{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Antibody evidence does not yet support 'immunity passport' proposals: WHO - ARIRANG NEWS", "description": "WHO, 코로나19 '면역 증명서'은 정확성 보장 못해. The World Health Organization said Friday that there's not enough evidence to prove that the presence of antibodies for COVID...", "url": "https://www.youtube.com/watch?v=cIiSr0eu-mo", "urlToImage": null, "publishedAt": "2020-04-26T04:08:28Z", "content": null}, {"source": {"id": null, "name": "Newsonair.com"}, "author": null, "title": "WHO says there is no evidence that recovered patients are immune to COVID-19 infection - All India Radio", "description": "World Health Organization (WHO) has said that there is currently no evidence that people who have recovered from COVID-19 and have antibodies are protected from a second infection.", "url": "http://www.newsonair.com/Main-News-Details.aspx?id=386715", "urlToImage": null, "publishedAt": "2020-04-26T02:42:41Z", "content": "Site Maintained by: Website Cell, NSD and IT Division, Prasar Bharati, New Delhi, India. Website Policy"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "IANS", "title": "As covid-19 death count crosses 2 lakh, WHO talks risks of 'immunity passports' - Livemint", "description": "Some governments have considered permitting people who have recovered to travel or return to work", "url": "https://www.livemint.com/news/world/as-covid-19-death-count-crosses-2-lakh-who-talks-risks-of-immunity-passports-11587866559473.html", "urlToImage": null, "publishedAt": "2020-04-26T02:11:07Z", "content": "Governments should not issue so-called \"immunity passports\" or \"risk-free certificates\" as a way of easing lockdowns, the World Health Organization (WHO) said.The WHO's guidance is based on evidence from researchers all around the world. But it could well cha… [+3235 chars]"}, {"source": {"id": null, "name": "Telanganatoday.com"}, "author": "Telangana Today", "title": "Developing strategies for management of Covid-19 - Telangana Today", "description": "We have witnessed several catastrophes and the way they were handled by governments with inputs from science. Today, in a knowledge-based society that uses Information Technology tools extensively, it has become possible to rapidly bring out products by short…", "url": "https://telanganatoday.com/developing-strategies-for-management-of-covid-19", "urlToImage": null, "publishedAt": "2020-04-26T01:59:44Z", "content": "We have witnessed several catastrophes and the way they were handled by governments with inputs from science. Today, in a knowledge-based society that uses Information Technology tools extensively, it has become possible to rapidly bring out products by short… [+8264 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "IANS", "title": "No evidence proves antibodies can protect from second wave: WHO - India TV News", "description": "There is currently no evidence that people who have recovered from COVID-19 and have antibodies are protected from a second infection, the World Health Organization (WHO) said in a daily situation report.", "url": "https://www.indiatvnews.com/news/world/no-evidence-proves-antibodies-can-protect-from-second-wave-who-611321", "urlToImage": null, "publishedAt": "2020-04-26T01:43:31Z", "content": "Image Source : APNo evidence proves antibodies can protect from second wave: WHO\r\nThere is currently no evidence that people who have recovered from COVID-19 and have antibodies are protected from a second infection, the World Health Organization (WHO) said i… [+1540 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Just like Shilpa Shetty, here's why dosa is the perfect protein-packed breakfast option for you - Times of India", "description": "Love feasting on dosas? We tell you why this is one of the healthiest breakfast options for you!", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/diet/just-like-shilpa-shetty-heres-why-dosa-is-the-perfect-protein-packed-breakfast-option-for-you/photostory/75377655.cms", "urlToImage": null, "publishedAt": "2020-04-26T01:30:00Z", "content": "For all the vegetarians who complain about missing out on proteins with their morning meal, fear no more. Dosa batter is made of fermented rice and black urad dal, which is an essential lentil. Pulses and lentils are super-rich on proteins, amino acids and gi… [+135 chars]"}, {"source": {"id": null, "name": "Sakshi.com"}, "author": "Priyadarshini", "title": "India May Face 2nd Wave Of Coronavirus In July-August: Experts - Sakshi English", "description": "Coronavirus disease is an infectious disease caused by a newly discovered COVID-19.", "url": "https://english.sakshi.com/national/2020/04/26/india-may-face-2nd-wave-of-coronavirus-in-july-august-experts", "urlToImage": null, "publishedAt": "2020-04-26T01:16:10Z", "content": "Coronavirus disease is an infectious disease caused by a newly discovered COVID-19. The first case of novel coronavirus was reported in Wuhan, China in December 2019. The infection spreads from one person to another and later, the virus began to appear outsid… [+1496 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Evgeny Lebedev For The Mail On Sunday", "title": "Shocking picture of bats for sale in Indonesia shows wet markets are still open - Daily Mail", "description": "Since I have begun to write on the urgent need to close live animal markets, I have been surprised by the support I have received from across the UK.", "url": "https://www.dailymail.co.uk/news/article-8257375/Shocking-picture-bats-sale-Indonesia-shows-wet-markets-open.html", "urlToImage": null, "publishedAt": "2020-04-26T00:56:23Z", "content": "Since I have begun to write on the urgent need to close live animal markets, I have been surprised by the support I have received from across the UK. \r\nReaders of The Mail on Sunday have written to say how strongly they agree about the threat of contagion the… [+3244 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Mumbai Mirror", "title": "‘No evidence’ recovered patients cannot be reinfected: WHO - Mumbai Mirror", "description": "The World Health Organization (WHO) said on Saturday that there was currently “no evidence” that people who have recovered from Covid-19 and have antibodies are protected from a second coronavirus in", "url": "https://mumbaimirror.indiatimes.com/coronavirus/news/no-evidence-recovered-patients-cannot-be-reinfected-who/articleshow/75383625.cms", "urlToImage": null, "publishedAt": "2020-04-26T00:30:00Z", "content": "The World Health Organization\r\n (WHO) said on Saturday that there was currently no evidence that people who have recovered from Covid-19 and have antibodies\r\n are protected from a second coronavirus\r\n infection.\r\nIn a scientific brief, the United Nations\r\n ag… [+1349 chars]"}, {"source": {"id": null, "name": "Nzherald.co.nz"}, "author": "NZ Herald", "title": "Covid-19 coronavirus: Healthy young people dying of virus-related strokes - New Zealand Herald", "description": "A terrifying warning has been issued about people with mild or no symptoms of the virus.", "url": "https://www.nzherald.co.nz/world/news/article.cfm?c_id=2&objectid=12327627", "urlToImage": null, "publishedAt": "2020-04-25T22:53:21Z", "content": "Young people, with mild to no symptoms of Covid-19, are dying of strokes related to the virus, doctors have warned.\r\n The experts say Covid-19 seems to be the cause for sudden strokes in adults in their 30s and 40s, who are otherwise healthy.\r\n Doctors in the… [+1525 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Mehr Gill", "title": "Explained: Types of human coronaviruses and the symptoms they cause - The Indian Express", "description": "While there are hundreds of coronaviruses, there are seven that we know can infect humans.", "url": "https://indianexpress.com/article/explained/types-of-human-coronaviruses-and-symptoms-6368444/", "urlToImage": null, "publishedAt": "2020-04-25T19:50:19Z", "content": "Written by Mehr Gill\r\n | New Delhi | \r\nUpdated: April 25, 2020 6:09:09 pm\r\nHuman coronaviruses were first characterised in the mid-1960s and they are mostly considered to be responsible for causing upper respiratory tract infections in children. (AP illustrat… [+6888 chars]"}, {"source": {"id": null, "name": "Investing.com"}, "author": null, "title": "Special Report: Countries, companies risk billions in race for coronavirus vaccine - Investing.com", "description": "Special Report: Countries, companies risk billions in race for coronavirus vaccine", "url": "https://www.investing.com/news/coronavirus/special-report-countries-companies-risk-billions-in-race-for-coronavirus-vaccine-2151221", "urlToImage": null, "publishedAt": "2020-04-25T19:41:00Z", "content": "By Julie Steenhuysen, Peter Eisler, Allison Martell and Stephanie Nebehay\r\n(Reuters) - In the race to develop a vaccine to end the COVID-19 pandemic, governments, charities and Big Pharma firms are sinking billions of dollars into bets with extraordinarily lo… [+16230 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Milly Vincent For Mailonline", "title": "Six-month-old baby given guard of honour as she is released from isolation after beating covid-19 - Daily Mail", "description": "Six-month-old Erin Bates is one of the youngest people to catch the infection and spent the last 14 days alone in isolation at Alder Hey Children's Hospital in Liverpool. She has made a full recovery.", "url": "https://www.dailymail.co.uk/news/article-8256649/Six-month-old-baby-given-guard-honour-released-isolation-beating-covid-19.html", "urlToImage": null, "publishedAt": "2020-04-25T18:55:14Z", "content": "This the touching moment a 'miracle baby' was given a guard of honour by tearful nurses and doctors after she beat Covid-19 and was wheeled out of isolation today.\r\nSix-month-old Erin Bates is one of the youngest people to catch the infection and has spent th… [+2296 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Ariana Eunjung Cha", "title": "Spike in stroke deaths in patients with only minor coronavirus symptoms - The Independent", "description": "Reports of strokes in the young and middle-aged are the latest twist in our evolving understanding of the mysteries of the virus, finds Ariana Eunjung Cha", "url": "https://www.independent.co.uk/news/world/americas/coronavirus-stroke-deaths-symptoms-covid-19-heart-a9484091.html", "urlToImage": null, "publishedAt": "2020-04-25T18:45:03Z", "content": "Thomas Oxley wasnt even on call the day he received the page to come into Mount Sinai Beth Israel Hospital in Manhattan. There werent enough doctors to treat all the emergency stroke patients, and he was needed in the operating room.\r\nThe patients chart appea… [+9849 chars]"}, {"source": {"id": null, "name": "Greaterkashmir.com"}, "author": null, "title": "WHO opposes 'immunity passports' - Greater Kashmir", "description": "WHO opposes ‘immunity passports’ Greater Kashmir | The World Health Organization is cautioning against the idea of “immunity passports.\" It says there is currently no evidence that people who have", "url": "https://www.greaterkashmir.com/news/front-page-2/who-opposes-immunity-passports/", "urlToImage": null, "publishedAt": "2020-04-25T18:32:00Z", "content": "The World Health Organization is cautioning against the idea of immunity passports.” It says there is currently no evidence that people who have recovered from COVID-19 and have antibodies are protected against a second infection.\r\nThe concept of immunity pas… [+764 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Sunetra Choudhury", "title": "CEA points at Spanish Flu lesson in Covid fight - Hindustan Times", "description": "The  Spanish flu emerged in 1918 and claimed 39 million lives till 1920.", "url": "https://www.hindustantimes.com/india-news/cea-points-at-spanish-flu-lesson-in-covid-fight/story-bMWrrU9fXxrCfKLjyVM96M.html", "urlToImage": null, "publishedAt": "2020-04-25T18:15:05Z", "content": "A paper recently published by the US-based National Bureau of Economic Research (NBER) is bringing considerable comfort to policy makers here. Chief Economic Advisor KV Subramanian was the first to draw attention to the research and others like it on the Span… [+2689 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Jayashree Nandi", "title": "2 cell types are entry points for virus - Hindustan Times", "description": "The respiratory tract is filled with numerous cells, among which are goblet cells and ciliated cells.", "url": "https://www.hindustantimes.com/india-news/2-cell-types-are-entry-points-for-virus/story-VZ250MIqdc4r0OIzxsTqPJ.html", "urlToImage": null, "publishedAt": "2020-04-25T17:54:31Z", "content": "Scientists have identified two types of cells in the nose that are likely to be point of infection for the Sars-CoV-2 virus, which causes Covid-19, in the body.\r\nThe respiratory tract is filled with numerous cells, among which are goblet cells and ciliated ce… [+2449 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "WHO: Why should I get vaccinated? - World Health Organization (WHO)", "description": "Without vaccines, we are at risk of serious illness and disability from diseases like measles, meningitis, tetanus and polio. In today' interconnected world,...", "url": "https://www.youtube.com/watch?v=9nadnOxvE74", "urlToImage": null, "publishedAt": "2020-04-25T17:33:39Z", "content": null}, {"source": {"id": null, "name": "Scroll.in"}, "author": "Annie Banerji, Thomson Reuters Foundation", "title": "India’s abysmal air quality makes its poor more vulnerable to Covid-19 - Scroll.in", "description": "Air pollution is a major cause of respiratory illnesses, which weaken the immune system.", "url": "https://scroll.in/article/959830/indias-abysmal-air-quality-makes-its-poor-more-vulnerable-to-covid-19", "urlToImage": null, "publishedAt": "2020-04-25T16:00:00Z", "content": "From street sweepers and farmers to rural housewives, poor Indians who breathe some of the worlds dirtiest air are at greater risk of dying from the new coronavirus than wealthier groups, health experts have warned.\r\nIndia is home to about half of the worlds … [+5268 chars]"}, {"source": {"id": null, "name": "Millenniumpost.in"}, "author": "IANS", "title": "Unearthing new dimensions - Millennium Post", "description": "The current pandemic has brought viral infections to public notice and yet misinformation abounds....", "url": "http://www.millenniumpost.in/sundaypost/inland/unearthing-new-dimensions-407847", "urlToImage": null, "publishedAt": "2020-04-25T15:38:14Z", "content": "Not too long ago, people were not really aware of viruses and their various characteristics. To most, viruses were an abstract, invisible threat, occasionally felt but largely ignored in favour of more immediate problems associated with modern living. However… [+5460 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "WATCH | National curfew and mandatory cloth face masks to come into effect under Level 4 - News24", "description": "As of 1 May, a national curfew from 20:00 to 05:00 will be in place and it will be applicable to everyone except essential workers traveling to and from work...", "url": "https://www.youtube.com/watch?v=dNs8wczQKNM", "urlToImage": null, "publishedAt": "2020-04-25T15:15:23Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "WHO warns against idea of 'immunity passports' - Times of India", "description": "Europe News: BERLIN: The World Health Organization is cautioning against the idea of “immunity passports.", "url": "https://timesofindia.indiatimes.com/world/europe/who-warns-against-idea-of-immunity-passports/articleshow/75375769.cms", "urlToImage": null, "publishedAt": "2020-04-25T14:49:55Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Bgr.com"}, "author": "Chris Smith", "title": "Everything we know about Italy’s horrific coronavirus outbreak might’ve just changed - BGR", "description": "New research from Italy says the first local coronavirus cases may have appeared as early as a month before people were diagnosed COVID-19 positive. Italy’s first COVID-19 cases were two Chinese citizens who were tested in Rome on January 31st. Three weeks la…", "url": "https://bgr.com/2020/04/25/coronavirus-stats-italys-covid-19-epidemic-may-have-started-earlier/", "urlToImage": null, "publishedAt": "2020-04-25T14:42:09Z", "content": "<ul><li>New research from Italy says the first local coronavirus cases may have appeared as early as a month before people were diagnosed COVID-19 positive.</li><li>Italy’s first COVID-19 cases were two Chinese citizens who were tested in Rome on January 31st… [+3644 chars]"}, {"source": {"id": null, "name": "Abs-cbn.com"}, "author": "Agence France-Presse", "title": "WHO: ‘No evidence’ that people who recovered from COVID-19 are immunized - ABS-CBN News", "description": "There is not enough evidence about the effectiveness of antibody-mediated immunity to guarantee the accuracy of an \"immunity passport\" or \"risk-free certificate.\"", "url": "https://news.abs-cbn.com/overseas/04/25/20/who-people-recovered-covid-19-immunized", "urlToImage": null, "publishedAt": "2020-04-25T13:52:00Z", "content": "The World Health Organization (WHO) warned on Saturday that there is no evidence that people who test positive for the new coronavirus are immunized and protected against reinfection.\r\nThe warning suggests that the issuance of \"immune passports\" may promote t… [+2075 chars]"}, {"source": {"id": null, "name": "Www.geo.tv"}, "author": "Reuters", "title": "US coronavirus death toll tops 50,000 - Geo News", "description": "United States is the country hardest-hit by the virus with more than 890,000 confirmed cases", "url": "https://www.geo.tv/latest/284830-us-coronavirus-death-toll-tops-50000", "urlToImage": null, "publishedAt": "2020-04-25T13:45:43Z", "content": "The death toll from the novel coronavirus topped 51,000 on Friday as nearly one in six workers out of a job, Georgia, Oklahoma and several other states took tentative steps at reopening businesses, despite disapproval from President Donald Trump and medical e… [+5484 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "'No evidence' that recovered COVID-19 patients cannot be reinfected: WHO - Moneycontrol", "description": "In a scientific brief, the United Nations agency warned governments against issuing \"immunity passports\" or \"risk-free certificates\" to people who have been infected as their accuracy could not be guaranteed.", "url": "https://www.moneycontrol.com/news/world/no-evidence-that-recovered-covid-19-patients-cannot-be-reinfected-who-5189661.html", "urlToImage": null, "publishedAt": "2020-04-25T13:38:14Z", "content": "The World Health Organisation (WHO) said on Saturday that there was currently \"no evidence\" that people who have recovered from COVID-19 and have antibodies are protected from a second coronavirus infection.\r\nIn a scientific brief, the United Nations agency w… [+2096 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "AFP", "title": "WHO says no evidence that people with coronavirus are immunised - Economic Times", "description": "There is currently no evidence that people who have recovered from #COVID19 and have antibodies are protected from a second infection,  WHO said in a statement.", "url": "https://economictimes.indiatimes.com/industry/healthcare/biotech/healthcare/who-says-no-evidence-that-people-with-coronavirus-are-immunised/articleshow/75378874.cms", "urlToImage": null, "publishedAt": "2020-04-25T13:16:49Z", "content": "Geneva: The World Health Organization (WHO) warned on Saturday that there is no evidence that people who test positive for the new coronavirus are immunised and protected against reinfection.\r\nThe warning suggests that the issuance of \"immune passports\" may p… [+206 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Free robot delivery for health workers in British town - Reuters", "description": "Ever since the British government imposed strict social distancing, a fleet of robots on wheels have been busy in the town of Milton Keynes, delivering for f...", "url": "https://www.youtube.com/watch?v=nib5bcNVZ8s", "urlToImage": null, "publishedAt": "2020-04-25T13:14:29Z", "content": null}, {"source": {"id": null, "name": "Jagran.com"}, "author": "Aalok Sensharma", "title": "Coronavirus Pandemic | 'No evidence' that recovered COVID-19 patients cannot be reinfected: WHO - Jagran English", "description": "In a scientific brief  the United Nations  UN  agency warned governments against issuing  immunity passports  or  risk free certificates  to people who have been infected as their accuracy could not be guaranteed", "url": "https://english.jagran.com/world/coronavirus-pandemic-no-evidence-that-recovered-covid19-patients-cannot-be-reinfected-who-10011117", "urlToImage": null, "publishedAt": "2020-04-25T13:01:03Z", "content": "Geneva | Agencies: At a time when the whole world battling the novel coronavirus, the World Health Organisation (WHO) has said that there is no evidence that patients who recovered from the deadly infection have antibodies for the virus and are protected from… [+1873 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Baby given guard of honour by NHS staff after recovering from coronavirus - The Telegraph", "description": "A six-month-old has been given a guard of honour and applauded by NHS staff after she recovered from coronavirus and was moved out of isolation. Baby Erin ha...", "url": "https://www.youtube.com/watch?v=9m8OjGk5WCQ", "urlToImage": null, "publishedAt": "2020-04-25T12:56:55Z", "content": null}, {"source": {"id": null, "name": "Scroll.in"}, "author": "Scroll Staff", "title": "No evidence that recovered Covid-19 patients cannot be reinfected, says WHO - Scroll.in", "description": "The United Nations agency warned governments against issuing ‘immunity passports’ to the recovered patients, as their accuracy could not be guaranteed.", "url": "https://scroll.in/latest/960219/no-evidence-that-recovered-covid-19-patients-cannot-be-reinfected-says-who", "urlToImage": null, "publishedAt": "2020-04-25T12:46:00Z", "content": "The World Health Organization on Saturday said there was no evidence that people who have recovered from Covid-19 and have antibodies are protected from a second coronavirus infection, Reuters reported. \r\nThe United Nations agency warned governments against i… [+1338 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Matt Simon", "title": "The Boston Dynamics Coronavirus Doctor Robot Dog Will See You Now - WIRED", "description": "Spot, the famously deft robot, gets a job screening patients at a hospital. But there’s still much that it and other medical robots can’t do.", "url": "https://www.wired.com/story/spot-the-coronavirus-doctor-robot-dog/", "urlToImage": null, "publishedAt": "2020-04-25T12:42:44Z", "content": "If the age of the coronavirus is anything, its surreal. And one of the most surreal things yet is happening at the Brigham and Womens Hospital in Boston, where help has arrived not from extra human medical professionals, but in the form of famous Boston Dynam… [+3920 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "Sweden goes it alone with 'relaxed' attitude to coronavirus - CGTN", "description": "Sweden's relaxed restrictions could lead to herd immunity but at what cost?", "url": "https://newseu.cgtn.com/news/2020-04-25/Sweden-goes-it-alone-with-relaxed-attitude-to-coronavirus-PYIUqQSwH6/index.html", "urlToImage": null, "publishedAt": "2020-04-25T12:41:25Z", "content": "Everyone wants immunity from the coronavirus. But there may be different ways to get it.\r\nOne is a vaccine. Clinical trials are already underway in the UK, and if all goes well, say those involved, it's possible a vaccination may be ready for production by Se… [+3523 chars]"}, {"source": {"id": null, "name": "Swarajyamag.com"}, "author": null, "title": "Coronavirus And Smoking: French Researchers Suggest Nicotine Could Protect Against Coronavirus - Swarajya", "description": "", "url": "https://swarajyamag.com/news-brief/coronavirus-and-smoking-french-researchers-suggest-nicotine-could-protect-against-coronavirus", "urlToImage": null, "publishedAt": "2020-04-25T11:31:00Z", "content": null}, {"source": {"id": null, "name": "Tribuneindia.com"}, "author": "Tribune India", "title": "Can you catch Covid-19 twice? This is what WHO has to say - The Tribune", "description": "", "url": "https://www.tribuneindia.com/news/health/can-you-catch-covid-19-twice-this-is-what-who-has-to-say-76173", "urlToImage": null, "publishedAt": "2020-04-25T11:08:00Z", "content": "Geneva, April 25\r\nThe World Health Organisation (WHO) said on Saturday that there was currently \"no evidence\" that people who have recovered from COVID-19 and have antibodies are protected from a second coronavirus infection.\r\nIn a scientific brief, the Unite… [+1678 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "PTI", "title": "Plasma therapy trials for coronavirus patients begin in Karnataka - Deccan Herald", "description": "The Karnataka government on Saturday commenced convalescent plasma therapy clinical trials for 'severe' coronavirus patients in the state.", "url": "https://www.deccanherald.com/state/top-karnataka-stories/plasma-therapy-trials-for-coronavirus-patients-begin-in-karnataka-829772.html", "urlToImage": null, "publishedAt": "2020-04-25T11:00:06Z", "content": "The Karnataka government on Saturday commenced convalescent plasma therapy clinical trials for 'severe' coronavirus patients in the state.\r\nFollow latest updates on the COVID-19 pandemic here\r\nIn a tweet, Medical Education Minister K Sudhakar said, \"Happy to … [+1295 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Jayashree Nandi", "title": "Bats cannot directly infect humans with Covid-19: Scientists - Hindustan Times", "description": "According to scientists, Sars-Cov-2 may have diverged from the closest coronavirus found in bats called RaTG13, about 40 to 70 years ago, indicating that the bat virus cannot directly infect humans.", "url": "https://www.hindustantimes.com/india-news/bats-cannot-directly-infect-humans-with-covid-19-scientists/story-uuEwHKcI0x266H1fxawFbN.html", "urlToImage": null, "publishedAt": "2020-04-25T09:30:44Z", "content": "Sixty-four scientists have said bats do not spread Covid-19 after reports of people requesting local authorities to clear trees over a fear of the colonies the winged mammals host.\r\nThe chiropterologists issuing the statement said they came together after rep… [+3518 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Cotton, natural silk, chiffon make best materials for homemade masks against COVID-19: Study - The Financial Express", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMilAFodHRwczovL3d3dy5maW5hbmNpYWxleHByZXNzLmNvbS9saWZlc3R5bGUvaGVhbHRoL2NvdHRvbi1uYXR1cmFsLXNpbGstY2hpZmZvbi1tYWtlLWJlc3QtbWF0ZXJpYWxzLWZvci1ob21lbWFkZS1tYXNrcy1hZ2FpbnN0LWNvdmlkLTE5LXN0dWR5LzE5Mzk0NDYv0gGZAWh0dHBzOi8vd3d3LmZpbmFuY2lhbGV4cHJlc3MuY29tL2xpZmVzdHlsZS9oZWFsdGgvY290dG9uLW5hdHVyYWwtc2lsay1jaGlmZm9uLW1ha2UtYmVzdC1tYXRlcmlhbHMtZm9yLWhvbWVtYWRlLW1hc2tzLWFnYWluc3QtY292aWQtMTktc3R1ZHkvMTkzOTQ0Ni9saXRlLw?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T09:04:27Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "AFP", "title": "Why has Spain been hit so hard by the coronavirus pandemic? - Economic Times", "description": "In Spain, one of the hardest-hit countries in the pandemic, the coronavirus spread quickly and widely without being detected, especially among the elderly.", "url": "https://economictimes.indiatimes.com/news/international/world-news/why-has-spain-been-hit-so-hard-by-the-coronavirus-pandemic/articleshow/75373535.cms", "urlToImage": null, "publishedAt": "2020-04-25T08:57:34Z", "content": "In Spain, one of the hardest-hit countries in the pandemic, the coronavirus spread quickly and widely without being detected, especially among the elderly, experts told AFP. While they stressed it was too early to carry out a detailed analysis, the experts po… [+4270 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "AP", "title": "Coronavirus: WHO warns against idea of 'immunity passports' - Deccan Herald", "description": "The World Health Organization is cautioning against the idea of “immunity passports.\" It says there is currently no evidence that people who have recovered from COVID-19 and have antibodies are protected against a second infection.", "url": "https://www.deccanherald.com/international/world-news-politics/coronavirus-world-health-organization-warns-against-idea-of-immunity-passports-829739.html", "urlToImage": null, "publishedAt": "2020-04-25T08:50:01Z", "content": "The World Health Organization is cautioning against the idea of immunity passports.\" It says there is currently no evidence that people who have recovered from COVID-19 and have antibodies are protected against a second infection.\r\nThe concept of immunity pas… [+813 chars]"}, {"source": {"id": null, "name": "Newindianexpress.com"}, "author": "PTI", "title": "World Health Organization warns against idea of 'immunity passports' - The New Indian Express", "description": "The concept of 'immunity passports' or 'risk-free certificates' has been floated as a way of allowing people protected against reinfection to return to work.", "url": "https://www.newindianexpress.com/world/2020/apr/25/world-health-organization-warns-against-idea-of-immunity-passports-2135155.html", "urlToImage": null, "publishedAt": "2020-04-25T08:48:00Z", "content": "BERLIN: The World Health Organization is cautioning against the idea of \"immunity passports.\" It says there is currently no evidence that people who have recovered from COVID-19 and have antibodies are protected against a second infection.\r\nThe concept of \"im… [+770 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": "https://www.facebook.com/dineshRewale", "title": "e-Agenda AajTak: Not just stay at home but also do yoga at home, says Ramdev - dineshr", "description": "In the wake of the coronavirus pandemic and the nationwide lockdown, people should not just stay and work at home, but they must also perform yoga at home, said yoga…", "url": "https://www.indiatoday.in/india/story/e-agenda-aajtak-yoga-ramdev-coronavirus-pandemic-lockdown-1670908-2020-04-25?utm_source=rss", "urlToImage": null, "publishedAt": "2020-04-25T07:21:40Z", "content": "In the wake of the coronavirus pandemic and the nationwide lockdown, people should not just stay and work at home, but they must also perform yoga at home, said yoga guru Ramdev on Saturday.\r\nRamdev was speaking at a special session at the e-Agenda Aaj Tak.\r\n… [+739 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Nations join WHO in virus initiative, but not US - The Star", "description": "World leaders pledged on Friday to accelerate work on tests, drugs and vaccines against Covid-19 and to share them around the globe. But the United States di...", "url": "https://www.youtube.com/watch?v=BSi5E7Grjx8", "urlToImage": null, "publishedAt": "2020-04-25T06:51:50Z", "content": "World leaders pledged on Friday to accelerate work on tests, drugs and vaccines against Covid-19 and to share them around the globe. But the United States did not take part in the launch.\r\nWATCH MORE: https://thestartv.com/c/newsSUBSCRIBE: https://cutt.ly/The… [+37 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "1752 Coronavirus Cases Reported On Friday, Biggest Single Day Spike | Coronavirus Outbreak - CNBC-TV18", "description": "India's fight against coronavirus has reached on the critical phase as the total number of coronavirus cases have crossed 23,000. Out of which 1750 cases wer...", "url": "https://www.youtube.com/watch?v=GnPn5O0s-v4", "urlToImage": null, "publishedAt": "2020-04-25T04:48:57Z", "content": null}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Coronavirus Detected on Air Pollution Particles That May Carry It Over Long Distances, Scientists Warn - News18", "description": "Leonardo Setti at the University of Bologna in Italy said it was imperative to investigate if the the coronavirus could be transported through air pollution.", "url": "https://www.news18.com/news/world/coronavirus-detected-on-air-pollution-particles-that-may-carry-it-over-long-distances-scientists-warn-2591919.html", "urlToImage": null, "publishedAt": "2020-04-25T03:39:15Z", "content": "The novel coronavirus has been found on air pollution particles by scientists who are studying if this could allow the virus to advance longer distances, resulting in more number of people contracting it, The Guardian reported.\r\nThe work is still in the initi… [+2716 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "G Thing: Pet fashion designer finds unique ways to give back to animal rescue crews - PIX11 News", "description": "She's one of the most in demand New York fashion designers for dog and cats.", "url": "https://www.youtube.com/watch?v=WcRkfwYZcdU", "urlToImage": null, "publishedAt": "2020-04-25T03:02:18Z", "content": "Sign in to report inappropriate content.\r\nSign in"}, {"source": {"id": null, "name": "Catchnews.com"}, "author": null, "title": "Coronavirus: Telangana reports 13 new cases; tally reaches 983 - Catch News", "description": "a total of 983 coronavirus positive cases have been reported in the state, including 291 patients cured/discharged and 25 deaths in the state,", "url": "http://www.catchnews.com/national-news/coronavirus-telangana-reports-13-new-cases-tally-reaches-983-189343.html", "urlToImage": null, "publishedAt": "2020-04-25T02:46:58Z", "content": "A total of 13 new coronavirus cases were reported in Telangana, taking the total number of positive cases in the state to 983, state health minister Eatala Rajendra said on Friday.\r\n\"After the announcement, till yesterday night, eight positive cases have repo… [+1007 chars]"}, {"source": {"id": null, "name": "Abplive.com"}, "author": "ABP News Bureau", "title": "Covid-19 Death Toll In US Crosses 50,000-Mark; Around 2,000 People Died Each Day This Month - ABP Live", "description": "As many as 50,031 people have now died in the US from COVID-19 since the start of the global health crisis, with more than 8,70,000 confirmed cases so far.", "url": "https://news.abplive.com/news/world/covid-19-death-toll-in-us-crosses-50000-mark-around-2000-people-died-each-day-this-month-1205841", "urlToImage": null, "publishedAt": "2020-04-25T01:32:17Z", "content": "New Delhi/ New York: United State remains to be the worst-affected country with death toll from the deadly Coronavirus pandemic surging passed 50,000-mark on Friday, as per a report by  Johns Hopkins University. As many as 50,031 people have now died in the U… [+2091 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "COVID-19: India may see second wave of outbreak in monsoon, say scientists - India Gone Viral", "description": "The trajectory of COVID-19 cases could have plateaued and might even fall for some weeks after the lockdown is lifted but India is likely to see a second wave in late July or August with a surge in th", "url": "https://indiagoneviral.com/news/2020/04/25/covid-19-india-may-see-second-wave-of-outbreak-in-monsoon-say-scientists/41722/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-25T00:04:54Z", "content": "The trajectory of\r\nCOVID-19\r\ncases could have plateaued and might even fall for some weeks after the\r\nlockdown\r\nis lifted but India is likely to see a second wave in late July or August with a surge in the number of cases during the monsoon, say\r\nscientists\r\n… [+6225 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Has Sweden got its science right? - BBC News", "description": "The strategy devised by scientists was to keep large parts of society open but not everyone is convinced.", "url": "https://www.bbc.co.uk/news/world-europe-52395866", "urlToImage": null, "publishedAt": "2020-04-24T23:29:45Z", "content": "Image caption\r\n Sweden's schools have remained open while neighbouring countries shut theirs for weeks\r\nSweden's strategy to keep large parts of society open is widely backed by the public. It has been devised by scientists and backed by government, and yet n… [+8699 chars]"}, {"source": {"id": null, "name": "Telegraphindia.com"}, "author": "By G.S. Mudur", "title": "Doctors: Monitor every Covid patient given HCQ - Telegraph India", "description": "The HCQ and azithromycin combination carries the risk of drug-induced sudden cardiac death", "url": "https://www.telegraphindia.com/india/coronavirus-outbreak-doctors-ask-to-monitor-every-covid-19-patient-given-hcq/cid/1767906", "urlToImage": null, "publishedAt": "2020-04-24T23:26:19Z", "content": "Every Covid-19 patient given the hydroxychloroquine (HCQ) and azithromycin combination should be monitored for adverse cardiac effects, doctors in India and the US said on Friday in cautionary research papers about the therapy adopted by India, the US and oth… [+3153 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Expectant mothers prepare to have children in the midst of COVID-19 pandemic - CBS 17", "description": "Expectant mothers prepare to have children in the midst of COVID-19 pandemic", "url": "https://www.youtube.com/watch?v=xf3lExxSb94", "urlToImage": null, "publishedAt": "2020-04-24T22:09:28Z", "content": "Sign in to report inappropriate content.\r\nSign in"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "Reuters", "title": "Coronavirus and COVID-19: Fact versus fiction - Deccan Herald", "description": "U.S. President Donald Trump's musings about whether disinfectants and ultraviolet light can be inserted into patients' bodies to treat COVID-19 have alarmed doctors and drawn warnings from the makers of Lysol, Dettol and Clorox. Here are some other claims tha…", "url": "https://www.deccanherald.com/science-and-environment/coronavirus-and-covid-19-fact-versus-fiction-829603.html", "urlToImage": null, "publishedAt": "2020-04-24T20:48:45Z", "content": "U.S. President Donald Trump's musings about whether disinfectants and ultraviolet light can be inserted into patients' bodies to treat COVID-19 have alarmed doctors and drawn warnings from the makers of Lysol, Dettol and Clorox.\r\nHere are some other claims th… [+3054 chars]"}, {"source": {"id": null, "name": "Scienceboard.net"}, "author": "Samantha  Black, PhD, The Science Advisory Board staff writer", "title": "Experts discuss promising strategies for tackling SARS-CoV-2 - The Science Board", "description": "What's the best strategy for developing treatments for the SARS-CoV-2 virus? The most promising approaches for a rapid response are antivirals and gene therapy, according to a new review article published April 24 in <em>Frontiers in Microbiology</em>.", "url": "https://www.scienceboard.net/index.aspx?sec=log&itemID=687", "urlToImage": null, "publishedAt": "2020-04-24T19:24:18Z", "content": "In an unprecedented effort, hundreds of thousands of researchers and clinicians from around the world are fighting against the clock to develop cures, vaccines, and diagnostics for COVID-19, the illness caused by the virus SARS-CoV-2. To date, over 1,650 acad… [+6253 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Does COVID-19 Cause Blood Clot Complications? | NBC New York - NBC New York", "description": "A small study of five critically ill COVID-19 patients at Mount Sinai Hospital in New York City could have major implications for how doctors respond to the ...", "url": "https://www.youtube.com/watch?v=twPd0YvY3T0", "urlToImage": null, "publishedAt": "2020-04-24T17:18:33Z", "content": null}, {"source": {"id": null, "name": "India.com"}, "author": "PTI", "title": "India may see second wave of COVID-19 outbreak in monsoon: Scientists - Zee News", "description": "The timing of the peak will depend on how India is able to control physical distancing and on the level of infection spreads after restrictions are relaxed, said scientists.", "url": "https://zeenews.india.com/india/india-may-see-second-wave-of-covid-19-outbreak-in-monsoon-scientists-2278767.html", "urlToImage": null, "publishedAt": "2020-04-24T16:47:09Z", "content": "New Delhi: The trajectory of COVID-19 cases could have plateaued and might even fall for some weeks after the lockdown is lifted but India is likely to see a second wave in late July or August with a surge in the number of cases during the monsoon, say scient… [+6179 chars]"}, {"source": {"id": null, "name": "Oregonlive.com"}, "author": null, "title": "Vitamins C, D can help prevent coronavirus, Oregon State University researcher says - OregonLive", "description": "Adrian Gombart of OSU’s Linus Pauling Institute, along with his collaborators at universities across the world, said public health officials should issue a clear set of nutritional guidelines to complement the existing advice about washing hands to prevent th…", "url": "https://www.oregonlive.com/coronavirus/2020/04/vitamins-c-d-can-help-prevent-coronavirus-oregon-state-university-researcher-says.html", "urlToImage": null, "publishedAt": "2020-04-24T15:37:02Z", "content": "Supplements containing vitamins C and D, along with other micronutrients, can be a safe, effective and low-cost means to fight off the novel coronavirus and other acute respiratory tract diseases, according to an Oregon State University researcher.\r\nAdrian Go… [+5436 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Italy's coronavirus epidemic began in January, study shows - Reuters", "description": "The first COVID-19 infections in Italy date back to January, according to a scientific study presented on Friday, shedding new light on the origins of the outbreak in one of the world's worst-affected countries.", "url": "https://www.reuters.com/article/us-health-coronavirus-italy-study-idUSKCN2262B1", "urlToImage": null, "publishedAt": "2020-04-24T14:38:00Z", "content": "ROME (Reuters) - The first COVID-19 infections in Italy date back to January, according to a scientific study presented on Friday, shedding new light on the origins of the outbreak in one of the world’s worst-affected countries. \r\nItaly began testing people a… [+1729 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "AFP", "title": "Coronavirus vaccine: Monkeys largely protected during trial, says Chinese firm - Livemint", "description": "Sinovac Biotech said it injected two different doses of its vaccine into eight rhesus macaque monkeys and exposed them to the virus three weeks later, and they did not develop infections", "url": "https://www.livemint.com/news/world/coronavirus-vaccine-monkeys-largely-protected-during-trial-says-chinese-firm-11587736770613.html", "urlToImage": null, "publishedAt": "2020-04-24T14:13:47Z", "content": "A novel coronavirus vaccine has for the first time \"largely protected\" monkeys from infection during an animal trial, data from a Chinese pharmaceutical giant showed.It is among a slew of vaccines being developed around the world as countries race to stop an … [+3317 chars]"}, {"source": {"id": null, "name": "Bgr.com"}, "author": "Chris Smith", "title": "The most unusual coronavirus symptom is also the most dangerous - BGR", "description": "The newest observed coronavirus symptom is also the most dangerous one and can appear in patients who don’t even experience other symptoms. Doctors have noticed an increase in strokes caused by blood clots in young adults, who might be reluctant to seek medic…", "url": "https://bgr.com/2020/04/24/coronavirus-symptoms-stroke-after-blood-clots-in-young-patients/", "urlToImage": null, "publishedAt": "2020-04-24T14:02:10Z", "content": "<ul><li>The newest observed coronavirus symptom is also the most dangerous one and can appear in patients who don’t even experience other symptoms.</li><li>Doctors have noticed an increase in strokes caused by blood clots in young adults, who might be relucta… [+3622 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Coronavirus pandemic | Over 50% consumers quit smoking during lockdown: Report - Moneycontrol", "description": "The survey revealed that over half of those who were interviewed had quit smoking during the ongoing lockdown while nearly 30 percent had reduced their daily consumption.", "url": "https://www.moneycontrol.com/news/business/coronavirus-pandemic-over-50-consumers-quit-smoking-during-lockdown-report-5187161.html", "urlToImage": null, "publishedAt": "2020-04-24T13:43:19Z", "content": "During the lockdown period in India, the consumption of cigarettes has taken a hit. A survey of over 100 smokers, conducted by IIFL Securities, found that around 58 percent respondents have quit smoking following the implementation of the nationwide lockdown … [+2003 chars]"}, {"source": {"id": null, "name": "Swarajyamag.com"}, "author": null, "title": "Novel Coronavirus Is A Result Of Crazy Experiments At Wuhan Institute of Virology: Top Russian Microbiologist - Swarajya", "description": "", "url": "https://swarajyamag.com/insta/novel-coronavirus-is-a-result-of-crazy-experiments-at-wuhan-institute-of-virology-top-russian-microbiologist", "urlToImage": null, "publishedAt": "2020-04-24T13:42:15Z", "content": null}, {"source": {"id": null, "name": "Imperial.ac.uk"}, "author": null, "title": "Coronavirus 'map' identifies key virus entry points into the body | Imperial News - Imperial College London", "description": "Scientists are creating a map of the human body to identify locations where the COVID-19 virus can enter human cells.", "url": "https://www.imperial.ac.uk/news/197114/coronavirus-identifies-virus-entry-points-into/", "urlToImage": null, "publishedAt": "2020-04-24T11:36:27Z", "content": "Scientists are creating a map of the human body to identify locations where the COVID-19 virus can enter human cells.\r\nThe research, from a number of international institutions including Imperial College London, has so far identified likely initial infection … [+5951 chars]"}, {"source": {"id": null, "name": "Biospectrumindia.com"}, "author": null, "title": "Indian scientists join global consortium in rapid response to COVID-19 - BSI bureau", "description": "People with confirmed or presumed COVID-19 are urged to participate in a survey on smell loss", "url": "https://www.biospectrumindia.com/news/58/16314/indian-scientists-join-gccr-to-assess-correlation-between-anosmia-with-covid-19.html", "urlToImage": null, "publishedAt": "2020-04-24T11:25:18Z", "content": "People with confirmed or presumed COVID-19 are urged to participate in a survey on smell loss\r\nFollowing a wave of reports from patients and clinicians about rapid onset smell loss, prominent health organisations across the world have suggested anosmia as an … [+1160 chars]"}, {"source": {"id": null, "name": "Tribuneindia.com"}, "author": "Tribune India", "title": "Microbiologist first in line for Oxford University's Covid-19 vaccine trial - The Tribune", "description": "Elisa Granato to be part of an initial group of 800 volunteers to go through trial", "url": "https://www.tribuneindia.com/news/health/microbiologist-first-in-line-for-oxford-universitys-covid-19-vaccine-trial-75564", "urlToImage": null, "publishedAt": "2020-04-24T10:14:00Z", "content": "London, April 24\r\nA microbiologist has become the first human to be injected for the human trial phase of a vaccine in the UK against the novel coronavirus being developed by a group of scientists at the University of Oxford.\r\nElisa Granato is the first volun… [+5051 chars]"}, {"source": {"id": null, "name": "Bloombergquint.com"}, "author": "Niclas Rolander", "title": "Sweden Steps Up Coronavirus Controls as Warm Weather Adds to Risks - BloombergQuint", "description": "Sweden Steps Up Coronavirus Controls as Warm Weather Adds to Risks", "url": "https://www.bloombergquint.com/politics/sweden-steps-up-covid-19-controls-as-warm-weather-adds-to-risks", "urlToImage": null, "publishedAt": "2020-04-24T10:02:39Z", "content": ""}, {"source": {"id": null, "name": "Selectscience.net"}, "author": "SelectScience", "title": "Pfizer, BioNTech COVID-19 vaccine cleared for human tests - SelectScience", "description": "Pfizer and BioNTech to start human trials of COVID-19 vaccine", "url": "https://www.selectscience.net/industry-news/pfizer-and-biontech-to-start-human-trials-of-covid-19-vaccine/?artID=51330", "urlToImage": null, "publishedAt": "2020-04-24T09:09:30Z", "content": null}, {"source": {"id": null, "name": "Thenewsminute.com"}, "author": null, "title": "Four-month-old baby dies after testing positive for coronavirus in Kerala - The News Minute", "description": "A four-month-old baby, who tested positive for the coronavirus, died at Kozhikode Medical College Hospital on Friday.  The baby was suffering from heart-related ailments from birth and passed away early Friday morning. Health Minister KK Shailaja confirmed th…", "url": "https://www.thenewsminute.com/article/four-month-old-baby-dies-after-testing-positive-coronavirus-kerala-123226", "urlToImage": null, "publishedAt": "2020-04-24T08:14:15Z", "content": "Health Minister KK Shailaja confirmed that the baby's last rites will be done according to COVID-19 protocol.A four-month-old baby, who tested positive for the coronavirus, died at Kozhikode Medical College Hospital on Friday. \r\nThe baby was suffering from he… [+2215 chars]"}, {"source": {"id": null, "name": "Chinadaily.com.cn"}, "author": "于小明", "title": "No evidence suggests people with COVID-19 antibodies protected from secondary infection: WHO - 中国日报", "description": "There is currently no evidence that people who have recovered from COVID-19 and have antibodies are protected from a second infection, the World Health Organization (WHO) said in a daily situation report on Saturday.", "url": "https://global.chinadaily.com.cn/a/202004/26/WS5ea4c1fba310a8b24115196a.html", "urlToImage": null, "publishedAt": "2020-04-24T07:00:00Z", "content": "A logo is pictured on the headquarters of the World Health Organization ahead of a meeting of the Emergency Committee on the novel coronavirus in Geneva, Switzerland, Jan 30, 2020. [Photo/Agencies] \r\nGENEVA -- There is currently no evidence that people who ha… [+1393 chars]"}, {"source": {"id": null, "name": "Timesnownews.com"}, "author": "Anushree Gupta", "title": "Researchers identify key cells targetted by novel coronavirus in the human body - Times Now", "description": "The two proteins under question were identified by previous researches as the angiotensin-converting enzyme 2, ACE-2, and another human protein enzyme called the TMPRSS2.", "url": "https://www.timesnownews.com/health/article/researchers-identify-key-cells-targetted-by-novel-coronavirus-in-the-human-body/582385", "urlToImage": null, "publishedAt": "2020-04-24T06:38:51Z", "content": "New Delhi: Researchers at the Massachusets Institute of Technology and Harvard, along with researchers from all over the world, have reportedly identified specific types of cells that are targetted by the coronavirus, which causes the COVID-19 disease. \r\nAcco… [+2729 chars]"}]}