{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": "reuters", "name": "Reuters"}, "author": "Nathan Layne", "title": "New York governor says 5-year old died from rare COVID-related complications - Reuters India", "description": "A 5-year old boy has died in New York from a rare inflammatory syndrome believed to be linked to the novel coronavirus, highlighting a potential new risk for children in the pandemic, Governor Andrew Cuomo said on Friday.", "url": "https://in.reuters.com/article/health-coronavirus-usa-new-york-idINKBN22L05J", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200509&t=2&i=1518012721&w=1200&r=LYNXMPEG4803C", "publishedAt": "2020-05-09T03:10:00Z", "content": "(Reuters) - A 5-year old boy has died in New York from a rare inflammatory syndrome believed to be linked to the novel coronavirus, highlighting a potential new risk for children in the pandemic, Governor Andrew Cuomo said on Friday. \r\nCuomo told a daily brie… [+3528 chars]"}, {"source": {"id": null, "name": "Financialexpress.com"}, "author": "FE Online", "title": "Bharat Biotech to lead monoclonal antibodies project for Covid-19 therapy - The Financial Express", "description": "This project brings together National Centre for Cell Science (NCCS), Pune; Indian Institute of Technology, Indore, and Gurgaon-based PredOmix Technologies in a collaborative mode for a public health emergency.", "url": "https://www.financialexpress.com/industry/bharat-biotech-to-lead-monoclonal-antibodies-project-for-covid-19-therapy/1953143/", "urlToImage": "https://images.financialexpress.com/2020/05/COVID-8.jpg", "publishedAt": "2020-05-09T02:42:28Z", "content": "Vaccine manufacturer Bharat Biotech said it would lead a project to develop human monoclonal antibodies as therapy for Covid-19 infections. The project is sanctioned by the Council of Scientific and Industrial Research (CSIR) under its flagship programme, New… [+2694 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Navashree Nandini", "title": "WHO says wet markets shouldnt close despite recognizing Wuhans role in COVID outbreak - Republic World - Republic World", "description": "A day after WHO scientist Dr. Peter Ben Embarekrecognised the role of Wuhan market in the coronavirus outbreak, he opined, 'such markets should not be shut'", "url": "https://www.republicworld.com/world-news/global-event-news/who-says-wet-markets-shouldnt-close-amid-covid-outbreak.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/6kw8yjfahlzacov2_1588989902.jpeg?tr=f-jpeg", "publishedAt": "2020-05-09T02:28:08Z", "content": "Even after the World Health Organization (WHO) scientist Dr. Peter Ben Embarek, on Friday, stated that the Wuhan market had a role in the novel coronavirus outbreak, he opined such markets should not be shut globally.\r\nIn a press briefing, WHO food safety and… [+3317 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Abantika Ghosh", "title": "Lack of health workers a concern in cities, govt says must live with virus - The Indian Express", "description": "“The real problem, not just in Mumbai but in urban areas elsewhere, as we are finding out now, is the lack of surveillance infrastructure. The NUHM never took off. In the villages, we are using ASHA workers and ANMs - there are enough field-level workers, the…", "url": "https://indianexpress.com/article/india/coronavirus-lack-of-health-workers-6401006/", "urlToImage": "https://images.indianexpress.com/2020/05/Health-worker-1.jpg?w=759", "publishedAt": "2020-05-09T01:56:10Z", "content": "Written by Abantika Ghosh\r\n | New Delhi | \r\nUpdated: May 9, 2020 7:21:04 am\r\nCovid-19 suspect on the way to the hospital from Narahi area of Lucknow on Friday.While most of the big cities, including all the metros, are in the red zone, the absence of field-le… [+5545 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The striking similarities between 1918 Flu & current COVID-19 pandemic - KOAA 5", "description": "A major historical pandemic was happening across the globe, including in Colorado Springs and Denver, just like the pandemic we are facing now.", "url": "https://www.youtube.com/watch?v=9_pMkO7y3PY", "urlToImage": "https://i.ytimg.com/vi/9_pMkO7y3PY/maxresdefault.jpg", "publishedAt": "2020-05-09T01:53:17Z", "content": null}, {"source": {"id": null, "name": "Thelancet.com"}, "author": null, "title": "Triple combination of interferon beta-1b, lopinavir–ritonavir, and ribavirin in the treatment of patients admitted to hospital with COVID-19: an open-label, randomised, phase 2 trial - The Lancet", "description": "Early triple antiviral therapy was safe and superior to lopinavir–ritonavir alone\nin alleviating symptoms and shortening the duration of viral shedding and hospital\nstay in patients with mild to moderate COVID-19. Future clinical study of a double\nantiviral t…", "url": "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(20)31042-4/fulltext", "urlToImage": "//els-jbs-prod-cdn.jbs.elsevierhealth.com/cms/asset/626fe0b9-ccbc-462b-8010-d99b9690a899/gr2.jpg", "publishedAt": "2020-05-08T22:31:07Z", "content": "We use cookies to help provide and enhance our service and tailor content and ads. By continuing you agree to the use of cookies.\r\nCopyright © 2020 Elsevier Inc. except certain content provided by third parties.\r\nPrivacy Policy   Terms and Conditions"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Gay Coronavirus Survivor Not Allowed To Donate Blood Because Of Deferral Period Policy - CBS New York", "description": "As the nation fights against COVID-19, blood and plasma donations are needed more than ever, but some coronavirus survivors are being told they're not allowe...", "url": "https://www.youtube.com/watch?v=qeUjXq7kxYY", "urlToImage": "https://i.ytimg.com/vi/qeUjXq7kxYY/maxresdefault.jpg", "publishedAt": "2020-05-08T22:25:33Z", "content": null}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Paresh Dave", "title": "WHO readies coronavirus app for checking symptoms, possibly contact tracing - Reuters", "description": "The World Health Organization (WHO) plans to launch an app this month to enable people in under-resourced countries to assess whether they may have the novel coronavirus, and is considering a Bluetooth-based contact tracing feature too, an official told Reute…", "url": "https://www.reuters.com/article/us-health-coronavirus-who-apps-idUSKBN22K2QV", "urlToImage": "https://s1.reutersmedia.net/resources/r/?m=02&d=20200508&t=2&i=1517985597&w=1200&r=LYNXMPEG471S0", "publishedAt": "2020-05-08T20:05:00Z", "content": "OAKLAND, California (Reuters) - The World Health Organization (WHO) plans to launch an app this month to enable people in under-resourced countries to assess whether they may have the novel coronavirus, and is considering a Bluetooth-based contact tracing fea… [+3981 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "WHO: Public health surveillance must be the next step in COVID-19 fight - Reuters", "description": "To bring the coronavirus outbreak under control, countries must get back on track with public health surveillance says the World Health Organization's (WHO) ...", "url": "https://www.youtube.com/watch?v=GEZ461g1Rkg", "urlToImage": "https://i.ytimg.com/vi/GEZ461g1Rkg/maxresdefault.jpg", "publishedAt": "2020-05-08T19:31:11Z", "content": null}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Sanchita Sharma", "title": "Anti-malaria drug hydroxychloroquine fails another test as a Covid-19 treatment, says study - Hindustan Times", "description": "Hydroxychloroquine is the only drug approved for treating hospitalised Covid-19 patients in India, where it is given in combination with the antibiotic azithromycin.", "url": "https://www.hindustantimes.com/india-news/anti-malaria-drug-fails-another-test-as-a-covid-19-treatment-says-study/story-IadOtW6iRHIf7LMCA6AvSN.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/09/Pictures/virus-outbreak-india_cf22c1a4-9166-11ea-b214-efce58d4f976.jpg", "publishedAt": "2020-05-08T19:11:00Z", "content": "Anti-malaria drug hydroxychloroquine has failed another test to check its efficacy in treating the coronavirus disease (Covid-19), a new study has revealed, with patients admitted to hospitals showing no change in their conditions after being administered the… [+4362 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Children with Coronavirus May Threaten World's Ability to Reopen - Bloomberg QuickTake", "description": "Children with Covid-19 threaten recovery from the pandemic -- sparking increased scrutiny of their cases from scientists and policy makers seeking clues abou...", "url": "https://www.youtube.com/watch?v=6BKjSqyIQT4", "urlToImage": "https://i.ytimg.com/vi/6BKjSqyIQT4/maxresdefault.jpg", "publishedAt": "2020-05-08T18:30:41Z", "content": null}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Explained Desk", "title": "What is coronavirus pandemic, and how it spread across the world - The Indian Express", "description": "Coronavirus Pandemic, Covid-19 Symptoms, Precautions, Vaccine, Medicine, Cases in India and World: Here's how the novel coronavirus pandemic started and a summary of the biggest developments in the novel coronavirus outbreak.", "url": "https://indianexpress.com/article/explained/what-is-the-coronavirus-pandemic-and-how-it-spread-across-the-world-6397912/", "urlToImage": "https://images.indianexpress.com/2020/05/covid-explained.jpg?w=759", "publishedAt": "2020-05-08T18:23:39Z", "content": "Coronavirus (Covid-19) cases, symptoms, precautions: The United States is at the top of the list in coronavirus infections and deaths that stand at 1,256,972 and 75,670 respectively.Coronavirus (Covid-19) cases, symptoms, precautions: For the last few months,… [+16059 chars]"}, {"source": {"id": null, "name": "Who.int"}, "author": "World Health Organization: WHO", "title": "Commemorating Smallpox Eradication – a legacy of hope, for COVID-19 and other diseases - World Health Organization", "description": "<p>On 8 May 1980, the 33rd World Health Assembly officially declared: ‘The world and all its peoples have won freedom from smallpox.’ <o:p></o:p><br /></p><p>The declaration marked the end of a disease that had plagued humanity for at least 3 000 years, killi…", "url": "https://www.who.int/news-room/detail/08-05-2020-commemorating-smallpox-eradication-a-legacy-of-hope-for-covid-19-and-other-diseases", "urlToImage": null, "publishedAt": "2020-05-08T18:19:59Z", "content": "On 8 May 1980, the 33rd World Health Assembly officially declared: ‘The world and all its peoples have won freedom from smallpox.’ \r\nThe declaration marked the end of a disease that had plagued humanity for at least 3 000 years, killing 300 million people in … [+5075 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "AstraZeneca to Make Experimental Virus Vaccine Developed by Oxford University - Bloomberg QuickTake", "description": "AstraZeneca has agreed to make an experimental inoculation developed by researchers at Oxford. Already being studied in humans, it could reach late-stage tri...", "url": "https://www.youtube.com/watch?v=OzltdRM7sLI", "urlToImage": "https://i.ytimg.com/vi/OzltdRM7sLI/maxresdefault.jpg", "publishedAt": "2020-05-08T17:42:32Z", "content": "AstraZeneca has agreed to make an experimental inoculation developed by researchers at Oxford. Already being studied in humans, it could reach late-stage trials by the middle of the year.\r\nFrom the U.S. to China to Germany, scientists are working around the c… [+1394 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "NYC launches virus contract tracing corps - Associated Press", "description": "New York City announced Friday it is launching a contact tracing corps to identify and treat people infected with the new coronavirus and prevent spread. (Ma...", "url": "https://www.youtube.com/watch?v=IOEw7lcnEBI", "urlToImage": "https://i.ytimg.com/vi/IOEw7lcnEBI/maxresdefault.jpg", "publishedAt": "2020-05-08T17:04:27Z", "content": null}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "India TV Lifestyle Desk", "title": "Can coronavirus be sexually transmitted? Here's what Chinese study says - India TV News", "description": "Doctors in China detected the virus in semen from six of 38 men hospitalized with laboratory-confirmed Covid-19. While four infected with the disease were sick, the other two were recovering", "url": "https://www.indiatvnews.com/health/coronavirus-covid-19-spread-through-sex-chinese-study-615463", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2020/05/coronavirus-1588956885.jpg", "publishedAt": "2020-05-08T17:01:45Z", "content": "Image Source : NEUROSCIENCENEW/INSTAGRAMCan coronavirus be transmitted via sex?\r\nSo far there was no proof of COVID-19 being sexually transmitted. However, a new study by Chinese researchers has raised many eyebrows. In a small study by Chinese researchers, i… [+1818 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "What do studies on new coronavirus mutations tell us? - Arab News", "description": "A series of studies of the genomes of thousands of samples of the new coronavirus SARS-CoV-2 show that it is mutating and evolving as it adapts to its human ...", "url": "https://www.youtube.com/watch?v=Sic0VMNEFcE", "urlToImage": "https://i.ytimg.com/vi/Sic0VMNEFcE/hqdefault.jpg", "publishedAt": "2020-05-08T16:57:54Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Antibiotic resistance may rise after COVID-19, as doctors struggle to treat secondary infections - CBS News", "description": "Doctors around the world are struggling to cure secondary illnesses patients contracted while battling coronavirus. Wired contributor Maryn McKenna joined CB...", "url": "https://www.youtube.com/watch?v=rvYekgNZhCo", "urlToImage": "https://i.ytimg.com/vi/rvYekgNZhCo/maxresdefault.jpg", "publishedAt": "2020-05-08T16:52:06Z", "content": "Sign in to report inappropriate content.\r\nSign in"}, {"source": {"id": null, "name": "Theprint.in"}, "author": "Kristen V Brown", "title": "Yes, coronavirus is mutating but most experts are not too worried - ThePrint", "description": "US researchers have identified a variant of the virus that causes Covid-19. It has quickly become the dominant form around the globe.", "url": "https://theprint.in/health/yes-coronavirus-is-mutating-but-most-experts-are-not-too-worried/417471/", "urlToImage": "https://d2c7ipcroan06u.cloudfront.net/wp-content/uploads/2020/05/corona-test.jpg", "publishedAt": "2020-05-08T16:44:59Z", "content": "San Francisco/New York: As the new coronavirus has spread from person to person, and country to country, the virus has changed thousands of times. The vast majority of these changes are incremental. But last week, researchers at the Los Alamos National Labora… [+6358 chars]"}, {"source": {"id": null, "name": "Scitechdaily.com"}, "author": null, "title": "Vitamin D Linked to Low Coronavirus Death Rate - SciTechDaily", "description": "New COVID-19 research finds relationship in data from 20 European countries. A new study has found an association between low average levels of vitamin D and high numbers of COVID-19 cases and mortality rates across 20 European countries. The research, led by…", "url": "https://scitechdaily.com/vitamin-d-linked-to-low-coronavirus-death-rate/", "urlToImage": "https://scitechdaily.com/images/Vitamin-D-Supplement-Sunshine.jpg", "publishedAt": "2020-05-08T16:02:01Z", "content": "People get vitamin D from sun exposure, foods (such as fatty fish, beef liver, cheese, and egg yolks), and supplements.\r\nNew COVID-19 research finds relationship in data from 20 European countries.\r\nA new study has found an association between low average lev… [+2820 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "How Scientists Are Using Baker's Yeast to Develop a Coronavirus Vaccine | Mashable - Mashable", "description": "While scientists are desperately looking for COVID-19 treatments and vaccines, common baker's yeast has proven to be an unexpected, yet valuable resource in ...", "url": "https://www.youtube.com/watch?v=ohe9tKUAVq4", "urlToImage": "https://i.ytimg.com/vi/ohe9tKUAVq4/maxresdefault.jpg", "publishedAt": "2020-05-08T16:00:36Z", "content": "While scientists are desperately looking for COVID-19 treatments and vaccines, common baker's yeast has proven to be an unexpected, yet valuable resource in the fight against coronavirus.\r\nMashable is your source for the latest in tech, culture, and entertain… [+223 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Jessica Knibbs", "title": "Coronavirus symptoms: Does your nose feel like this? Two warning signs found in the nose - Express", "description": "CORONAVIRUS symptoms have been shown to manifest themselves in a number of ways. If your nose feels like either of these two warnings it could mean you're at risk.", "url": "https://www.express.co.uk/life-style/health/1279726/coronavirus-latest-update-symptoms-anosmia-runny-nose-covid19", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/750x445/1279726.jpg", "publishedAt": "2020-05-08T15:36:55Z", "content": null}, {"source": {"id": null, "name": "Bgr.com"}, "author": "Chris Smith", "title": "Scientists have developed antibodies that can kill coronavirus - BGR", "description": "Researchers from the Netherlands and Japan have developed antibodies for the novel coronavirus that can neutralize the pathogen in labs. The drugs still need to prove their effectiveness in human trials, but they might be ready for wide use before a vaccine. …", "url": "https://bgr.com/2020/05/08/coronavirus-treatment-monoclonal-antibody-drugs-47d11-vhh-others/", "urlToImage": "https://boygeniusreport.files.wordpress.com/2020/03/webp.net-resizeimage-1-9.jpg?quality=70&strip=all", "publishedAt": "2020-05-08T14:52:41Z", "content": "<ul><li>Researchers from the Netherlands and Japan have developed antibodies for the novel coronavirus that can neutralize the pathogen in labs.</li><li>The drugs still need to prove their effectiveness in human trials, but they might be ready for wide use be… [+4997 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Spanish Cat Who Died of Pre-existing Respiratory Condition Tests Positive for Coronavirus - News18", "description": "The cat, named Negrito, was the sixth feline to be detected with the disease globally. It belonged to a household in the Barcelona area where several family members had caught the virus.", "url": "https://www.news18.com/news/world/spanish-cat-who-died-of-pre-existing-respiratory-condition-tests-positive-for-coronavirus-2611889.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/03/Untitled-design-25.png", "publishedAt": "2020-05-08T14:37:10Z", "content": "A cat belonging to a family in the Spanish region of Catalonia tested positive for the novel coronavirus, the professor who conducted an autopsy on the pet said on Friday.\r\nIt did not die from the virus, however, but from a pre-existing respiratory condition … [+1667 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "PTI", "title": "Mandatory BCG vaccination may make COVID-19 less virulent in India, suggests study - Deccan Herald", "description": "The bacille Calmette-Gurin (BCG) vaccine has a documented protective effect against meningitis and disseminated TB in children, according to the World Health Organisation.", "url": "https://www.deccanherald.com/science-and-environment/mandatory-bcg-vaccination-may-make-covid-19-less-virulent-in-india-suggests-study-835151.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/article_images/2020/05/08/bcg%20vaccine%20afp-1588958435.jpg", "publishedAt": "2020-05-08T13:52:02Z", "content": "After scanning COVID-19 data of 29 countries across the world, a group of city-based researchers has suggested that factors such as BCG vaccination in developing nations like India have led to a situation where the rate of contamination and fatality from the … [+3488 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Lifestyle Desk", "title": "How diabetics can manage stress during lockdown to control blood sugar levels - The Indian Express", "description": "If your blood sugar levels are not under control, make sure to consult your doctor without delay.", "url": "https://indianexpress.com/article/lifestyle/health/how-diabetics-can-manage-stress-to-control-sugar-levels-lockdown-covid-19-6400326/", "urlToImage": "https://images.indianexpress.com/2020/05/stress-759.jpg?w=759", "publishedAt": "2020-05-08T13:00:33Z", "content": "Stress can increase blood sugar levels. (Source: getty images)One of the things diabetics are most worried about these days is whether they are more prone to the coronavirus infection. But evidence has shown that as long as diabetics keep their blood sugar le… [+3782 chars]"}, {"source": {"id": null, "name": "Thenewsopediaindia.co.in"}, "author": "rishixkumar00", "title": "Italy’s Milan a ticking coronavirus ‘bomb’: Report - The Newsopedia", "description": "Italy’s economic capital Milan is a virus time “bomb” at risk of erupting with residents now free to move around -- some gathering for canal-side cocktails -- after two", "url": "https://www.thenewsopediaindia.co.in/news/world/italys-milan-a-ticking-coronavirus-bomb%e2%80%89report-world-news/", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/08/Pictures/virus-outbreak-italy_11f6586e-9122-11ea-b214-efce58d4f976.jpg", "publishedAt": "2020-05-08T12:59:22Z", "content": "Italys economic capital Milan is a virus time bomb at risk of erupting with residents now free to move around — some gathering for canal-side cocktails — after two months under a pandemic lockdown. \r\nThe city in the northern Lombardy region is the epicentre o… [+1219 chars]"}, {"source": {"id": null, "name": "Thestatesman.com"}, "author": "SNS Web", "title": "Hotter, humid weather may not halt spread of Coronavirus: Study - The Statesman", "description": "There were several study limitations, according to the researches, such as differences in testing practices, the inability to estimate actual rates of COVID-19 and compliance with social distancing.", "url": "https://www.thestatesman.com/coronavirus/hotter-humid-weather-may-not-halt-spread-of-coronavirus-study-1502885698.html", "urlToImage": "https://www.thestatesman.com/wp-content/uploads/2020/05/corona.jpg", "publishedAt": "2020-05-08T12:48:09Z", "content": "According to a global study on novel Coronavirus, temperature and latitude are not associated with the spread of COVID-19 disease that found public health measures, including school closures, social distancing and restrictions of large gatherings etc are havi… [+2907 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "IANS", "title": "Coronavirus: Hotter, humid weather may not stop COVID-19, says study - Livemint", "description": "The study looked at 144 geopolitical areas and found little or no association between latitude or temperature with epidemic growth of COVID-19 and a weak association between humidity and reduced transmission", "url": "https://www.livemint.com/news/india/coronavirus-hotter-humid-weather-may-not-stop-covid-19-says-study-11588938178090.html", "urlToImage": "https://images.livemint.com/img/2020/05/08/600x338/AFP_1R36IG_1588895056631_1588941139487.jpg", "publishedAt": "2020-05-08T12:34:47Z", "content": "TORONTO :\r\ncoronavirus, coronavirus pandemic, temperature, humid weather, COVID-19 disease, coronavirus transmission, Canadian Medical Association Journal, Donald TrumpTemperature and latitude are not associated with the spread of the COVID-19 disease, say re… [+3161 chars]"}, {"source": {"id": null, "name": "Weather.com"}, "author": "IANS", "title": "Hot, Humid Weather Unlikely to Slow Down Coronavirus Transmission: Study - The Weather Channel", "description": "The researchers did find that public health measures, including school closures, social distancing and restrictions of large gatherings, have been effective.", "url": "https://weather.com/en-IN/india/coronavirus/news/2020-05-08-hot-humid-weather-unlikely-slow-down-coronavirus-transmission", "urlToImage": "https://s.w-x.co/in-heat_20.jpg", "publishedAt": "2020-05-08T12:26:03Z", "content": "File photo: People stand in scorching heat at a food distribution centre during the nationwide lockdown in New Delhi, India\r\n(Piyal Bhattacharjee/TOI, Delhi, BCCL\r\n)\r\nTemperature and latitude are not associated with the spread of COVID-19, say researchers, ad… [+3007 chars]"}, {"source": {"id": "the-irish-times", "name": "The Irish Times"}, "author": "Richard Milne", "title": "Sweden insists its no-lockdown approach to coronavirus will pay off - The Irish Times", "description": "Architect of controversial strategy says Sweden will have advantage against virus second wave", "url": "https://www.irishtimes.com/news/world/europe/sweden-insists-its-no-lockdown-approach-to-coronavirus-will-pay-off-1.4248417", "urlToImage": "https://www.irishtimes.com/image-creator/?id=1.4248415&origw=1440", "publishedAt": "2020-05-08T11:58:27Z", "content": "Swedens unique strategy to deal with coronavirus will ensure it has only a small second wave of cases unlike other countries that could be forced to return to lockdown, according to the architect of the contentious policy.\r\nAnders Tegnell, Swedens state epide… [+4865 chars]"}, {"source": {"id": null, "name": "Theprint.in"}, "author": "Mohana Basu", "title": "Scientists develop sensor that can help smartphones detect coronavirus in 60 seconds - ThePrint", "description": "Low vitamin D levels linked to higher deaths and a dialysis device that gives white blood cells a fighting edge, ThePrint brings you the latest on Covid-19.", "url": "https://theprint.in/health/scientists-develop-sensor-that-can-help-smartphones-detect-coronavirus-in-60-seconds/417100/", "urlToImage": "https://d2c7ipcroan06u.cloudfront.net/wp-content/uploads/2020/04/corr.jpg", "publishedAt": "2020-05-08T11:10:14Z", "content": "New Delhi: The coronavirus pandemic has driven scientists around the world to find new ways of fighting Covid-19, even as understanding about the virus evolves every day.\r\nHere are some of the latest scientific developments in the fight against SARS-CoV-2.\r\nS… [+5593 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Ariana Eunjung Cha", "title": "Coronavirus: Blood thinners could boost survival chances of patients - The Independent", "description": "There was no significant difference in most dangerous side effect of anticoagulants in those who were on drugs versus those not", "url": "https://www.independent.co.uk/news/world/americas/coronavirus-blood-thinners-us-survival-deaths-a9505201.html", "urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2020/05/08/11/gettyimages-72966192.jpg", "publishedAt": "2020-05-08T10:55:30Z", "content": "Treating coronavirus patients with blood thinners could help boost their prospects for survival, according to preliminary findings from physicians at New York Citys largest hospital system that offer another clue about treating the deadly condition.\r\nThe resu… [+5931 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "IANS", "title": "Facebook, YouTube, Twitter struggle to remove pandemic conspiracy video - The Hindu", "description": "The 26-minute video features a famous vaccine conspiracist who defies the advice of medical experts like saying that “sheltering in place harms consumers’ immune systems and that masks can make people sicker”", "url": "https://www.thehindu.com/sci-tech/technology/internet/facebook-youtube-twitter-struggle-to-remove-pandemic-conspiracy-video/article31534247.ece", "urlToImage": "https://www.thehindu.com/sci-tech/technology/internet/m9fw0z/article31534246.ece/ALTERNATES/LANDSCAPE_615/08NETFBGOOGLETWITTER", "publishedAt": "2020-05-08T10:32:02Z", "content": "Social media platforms like Facebook, YouTube and Twitter are finding it difficult to remove a Coronavirus conspiracy video called Plandemic that has spread faster that the virus and can still be accessed on these platforms.\r\nThe 26-minute video features a fa… [+1387 chars]"}, {"source": {"id": null, "name": "Bloombergquint.com"}, "author": "Nishant Sharma", "title": "Are India’s Private Labs Overcharging For Covid-19 Tests? - BloombergQuint", "description": "The pricing of the RT-PCR tests being conducted by private labs has kicked off a debate.", "url": "https://www.bloombergquint.com/business/are-indias-private-labs-overcharging-for-covid-19-tests", "urlToImage": "https://images.assettype.com/bloombergquint%2F2020-05%2Fb60b05e1-dd21-47ba-ab8b-5a71bd725511%2F361805276.jpg?w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2020-05-08T09:54:05Z", "content": ""}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Terri-Ann Williams", "title": "The 6 signs of ‘silent hypoxia’ that can prove deadly for Covid patients - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11569767/six-signs-silent-hypoxia-covid-patients/", "urlToImage": "https://www.thesun.co.uk/wp-content/uploads/2020/05/NINTCHDBPICT000580912166.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "publishedAt": "2020-05-08T09:49:01Z", "content": "SILENT hypoxia is a condition that is mystifying doctors as it continues to leave patients with the coronavirus able to converse with their loved ones, when they would usually be gasping for air.\r\nPatients with the condition also known as \"happy hypoxia\" will… [+6938 chars]"}, {"source": {"id": null, "name": "Oneindia.com"}, "author": "Simran Kashyap", "title": "What is ‘silent hypoxia’ that can prove deadly for Coronavirus patients - Oneindia", "description": "Hypoxia is a condition in which the body or a region of the body is deprived of adequate oxygen supply at the tissue level. It is a condition in which the body's oxygen concentration levels drop below 60 per cent in patients infected with the coronavirus.", "url": "https://www.oneindia.com/india/what-is-silent-hypoxia-that-can-prove-deadly-for-coronavirus-patients-3085161.html", "urlToImage": "https://www.oneindia.com/img/2020/05/xcoronavirus832-1586958260-1588668194-jpg-pagespeed-ic-lnndj5ptof-1588930694.jpg", "publishedAt": "2020-05-08T09:40:19Z", "content": "New Delhi, May 08: Many patients are now arriving at the hospital with oxygen percentage levels in the 80s or 70s and some have even had levels below 50 per cent. The condition is known as 'Silent Hypoxia'.\r\nIt is a condition in which the body's oxygen concen… [+1727 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "India.com Viral News Desk", "title": "Rare Medical Case: Brazil Man Complains of Severe Back Pain, Stunned to Discover That He Has 3 Kidneys! - India.com", "description": "Doctors believe that the condition arises during embryonic development when a structure that typically forms a single kidney splits in two.", "url": "https://www.india.com/viral/brazil-man-complains-of-severe-back-pain-stunned-to-discover-that-he-has-3-kidneys-4023330/", "urlToImage": "https://www.india.com/wp-content/uploads/2020/05/The_Stethoscope_Peru-1.jpg", "publishedAt": "2020-05-08T09:09:33Z", "content": "Did you know that a person can have 3 kidneys? Well, it seems almost impossible, however it’s true! Having three kidneys is extremely rare, and there are fewer than 100 cases reported in the medical literature. Also Read - World Kidney Day 2020: All You Need … [+1401 chars]"}, {"source": {"id": null, "name": "Theprint.in"}, "author": "Justin Fox", "title": "Covid-19 mainly kills old people. So do most other diseases - ThePrint", "description": "Covid-19 is a highly infectious disease for everybody over 40, but is less harmful than a disease of similar infectiousness.", "url": "https://theprint.in/health/covid-19-mainly-kills-old-people-so-do-most-other-diseases/416931/", "urlToImage": "https://d2c7ipcroan06u.cloudfront.net/wp-content/uploads/2020/05/361866211-1.jpg", "publishedAt": "2020-05-08T08:58:11Z", "content": "Covid-19 is hard on the elderly, with those 65 and older accounting for 80% of the U.S. deaths from the disease for which the Centers for Disease Control and Prevention has released demographic data. But this is true of most illnesses: In 2018, 78% of all U.S… [+9457 chars]"}, {"source": {"id": null, "name": "Zeebiz.com"}, "author": "PTI", "title": "Most COVID-19 patients may lose sense of smell by third day of infection: Study - Zee Business", "description": "The findings indicated that a decreased sense of smell may be an indicator of patients early in the disease course as well as those who may go on to develop more severe symptoms, like shortness of breath, Sedaghat said.", "url": "https://www.zeebiz.com/india/news-most-covid-19-patients-may-lose-sense-of-smell-by-third-day-of-infection-study-126299", "urlToImage": "https://cdn.zeebiz.com/sites/default/files/2020/05/08/118448-smell-pixabay.jpg", "publishedAt": "2020-05-08T08:45:00Z", "content": "Loss of the sense of smell is most likely to occur by the third day of infection with the novel coronavirus, according to a study of over 100 COVID-19 patients which may help public health experts better identify those carrying the virus without adverse sympt… [+2939 chars]"}, {"source": {"id": null, "name": "Medicalxpress.com"}, "author": "Cedric Ricks", "title": "By the third day most with COVID-19 lose sense of smell - Medical Xpress", "description": "A University of Cincinnati researcher says a study of COVID-19 patients shows loss of the sense of smell is most likely to occur by the third day of infection with the novel virus. Most of these patients are also experiencing a loss of the sense of taste.", "url": "https://medicalxpress.com/news/2020-05-day-covid-.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/bythethirdda.jpg", "publishedAt": "2020-05-08T08:44:09Z", "content": "A University of Cincinnati researcher says a study of COVID-19 patients shows loss of the sense of smell is most likely to occur by the third day of infection with the novel virus. Most of these patients are also experiencing a loss of the sense of taste.\r\nTh… [+4746 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "World Thalassemia Day 2020: India has roughly 40 mn carriers; here are key points about the chronic... - Firstpost", "description": "This year, TIF is holding a virtual discussion in which patient advocates will talk about the accessibility and affordability of novel therapies for thalassemia", "url": "https://www.firstpost.com/health/world-thalassemia-day-2020-india-has-roughly-40-mn-carriers-here-are-key-points-about-the-chronic-genetic-disease-8346991.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/05/blood-1813410_1280-1.jpg", "publishedAt": "2020-05-08T08:05:54Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Qatar health minister: 'Coronavirus rate not high, but realistic' | Talk to Al Jazeera - Al Jazeera English", "description": "It has been nearly two months since Qatar implemented a series of measures to contain the outbreak of COVID-19, the highly infectious respiratory disease cau...", "url": "https://www.youtube.com/watch?v=VbkGlfkrNB0", "urlToImage": "https://i.ytimg.com/vi/VbkGlfkrNB0/maxresdefault.jpg", "publishedAt": "2020-05-08T07:47:32Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Could wastewater spread the novel coronavirus? - Don't neglect sewage! - Economic Times", "description": "Even as the novel coronavirus spreads across the world, environmental biologists at the University of Stirling have warned that the potential spread of COVID-19 via sewage \"must not be neglected\" in the battle to protect human health. Don't neglect sewage!", "url": "https://economictimes.indiatimes.com/news/politics-and-nation/could-wastewater-spread-the-novel-coronavirus/dont-neglect-sewage/slideshow/75619333.cms", "urlToImage": "https://img.etimg.com/thumb/msid-75619333,width-1070,height-580,overlay-economictimes/photo.jpg", "publishedAt": "2020-05-08T06:35:00Z", "content": "Updated: 08 May 2020, 12:05 PM IST\r\nEven as the novel coronavirus spreads across the world, environmental biologists at the University of Stirling have warned that the potential spread of COVID-19 via sewage \"must not be neglected\" in the battle to protect hu… [+1813 chars]"}, {"source": {"id": null, "name": "Japantimes.co.jp"}, "author": "Internal Submission", "title": "Lockdown darkens for India after train runs over sleeping migrants - The Japan Times", "description": "A freight train ran over and killed more than a dozen poor Indians, who were trying to walk back to their home state after the world’s most expansive virus", "url": "https://www.japantimes.co.jp/news/2020/05/08/asia-pacific/india-train-runs-over-migrants/", "urlToImage": "https://cdn.japantimes.2xx.jp/wp-content/uploads/2020/05/np_file_10894-870x617.jpeg", "publishedAt": "2020-05-08T06:18:00Z", "content": "A freight train ran over and killed more than a dozen poor Indians, who were trying to walk back to their home state after the worlds most expansive virus lockdown left them unemployed.\r\nAs many as 20 people had walked for 36 kilometers (22 miles), following … [+1783 chars]"}, {"source": {"id": null, "name": "Timesnownews.com"}, "author": "Salome Phelamei", "title": "Coronavirus mutations: 50% virus strains in India have new mutation; D614G could make disease more contagious - Times Now", "description": "As the novel coronavirus continues to spread its venom across the world, a research has warned that a particular mutation in the virus spike protein could make COVID-19 more contagious.", "url": "https://www.timesnownews.com/health/article/coronavirus-mutations-50-virus-strains-in-india-have-new-mutation-d614g-could-make-disease-more-contagious/588789", "urlToImage": "https://imgk.timesnownews.com/story/virus-mutations.gif?tr=w-560,h-292,fo-top", "publishedAt": "2020-05-08T06:11:25Z", "content": "<ul><li>Researchers say a new mutation called 'D614G' in the spike protein is becoming dominant across the world</li><li> An analysis of 82 coronavirus strains in India showed that nearly 50 per cent of these strains have the new mutation</li><li>The authors … [+4227 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Asian News International | Posted by: Shankhyaneel Sarkar", "title": "Blood thinners may boost survival rates of Covid-19 infected patients: Report - Top Live News", "description": "The Washington Post reported that the results of the analysis, conducted over 2,733 patients, were published on Wednesday in the Journal of the American College of Cardiology.", "url": "https://www.hindustantimes.com/world-news/blood-thinners-may-boost-survival-rates-of-covid-19-infected-patients-report/story-ZoaHyGBIecseqITSsPabJK.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/08/Pictures/transmission-electron-micrograph-particle-coronavirus-known-novel_e3497a04-90eb-11ea-80d7-183d6ba34199.jpg", "publishedAt": "2020-05-08T05:34:36Z", "content": "Treating coronavirus patients with blood thinners may help in boosting their prospects for survival, according to preliminary findings from physicians at New York City’s largest hospital system that offers another source of hope in treating the deadly infecti… [+4100 chars]"}, {"source": {"id": null, "name": "Scitechdaily.com"}, "author": null, "title": "COVID-19 Treatment May Lie in Pangolin Genetics – May Possess Evolutionary Advantage Against Coronavirus - SciTechDaily", "description": "The exotic animal's genome could point to possible treatment options for COVID-19 in humans. Similar to how a smoke detector sounds off an alarm, certain genes sense when a virus enters the body, alerting of an intruder and triggering an immune response in mo…", "url": "https://scitechdaily.com/covid-19-treatment-may-lie-in-pangolin-genetics-may-possess-evolutionary-advantage-against-coronavirus/", "urlToImage": "https://scitechdaily.com/images/Pangolin-Zambia.jpg", "publishedAt": "2020-05-08T04:00:39Z", "content": "The exotic animal’s genome could point to possible treatment options for COVID-19 in humans.\r\nSimilar to how a smoke detector sounds off an alarm, certain genes sense when a virus enters the body, alerting of an intruder and triggering an immune response in m… [+2767 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Lara Moehlman", "title": "8-year-old rushed to hospital due to mystery illness linked to COVID-19 - ABC News", "description": "", "url": "https://abcnews.go.com/Health/year-rushed-hospital-due-mystery-illness-linked-covid/story?id=70568060", "urlToImage": "https://s.abcnews.com/images/Health/jayden-hardowar-02-ht-jef-200507_hpMain_16x9_992.jpg", "publishedAt": "2020-05-08T03:48:41Z", "content": "Jayden Hardowar, 8, of Richmond Hill, Queens, spiked a mild fever sometime around April 23.\r\nA pediatrician told Jayden's parents not to worry and to continue taking children's Tylenol, his father, Roup Hardowar, told ABC News on Thursday.\r\nIn three days, his… [+3918 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "CNN", "title": "Coronavirus: Missing remains mean no peace for grieving families in Ecuador - 7NEWS.com.au", "description": "There are so many bodies, relatives are being asked to search through unidentified remains themselves.", "url": "https://7news.com.au/news/world/coronavirus-missing-remains-mean-no-peace-for-grieving-families-in-ecuador-c-1024833", "urlToImage": "https://images.7news.com.au/publication/C-1024833/1003a0153431771deb6413b91bf6a1bf641f49e3-16x9-x0y0w2000h1125.png?imwidth=1024", "publishedAt": "2020-05-08T03:05:31Z", "content": "Warning: Distressing images and content\r\nWhen Flavio Ramos was wheeled into the hospital room in Ecuador, he was gasping for air and slipping in and out of consciousness.\r\nSo it was his son, Arturo, who first noticed the bodies.\r\nTwo corpses laid unattended o… [+8268 chars]"}, {"source": {"id": null, "name": "Technoinfoplus.com"}, "author": null, "title": "Researchers In Italy Have Claimed That They Have Developed The World's First Vaccine Against Coronavirus Disease! - Techno Info Plus", "description": "But thankfully, Italy's research team says that they have found the first vaccine against the coronavirus antibodies. 𝕿𝖊𝖈𝖍𝖓𝖔 𝕴𝖓𝖋𝖔 𝕻𝖑𝖚𝖘", "url": "https://technoinfoplus.com/researchers-in-italy-have-claimed-that-they-have-developed-the-worlds-first-vaccine-against-coronavirus-disease/", "urlToImage": "https://technoinfoplus.com/wp-content/uploads/2020/05/download-8.jpg", "publishedAt": "2020-05-08T02:03:37Z", "content": "Coronavirus Breakthrough\r\nWe all know the impact that the coronavirus causes to the world. Some many scientists and researchers are trying to find a medicine for this deadly disease. However, the countries are taking several measures to control this virus. Re… [+2017 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "AFP", "title": "As the COVID-19 pandemic deepens, virus symptoms multiply - Deccan Herald", "description": "Every week, it seems, the list of coronavirus symptoms -- ranging from disagreeable to the deadly -- grows longer. Follow latest updates on the COVID-19 pandemic here", "url": "https://www.deccanherald.com/science-and-environment/as-the-covid-19-pandemic-deepens-virus-symptoms-multiply-834928.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/article_images/2020/05/08/755237-01-02-1588904450.jpg", "publishedAt": "2020-05-07T20:58:35Z", "content": "Every week, it seems, the list of coronavirus symptoms -- ranging from disagreeable to the deadly -- grows longer.\r\nFollow latest updates on the COVID-19 pandemic here\r\nWhat began as a familiar flu-like cluster of chills, headaches and fever has rapidly expan… [+5496 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "What happens if your driver's license expires during the COVID-19 pandemic? - WHAS11", "description": "If your license expired March 18, the day after offices closed, and you cannot renew online, you have until June 15 before your license truly expires.", "url": "https://www.youtube.com/watch?v=8pzTUrQZV2I", "urlToImage": "https://i.ytimg.com/vi/8pzTUrQZV2I/hqdefault.jpg", "publishedAt": "2020-05-07T20:50:17Z", "content": null}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Staff Reporter", "title": "Health expert warns against herd immunity strategy - The Hindu", "description": "It is better to focus on herd protection by emphasising more on disease containment and protection of vulnerable groups’", "url": "https://www.thehindu.com/news/national/health-expert-warns-against-herd-immunity-strategy/article31530401.ece", "urlToImage": "https://www.thehindu.com/news/national/kipois/article31530400.ece/ALTERNATES/LANDSCAPE_615/07THLTKSRINATHREDDYPHFI", "publishedAt": "2020-05-07T20:44:44Z", "content": "Prominent public health expert and advisor to the Odisha government on health, K. Srinath Reddy, warned against pursuing the herd immunity strategy to overcome the COVID-19 pandemic.\r\nThe herd immunity idea might prove to be dangerous as it carries the risk o… [+2149 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "Not good enough: FDA withdraws approval for some China-made masks - Aljazeera.com", "description": "A number of the Chinese-made masks failed to demonstrate a minimum particulate filtration efficiency: FDA.", "url": "https://www.aljazeera.com/ajimpact/good-fda-withdraws-approval-china-masks-200507193220747.html", "urlToImage": "https://www.aljazeera.com/mritems/Images/2020/5/7/c6691ec61e5445d29b4269b174e9d88d_18.jpg", "publishedAt": "2020-05-07T20:02:00Z", "content": "The United States Food and Drug Administration (FDA) on Thursday announced that it has cancelled the approval for some manufacturers in China to sell N95 respirators in the US. The administration says the masks failed to offer adequate protection against the … [+486 chars]"}, {"source": {"id": null, "name": "Bangkokpost.com"}, "author": "Bangkok Post Public Company Limited", "title": "As pandemic deepens, virus symptoms multiply - Bangkok Post", "description": "PARIS - Every week, it seems, the list of coronavirus symptoms -- ranging from disagreeable to the deadly -- grows longer.", "url": "https://www.bangkokpost.com/world/1914280/as-pandemic-deepens-virus-symptoms-multiply", "urlToImage": "https://static.bangkokpost.com/media/content/20200508/c1_3625472_700.jpg", "publishedAt": "2020-05-07T18:45:00Z", "content": "PARIS - Every week, it seems, the list of coronavirus symptoms -- ranging from disagreeable to the deadly -- grows longer.\r\nWhat began as a familiar flu-like cluster of chills, headaches and fever has rapidly expanded over the last three months into a catalog… [+5440 chars]"}, {"source": {"id": null, "name": "Abplive.com"}, "author": "ABP News Bureau", "title": "Chinese Researcher On Covid-19 In US Found Dead, Raises Question On Whether It’s A Murder Or Suicide - ABP Live", "description": "The young researcher Dr Bing Liu had been shot multiple times in the head, neck, and torso in his house and later the suspect was also found dead inside a car few miles away.", "url": "https://news.abplive.com/news/chinese-researcher-on-covid-19-in-the-us-found-dead-in-murder-suicide-1230143", "urlToImage": "https://static.abplive.com/wp-content/uploads/2020/05/07214802/bing-liu.jpg?impolicy=abp_cdn&imwidth=1200&imheight=628", "publishedAt": "2020-05-07T18:34:45Z", "content": "Cornavirus in US: In a shocking incident a Chinese researcher in the University of Pittsburgh who is said to have been on the verge of making a breakthrough in coronavirus research was found dead in a murder-suicide. The young researcher Dr Bing Liu had been … [+2884 chars]"}, {"source": {"id": null, "name": "Sciencedaily.com"}, "author": null, "title": "Sleep difficulties linked to altered brain development in infants who later develop autism - Science Daily", "description": "New research finds that sleep problems in a baby's first 12 months may not only precede an autism diagnosis, but also may be associated with altered growth trajectory in a key part of the brain, the hippocampus.", "url": "https://www.sciencedaily.com/releases/2020/05/200507094747.htm", "urlToImage": null, "publishedAt": "2020-05-07T15:56:20Z", "content": "Infants spend most of their first year of life asleep. Those hours are prime time for brain development, when neural connections form and sensory memories are encoded.But when sleep is disrupted, as occurs more often among children with autism, brain developm… [+7765 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "COVID-19 in Africa: Misinformation thwarting containment - Al Jazeera English", "description": "Confirmed cases of the coronavirus are slowly rising in Africa. Health experts warn that efforts to contain the virus are being undermined by misinformation,...", "url": "https://www.youtube.com/watch?v=ncBcYKK95KQ", "urlToImage": "https://i.ytimg.com/vi/ncBcYKK95KQ/maxresdefault.jpg", "publishedAt": "2020-05-07T15:43:51Z", "content": null}, {"source": {"id": null, "name": "Medscape.com"}, "author": null, "title": "Androgens May Explain Male Vulnerability to COVID-19 - Medscape", "description": "Striking differences in how men and women are affected by COVID-19 might be explained by deleterious effects of androgens in males, say Italian researchers.", "url": "https://www.medscape.com/viewarticle/930128", "urlToImage": "https://img.medscape.com/thumbnail_library/is_200506_coronavirus_covid-19_man_woman_sign_800x450.jpg", "publishedAt": "2020-05-07T15:36:38Z", "content": "Editor's note: Find the latest COVID-19 news and guidance in Medscape's Coronavirus Resource Center.\r\nAs the COVID-19 pandemic has swept across the world, a striking difference has been seen between the sexes. But why are men so much more susceptible to sever… [+7902 chars]"}, {"source": {"id": null, "name": "Theconversation.com"}, "author": "Mark Wass, Martin Michaelis, Peter Ellis", "title": "Coronavirus found in semen of young men with COVID-19 - The Conversation UK", "description": "Sexually active men should consider wearing condoms during the pandemic.", "url": "https://theconversation.com/coronavirus-found-in-semen-of-young-men-with-covid-19-138059", "urlToImage": "https://images.theconversation.com/files/333324/original/file-20200507-49546-dd8p45.jpg?ixlib=rb-1.1.0&rect=0%2C565%2C5982%2C2991&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2020-05-07T15:01:00Z", "content": "We dont know much about SARS-CoV-2, the virus that causes COVID-19, but we are learning new things about it every day. The latest bit of the jigsaw puzzle comes from a small study conducted in China, which found SARS-CoV-2 RNA (the viruss genetic code) in the… [+3331 chars]"}, {"source": {"id": null, "name": "Timesnownews.com"}, "author": "Times Now Digital", "title": "SHOCKING: Some people in US are organising 'COVID-19' parties to intentionally spread the virus - Times Now", "description": "If anti-lockdown protests were not worrying enough, now youngsters are organising ‘COVID-19’ parties to intentionally spread the virus.", "url": "https://www.timesnownews.com/the-buzz/article/shocking-some-people-in-us-are-organising-covid-19-parties-to-intentionally-spread-the-virus/588527", "urlToImage": "https://imgk.timesnownews.com/story/PART2.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2020-05-07T12:43:04Z", "content": "Open defiance of lockdown and quarantine rules has become somewhat of a trend in many countries even as the coronavirus pandemic continues to kill thousands every day.\r\nYoung people around the world were seen hitting the beach, taking strolls in public places… [+1797 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "What's it like to be a health worker fighting COVID-19? | AFP - AFP News Agency", "description": "They have been hailed as the heroes of the pandemic, working flat out to stave off the worst effects of the virus. Doctors and nurses around the world gave A...", "url": "https://www.youtube.com/watch?v=9VIIiaL5K4g", "urlToImage": "https://i.ytimg.com/vi/9VIIiaL5K4g/maxresdefault.jpg", "publishedAt": "2020-05-07T12:12:38Z", "content": null}, {"source": {"id": null, "name": "Dailysabah.com"}, "author": "Reuters", "title": "Black and Pakistani people more likely to die from COVID-19 in UK, data reveals | Daily Sabah - Daily Sabah", "description": "Black people and those of Bangladeshi and Pakistani ethnicity have a significantly higher chance of dying from COVID-19 than white people, even when adjusting for deprivation,...", "url": "https://www.dailysabah.com/world/europe/black-and-pakistani-people-more-likely-to-die-from-covid-19-in-uk-data-reveals", "urlToImage": "https://idsb.tmgrup.com.tr/ly/uploads/images/2020/05/07/thumbs/1200x600/34471.jpg", "publishedAt": "2020-05-07T10:20:38Z", "content": "Black people and those of Bangladeshi and Pakistani ethnicity have a significantly higher chance of dying from COVID-19 than white people, even when adjusting for deprivation, the British statistics office said on Thursday.\r\nUsing models that adjusted for a r… [+1662 chars]"}, {"source": {"id": null, "name": "Ladbible.com"}, "author": "Claire Reid", "title": "Menthol Cigarettes Will Be Banned In The UK This Month - LADbible", "description": "The new rules, which also ban 'skinny' cigarettes, comes into action soon", "url": "https://www.ladbible.com/news/uk-menthol-cigarettes-banned-in-the-uk-from-20-may-20200507", "urlToImage": "https://images.ladbible.com/thumbnail?type=jpeg&url=http://beta.ems.ladbiblegroup.com/s3/content/3e89c0965eb37d3967dac6e332c318db.png&quality=70&width=808", "publishedAt": "2020-05-07T10:03:46Z", "content": "A ban on menthol cigarettes comes into action in the UK on 20 May.\r\nThe ban, which includes the sale of all tobacco that contains flavourings, is part of an effort to stop younger people from smoking and reducing the number of people taking up smoking overall… [+1875 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Aishwarya Dharni", "title": "New Claim: Antibodies Of 4-YO Llama Named Winter Could Help Humanity Recover From COVID-19 - India Times", "description": "Four-year-old llama named Winter who lives at a research farm in Belgium along with 130 other llamas and alpacas. All of them produce a special class of disease-resistant antibodies that help in binding the spiky proteins that stud the surface of the coronavi…", "url": "https://www.indiatimes.com/trending/social-relevance/4-year-old-llamas-antibodies-could-help-cure-covid-19-512688.html", "urlToImage": "https://im.indiatimes.in/content/2020/May/winterllama_5eb3ce41aafa4.png", "publishedAt": "2020-05-07T09:39:15Z", "content": "With over 200 countries affected by the deadly COVID-19 pandemic, almost everyone is working tirelessly to find a cure. Now a new study claims that a llama's antibodies could help neutralise the virus.\r\nAccording to an ANI report, the animal mentioned is a fo… [+3292 chars]"}, {"source": {"id": null, "name": "Sciencetimes.com"}, "author": "Staff Reporter", "title": "Vaccines May Not Work on New Mutant Strain of Coronavirus Spreading in US and Europe – Study - Science Times", "description": "A newly discovered coronavirus mutation may be \"immune\" to vaccines currently being tested. It is of urgent concern to the medical community, which is searching for a vaccine that will work against COVID-19.", "url": "https://www.sciencetimes.com/articles/25610/20200507/vaccines-work-new-mutant-strain-coronavirus-spreading-europe-–-study.htm", "urlToImage": "https://1721181113.rsc.cdn77.org/data/images/full/27430/covid-19.jpg", "publishedAt": "2020-05-07T09:09:28Z", "content": null}, {"source": {"id": null, "name": "Qz.com"}, "author": "Uwagbale Edward-Ekpu", "title": "Kenyan-British mosquito scientists use microbe to stop malaria - Quartz Africa", "description": "Scientists believe the Microsporidia MB is a candidate as an eco-friendly and sustainable strategy to replace harmful mosquito populations with harmless ones", "url": "https://qz.com/africa/1853116/kenyan-british-mosquito-scientists-use-microbe-to-stop-malaria/", "urlToImage": "https://cms.qz.com/wp-content/uploads/2020/05/RTX1VI38-e1588839158281.jpg?quality=75&strip=all&w=1400", "publishedAt": "2020-05-07T09:04:35Z", "content": "Scientists in Kenya have discovered a novel method with significant potential to completely stop mosquitos from transmitting the parasites which cause malaria in humans.\r\nThe team of scientists, mostly from Kenya and the UK, plus one from South Africa, have b… [+3126 chars]"}, {"source": {"id": null, "name": "Financialexpress.com"}, "author": "FE Online", "title": "COVID-19: CSIR submits 53 genome sequences of coronavirus in Indians to global body; to submit 450 more by May 15 - The Financial Express", "description": "The Council for Scientific and Industrial Research (CSIR) is also planning to submit additional 450 genome sequence data of coronavirus by May 15, its Director General Shekhar Mande said.", "url": "https://www.financialexpress.com/lifestyle/health/covid-19-csir-submits-53-genome-sequences-of-coronavirus-in-indians-to-global-body-to-submit-450-more-by-may-15/1950988/", "urlToImage": "https://images.financialexpress.com/2020/05/coronavirus-tests.jpg", "publishedAt": "2020-05-07T08:26:03Z", "content": "Amidst concerns that coronavirus have undergone mutation and the new strain maybe more contagious, India’s premier R&amp;D organisation, CSIR, has submitted as many as 53 genome sequences of the virus to a global genome database, a move that may help in bette… [+3396 chars]"}, {"source": {"id": null, "name": "Business-standard.com"}, "author": "Agencies", "title": "How bats carry coronavirus without getting sick decoded by scientists - Business Standard", "description": "In the study, the scientists demonstrated that cells from an insect-eating brown bat can be persistently infected with MERS coronavirus for months", "url": "https://www.business-standard.com/article/current-affairs/how-bats-carry-coronavirus-without-getting-sick-decoded-by-scientists-120050700550_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2020-05/06/full/1588788947-3303.jpg", "publishedAt": "2020-05-07T08:15:51Z", "content": "Scientists have uncovered how bats can carry the MERS coronavirus without getting sick, shedding light on what triggers coronaviruses, including the one behind the Covid-19 pandemic, to jump to humans.\r\nAccording to the study, published in the journal Scienti… [+3406 chars]"}]}