{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Woman helping with COVID-19 outbreak says hotel she was staying in asked her to leave - WSOCTV9", "description": "Woman helping with COVID-19 outbreak says hotel she was staying in asked her to leave", "url": "https://www.youtube.com/watch?v=Xftqufakopg", "urlToImage": null, "publishedAt": "2020-04-26T04:52:00Z", "content": null}, {"source": {"id": null, "name": "Swarajyamag.com"}, "author": null, "title": "WHO Advices Against Immunity Passports, Says No Evidence Suggests You’re Protected After Getting It Once - Swarajya", "description": "Some governments have considered permitting people who have recovered to travel or return to work.", "url": "https://swarajyamag.com/insta/who-advices-against-immunity-passports-says-no-evidence-suggests-youre-protected-after-getting-it-once", "urlToImage": null, "publishedAt": "2020-04-26T04:17:39Z", "content": null}, {"source": {"id": null, "name": "Nenow.in"}, "author": "NE NOW NEWS", "title": "Second wave of COVID-19 may hit India during monsoon months - Northeast Now", "description": "Though coronavirus cases in India may go down substantially in the coming days, it may again resurface during the monsoon months. According to an India Times report, the second wave is expected to hit the country in the months of July and August. However, acc…", "url": "https://nenow.in/top-news/second-wave-of-covid-19-may-hit-india-during-monsoon-months.html/", "urlToImage": null, "publishedAt": "2020-04-26T03:20:07Z", "content": "Though coronavirus cases in India may go down substantially in the coming days, it may again resurface during the monsoon months.\r\nAccording to an India Times report, the second wave is expected to hit the country in the months of July and August.\r\nHowever, a… [+840 chars]"}, {"source": {"id": null, "name": "Newsonair.com"}, "author": null, "title": "Maharashtra: COVID-19 cases reach 7,628 - All India Radio", "description": "", "url": "http://newsonair.com/Main-News-Details.aspx?id=386716", "urlToImage": null, "publishedAt": "2020-04-26T02:58:03Z", "content": "Site Maintained by: Website Cell, NSD and IT Division, Prasar Bharati, New Delhi, India. Website Policy"}, {"source": {"id": null, "name": "Newsonair.com"}, "author": null, "title": "WHO says there is no evidence that recovered patients are immune to COVID-19 infection - All India Radio", "description": "World Health Organization (WHO) has said that there is currently no evidence that people who have recovered from COVID-19 and have antibodies are protected from a second infection.", "url": "http://www.newsonair.com/Main-News-Details.aspx?id=386715", "urlToImage": null, "publishedAt": "2020-04-26T02:42:41Z", "content": "Site Maintained by: Website Cell, NSD and IT Division, Prasar Bharati, New Delhi, India. Website Policy"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "No evidence that recovered COVID-19 patients cannot be reinfected, 'immunity passports' could increase... - Firstpost", "description": "In a scientific brief, the United Nations agency warned governments against issuing “immunity passports” or “risk-free certificates” to people who have been infected as their accuracy could not be guaranteed.", "url": "https://www.firstpost.com/world/no-evidence-that-recovered-covid-19-patients-cannot-be-reinfected-immunity-passports-could-increase-spread-says-who-8300901.html", "urlToImage": null, "publishedAt": "2020-04-26T02:32:57Z", "content": "Geneva: The World Health Organization (WHO) said on Saturday that there was currently no evidence that people who have recovered from COVID-19 and have antibodies are protected from a second coronavirus infection.\r\nWHO logo. Reuters\r\nIn a scientific brief, th… [+1873 chars]"}, {"source": {"id": null, "name": "Nenow.in"}, "author": "NE NOW NEWS", "title": "COVID-19 can attack again! - Northeast Now", "description": "One can be infected with COVID-19 again after getting cured for the first time, warns World Health Organization on Saturday. In a statement by WHO said there is currently no evidence that people who have recovered from COVID-19 and have anti-bodies are protec…", "url": "https://nenow.in/health/covid-19-can-attack-again.html/", "urlToImage": null, "publishedAt": "2020-04-26T02:13:24Z", "content": "One can be infected with COVID-19 again after getting cured for the first time, warns World Health Organization on Saturday.\r\nIn a statement by WHO said there is currently no evidence that people who have recovered from COVID-19 and have anti-bodies are prote… [+666 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Marty Johnson", "title": "First known US coronavirus death caused by massive cardiac event | TheHill - The Hill", "description": "The earliest known death in the U.S. due to complications from coronavirus occurred after an infe...", "url": "https://thehill.com/homenews/state-watch/494682-first-known-us-coronavirus-death-caused-by-massive-cardiac-event", "urlToImage": null, "publishedAt": "2020-04-26T02:08:57Z", "content": "The earliest known death in the U.S. due to complications from coronavirus occurred after an infected patient had a massive heart attack, an autopsy report obtained by the San Francisco Chronicle revealed.\r\nA 57-year-old woman from Santa Clara County, Calif.,… [+811 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Just like Shilpa Shetty, here's why dosa is the perfect protein-packed breakfast option for you - Times of India", "description": "Love feasting on dosas? We tell you why this is one of the healthiest breakfast options for you!", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/diet/just-like-shilpa-shetty-heres-why-dosa-is-the-perfect-protein-packed-breakfast-option-for-you/photostory/75377655.cms", "urlToImage": null, "publishedAt": "2020-04-26T01:30:00Z", "content": "For all the vegetarians who complain about missing out on proteins with their morning meal, fear no more. Dosa batter is made of fermented rice and black urad dal, which is an essential lentil. Pulses and lentils are super-rich on proteins, amino acids and gi… [+135 chars]"}, {"source": {"id": null, "name": "Sakshi.com"}, "author": "Priyadarshini", "title": "India May Face 2nd Wave Of Coronavirus In July-August: Experts - Sakshi English", "description": "Coronavirus disease is an infectious disease caused by a newly discovered COVID-19.", "url": "https://english.sakshi.com/national/2020/04/26/india-may-face-2nd-wave-of-coronavirus-in-july-august-experts", "urlToImage": null, "publishedAt": "2020-04-26T01:16:10Z", "content": "Coronavirus disease is an infectious disease caused by a newly discovered COVID-19. The first case of novel coronavirus was reported in Wuhan, China in December 2019. The infection spreads from one person to another and later, the virus began to appear outsid… [+1496 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Jayashree Nandi & Anonna Dutt", "title": "Virus could cling to air pollutants - Hindustan Times", "description": "India has among the highest particulate matter (PM) concentrations globally.", "url": "https://www.hindustantimes.com/india-news/virus-could-cling-to-air-pollutants/story-3IVTDluMJ7UIGGZlm7L64J.html", "urlToImage": null, "publishedAt": "2020-04-26T00:12:00Z", "content": "SARS-CoV-2, the virus that causes Covid-19, can cling to air pollutants, tests conducted in Italy have found -- a finding which, if validated, should cause concern in India, especially Delhi, where air pollution is a recurring problem, although both the resea… [+4772 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "VIDEO: Coronavirus pandemic changing Ramadan celebrations - WFSB 3", "description": "This year, Ramadan celebrations are looking very different because of the coronavirus pandemic.", "url": "https://www.youtube.com/watch?v=6Pp13Nbk12I", "urlToImage": null, "publishedAt": "2020-04-25T22:57:49Z", "content": "This year, Ramadan celebrations are looking very different because of the coronavirus pandemic."}, {"source": {"id": null, "name": "Nzherald.co.nz"}, "author": "NZ Herald", "title": "Covid-19 coronavirus: Healthy young people dying of virus-related strokes - New Zealand Herald", "description": "A terrifying warning has been issued about people with mild or no symptoms of the virus.", "url": "https://www.nzherald.co.nz/world/news/article.cfm?c_id=2&objectid=12327627", "urlToImage": null, "publishedAt": "2020-04-25T22:53:21Z", "content": "Young people, with mild to no symptoms of Covid-19, are dying of strokes related to the virus, doctors have warned.\r\n The experts say Covid-19 seems to be the cause for sudden strokes in adults in their 30s and 40s, who are otherwise healthy.\r\n Doctors in the… [+1525 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Why has Spain been hit so hard by the coronavirus pandemic? - India Today", "description": "Experts pointed to the country's sociable lifestyle and close ties between young and older family members as significant factors in the virus's spread.", "url": "https://www.indiatoday.in/world/story/why-spain-hit-hard-by-coronavirus-pandemic-1671126-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T22:00:06Z", "content": "In Spain, one of the hardest-hit countries in the pandemic, the coronavirus spread quickly and widely without being detected, especially among the elderly, experts told news agency AFP.\r\nWhile they stressed it was too early to carry out a detailed analysis, t… [+4429 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "Coronavirus survivors detail despair, recovery: 'You're a miracle' - India Gone Viral", "description": "They are survivors of severe cases of the coronavirus, most of them had been hospitalized, some of them hooked up to ventilators for several days and none of them ever wanting to experience the misery", "url": "https://indiagoneviral.com/health/2020/04/26/coronavirus-survivors-detail-despair-recovery-youre-a-miracle/42418/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-25T20:07:54Z", "content": "They are survivors of severe cases of the coronavirus, most of them had been hospitalized, some of them hooked up to ventilators for several days and none of them ever wanting to experience the misery, uncertainty and loneliness of the illness ever again.\r\n“I… [+4611 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Peter Stubley", "title": "First credible evidence emerges of person being killed by meteor - The Independent", "description": "Researchers find official records documenting fatal strike in Iraq in 1888", "url": "https://www.independent.co.uk/news/science/meteor-man-death-first-person-killed-iraq-turkey-ottoman-empire-a9484231.html", "urlToImage": null, "publishedAt": "2020-04-25T20:00:42Z", "content": "The odds of being struck and killed by a meteorite are said to be as low as one in 250,000.\r\nThere has been no credible and well-documented evidence of any human being befalling this unfortunate fate.\r\nBut researchers now say they have found three separate of… [+16481 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Mehr Gill", "title": "Explained: Types of human coronaviruses and the symptoms they cause - The Indian Express", "description": "While there are hundreds of coronaviruses, there are seven that we know can infect humans.", "url": "https://indianexpress.com/article/explained/types-of-human-coronaviruses-and-symptoms-6368444/", "urlToImage": null, "publishedAt": "2020-04-25T19:50:19Z", "content": "Written by Mehr Gill\r\n | New Delhi | \r\nUpdated: April 25, 2020 6:09:09 pm\r\nHuman coronaviruses were first characterised in the mid-1960s and they are mostly considered to be responsible for causing upper respiratory tract infections in children. (AP illustrat… [+6888 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Milly Vincent For Mailonline", "title": "Six-month-old baby given guard of honour as she is released from isolation after beating covid-19 - Daily Mail", "description": "Six-month-old Erin Bates is one of the youngest people to catch the infection and spent the last 14 days alone in isolation at Alder Hey Children's Hospital in Liverpool. She has made a full recovery.", "url": "https://www.dailymail.co.uk/news/article-8256649/Six-month-old-baby-given-guard-honour-released-isolation-beating-covid-19.html", "urlToImage": null, "publishedAt": "2020-04-25T18:55:14Z", "content": "This the touching moment a 'miracle baby' was given a guard of honour by tearful nurses and doctors after she beat Covid-19 and was wheeled out of isolation today.\r\nSix-month-old Erin Bates is one of the youngest people to catch the infection and has spent th… [+2296 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Ariana Eunjung Cha", "title": "Spike in stroke deaths in patients with only minor coronavirus symptoms - The Independent", "description": "Reports of strokes in the young and middle-aged are the latest twist in our evolving understanding of the mysteries of the virus, finds Ariana Eunjung Cha", "url": "https://www.independent.co.uk/news/world/americas/coronavirus-stroke-deaths-symptoms-covid-19-heart-a9484091.html", "urlToImage": null, "publishedAt": "2020-04-25T18:45:03Z", "content": "Thomas Oxley wasnt even on call the day he received the page to come into Mount Sinai Beth Israel Hospital in Manhattan. There werent enough doctors to treat all the emergency stroke patients, and he was needed in the operating room.\r\nThe patients chart appea… [+9849 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Ariana Eunjung Cha", "title": "Young and middle-aged people, barely sick with covid-19, are dying of strokes - The Washington Post", "description": "Doctors sound alarm about patients in their 30s and 40s left debilitated or dead by strokes. Some didn’t even know they were infected by coronavirus.", "url": "https://www.washingtonpost.com/health/2020/04/24/strokes-coronavirus-young-patients/", "urlToImage": null, "publishedAt": "2020-04-25T18:18:21Z", "content": "Oxley gasped when he got to the patients age and covid-19 status: 44, positive.\r\nThe man was among several recent stroke patients in their 30s to 40s who were all infected with the coronavirus. The median age for that type of severe stroke is 74.\r\nAs Oxley, a… [+9467 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Sunetra Choudhury", "title": "CEA points at Spanish Flu lesson in Covid fight - Hindustan Times", "description": "The  Spanish flu emerged in 1918 and claimed 39 million lives till 1920.", "url": "https://www.hindustantimes.com/india-news/cea-points-at-spanish-flu-lesson-in-covid-fight/story-bMWrrU9fXxrCfKLjyVM96M.html", "urlToImage": null, "publishedAt": "2020-04-25T18:15:05Z", "content": "A paper recently published by the US-based National Bureau of Economic Research (NBER) is bringing considerable comfort to policy makers here. Chief Economic Advisor KV Subramanian was the first to draw attention to the research and others like it on the Span… [+2689 chars]"}, {"source": {"id": null, "name": "Inverse.com"}, "author": "Abela Mahimbo, David Isaacs, Melissa Kang, Melanie Wong", "title": "Why are some people with Covid-19 asymptomatic? Evidence points to 2 factors - Inverse", "description": "Recent studies suggest as many as 80% or more of those infected are “silent carriers”, showing no or very mild symptoms.", "url": "https://www.inverse.com/science/covid-19-asymptomatic", "urlToImage": null, "publishedAt": "2020-04-25T17:58:15Z", "content": "SARS-CoV-2, the coronavirus which causes COVID-19, has infected almost 2.5 million people around the world and claimed 170,000 lives.\r\nBut some people dont even get symptoms. Recent studies suggest as many as 80 percentor more of those infected are silent car… [+5687 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Jayashree Nandi", "title": "2 cell types are entry points for virus - Hindustan Times", "description": "The respiratory tract is filled with numerous cells, among which are goblet cells and ciliated cells.", "url": "https://www.hindustantimes.com/india-news/2-cell-types-are-entry-points-for-virus/story-VZ250MIqdc4r0OIzxsTqPJ.html", "urlToImage": null, "publishedAt": "2020-04-25T17:54:31Z", "content": "Scientists have identified two types of cells in the nose that are likely to be point of infection for the Sars-CoV-2 virus, which causes Covid-19, in the body.\r\nThe respiratory tract is filled with numerous cells, among which are goblet cells and ciliated ce… [+2449 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "WHO: Why should I get vaccinated? - World Health Organization (WHO)", "description": "Without vaccines, we are at risk of serious illness and disability from diseases like measles, meningitis, tetanus and polio. In today' interconnected world,...", "url": "https://www.youtube.com/watch?v=9nadnOxvE74", "urlToImage": null, "publishedAt": "2020-04-25T17:33:39Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "World Malaria Day: Governments urged to prevent rise in deaths - Al Jazeera English", "description": "On World Malaria Day, health officials are warning governments to move fast to prevent a rise in Malaria-related deaths. In Kenya, thousands of people have l...", "url": "https://www.youtube.com/watch?v=64nKBK4kq_w", "urlToImage": null, "publishedAt": "2020-04-25T15:59:04Z", "content": "On World Malaria Day, health officials are warning governments to move fast to prevent a rise in Malaria-related deaths.In Kenya, thousands of people have lost their homes after seasonal torrential rains destroyed them. Now, mosquitos are thriving in the wet … [+340 chars]"}, {"source": {"id": null, "name": "Millenniumpost.in"}, "author": "IANS", "title": "Unearthing new dimensions - Millennium Post", "description": "The current pandemic has brought viral infections to public notice and yet misinformation abounds....", "url": "http://www.millenniumpost.in/sundaypost/inland/unearthing-new-dimensions-407847", "urlToImage": null, "publishedAt": "2020-04-25T15:38:14Z", "content": "Not too long ago, people were not really aware of viruses and their various characteristics. To most, viruses were an abstract, invisible threat, occasionally felt but largely ignored in favour of more immediate problems associated with modern living. However… [+5460 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "WATCH | National curfew and mandatory cloth face masks to come into effect under Level 4 - News24", "description": "As of 1 May, a national curfew from 20:00 to 05:00 will be in place and it will be applicable to everyone except essential workers traveling to and from work...", "url": "https://www.youtube.com/watch?v=dNs8wczQKNM", "urlToImage": null, "publishedAt": "2020-04-25T15:15:23Z", "content": null}, {"source": {"id": null, "name": "Bgr.com"}, "author": "Chris Smith", "title": "Everything we know about Italy’s horrific coronavirus outbreak might’ve just changed - BGR", "description": "New research from Italy says the first local coronavirus cases may have appeared as early as a month before people were diagnosed COVID-19 positive. Italy’s first COVID-19 cases were two Chinese citizens who were tested in Rome on January 31st. Three weeks la…", "url": "https://bgr.com/2020/04/25/coronavirus-stats-italys-covid-19-epidemic-may-have-started-earlier/", "urlToImage": null, "publishedAt": "2020-04-25T14:42:09Z", "content": "<ul><li>New research from Italy says the first local coronavirus cases may have appeared as early as a month before people were diagnosed COVID-19 positive.</li><li>Italy’s first COVID-19 cases were two Chinese citizens who were tested in Rome on January 31st… [+3644 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "'No evidence' that recovered COVID-19 patients cannot be reinfected: WHO - Moneycontrol", "description": "In a scientific brief, the United Nations agency warned governments against issuing \"immunity passports\" or \"risk-free certificates\" to people who have been infected as their accuracy could not be guaranteed.", "url": "https://www.moneycontrol.com/news/world/no-evidence-that-recovered-covid-19-patients-cannot-be-reinfected-who-5189661.html", "urlToImage": null, "publishedAt": "2020-04-25T13:38:14Z", "content": "The World Health Organisation (WHO) said on Saturday that there was currently \"no evidence\" that people who have recovered from COVID-19 and have antibodies are protected from a second coronavirus infection.\r\nIn a scientific brief, the United Nations agency w… [+2096 chars]"}, {"source": {"id": "ary-news", "name": "Ary News"}, "author": "AFP", "title": "WHO says no evidence that people with coronavirus are immunised - ARY NEWS", "description": "The warning suggests that the issuance of \"immune passports\" may promote the continued spread of the pandemic.", "url": "https://arynews.tv/en/who-no-evidence-people-coronavirus-immunised/", "urlToImage": null, "publishedAt": "2020-04-25T13:25:23Z", "content": "The World Health Organization (WHO) warned on Saturday that there is no evidence that people who test positive for the new coronavirus are immunised and protected against reinfection.\r\nThe warning suggests that the issuance of “immune passports” may promote t… [+1750 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": "Natasha Kumar", "title": "Scientists have discovered the first significant mutation of the coronavirus - The Times Hub", "description": null, "url": "https://thetimeshub.in/scientists-have-discovered-the-first-significant-mutation-of-the-coronavirus/10797/", "urlToImage": null, "publishedAt": "2020-04-25T13:07:48Z", "content": "A group of researchers from Australia and Taiwan were able to detect the first important mutation in the structure of coronavirus infections SARS-CoV-2. To make this discovery, scientists were able after a detailed analysis of the genetic structure of more th… [+1235 chars]"}, {"source": {"id": null, "name": "Www.geo.tv"}, "author": "Reuters", "title": "Fact vs fiction: Heres what you need to know about coronavirus - Geo News", "description": "Read what health experts says about how to treat COVID-19 or stop the transmission of the new coronavirus", "url": "https://www.geo.tv/latest/284878-fact-vs-fiction-heres-what-you-need-to-know-about-coronavirus", "urlToImage": null, "publishedAt": "2020-04-25T12:55:28Z", "content": "If you like us are wondering whether US President Donald Trumps musings about disinfectants and ultraviolet light can be used to treat COVID-19 are true or false, here's a breakdown of what's true and false about the disease. \r\nTREATMENT\r\nFiction: Disinfectan… [+2869 chars]"}, {"source": {"id": null, "name": "Scroll.in"}, "author": "Scroll Staff", "title": "No evidence that recovered Covid-19 patients cannot be reinfected, says WHO - Scroll.in", "description": "The United Nations agency warned governments against issuing ‘immunity passports’ to the recovered patients, as their accuracy could not be guaranteed.", "url": "https://scroll.in/latest/960219/no-evidence-that-recovered-covid-19-patients-cannot-be-reinfected-says-who", "urlToImage": null, "publishedAt": "2020-04-25T12:46:00Z", "content": "The World Health Organization on Saturday said there was no evidence that people who have recovered from Covid-19 and have antibodies are protected from a second coronavirus infection, Reuters reported. \r\nThe United Nations agency warned governments against i… [+1338 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "Sweden goes it alone with 'relaxed' attitude to coronavirus - CGTN", "description": "Sweden's relaxed restrictions could lead to herd immunity but at what cost?", "url": "https://newseu.cgtn.com/news/2020-04-25/Sweden-goes-it-alone-with-relaxed-attitude-to-coronavirus-PYIUqQSwH6/index.html", "urlToImage": null, "publishedAt": "2020-04-25T12:41:25Z", "content": "Everyone wants immunity from the coronavirus. But there may be different ways to get it.\r\nOne is a vaccine. Clinical trials are already underway in the UK, and if all goes well, say those involved, it's possible a vaccination may be ready for production by Se… [+3523 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Kenneth R. Rosen", "title": "Italian Woman Tests Positive for COVID-19 After 60 Days of Quarantine and Swabbing - Newsweek", "description": "Bianca Dobroiu arrived at the Sant'Orsola-Malpighi Polyclinic hospital in Bologna with a fever above 105 degrees and was diagnosed with COVID-19.", "url": "https://www.newsweek.com/italian-woman-tests-positive-covid-19-after-60-days-quarantine-swabbing-1500202", "urlToImage": null, "publishedAt": "2020-04-25T12:30:39Z", "content": "A 23-year-old in Italy being treated for the disease caused by the novel coronavirus continues to test positive, despite two months of quarantine and continual swabs.\r\nBianca Dobroiu arrived at the Sant'Orsola-Malpighi Polyclinic hospital, a public hospital p… [+4335 chars]"}, {"source": {"id": null, "name": "Cnbctv18.com"}, "author": null, "title": "Lockdown: Godrej Group urges govt to include mosquito repellents in essential items list - CNBCTV18", "description": "In March, the World Health Organization (WHO) also issued an advisory urging countries to ensure the continuity of malaria services in the context of the COVID-19 pandemic, the statement saidGet latest Business online at cnbctv18.com", "url": "https://www.cnbctv18.com/business/lockdown-godrej-group-urges-govt-to-include-mosquito-repellents-in-essential-items-list-5775731.htm/", "urlToImage": null, "publishedAt": "2020-04-25T12:23:02Z", "content": "The Godrej Group on Saturday urged the government to include mosquito repellents and other similar products in the essential items list during the ongoing lockdown.\r\nAs a trend, malaria and dengue spike during May running up to August and preparation for the … [+1509 chars]"}, {"source": {"id": null, "name": "Aa.com.tr"}, "author": null, "title": "World Malaria Day: Fight against life-threatening disease - Anadolu Agency", "description": "'No evidence-based information chloroquine medication, used in malaria, protective in COVID-19,' says expert  - Anadolu Agency", "url": "https://www.aa.com.tr/en/health/world-malaria-day-fight-against-life-threatening-disease/1818308", "urlToImage": null, "publishedAt": "2020-04-25T12:10:38Z", "content": "ANKARA \r\nWhile humanity is struggling with coronavirus outbreak, the world is observing on April 25 Malaria Day, highlighting the importance of the fight against another life-threatening disease.\r\nAlthough it is very easy and inexpensive to prevent deaths fro… [+3789 chars]"}, {"source": {"id": null, "name": "Swarajyamag.com"}, "author": null, "title": "Coronavirus And Smoking: French Researchers Suggest Nicotine Could Protect Against Coronavirus - Swarajya", "description": "", "url": "https://swarajyamag.com/news-brief/coronavirus-and-smoking-french-researchers-suggest-nicotine-could-protect-against-coronavirus", "urlToImage": null, "publishedAt": "2020-04-25T11:31:00Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus Explained: how the virus will hit the poorest people on the planet - Channel 4 News", "description": "The coronavirus pandemic is affecting the world, no matter who you are and where you come from. (Subscribe: https://bit.ly/C4_News_Subscribe) Covid-19 is dev...", "url": "https://www.youtube.com/watch?v=QorckhwMLR0", "urlToImage": null, "publishedAt": "2020-04-25T11:05:09Z", "content": "The coronavirus pandemic is affecting the world, no matter who you are and where you come from. (Subscribe: https://bit.ly/C4_News_Subscribe) \r\nCovid-19 is devastating countries across the globe, with some of the wealthiest nations struggling to contain the s… [+522 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "PTI", "title": "Plasma therapy trials for coronavirus patients begin in Karnataka - Deccan Herald", "description": "The Karnataka government on Saturday commenced convalescent plasma therapy clinical trials for 'severe' coronavirus patients in the state.", "url": "https://www.deccanherald.com/state/top-karnataka-stories/plasma-therapy-trials-for-coronavirus-patients-begin-in-karnataka-829772.html", "urlToImage": null, "publishedAt": "2020-04-25T11:00:06Z", "content": "The Karnataka government on Saturday commenced convalescent plasma therapy clinical trials for 'severe' coronavirus patients in the state.\r\nFollow latest updates on the COVID-19 pandemic here\r\nIn a tweet, Medical Education Minister K Sudhakar said, \"Happy to … [+1295 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "'No evidence' yet that recovered COVID patients cannot be reinfected - WHO - Reuters", "description": "The World Health Organization (WHO) said on Saturday that there was currently \"no evidence\" that people who have recovered from COVID-19 and have antibodies are protected from a second coronavirus infection.", "url": "https://in.reuters.com/article/health-coronavirus-who-idINL5N2CC6XA", "urlToImage": null, "publishedAt": "2020-04-25T09:48:00Z", "content": "GENEVA, April 25 (Reuters) - The World Health Organization (WHO) said on Saturday that there was currently “no evidence” that people who have recovered from COVID-19 and have antibodies are protected from a second coronavirus infection. \r\nIn a statement, the … [+545 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Jayashree Nandi", "title": "Bats cannot directly infect humans with Covid-19: Scientists - Hindustan Times", "description": "According to scientists, Sars-Cov-2 may have diverged from the closest coronavirus found in bats called RaTG13, about 40 to 70 years ago, indicating that the bat virus cannot directly infect humans.", "url": "https://www.hindustantimes.com/india-news/bats-cannot-directly-infect-humans-with-covid-19-scientists/story-uuEwHKcI0x266H1fxawFbN.html", "urlToImage": null, "publishedAt": "2020-04-25T09:30:44Z", "content": "Sixty-four scientists have said bats do not spread Covid-19 after reports of people requesting local authorities to clear trees over a fear of the colonies the winged mammals host.\r\nThe chiropterologists issuing the statement said they came together after rep… [+3518 chars]"}, {"source": {"id": null, "name": "Financialexpress.com"}, "author": "FE Online", "title": "Cotton, natural silk, chiffon make best materials for homemade masks against COVID-19: Study - The Financial Express", "description": "They said the performance of these fabric layers was close to that of an N95 mask material.  According to the study, substituting the chiffon with natural silk or flannel, or simply using a cotton quilt with cotton-polyester batting, produced similar results.", "url": "https://www.financialexpress.com/lifestyle/health/cotton-natural-silk-chiffon-make-best-materials-for-homemade-masks-against-covid-19-study/1939446/", "urlToImage": null, "publishedAt": "2020-04-25T09:04:27Z", "content": "As people resort to making their own cloth masks due to shortage of surgical and N95 varieties in the wake of the COVID-19 pandemic, a new study says a combination of cotton with natural silk or chiffon can filter out aerosol particles provided that the mask … [+2378 chars]"}, {"source": {"id": null, "name": "Trtworld.com"}, "author": "TRTWorld", "title": "WHO warns against idea of 'immunity passports' - TRT World", "description": "The concept of “immunity passports” or “risk-free certificates” has been floated as a way of allowing people protected against reinfection to return to work.", "url": "https://www.trtworld.com/life/who-warns-against-idea-of-immunity-passports-35737", "urlToImage": null, "publishedAt": "2020-04-25T08:54:25Z", "content": "The concept of immunity passports or risk-free certificates has been floated as a way of allowing people protected against reinfection to return to work.\r\nThis Wednesday, March 11, 2015 photo shows the World Health Organization headquarters building in Geneva… [+1045 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "AP", "title": "Coronavirus: WHO warns against idea of 'immunity passports' - Deccan Herald", "description": "The World Health Organization is cautioning against the idea of “immunity passports.\" It says there is currently no evidence that people who have recovered from COVID-19 and have antibodies are protected against a second infection.", "url": "https://www.deccanherald.com/international/world-news-politics/coronavirus-world-health-organization-warns-against-idea-of-immunity-passports-829739.html", "urlToImage": null, "publishedAt": "2020-04-25T08:50:01Z", "content": "The World Health Organization is cautioning against the idea of immunity passports.\" It says there is currently no evidence that people who have recovered from COVID-19 and have antibodies are protected against a second infection.\r\nThe concept of immunity pas… [+813 chars]"}, {"source": {"id": null, "name": "Dailysabah.com"}, "author": "Associated Press", "title": "WHO urges against idea of 'immunity passports' | Daily Sabah - Daily Sabah", "description": "The World Health Organization is cautioning against the idea of \"immunity passports.\" It says there is currently no evidence that people who have recovered from COVID-19...", "url": "https://www.dailysabah.com/world/who-urges-against-idea-of-immunity-passports/news", "urlToImage": null, "publishedAt": "2020-04-25T08:28:41Z", "content": "The World Health Organization is cautioning against the idea of \"immunity passports.\" It says there is currently no evidence that people who have recovered from COVID-19 and have antibodies are protected against a second case of infection.\r\nThe concept of \"im… [+816 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": "https://www.facebook.com/dineshRewale", "title": "e-Agenda AajTak: Not just stay at home but also do yoga at home, says Ramdev - dineshr", "description": "In the wake of the coronavirus pandemic and the nationwide lockdown, people should not just stay and work at home, but they must also perform yoga at home, said yoga…", "url": "https://www.indiatoday.in/india/story/e-agenda-aajtak-yoga-ramdev-coronavirus-pandemic-lockdown-1670908-2020-04-25?utm_source=rss", "urlToImage": null, "publishedAt": "2020-04-25T07:21:40Z", "content": "In the wake of the coronavirus pandemic and the nationwide lockdown, people should not just stay and work at home, but they must also perform yoga at home, said yoga guru Ramdev on Saturday.\r\nRamdev was speaking at a special session at the e-Agenda Aaj Tak.\r\n… [+739 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Nations join WHO in virus initiative, but not US - The Star", "description": "World leaders pledged on Friday to accelerate work on tests, drugs and vaccines against Covid-19 and to share them around the globe. But the United States di...", "url": "https://www.youtube.com/watch?v=BSi5E7Grjx8", "urlToImage": null, "publishedAt": "2020-04-25T06:51:50Z", "content": "World leaders pledged on Friday to accelerate work on tests, drugs and vaccines against Covid-19 and to share them around the globe. But the United States did not take part in the launch.\r\nWATCH MORE: https://thestartv.com/c/newsSUBSCRIBE: https://cutt.ly/The… [+37 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "Coronavirus in Italy may have started unnoticed in January: Study - Al Jazeera English", "description": "The surge in cases after the first diagnosis suggests the virus had been in Italy longer than realised, say researchers.", "url": "https://www.aljazeera.com/news/2020/04/coronavirus-italy-started-unnoticed-january-study-200424214841332.html", "urlToImage": null, "publishedAt": "2020-04-25T06:08:57Z", "content": "The first coronavirus infections in Italy date back to January, according to a scientific study presented on Friday, shedding new light on the origins of the outbreak in one of the world's worst-affected countries.\r\nItaly began testing people after diagnosing… [+2322 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Nitin Sreedhar", "title": "When a virus jumps: of man, microbes and pandemics - Livemint", "description": "Climate change effects or complex man-animal interactions—why are zoonotic disease outbreaks like covid-19 becoming more frequent?", "url": "https://www.livemint.com/mint-lounge/features/when-a-virus-jumps-of-man-microbes-and-pandemics-11587735889206.html", "urlToImage": null, "publishedAt": "2020-04-25T05:10:40Z", "content": "Inger Andersen, executive director of the UN Environment Programme, said last month that nature was sending humankind a message\" through the coronavirus pandemic and climate crisis. In an interview with The Guardian, the Danish environmentalist said there wer… [+10236 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "1752 Coronavirus Cases Reported On Friday, Biggest Single Day Spike | Coronavirus Outbreak - CNBC-TV18", "description": "India's fight against coronavirus has reached on the critical phase as the total number of coronavirus cases have crossed 23,000. Out of which 1750 cases wer...", "url": "https://www.youtube.com/watch?v=GnPn5O0s-v4", "urlToImage": null, "publishedAt": "2020-04-25T04:48:57Z", "content": null}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Coronavirus Detected on Air Pollution Particles That May Carry It Over Long Distances, Scientists Warn - News18", "description": "Leonardo Setti at the University of Bologna in Italy said it was imperative to investigate if the the coronavirus could be transported through air pollution.", "url": "https://www.news18.com/news/world/coronavirus-detected-on-air-pollution-particles-that-may-carry-it-over-long-distances-scientists-warn-2591919.html", "urlToImage": null, "publishedAt": "2020-04-25T03:39:15Z", "content": "The novel coronavirus has been found on air pollution particles by scientists who are studying if this could allow the virus to advance longer distances, resulting in more number of people contracting it, The Guardian reported.\r\nThe work is still in the initi… [+2716 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "G Thing: Pet fashion designer finds unique ways to give back to animal rescue crews - PIX11 News", "description": "She's one of the most in demand New York fashion designers for dog and cats.", "url": "https://www.youtube.com/watch?v=WcRkfwYZcdU", "urlToImage": null, "publishedAt": "2020-04-25T03:02:18Z", "content": "Sign in to report inappropriate content.\r\nSign in"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "Reuters", "title": "Could warmer weather help contain coronavirus? - Deccan Herald", "description": "The world is looking for signs that the arrival of warmer weather in the northern hemisphere could slow the spread of the coronavirus outbreak, which has killed more than 190,000 people and sent the global economy into a tailspin as countries impose lockdowns…", "url": "https://www.deccanherald.com/science-and-environment/could-warmer-weather-help-contain-coronavirus-829641.html", "urlToImage": null, "publishedAt": "2020-04-25T02:48:17Z", "content": "The world is looking for signs that the arrival of warmer weather in the northern hemisphere could slow the spread of the coronavirus outbreak, which has killed more than 190,000 people and sent the global economy into a tailspin as countries impose lockdowns… [+3715 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Has Sweden got its science right? - BBC News", "description": "The strategy devised by scientists was to keep large parts of society open but not everyone is convinced.", "url": "https://www.bbc.co.uk/news/world-europe-52395866", "urlToImage": null, "publishedAt": "2020-04-24T23:29:45Z", "content": "Image caption\r\n Sweden's schools have remained open while neighbouring countries shut theirs for weeks\r\nSweden's strategy to keep large parts of society open is widely backed by the public. It has been devised by scientists and backed by government, and yet n… [+8699 chars]"}, {"source": {"id": null, "name": "Telegraphindia.com"}, "author": "By G.S. Mudur", "title": "Doctors: Monitor every Covid patient given HCQ - Telegraph India", "description": "The HCQ and azithromycin combination carries the risk of drug-induced sudden cardiac death", "url": "https://www.telegraphindia.com/india/coronavirus-outbreak-doctors-ask-to-monitor-every-covid-19-patient-given-hcq/cid/1767906", "urlToImage": null, "publishedAt": "2020-04-24T23:26:19Z", "content": "Every Covid-19 patient given the hydroxychloroquine (HCQ) and azithromycin combination should be monitored for adverse cardiac effects, doctors in India and the US said on Friday in cautionary research papers about the therapy adopted by India, the US and oth… [+3153 chars]"}, {"source": {"id": null, "name": "Webmd.com"}, "author": "Brenda  Goodman, MA", "title": "Blood Clots Are Another Dangerous COVID-19 Mystery - WebMD", "description": "Around the world, doctors caring for COVID-19 patients have been trying to make sense of the same thing. When they draw blood from COVID patients, it clots in the tubes.", "url": "https://www.webmd.com/lung/news/20200424/blood-clots-are-another-dangerous-covid-19-mystery", "urlToImage": null, "publishedAt": "2020-04-24T18:46:44Z", "content": "He says this theory of infection explains some things that doctors have been trying to puzzle out.\r\nFor example, certain conditions like high blood pressure, diabetes, and heart disease stress the endothelium. Its no surprise, then, that people who have these… [+1776 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Does COVID-19 Cause Blood Clot Complications? | NBC New York - NBC New York", "description": "A small study of five critically ill COVID-19 patients at Mount Sinai Hospital in New York City could have major implications for how doctors respond to the ...", "url": "https://www.youtube.com/watch?v=twPd0YvY3T0", "urlToImage": null, "publishedAt": "2020-04-24T17:18:33Z", "content": null}, {"source": {"id": null, "name": "Oregonlive.com"}, "author": null, "title": "Vitamins C, D can help prevent coronavirus, Oregon State University researcher says - OregonLive", "description": "Adrian Gombart of OSU’s Linus Pauling Institute, along with his collaborators at universities across the world, said public health officials should issue a clear set of nutritional guidelines to complement the existing advice about washing hands to prevent th…", "url": "https://www.oregonlive.com/coronavirus/2020/04/vitamins-c-d-can-help-prevent-coronavirus-oregon-state-university-researcher-says.html", "urlToImage": null, "publishedAt": "2020-04-24T15:37:02Z", "content": "Supplements containing vitamins C and D, along with other micronutrients, can be a safe, effective and low-cost means to fight off the novel coronavirus and other acute respiratory tract diseases, according to an Oregon State University researcher.\r\nAdrian Go… [+5436 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "David Nikel", "title": "Sweden Health Chief Admits ‘It’s Not Over’ As Coronavirus Cases Leap - Forbes", "description": "Following an additional 131 deaths reported in the last 24 hours, Sweden’s COVID-19 death toll now stands at 2,152.", "url": "https://www.forbes.com/sites/davidnikel/2020/04/24/sweden-health-chief-admits-its-not-over-as-coronavirus-cases-leap/", "urlToImage": null, "publishedAt": "2020-04-24T15:09:59Z", "content": "Sweden's state epidemiologist Anders Tegnell has said the number of COVID-19 deaths in Sweden have ... [+] been higher than expected.\r\nAFP via Getty Images\r\nSwedens state epidemiologist Anders Tegnell has announced a record daily high of coronavirus cases for… [+3119 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Italy's coronavirus epidemic began in January, study shows - Reuters", "description": "The first COVID-19 infections in Italy date back to January, according to a scientific study presented on Friday, shedding new light on the origins of the outbreak in one of the world's worst-affected countries.", "url": "https://www.reuters.com/article/us-health-coronavirus-italy-study-idUSKCN2262B1", "urlToImage": null, "publishedAt": "2020-04-24T14:38:00Z", "content": "ROME (Reuters) - The first COVID-19 infections in Italy date back to January, according to a scientific study presented on Friday, shedding new light on the origins of the outbreak in one of the world’s worst-affected countries. \r\nItaly began testing people a… [+1729 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "AFP", "title": "Coronavirus vaccine: Monkeys largely protected during trial, says Chinese firm - Livemint", "description": "Sinovac Biotech said it injected two different doses of its vaccine into eight rhesus macaque monkeys and exposed them to the virus three weeks later, and they did not develop infections", "url": "https://www.livemint.com/news/world/coronavirus-vaccine-monkeys-largely-protected-during-trial-says-chinese-firm-11587736770613.html", "urlToImage": null, "publishedAt": "2020-04-24T14:13:47Z", "content": "A novel coronavirus vaccine has for the first time \"largely protected\" monkeys from infection during an animal trial, data from a Chinese pharmaceutical giant showed.It is among a slew of vaccines being developed around the world as countries race to stop an … [+3317 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Coronavirus pandemic | Over 50% consumers quit smoking during lockdown: Report - Moneycontrol", "description": "The survey revealed that over half of those who were interviewed had quit smoking during the ongoing lockdown while nearly 30 percent had reduced their daily consumption.", "url": "https://www.moneycontrol.com/news/business/coronavirus-pandemic-over-50-consumers-quit-smoking-during-lockdown-report-5187161.html", "urlToImage": null, "publishedAt": "2020-04-24T13:43:19Z", "content": "During the lockdown period in India, the consumption of cigarettes has taken a hit. A survey of over 100 smokers, conducted by IIFL Securities, found that around 58 percent respondents have quit smoking following the implementation of the nationwide lockdown … [+2003 chars]"}, {"source": {"id": null, "name": "Swarajyamag.com"}, "author": null, "title": "Novel Coronavirus Is A Result Of Crazy Experiments At Wuhan Institute of Virology: Top Russian Microbiologist - Swarajya", "description": "", "url": "https://swarajyamag.com/insta/novel-coronavirus-is-a-result-of-crazy-experiments-at-wuhan-institute-of-virology-top-russian-microbiologist", "urlToImage": null, "publishedAt": "2020-04-24T13:42:15Z", "content": null}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Aylin Woodward", "title": "Coronavirus may cause blood clots and strokes, even in young patients - Business Insider - Business Insider", "description": "A New York doctor said there's been an uptick in the number of local young people having strokes. That could be because of COVID-19-related clots.", "url": "https://www.businessinsider.com/coronavirus-blood-clots-strokes-young-patients-2020-4", "urlToImage": null, "publishedAt": "2020-04-24T13:39:31Z", "content": "Doctors treating COVID-19 patients have begun to document ways in which the disease affects far more than just the lungs.\r\nExperts have reported kidney issues, heart problems, and, more recently, blood clots appearing in various parts of patients' bodies. Suc… [+4238 chars]"}, {"source": {"id": null, "name": "Positive.news"}, "author": null, "title": "What went right: good coronavirus news from the fifth week of lockdown - Positive.News", "description": "There are signs the epidemic had reached its peak in the UK, but that wasn’t the only good news about coronavirus this week", "url": "https://www.positive.news/society/good-coronavirus-news-from-the-fifth-week-of-lockdown/", "urlToImage": null, "publishedAt": "2020-04-24T12:50:29Z", "content": "Crowdfunder launched to get Positive News to NHS staffThe Positive News team is raising funds via a Crowdfunder campaign to distribute thousands of complimentary copies of the magazine to NHS staff. After a number of hospitals got in touch to request copies, … [+371 chars]"}, {"source": {"id": null, "name": "Imperial.ac.uk"}, "author": null, "title": "Coronavirus 'map' identifies key virus entry points into the body | Imperial News - Imperial College London", "description": "Scientists are creating a map of the human body to identify locations where the COVID-19 virus can enter human cells.", "url": "https://www.imperial.ac.uk/news/197114/coronavirus-identifies-virus-entry-points-into/", "urlToImage": null, "publishedAt": "2020-04-24T11:36:27Z", "content": "Scientists are creating a map of the human body to identify locations where the COVID-19 virus can enter human cells.\r\nThe research, from a number of international institutions including Imperial College London, has so far identified likely initial infection … [+5951 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "One-month-old Thai coronavirus patient 'cured' with antiviral drug cocktail, doctor says - South China Morning Post", "description": "Subscribe to our YouTube channel for free here: https://sc.mp/subscribe-youtube A one-month-old Thai coronavirus patient, the country’s youngest Covid-19 cas...", "url": "https://www.youtube.com/watch?v=MuWIy8C6U3g", "urlToImage": null, "publishedAt": "2020-04-24T11:23:59Z", "content": "Subscribe to our YouTube channel for free here: https://sc.mp/subscribe-youtube\r\nA one-month-old Thai coronavirus patient, the countrys youngest Covid-19 case, has reportedly been cured using a cocktail of antiviral drugs, according to the doctor who treated … [+206 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Peter Sullivan", "title": "Controversial idea to speed coronavirus vaccine gains ground | TheHill - The Hill", "description": "An idea that might seem outlandish at first is gaining some ground as a way to speed de...", "url": "https://thehill.com/policy/healthcare/494417-controversial-idea-to-speed-coronavirus-vaccine-gains-ground", "urlToImage": null, "publishedAt": "2020-04-24T10:00:37Z", "content": "An idea that might seem outlandish at first is gaining some ground as a way to speed development of a coronavirus vaccine: intentionally infecting people with the virus as part of a trial.\r\nThe idea, known as a challenge trial, would deliberately infect a few… [+4702 chars]"}, {"source": {"id": null, "name": "Selectscience.net"}, "author": "SelectScience", "title": "Pfizer, BioNTech COVID-19 vaccine cleared for human tests - SelectScience", "description": "Pfizer and BioNTech to start human trials of COVID-19 vaccine", "url": "https://www.selectscience.net/industry-news/pfizer-and-biontech-to-start-human-trials-of-covid-19-vaccine/?artID=51330", "urlToImage": null, "publishedAt": "2020-04-24T09:09:30Z", "content": null}]}