{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "News-medical.net"}, "author": null, "title": "Smoking increases ACE2 protein in the lungs which may promote COVID-19 infection - News-Medical.Net", "description": "Previous data from COVID-19 patients suggests that cigarette smokers are more likely to have health complications.", "url": "https://www.news-medical.net/news/20200518/Smoking-increases-ACE2-protein-in-the-lungs-which-may-promote-COVID-19-infection.aspx", "urlToImage": "https://www.news-medical.net/image.axd?picture=2014%2f7%2fProtein-620x480.jpg", "publishedAt": "2020-05-19T02:37:16Z", "content": "Reviewed by Emily Henderson, B.Sc.May 18 2020\r\nPrevious data from COVID-19 patients suggests that cigarette smokers are more likely to have health complications. One possible reason, researchers report May 15 in the journal Developmental Cell, is that smoking… [+3622 chars]"}, {"source": {"id": null, "name": "Cnbctv18.com"}, "author": null, "title": "Coronavirus treatment from Moderna vaccine appears safe, shows positive results in 8 people - CNBCTV18", "description": "Moderna Inc's experimental COVID-19 vaccine, has brought in a wave of positive sentiment after the biotech company produced protective antibodies in a small group of healthy volunteers, on Monday. The data comes from eight people who took part in a 45-subject…", "url": "https://www.cnbctv18.com/healthcare/coronavirus-treatment-from-moderna-vaccine-appears-safe-shows-positive-results-in-8-people-5953781.htm/", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2020/05/COVID-vaccine-reuters.jpg", "publishedAt": "2020-05-19T02:31:18Z", "content": "Moderna Inc's experimental COVID-19 vaccine, the first to be tested in the United States, has brought in a wave of positive sentiment amongst people after the biotech company produced protective antibodies in a small group of healthy volunteers, on Monday.\r\nT… [+4406 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "A universal patent for Covid-19 vaccine? - FRANCE 24 English", "description": "« Teams all around the world started making their research on that. Some of them probably spoke too early, and some of them seem to have been mixing up two t...", "url": "https://www.youtube.com/watch?v=o9OTJnAz3rc", "urlToImage": "https://i.ytimg.com/vi/o9OTJnAz3rc/maxresdefault.jpg", "publishedAt": "2020-05-19T01:00:16Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Kuldeep Tiwari", "title": "Do not wear gloves. Wash your hands - Ahmedabad Mirror", "description": "Docs advise washing hands with soap for 20 secs over wearing gloves, especially in offices where you do not come in contact with many people", "url": "https://ahmedabadmirror.indiatimes.com/ahmedabad/others/do-not-wear-gloves-wash-your-hands/articleshow/75813007.cms", "urlToImage": "https://static.toiimg.com/photo/imgsize-301540,msid-75812985/75812985.jpg", "publishedAt": "2020-05-19T00:30:00Z", "content": "To protect against coronavirusDocs advise washing hands\r\n with soap for 20 secs over wearing gloves, especially in offices where you do not come in contact with many peopleIf you think that wearing gloves can give you protection against Covid-19, think again.… [+1737 chars]"}, {"source": {"id": null, "name": "Thelancet.com"}, "author": null, "title": "Cardiac dysfunction and thrombocytopenia-associated multiple organ failure inflammation phenotype in a severe paediatric case of COVID-19 - The Lancet", "description": "A 16-year-old male with chromosome 18q deletion and well controlled epilepsy presented\nto the Children's National Hospital (Washington, DC, USA) with haemodynamic shock\nafter 4 days of fever and one generalised seizure at home. Although he had no respiratory\n…", "url": "https://www.thelancet.com/journals/lanchi/article/PIIS2352-4642(20)30163-2/fulltext", "urlToImage": "//els-jbs-prod-cdn.jbs.elsevierhealth.com/cms/asset/745f5c92-bae7-4ed1-bda5-9a2b2f2e2893/gr1.jpg", "publishedAt": "2020-05-18T22:35:33Z", "content": "We use cookies to help provide and enhance our service and tailor content and ads. By continuing you agree to the use of cookies.\r\nCopyright © 2020 Elsevier Inc. except certain content provided by third parties.\r\nPrivacy Policy   Terms and Conditions"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus: loss of taste or smell added to official symptoms - BBC News - BBC News", "description": "Loss of taste and smell has been added to the list of official symptoms of coronavirus infection. Previously the list only included a high temperature and a ...", "url": "https://www.youtube.com/watch?v=FRtZA4WY8Mo", "urlToImage": "https://i.ytimg.com/vi/FRtZA4WY8Mo/hqdefault.jpg", "publishedAt": "2020-05-18T22:02:14Z", "content": null}, {"source": {"id": null, "name": "Healthline.com"}, "author": "Dan Gray", "title": "8 Weeks of a Diet Rich in Fruits, Vegetables Can Improve Heart Health - Healthline", "description": "Experts say these foods have common nutrients that can be delivered in a more efficient way than taking supplements.", "url": "https://www.healthline.com/health-news/diet-rich-in-fruits-vegetables-improve-heart-health", "urlToImage": "https://post.healthline.com/wp-content/uploads/2020/05/Fruit_Veggie_Tray_1200x628-facebook-1200x628.jpg", "publishedAt": "2020-05-18T21:39:53Z", "content": "<ul><li>New research shows that eating a diet high in fruits and vegetables can produce better cardiovascular health. </li><li>Potassium, magnesium, and fiber are key nutrients in fruits and vegetables that may boost heart health.</li><li>Whole foods rather t… [+5119 chars]"}, {"source": {"id": null, "name": "Businessinsider.in"}, "author": "Erin Heger", "title": "7 benefits of meditation, and how it can affect your brain - Business Insider India", "description": "The benefits of meditation are extensive — and backed by science. The mental health benefits of meditation include better focus and concentration, improved", "url": "https://www.businessinsider.in/science/health/news/7-benefits-of-meditation-and-how-it-can-affect-your-brain/articleshow/75816424.cms", "urlToImage": "https://www.businessinsider.in/photo/75816424/7-benefits-of-meditation-and-how-it-can-affect-your-brain.jpg?imgsize=365896", "publishedAt": "2020-05-18T21:35:00Z", "content": "Numerous studies have proven the benefits of regular meditation. \r\nThese can include decreased stress, improved concentration, lower blood pressure, and reduced symptoms of anxiety and depression, just to name a few. \r\nAnd while there are different types of m… [+5700 chars]"}, {"source": {"id": null, "name": "Medicaldialogues.in"}, "author": "Hina Zahid", "title": "Neural pathways connecting gut and brain linked to common gut disorders - Medical Dialogues", "description": "PITTSBURGH -Different systems of the body are interconnected and cannot be completely understood in...", "url": "https://medicaldialogues.in/gastroenterology/news/neural-pathways-connecting-gut-and-brain-linked-to-common-gut-disorders-65871", "urlToImage": "https://medicaldialogues.in/h-upload/2020/04/02/126212-headandbrainillustrationthmb.jpg", "publishedAt": "2020-05-18T20:30:26Z", "content": "PITTSBURGH -Different systems of the body are interconnected and cannot be completely understood in isolation. The brain-gut connection is one very important example of this phenomenon.\r\nGut and brain are connected physically through millions of nerves, most … [+3652 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Nick Brown", "title": "Exclusive: CDC plans sweeping COVID-19 antibody study in 25 metropolitan areas - Reuters India", "description": "The U.S. Centers for Disease Control and Prevention (CDC) plans a nationwide study of up to 325,000 people to track how the new coronavirus is spreading across the country into next year and beyond, a CDC spokeswoman and researchers conducting the effort told…", "url": "https://in.reuters.com/article/us-health-coronavirus-testing-cdc-exclus-idINKBN22U2TZ", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200518&t=2&i=1519067966&w=1200&r=LYNXMPEG4H27H", "publishedAt": "2020-05-18T20:01:00Z", "content": "(Reuters) - The U.S. Centers for Disease Control and Prevention (CDC) plans a nationwide study of up to 325,000 people to track how the new coronavirus is spreading across the country into next year and beyond, a CDC spokeswoman and researchers conducting the… [+4663 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Reuters", "title": "US coronavirus cases top 1.5 million, infections rise in some southern states - Livemint", "description": "Michigan saw new cases rise 18% after five weeks of declines.Michigan was hit hard early in the outbreak and has seen more than 4,800 deaths", "url": "https://www.livemint.com/news/world/us-coronavirus-cases-top-1-5-million-infections-rise-in-some-southern-states-11589829927525.html", "urlToImage": "https://images.livemint.com/img/2020/05/18/600x338/b541c1563c8d4d97a1d6db3f34c492aa-9d5fd225a0f246e49e6a93035019ed64-1_1589830172417_1589830190996.jpg", "publishedAt": "2020-05-18T19:30:23Z", "content": "The number of covid-19 cases in the United States exceeded 1.5 million on Monday, as total deaths caused by the new coronavirus approached 90,000, according to a Reuters tally of state and county figures.Most US states reported a drop in new cases of the resp… [+2078 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Aditi Sharma", "title": "World IBD Day 2020: History, significance and how is it celebrated? - Republic World - Republic World", "description": "World IBD Day 2020 would be celebrated on May 19. World IBD Day unites the world in the fight against Ulcerative Colitis and Crohn’s Disease. Read more.", "url": "https://www.republicworld.com/lifestyle/health/world-ibd-day-2020-history-significance-celebration-etc.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/rvxn6blbbnvyqm07_1589801314.jpeg?tr=f-jpeg", "publishedAt": "2020-05-18T19:23:14Z", "content": "World IBD Day takes place annually on May 19. World IBD Day unites the world in the fight against Ulcerative Colitis and Crohn’s Disease, also known as inflammatory bowel diseases (IBD). Over 5 million people are living with IBD worldwide and with no cure or … [+3055 chars]"}, {"source": {"id": null, "name": "Medicaldialogues.in"}, "author": "Dr. Kamal Kant Kohli", "title": "Yoga eases depression in patients of schizophrenia and Alcohol misuse - Medical Dialogues", "description": "Yoga may alleviate symptoms of depression in patients of other mental illnesses including...", "url": "https://medicaldialogues.in/psychiatry/news/yoga-eases-depression-in-patients-of-schizophrenia-and-alcohol-misuse-65878", "urlToImage": "https://medicaldialogues.in/h-upload/2020/05/18/128971-yoga.jpg", "publishedAt": "2020-05-18T18:15:45Z", "content": "Yoga seems to ease depressive symptoms in people with other mental health issues, reveals a review and pooled data analysis of the available evidence, published online in the British Journal of Sports Medicine. \r\nAnd the more weekly sessions completed, the gr… [+3097 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Shivali Best", "title": "Coronavirus 'could burn out naturally' before a vaccine is developed, expert claims - Mirror Online", "description": "Professor Karol Sikora, former director of the World Health Organisation (WHO) Cancer Programme, has revealed that the coronavirus ‘could burn out naturally’ before a vaccine is developed", "url": "https://www.mirror.co.uk/science/coronavirus-could-burn-out-naturally-22043575", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article21836400.ece/ALTERNATES/s1200/1_RGP_MDM_040320Proton_014.jpg", "publishedAt": "2020-05-18T18:11:48Z", "content": "With coronavirus cases around the world now at over 4.7 million, scientists have been working around the clock to develop a vaccine. \r\nA human vaccine trial is currently underway in Oxford, with a vaccine promised for 30 million Brits by September if it prove… [+1906 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Narayan Lakshman", "title": "‘Moving into summer months, India could get hit very hard’, says virologist Peter Hotez - The Hindu", "description": "U.S. virologist expresses concern about India’s crowded urban areas in low-income neighbourhoods where people are forced to live in proximity", "url": "https://www.thehindu.com/news/national/moving-into-summer-months-india-could-get-hit-very-hard-says-virologist-peter-hotez/article31618159.ece", "urlToImage": "https://www.thehindu.com/news/national/ueunp7/article31618158.ece/ALTERNATES/LANDSCAPE_615/thjc-Peter-Hotez", "publishedAt": "2020-05-18T18:05:38Z", "content": "As the world continues to grapple with the debilitating human toll and economic consequences of the ongoing COVID-19 pandemic, Peter Hotez, Dean for the National School of Tropical Medicine and a Professor at the Departments of Paediatrics and Molecular Virol… [+4124 chars]"}, {"source": {"id": null, "name": "Nationalheraldindia.com"}, "author": "IANS", "title": "‘Heart attack prevention efforts lag for people with stroke’ - National Herald", "description": "Researchers have found that patients with peripheral artery disease or stroke were less likely to receive recommended treatments to prevent heart attack than those with coronary artery disease.", "url": "https://www.nationalheraldindia.com/health/heart-attack-prevention-efforts-lag-for-people-with-stroke", "urlToImage": "https://gumlet.assettype.com/nationalherald%2F2020-03%2F97691429-1e11-48a4-ade0-2ca182786043%2F73f897e0b0b1184bec5d9af9899fced5.jpg?rect=0%2C0%2C1920%2C1008&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2020-05-18T17:51:03Z", "content": "\"We need to generate awareness among both clinicians and patients that all of these diseases should be treated with aggressive secondary preventive medications, including aspirin and statins, regardless of whether people have heart disease or not,\" Michos add… [+506 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Jacob Koshy", "title": "Potential Oxford vaccine fails to prevent virus spread in monkeys - The Hindu", "description": "But it provides protection from pneumonia; tests to continue.", "url": "https://www.thehindu.com/news/national/potential-oxford-vaccine-fails-to-prevent-virus-spread-in-monkeys/article31617852.ece", "urlToImage": "https://www.thehindu.com/news/national/wglbkg/article31617850.ece/ALTERNATES/LANDSCAPE_615/CORONAVIRUS-NKV-TEST", "publishedAt": "2020-05-18T17:44:58Z", "content": "A high-profile potential vaccine for COVID-19 being tested by researchers at Oxord University failed to protect vaccinated monkeys from being infected by the virus. However, the test animals appeared to be protected from pneumonia.\r\nAlso read: WHO backs COVID… [+3158 chars]"}, {"source": {"id": null, "name": "Indulgexpress.com"}, "author": "F Khatoon", "title": "For flawless skin this summer invest in a good sunblock: Skin expert Gunjan Jain - Indulgexpress", "description": "Skin expert Gunjan Jain tells us why sunblock is necessary for daily skin care", "url": "https://www.indulgexpress.com/sex-health/wellness/2020/may/18/for-flawless-skin-this-summer-invest-in-a-good-sunblock-skin-expert-gunjan-jain-25066.html", "urlToImage": "https://images.indulgexpress.com/uploads/user/imagelibrary/2020/5/18/w600X390/Sunscreen.jpg", "publishedAt": "2020-05-18T16:34:00Z", "content": "With lockdown our entire healthcare routine has changed. Less outdoor activities in the schedule translate to minimum or no make-up. Tubes of concealers and foundations are stuck in the corner of the dressing table and our favourite shade of lipstick is also … [+2320 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "UK death toll from confirmed coronavirus cases rises 160 to 34,796 - Reuters India", "description": "The number of people who have died in the United Kingdom after testing positive for COVID-19 rose by 160 to 34,796, the health department said on Twitter on Monday.", "url": "https://in.reuters.com/article/health-coronavirus-britain-casualties-idINKBN22U2CX", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200518&t=2&i=1519042028&w=1200&r=LYNXMPEG4H1T6", "publishedAt": "2020-05-18T16:01:00Z", "content": "LONDON (Reuters) - The number of people who have died in the United Kingdom after testing positive for COVID-19 rose by 160 to 34,796, the health department said on Twitter on Monday. \r\nA total of 246,406 people have tested positive for the virus, up 2,684. \r… [+54 chars]"}, {"source": {"id": null, "name": "Thetimes.co.uk"}, "author": "Rhys Blakely, Science Correspondent", "title": "Coronavirus: Oxford vaccine 'may still leave people infectious' - The Times", "description": "Concerns have been raised about the coronavirus vaccine being developed by Oxford University after scientists observed that it did not provide a “gold-standard” protection when tested on monkeys.The", "url": "https://www.thetimes.co.uk/article/coronavirus-oxford-vaccine-may-still-leave-people-infectious-qx3763dxz", "urlToImage": "https://www.thetimes.co.uk/imageserver/image/%2Fmethode%2Ftimes%2Fprod%2Fweb%2Fbin%2F70573aea-9924-11ea-b5c4-b1ab503e0466.jpg?crop=1280%2C720%2C0%2C0&resize=685", "publishedAt": "2020-05-18T16:00:00Z", "content": "Concerns have been raised about the coronavirus vaccine being developed by Oxford University after scientists observed that it did not provide a gold-standard protection when tested on monkeys.\r\nThe government announced £65.5 million in additional funding for… [+533 chars]"}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "Jahnavi Sarma", "title": "Good news on the COVID-19 vaccine front: A cure may be possible from tobacco leaves - TheHealthSite", "description": "In a new development on the vaccine front Oxford University's researchers are trying to develop a vaccine made with proteins from tobacco leaves.", "url": "https://www.thehealthsite.com/news/good-news-on-the-covid-19-vaccine-front-a-cure-may-be-possible-from-tobacco-leaves-746069/", "urlToImage": "https://st1.thehealthsite.com/wp-content/uploads/2020/05/Covid-19-Vaccine-1-655x353.jpg", "publishedAt": "2020-05-18T15:43:02Z", "content": "With the COVID-19 pandemic showing no signs to disappearing in the near future, scientists are desperately trying to find a vaccine for the virus. There are many trials going on in different parts of the world. But there is no concrete evidence yet of any cur… [+3307 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "60 per cent of Indians suffer from milk intolerance (and many don’t even realise it) - Times of India", "description": "Milk and other dairy products have been a major source of calcium for vegetarians.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/diet/60-per-cent-of-indians-suffer-from-milk-intolerance-and-many-dont-even-realise-it/photostory/75807121.cms", "urlToImage": "https://static.toiimg.com/photo/75807166.cms", "publishedAt": "2020-05-18T15:30:00Z", "content": "Milk has vitamin D, calcium, vitamin B2, vitamin B12, potassium and phosphorus in it. It also has some vitmain A, vitamin B1, vitmain B6, zinc and magnesium. For vegetarians, milk is one major source of calcium. In fact, studies say one should consume at leas… [+368 chars]"}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "Sanyukta Baijal", "title": "Vitamin D deficiency linked with COVID-19 mortality rate: 6 signs that you lack the sunshine vitamin - TheHealthSite", "description": "Here are six symptoms that will tell you if you are deficient of vitamin D. | TheHealthSite.com", "url": "https://www.thehealthsite.com/fitness/diet/vitamin-d-deficiency-linked-with-covid-19-mortality-rate-6-signs-that-you-lack-the-sunshine-vitamin-746064/", "urlToImage": "https://st1.thehealthsite.com/wp-content/uploads/2020/04/Vitamin-D-655x353.jpg", "publishedAt": "2020-05-18T15:17:45Z", "content": "We all know that a well-balanced diet, rich in proteins, carbs, fats, vitamins and minerals ensures good health. Deficiency of any of these nutrients can take a toll on your health, in more ways than one. Vitamin D, which is known to be essential for your bon… [+3471 chars]"}, {"source": {"id": null, "name": "Businessinsider.in"}, "author": "Anna Medaris Miller", "title": "A former WHO director says the coronavirus could 'burn out' before we have a vaccine - Business Insider India", "description": "Dr. Karol Sikora, a British oncologist and a former WHO director, tweeted that there's a real chance the novel coronavirus could burn out before a vaccine", "url": "https://www.businessinsider.in/science/news/a-former-who-director-says-the-coronavirus-could-burn-out-before-we-have-a-vaccine/articleshow/75810831.cms", "urlToImage": "https://www.businessinsider.in/photo/75810831/a-former-who-director-says-the-coronavirus-could-burn-out-before-we-have-a-vaccine.jpg?imgsize=477821", "publishedAt": "2020-05-18T15:07:00Z", "content": "A vaccine against the novel coronavirus is \"the one great hope\" of eliminating COVID-19, according to World Health Organization's Executive Director of Health Emergencies Mike Ryan.\r\nOther scientists and researchers have emphasized that a widely-distributed v… [+1792 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Medical team in Bangladesh suggests combination of Ivermectin and Doxycycline for COVID-19 treatment - Firstpost", "description": "As per media reports, the team tested a combination of the antiparasitic drug Ivermectin and the antibiotic Doxycycline on a group of 60 COVID-19 patients.", "url": "https://www.firstpost.com/health/medical-team-in-bangladesh-suggests-combination-of-ivermectin-and-doxycycline-for-covid-19-treatment-8380171.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/03/chemistry-4932607_1280-1.jpg", "publishedAt": "2020-05-18T15:06:39Z", "content": null}, {"source": {"id": null, "name": "Dnaindia.com"}, "author": "DNA", "title": "Study reveals antioxidant-rich Indo-Mediterranean diet significantly lowers pre-heart failure - DNA India", "description": "While Indo-Mediterranean diets are anti-inflammatory and considered good for a healthy heart, recently, cohort studies and case-control studies have demonstrated that western-style diets rich in sugar and lack of physical activity are important behavioural ri…", "url": "https://www.dnaindia.com/india/video-study-reveals-antioxidant-rich-indo-mediterranean-diet-significantly-lowers-pre-heart-failure-2825198", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/2020/05/18/906517-00000003.jpg", "publishedAt": "2020-05-18T14:29:33Z", "content": "©2020 Diligent Media Corporation Ltd."}, {"source": {"id": null, "name": "Gulfnews.com"}, "author": "Shyam A. Krishna, Senior Associate Editor", "title": "COVID-19: How poop data helps in fighting coronavirus - Gulf News", "description": "Sewage science offers tools for early virus detection and can help decide on lockdowns", "url": "https://gulfnews.com/world/covid-19-how-poop-data-helps-in-fighting-coronavirus-1.1589730279825", "urlToImage": "https://imagevars.gulfnews.com/2020/05/17/Wastewater-monitoring_1722358be68_medium.jpg", "publishedAt": "2020-05-18T14:27:45Z", "content": "The Sims Bayou South Wastewater Treatment Plant and Sims Bayou river in Houston, Texas, US. City health officials and Rice University scientists have begun testing Houston wastewater samples for COVID-19, a process they hope will reveal the true spread of the… [+8622 chars]"}, {"source": {"id": null, "name": "Hospimedica.com"}, "author": "HospiMedica International", "title": "COVID-19 Patients Face Higher Risk of Dangerous Blood Clots - HospiMedica", "description": "Researchers using a combination of two specific blood-clotting tests have found that critically ill COVID-19 patients were at a high risk of developing renal failure, venous blood clots, and other complications associated with blood clots, such as stroke.", "url": "https://www.hospimedica.com/covid-19/articles/294782429/covid-19-patients-face-higher-risk-of-dangerous-blood-clots.html", "urlToImage": "https://www.hospimedica.com/images/stories/articles/article_images/2020-05-18/SDD-1332.jpg", "publishedAt": "2020-05-18T14:21:42Z", "content": "Researchers using a combination of two specific blood-clotting tests have found that critically ill COVID-19 patients were at a high risk of developing renal failure, venous blood clots, and other complications associated with blood clots, such as stroke.The … [+3243 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Covid-19: slaughterhouses across the world are increasingly becoming a hotspot for the virus - FRANCE 24 English", "description": "Around a hundred people are believed to have been infected by the coronavirus in newly discovered outbreaks in two French abattoirs. It's a similar situation...", "url": "https://www.youtube.com/watch?v=NB__U5d-u5k", "urlToImage": "https://i.ytimg.com/vi/NB__U5d-u5k/maxresdefault.jpg", "publishedAt": "2020-05-18T14:05:20Z", "content": null}, {"source": {"id": null, "name": "Yourstory.com"}, "author": "Dr. MS Kanwar", "title": "How the healthcare industry is preparing for post COVID-19 lockdown era - YourStory", "description": "In the short term, healthcare experts and organisations should be prepared for the possibility in spurt of COVID-19 cases in areas that have partially lifted the lockdown.", "url": "https://yourstory.com/2020/05/healthcare-industry-preparing-post-covid-19-lockdown", "urlToImage": "https://images.yourstory.com/cs/2/f02aced0d86311e98e0865c1f0fe59a2/healthcare-coronavirus-1589379515134.png?fm=png&auto=format", "publishedAt": "2020-05-18T13:37:29Z", "content": "While the COVID-19 pandemic has strained the healthcare system not only in India but worldwide, another challenge that is round the corner is how will the healthcare models evolve once the lockdown is lifted.\r\nThere is no way hospitals can go back to function… [+5514 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "India.com Lifestyle Staff", "title": "Don't do Away With Your Tea Bags, They Have These Surprising Beauty Benefits - India.com", "description": "Here we give you enough reasons to include tea bags in your daily beauty regime.", "url": "https://www.india.com/lifestyle/dont-do-away-with-your-tea-bags-they-have-these-surprising-beauty-benefits-4032810/", "urlToImage": "https://www.india.com/wp-content/uploads/2020/05/A-cup-of-tea.jpg", "publishedAt": "2020-05-18T13:24:19Z", "content": "Tea bags act as a magical potion when it comes to enhancing your beauty. This means, apart from boosting your energy level and making you ready for the daily task, these humble tea bags can do much more that can leave you stunned. So, tea bags should be given… [+1610 chars]"}, {"source": {"id": null, "name": "Jagran.com"}, "author": "Aalok Sensharma", "title": "How effective is Hydroxychloroquine against COVID-19? Here's all you need to know - Jagran English", "description": "Among the first drugs which raised the anticipations in line with the hope for the COVID cure  was anti malarial drug hydroxychloroquine  HCQ    pic credits  PTI", "url": "https://english.jagran.com/lifestyle/how-effective-is-hydroxychloroquine-against-covid19-heres-all-you-need-to-know-10011996", "urlToImage": "https://www.jagranimages.com/images/2020/may/coronavirus-cure1589808364773.jpg", "publishedAt": "2020-05-18T13:22:33Z", "content": "New Delhi | Jagran Lifestyle Desk: The global patient count of coronavirus has exceeded the mark of 4.7 million with over 315,000 fatalities, according to Johns Hopkins University's COVID-tracker. With countries racing against time to find the cure to vile co… [+2385 chars]"}, {"source": {"id": null, "name": "Tribuneindia.com"}, "author": "Tribune India", "title": "All severe pneumonia patients to be tested for COVID, says Centre - The Tribune India", "description": "Previous guidelines only mandated testing of hospitalised SARI cases", "url": "https://www.tribuneindia.com/news/nation/all-severe-pneumonia-patients-to-be-tested-for-covid-says-centre-86489", "urlToImage": "https://cms.tribuneindia.com/gallary_content/2020/5/2020_5$largeimg_111521352.JPG", "publishedAt": "2020-05-18T13:22:32Z", "content": "Tribune News Service\r\nNew Delhi, May 18\r\nEntering the fourth spell of lockdown to manage COVID19, the government on Monday revised its disease testing strategy saying all patients of severe acute respiratory illness (SARI) would now be subjected to an RTPCR t… [+1697 chars]"}, {"source": {"id": null, "name": "Timesnownews.com"}, "author": "PTI", "title": "UK moving towards next level out of lockdown, says Indian-origin minister - Times Now", "description": "The minister unveiled a new 93-million pounds investment to accelerate the UK's first Vaccines Manufacturing Innovation Centre, which is set to be completed by next year.", "url": "https://www.timesnownews.com/international/article/uk-moving-towards-next-level-out-of-lockdown-says-indian-origin-minister/593694", "urlToImage": "https://imgk.timesnownews.com/story/covid_corona_IANS_49.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2020-05-18T13:15:46Z", "content": "London: The UK is in a position to move to the next level of its COVID-19 response and further lift the lockdown measures in place in careful steps, UK Business Secretary Alok Sharma has said. The Indian-origin minister said the country had succeeded in keepi… [+2108 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Asian News International| Posted by Kabir Bhandari", "title": "Study explains parents’ concern about privacy, body image impact on tweens using health app - Hindustan Times", "description": "Most parents of children between the age group of 8-12, have concerns about the impact of such apps on their tweens, according to the C.S. Mott Children’s Hospital National Poll on Children’s Health at Michigan Medicine.", "url": "https://www.hindustantimes.com/more-lifestyle/study-explains-parents-concern-about-privacy-body-image-impact-on-tweens-using-health-app/story-2xvcukK2CAxTAI3kf5dzCO.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/18/Pictures/_730f314e-9900-11ea-871b-70b2176894d0.jpg", "publishedAt": "2020-05-18T13:00:41Z", "content": "Health applications have become a go-to tool among teens and adults to keep track of their fitness, weight loss, sleep, and even menstrual cycles.\r\nHowever, most parents of children between the age group of 8-12, have concerns about the impact of such apps on… [+3242 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "PTI", "title": "Coronavirus: Diabetics at higher risk of dying from COVID-19, say experts - Livemint", "description": "The risk of a fatal outcome from COVID-19 is up to 50% higher in people with diabetes, experts said.According to Union health ministry, besides diabetes, people having co-morbidities like hypertension, chronic kidney and heart-related issues also form a high-…", "url": "https://www.livemint.com/news/india/coronavirus-diabetics-at-higher-risk-of-dying-from-covid-19-say-experts-11589795624627.html", "urlToImage": "https://images.livemint.com/img/2020/05/18/600x338/diabete_1561573934715_1589803076921.jpg", "publishedAt": "2020-05-18T12:18:55Z", "content": "NEW DELHI :\r\nThe risk of a fatal outcome from COVID-19 is up to 50% higher in people with diabetes, experts said, recommending regular monitoring of blood glucose and home-based exercises to maintain physical and mental health.According to the Union health mi… [+3532 chars]"}, {"source": {"id": null, "name": "Ndtv.com"}, "author": null, "title": "15 Tips To Stay Consistent On A Healthy Diet From Nutritionist - NDTV", "description": "Maintaining consistency in healthy diet can be more difficult than you can imagine. Here are some tips from nutritionist that can help you eat healthy and follow a healthy diet with discipline and fewer distractions.", "url": "https://www.ndtv.com/health/15-tips-to-stay-consistent-on-healthy-diet-from-nutritionist-2230911", "urlToImage": "https://c.ndtvimg.com/2019-05/rcbiqg8o_healthy-diet_625x300_25_May_19.jpg", "publishedAt": "2020-05-18T12:10:52Z", "content": "Eat a balanced diet to maintain consistency in healthy eating\r\nHighlights\r\n<ul><li>Make sure your diet is diverse and includes all food groups\r\n</li><li>It is okay to indulge in cravings once in a while \r\n</li><li>Eat small and frequent meals to maintain cons… [+6979 chars]"}, {"source": {"id": null, "name": "Catchnews.com"}, "author": null, "title": "Doctors find a new way to save COVID-19 patients from dying; deets inside - Catch News", "description": "The deaths of some coronavirus sufferers have previously been attributed to a lack of oxygen in the blood.", "url": "http://www.catchnews.com/health-news/doctors-find-a-new-way-to-save-covid-19-patients-from-dying-deets-inside-191342.html", "urlToImage": "http://images.catchnews.com/upload/2020/05/18/coronavirus_treatment_191342_730x419.jpg", "publishedAt": "2020-05-18T12:01:20Z", "content": "The coronavirus has engulfed the world in its grip and even giving nightmares to doctors and researchers as there are no vaccines has discovered yet. However, doctors are still researching to find the solution to end this wreaking havoc across the globe.\r\nAmi… [+1956 chars]"}, {"source": {"id": null, "name": "Timesnownews.com"}, "author": "Salome Phelamei", "title": "Coronavirus symptoms: Tingling pain in your hands could be a warning sign of COVID-19 - Times Now", "description": "A new report suggests that you could be at risk of the novel coronavirus infection if you have subtle tingling pain in the hands. Read on to learn more about the warning signs and symptoms of COVID-19.", "url": "https://www.timesnownews.com/health/article/coronavirus-symptoms-tingling-pain-in-your-hands-could-be-a-warning-sign-of-covid/593621", "urlToImage": "https://imgk.timesnownews.com/story/covid_pain.jpeg?tr=w-560,h-292,fo-top", "publishedAt": "2020-05-18T11:12:55Z", "content": "<ul><li>People infected with the new strain of coronavirus had reported a wide range of unusual symptoms </li><li>The COVID-19 pandemic has so far claimed at least 313,611 across the world</li><li>Health experts say the severity of symptoms of COVID-19 can ra… [+2916 chars]"}, {"source": {"id": null, "name": "Newkerala.com"}, "author": null, "title": "UK ready to move to level three of lockdown #87655 - New Kerala", "description": "United Kingdom News: UK ready to move to level three of lockdown - The UK will soon be able to move to level three of the COVID-19 lockdown in careful steps, Business Secretary Alok Sharma has said....", "url": "https://www.newkerala.com/news/2020/87655.htm", "urlToImage": null, "publishedAt": "2020-05-18T11:09:31Z", "content": "Speaking at the daily press conference on Sunday, Sharma stated that the alert levels were based on the R value and number of coronavirus cases in the UK, the Metro newspaper reported. The higher the alert level, the more strict the lockdown measures need to … [+1325 chars]"}, {"source": {"id": null, "name": "Thewire.in"}, "author": "Dr Vipin Vashishtha", "title": "COVID-19: Our Obsession with Numbers Is Misleading Us - The Wire", "description": "Let us act based on what we know – instead of what we think we know – and open the economy, protect the more vulnerable and follow non-pharmacological protocols.", "url": "https://science.thewire.in/health/covid-19-our-obsession-with-numbers-is-misleading-us/", "urlToImage": "https://cdn.thewire.in/wp-content/uploads/2020/04/16112118/2020-04-15T072849Z_1_LYNXNPEG3E0DK_RTROPTP_4_HEALTH-CORONAVIRUS-SOUTHASIA.jpg", "publishedAt": "2020-05-18T11:03:10Z", "content": "At the time of writing, there had been around 4.8 million cases of the novel coronavirus around the world, and more than 320,000 deaths. In India, over 96,000 cases and 3,000 deaths have been reported thus far. The first case in the country was reported on Ja… [+8380 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "COVID-19 can cause serious cardiovascular problems, scientists warn - The Financial Express", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMifWh0dHBzOi8vd3d3LmZpbmFuY2lhbGV4cHJlc3MuY29tL2xpZmVzdHlsZS9oZWFsdGgvY292aWQtMTktY2FuLWNhdXNlLXNlcmlvdXMtY2FyZGlvdmFzY3VsYXItcHJvYmxlbXMtc2NpZW50aXN0cy13YXJuLzE5NjI4MDgv0gGCAWh0dHBzOi8vd3d3LmZpbmFuY2lhbGV4cHJlc3MuY29tL2xpZmVzdHlsZS9oZWFsdGgvY292aWQtMTktY2FuLWNhdXNlLXNlcmlvdXMtY2FyZGlvdmFzY3VsYXItcHJvYmxlbXMtc2NpZW50aXN0cy13YXJuLzE5NjI4MDgvbGl0ZS8?oc=5", "urlToImage": null, "publishedAt": "2020-05-18T10:53:43Z", "content": null}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Rakesh Kumar Maurya", "title": "World AIDS Vaccine Day 2020: All you need to know - Hindustan Times", "description": "AIDS (Acquired Immuno Deficiency Syndrome) is one of the most serious health conditions to have affected people globally, and there are 2.1 million people living with the condition in India alone.", "url": "https://www.hindustantimes.com/more-lifestyle/world-aids-vaccine-day-2020-all-you-need-to-know/story-konoKm1nFWtgKTFtdu5uRO.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/18/Pictures/_b8fc1314-98ee-11ea-871b-70b2176894d0.jpg", "publishedAt": "2020-05-18T10:44:49Z", "content": "AIDS (Acquired Immuno Deficiency Syndrome) is one of the most serious health conditions to have affected people globally, and there are 2.1 million people living with the condition in India alone. It is caused by the Human Immunodeficiency Virus (HIV)which af… [+3051 chars]"}, {"source": {"id": null, "name": "Deccanchronicle.com"}, "author": null, "title": "AI system being developed to tell which COVID patients are at risk of cardiac events - Deccan Chronicle", "description": "Researchers hope to create a predictive risk score that can determine adverse cardiac events up to 24 hours ahead.", "url": "https://www.deccanchronicle.com/technology/in-other-news/180520/ai-system-being-developed-to-tell-which-covid-patients-are-at-risk-of.html", "urlToImage": "https://s3.ap-southeast-1.amazonaws.com/images.deccanchronicle.com/dc-Cover-g4bflmnbi4coegebsi9036ohp2-20200518154532.Medi.jpeg", "publishedAt": "2020-05-18T10:29:00Z", "content": "New York: Scientists in the US are using artificial intelligence (AI) algorithms to identify which COVID-19 patients are at risk of adverse cardiac events such as heart failure, sustained abnormal heartbeats, heart attacks, and death. The researchers from Joh… [+3253 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Coronavirus Myth Busted: Using a mouthwash won't kill the virus or prevent COVID-19 - Firstpost", "description": "The World Health Organization (WHO) has already delivered their statement that neither swishing nor gargling with mouthwash can kill the COVID-19 virus.", "url": "https://www.firstpost.com/health/coronavirus-myth-busted-using-a-mouthwash-wont-kill-the-virus-or-prevent-covid-19-8379221.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2019/09/GettyImages-1130636090.jpg", "publishedAt": "2020-05-18T10:16:12Z", "content": null}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Lifestyle Desk", "title": "Immunity boosters: Add these food groups to your grocery list - The Indian Express", "description": "Look out for these five food groups to add the right balance of nutrients to your diet.", "url": "https://indianexpress.com/article/lifestyle/health/immunity-boosters-food-groups-grocery-list-nmami-agarwal-health-diet-6413137/", "urlToImage": "https://images.indianexpress.com/2020/05/balanced-diet_759.jpg?w=759", "publishedAt": "2020-05-18T10:12:19Z", "content": "Your checklist for your next grocery list should include these items. (Source: Getty Images/Thinkstock)Considering the food we eat has a direct impact on our bodies, it is extremely important to pay close attention to what we are consuming. Which is why when … [+4570 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Mehr Gill", "title": "Explained: How Covid-19 affects different parts of the body - The Indian Express", "description": "It is still not clear why some individuals infected with the disease remain asymptomatic, while there are others who develop mild or moderate symptoms and some who get critically ill and succumb to the disease.", "url": "https://indianexpress.com/article/explained/how-covid-19-affects-different-parts-of-the-body-6415720/", "urlToImage": "https://images.indianexpress.com/2020/05/covidtoe-chilblainlesions-759-1.jpg?w=759", "publishedAt": "2020-05-18T10:10:18Z", "content": "Written by Mehr Gill\r\n | New Delhi | \r\nUpdated: May 18, 2020 3:34:13 pm\r\nSome cases of the so-called “Covid toe” were reported from Spain and the US earlier this monthWhile fever, cough and difficulty in breathing are some of the most common symptoms of COVID… [+5630 chars]"}, {"source": {"id": null, "name": "Vogue.in"}, "author": "Anjan Sachar", "title": "Stuck with dental issues in quarantine? Here's what you need to do - VOGUE India", "description": "You may not be able to make it to your dentist while we’re all in lockdown, but that doesn’t mean your dental health should suffer. Here’s how to keep your teeth looking clean and feeling fresh throughout", "url": "https://www.vogue.in/how-to/content/how-to-care-for-tooth-cavity-in-quarantine-coronavirus-lockdown-dentist", "urlToImage": "https://assets.vogue.in/photos/5ec21e821e1bf8da0f205117/16:9/w_1920,c_limit/deepika%20padukone%20makeup%20skincare%20teeth.jpg", "publishedAt": "2020-05-18T09:29:49Z", "content": "Its easy to ignore your dental health till you suddenly start to spot discolouration or experience pain in your teeth. Unfortunately, the ability to instantly make an appointment to see your dentist isnt part of our new pandemic-stricken normal. Whether its y… [+4264 chars]"}, {"source": {"id": null, "name": "Telanganatoday.com"}, "author": "Telangana Today", "title": "Too much sitting causing stiff muscles? Here's what to do - Telangana Today", "description": "New Delhi: With fitness centers closures and little workout activity at home, most Indians are not moving around as much as they should. Prolonged sitting at home, often in uncomfortable positions, can cause muscles to stiffen up. Here are easy tips to reduce…", "url": "https://telanganatoday.com/too-much-sitting-causing-stiff-muscles-heres-what-to-do", "urlToImage": "https://cdn.telanganatoday.com/wp-content/uploads/2020/05/stifness.jpg", "publishedAt": "2020-05-18T09:27:29Z", "content": "New Delhi: With fitness centers closures and little workout activity at home, most Indians are not moving around as much as they should. Prolonged sitting at home, often in uncomfortable positions, can cause muscles to stiffen up.\r\nHere are easy tips to reduc… [+1928 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "IANS", "title": "Why people should stop googling medical symptoms - India TV News", "description": "The research also found that the advice provided on when and where to seek health care was accurate 49 per cent of the time.", "url": "https://www.indiatvnews.com/lifestyle/news-why-people-should-stop-googling-medical-symptoms-618281", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2020/05/pjimage-2-1589792170.jpg", "publishedAt": "2020-05-18T09:13:10Z", "content": "Image Source : PIXABAYWhy people should stop googling medical symptoms\r\nMany people turn to 'Dr Google' to self-diagnose their health symptoms and seek medical advice, but online symptom checkers are only accurate about a third of the time, warn researchers.\r… [+1819 chars]"}, {"source": {"id": null, "name": "Medicaldialogues.in"}, "author": "Hina Zahid", "title": "PET imaging may help researchers see extent of Alzheimers early damage - Medical Dialogues", "description": "Yale University researchers have developed a new imaging technology that allows scientists to see...", "url": "https://medicaldialogues.in/neurology-neurosurgery/news/pet-imaging-may-help-researchers-see-extent-of-alzheimers-early-damage-65870", "urlToImage": "https://medicaldialogues.in/h-upload/2020/03/03/125122-alzheimers-disease.jpg", "publishedAt": "2020-05-18T09:06:07Z", "content": "Yale University researchers have developed a new imaging technology that allows scientists to see the widespread loss of brain synapses in early stages of Alzheimer's disease. This finding may help scientists in drug development one day. The new research has … [+1859 chars]"}, {"source": {"id": null, "name": "Telanganatoday.com"}, "author": "Telangana Today", "title": "'Hypertension is a serious co-morbidity' - Telangana Today", "description": "New Delhi: Hypertension is a chronic lifestyle disease and in the wake of COVID-19 situation, it has emerged as a serious comorbidity especially among the elderly, say health experts. Hypertension is a condition when a person's blood pressure is consistently …", "url": "https://telanganatoday.com/hypertension-is-a-serious-co-morbidity", "urlToImage": "https://cdn.telanganatoday.com/wp-content/uploads/2020/05/hypertension-1.jpg", "publishedAt": "2020-05-18T08:47:02Z", "content": "New Delhi: Hypertension is a chronic lifestyle disease and in the wake of COVID-19 situation, it has emerged as a serious comorbidity especially among the elderly, say health experts.\r\nHypertension is a condition when a person’s blood pressure is consistently… [+3014 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Pam Belluck", "title": "‘Straight-Up Fire’ in His Veins: A personal recount of a New York teen that battled the new COVID-19... - Firstpost", "description": "Jack McMorrow, 14, awoke in agony, with heart failure. His case may help doctors understand a frightening new affliction in children linked to the coronavirus.", "url": "https://www.nytimes.com/2020/05/17/health/coronavirus-multisystem-fnflammatory-syndrome-children-teenagers.html", "urlToImage": "https://static01.nyt.com/images/2020/05/15/science/00virus-teen-1/00virus-teen-1-facebookJumbo.jpg", "publishedAt": "2020-05-18T08:24:18Z", "content": "When a sprinkling of a reddish rash appeared on Jack McMorrows hands in mid-April, his father figured the 14-year-old was overusing hand sanitizer not a bad thing during a global pandemic.\r\nWhen Jacks parents noticed that his eyes looked glossy, they attribut… [+12693 chars]"}, {"source": {"id": null, "name": "Eureporter.co"}, "author": "EU Reporter Correspondent", "title": "UK to invest up to £93 million in new #Coronavirus vaccine centre - EU Reporter - EU Reporter", "description": "The British government will invest up to £93 million ($112m) to accelerate construction of a new vaccines centre, the Department for Business, Energy and Industrial Strategy said on Saturday (16 May), writes Roshan Abraham. The funding will ensure the new cen…", "url": "https://www.eureporter.co/frontpage/2020/05/18/uk-to-invest-up-to-93-million-in-new-coronavirus-vaccine-centre/", "urlToImage": "https://www.eureporter.co/wp-content/uploads/2014/03/innovative-vaccines.jpg", "publishedAt": "2020-05-18T06:46:04Z", "content": "The funding will ensure the new centre opens in summer 2021, a year ahead of schedule, the department said.\r\nThe Vaccines Manufacturing and Innovation Centre (VMIC), which is currently under construction, is a key component of the governments programme to ens… [+117 chars]"}, {"source": {"id": null, "name": "Theweek.in"}, "author": null, "title": "Why coercion tactic may not work with most children - THE WEEK", "description": "Children perceived coercion as reducing their motivation for physical activity", "url": "https://www.theweek.in/news/health/2020/05/18/why-coercion-tactic-may-not-work-with-most-children.html", "urlToImage": "https://www.theweek.in/content/dam/week/news/sci-tech/2019/June/children-play-nature-kids-free-run-shut.jpg", "publishedAt": "2020-05-18T06:33:45Z", "content": "Parents who want their offspring to be physically active should not use force or threats as children perceive coercion as reducing their motivation for physical activity, says a new study. A parent who knows a child's preferences and participates in the activ… [+3192 chars]"}, {"source": {"id": null, "name": "Theweek.in"}, "author": null, "title": "Over 300 patients in Singapore receive erroneous message as IT glitch hits COVID-19 testing - THE WEEK", "description": "(This story has not been edited by THE WEEK and is auto-generated from a PTI", "url": "https://www.theweek.in/wire-updates/international/2020/05/18/fgn56-virus-singpore-message.html", "urlToImage": "https://www.theweek.in/etc/designs/week/img/logo-main.png", "publishedAt": "2020-05-18T04:14:07Z", "content": "By Gurdip SinghSingapore, May 18 (PTI) An IT glitch in the COVID-19 testing in Singapore resulted in 357 patients receiving an erroneous message informing them that they had tested positive for the coronavirus, prompting authorities to apologise for the mista… [+2385 chars]"}, {"source": {"id": null, "name": "Tribuneindia.com"}, "author": "Tribune India", "title": "Virus to cause long-term damage: Health experts - The Tribune India", "description": "", "url": "https://www.tribuneindia.com/news/world/virus-to-cause-long-term-damage-health-experts-86389", "urlToImage": "https://cms.tribuneindia.com/gallary_content/2020/5/2020_5$largeimg_88530134.jpg", "publishedAt": "2020-05-18T02:20:33Z", "content": "Beijing, May 17\r\nChina's health authority has officially included damage to a number of internal organs as among the potential effects of the novel coronavirus, expanding medical insurance coverage for patients as the long-term toll of the disease emerges.\r\nC… [+1467 chars]"}, {"source": {"id": null, "name": "Ummid.com"}, "author": null, "title": "Britain records 170 new COVID deaths; tally jumps to 34636 - ummid.com", "description": "The figures include deaths in all settings, including hospitals, care homes and the wider community", "url": "https://ummid.com/news/2020/may/18.05.2020/britain-records-170-new-covid-deaths.html", "urlToImage": "https://ummid.com/news/2020/may/18.05.2020/uk-corona-update.jpg", "publishedAt": "2020-05-17T23:21:00Z", "content": "London: Another 170 COVID-19 patients have died in Britain as of Saturday afternoon, bringing the total coronavirus-related death toll in the country to 34,636, Secretary of State for Business, Energy and Industrial Strategy Alok Sharma said.\r\nThe figures inc… [+2841 chars]"}, {"source": {"id": null, "name": "Itv.com"}, "author": null, "title": "Coronavirus: How will the Oxford Covid-19 vaccine trial work? - ITV News", "description": "If the Covid-19 vaccine candidate developed by Oxford University proves successful in human trials then up to 30 million doses for the UK could be available by September, the Government has said.\n\nBusiness Secretary Alok Sharma said the first clinical trials …", "url": "https://www.itv.com/news/2020-05-17/coronavirus-how-will-the-oxford-covid-19-vaccine-trial-work/", "urlToImage": "https://news.images.itv.com/image/file/2220152/img.jpg", "publishedAt": "2020-05-17T19:31:00Z", "content": "If the Covid-19 vaccine candidate developed by Oxford University proves successful in human trials then up to 30 million doses for the UK could be available by September, the Government has said.\r\nBusiness Secretary Alok Sharma said the first clinical trials … [+3510 chars]"}, {"source": {"id": null, "name": "Theshillongtimes.com"}, "author": "Agencies", "title": "Social media influencers can encourage teens to follow COVID norms - The Shillong Times", "description": "The time is of social media influencers! A team of researches has suggested that social media influencers can help encourage adolescents to follow social distancing guidelines.In a breakthrough study, researchers say that peer-to-peer campaigns are l", "url": "http://theshillongtimes.com/2020/05/18/social-media-influencers-can-encourage-teens-to-follow-covid-norms/", "urlToImage": "https://i1.wp.com/theshillongtimes.com/wp-content/uploads/2020/05/social-media.jpg?fit=315%2C177", "publishedAt": "2020-05-17T17:47:00Z", "content": "The time is of social media influencers! A team of researches has suggested that social media influencers can help encourage adolescents to follow social distancing guidelines.In a breakthrough study, researchers say that peer-to-peer campaigns are likely to … [+1867 chars]"}, {"source": {"id": null, "name": "Theshillongtimes.com"}, "author": "Agencies", "title": "Binge drinking can lead to drunkorexia in young women - The Shillong Times", "description": "Whether it is Mojito or a simple glass of fizz, if you find yourself bingeing on more than a few, you could be putting your physical and mental health at risk because binge drinking can contribute to drunkorexia, say researchers in a study that invol", "url": "http://theshillongtimes.com/2020/05/18/binge-drinking-can-lead-to-drunkorexia-in-young-women/", "urlToImage": "https://i0.wp.com/theshillongtimes.com/wp-content/uploads/2020/01/Drinking.jpg?fit=460%2C261", "publishedAt": "2020-05-17T17:45:00Z", "content": "Whether it is Mojito or a simple glass of fizz, if you find yourself bingeing on more than a few, you could be putting your physical and mental health at risk because binge drinking can contribute to drunkorexia, say researchers in a study that involved young… [+1337 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "Suraksha P", "title": "Less dengue cases a silver lining to COVID-19 - Deccan Herald", "description": "The number of dengue cases in March and April were 50% lesser than the corresponding period last year, according to officials of the National Vector Borne Disease Control Programme (NVBDCP). There have been only 1,613 dengue cases in the first five months of …", "url": "https://www.deccanherald.com/state/top-karnataka-stories/less-dengue-cases-a-silver-lining-to-covid-19-838818.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/article_images/2020/05/17/file76ilzwzyss7uxmi620s-1589736949.jpg", "publishedAt": "2020-05-17T17:14:01Z", "content": "The number of dengue cases in March and April were 50% lesser than the corresponding period last year, according to officials of the National Vector Borne Disease Control Programme (NVBDCP).\r\nThere have been only 1,613 dengue cases in the first five months of… [+1859 chars]"}, {"source": {"id": null, "name": "Gulfnews.com"}, "author": "Jay Hilotin, Assistant Editor", "title": "COVID-19 vaccine candidates: All you need to know - Gulf News", "description": "Who are the likely winners in global vaccine sprint to develop COVID-19 shot?", "url": "https://gulfnews.com/world/covid-19-candidate-vaccines-all-you-need-to-know-1.1589721575701", "urlToImage": "https://imagevars.gulfnews.com/2020/05/17/Vaccine-Covid-19_1722362da8b_medium.jpg", "publishedAt": "2020-05-17T17:13:27Z", "content": "Image Credit: Gulf News\r\nHighlights\r\n<ul><li>In April, the WHO announced 3 leading “vaccine candidates”</li><li>In mid-May, the number has reached 10, and now in crucial final stages of human testing</li><li>Top scientists are engaged in a global vaccine spri… [+8321 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "IANS", "title": "Mysterious rare disease linked to COVID-19 infecting children worldwide. Are Indian kids vulnerable? - India TV News", "description": "As if it was not enough that novel pandemic COVID-19 was affecting millions of people cutting across the global boundaries, the disease, albeit few in children, is manifesting with symptoms of rare diseases.", "url": "https://www.indiatvnews.com/fyi/mysterious-rare-disease-linked-to-covid-19-infecting-children-worldwide-are-indian-kids-vulnerable-618111", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2020/05/800-1589355345.jpeg", "publishedAt": "2020-05-17T16:11:22Z", "content": "Image Source : AP/FILEMysterious rare disease linked to COVID-19 infecting children worldwide. Are Indian kids vulnerable?\r\nAs if it was not enough that novel pandemic COVID-19 was affecting millions of people cutting across the global boundaries, the disease… [+5327 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Coronavirus patients with metabolic syndrome take longer to recover, hint experts - India Today", "description": "\"Of the 1,100 Covid-19 patients, about 150 men had metabolic syndrome (co-morbidities),\" Dr Ravi Dosi said.", "url": "https://www.indiatoday.in/india/story/coronavirus-patients-with-metabolic-syndrome-take-longer-to-recover-hint-experts-1679006-2020-05-17", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202005/Kolkata_graffiti__PTI_-647x363.jpeg?yeZV4sUVXa.k8ebvNbd_iJfuEQEyw4TL", "publishedAt": "2020-05-17T15:24:36Z", "content": "People with \"metabolic syndrome\" take longer in recovering from coronavirus infection as it causes further health complications, experts have said and suggested a healthy lifestyle and diet to keep the pandemic at bay.\r\nMetabolic syndrome is characterised by … [+1617 chars]"}, {"source": {"id": null, "name": "Oneindia.com"}, "author": "Simran Kashyap", "title": "Karnataka: No institutional quarantine for healthcare workers in complete PPE - Oneindia", "description": "he Health and Family Welfare Department on Saturday issued an order stating that there is no need of a 14-day institutional quarantine for healthcare workers (Doctors, residents, nurses, technicians and group D workers), who work in complete personal protecti…", "url": "https://www.oneindia.com/india/karnataka-no-institutional-quarantine-for-healthcare-workers-in-complete-ppe-3089820.html", "urlToImage": "https://www.oneindia.com/img/2020/05/pti01-05-2020-000145b-1589686688.jpg", "publishedAt": "2020-05-17T15:07:06Z", "content": "New Delhi, May 17: The Health and Family Welfare Department on Saturday issued an order stating that there is no need of a 14-day institutional quarantine for healthcare workers, who work in complete personal protective equipment (PPE) without any breach, whi… [+1635 chars]"}, {"source": {"id": null, "name": "Edexlive.com"}, "author": "Edex Live", "title": "Talking loudly can increase the risk of COVID-19 transmission: Study - EdexLive", "description": "The experiment explains the reason behind the coronavirus infections spreading in nursing homes, conferences, households, and other places", "url": "https://www.edexlive.com/news/2020/may/17/talking-loudly-can-increase-the-risk-of-covid-19-transmission-study-12075.html", "urlToImage": "https://images.edexlive.com/uploads/user/imagelibrary/2020/5/17/w600X390/mask.jpg", "publishedAt": "2020-05-17T11:48:29Z", "content": "Researchers have found that loud speech has the capability of emitting small respiratory droplets that stay in the air for a minimum of eight minutes.\r\nThe new study reported in The Washington Post was published in a peer-reviewed journal of National Academy … [+2286 chars]"}, {"source": {"id": null, "name": "Devdiscourse.com"}, "author": "ANI", "title": "COVID-19 spread high In India but not affecting all parts of country: Govt document - Devdiscourse", "description": "The containment policy of COVID-19 needs a differential approach in India as the virus spread is high in the population but it is not uniformly affecting all parts of the country, stated the latest updated containment plan for large outbreak area.", "url": "https://www.devdiscourse.com/article/health/1054506-covid-19-spread-high-in-india-but-not-affecting-all-parts-of-country-govt-document", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/17_05_2020_10_06_50_9205576.jpg?width=920&format=jpeg", "publishedAt": "2020-05-17T10:08:13Z", "content": "By Priyanka Sharma The containment policy of COVID-19 needs a differential approach in India as the virus spread is high in the population but it is not uniformly affecting all parts of the country, stated the latest updated containment plan for large outbrea… [+1770 chars]"}, {"source": {"id": null, "name": "Thestatesman.com"}, "author": "SNS Web", "title": "Spraying disinfectants in open spaces doesn’t eliminate COVID-19: WHO - The Statesman", "description": "The UN body has also against the systematic spraying and fumigating of disinfectants on to surfaces in indoor spaces, citing a study that has shown it to be ineffective outside direct spraying areas.", "url": "https://www.thestatesman.com/coronavirus/spraying-disinfectants-in-open-spaces-doesnt-eliminate-covid-19-who-1502889628.html", "urlToImage": "https://www.thestatesman.com/wp-content/uploads/2020/05/disinfectant.jpg", "publishedAt": "2020-05-17T06:36:14Z", "content": "The World Health Organization (WHO) agency of the United Nations responsible for international public health, warned on Saturday that spraying disinfectant on the streets, as practised in some countries, does not eliminate the novel coronavirus and even poses… [+2097 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "Mrityunjay Bose", "title": "'Inability to learn from SARS, Ebola led to coronavirus situation' - Deccan Herald", "description": "Though the world now has enough experience of pandemics and epidemics like SARS, Ebola, Swine Flu, Zika, our inability or unwillingness to learn from past experience caused the delay in handling the COVID-19 situation, said Dr Swapneil Parikh.", "url": "https://www.deccanherald.com/national/inability-to-learn-from-sars-ebola-led-to-coronavirus-situation-838577.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/article_images/2020/05/17/BOOK-1589686801.jpg", "publishedAt": "2020-05-17T03:40:01Z", "content": "Though the world now has enough experience of pandemics and epidemics like SARS, Ebola, Swine Flu, Zika, our inability or unwillingness to learn from past experience caused the delay in handling the COVID-19 situation, said Dr Swapneil Parikh. \r\nNothing of th… [+2887 chars]"}]}