{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "New York Times", "title": "Coronavirus antibody tests: Can you trust the results? - Times of India", "description": "The researchers worked around the clock, in shifts of three to five hours, hoping to stave off weariness and keep t", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/coronavirus-antibody-tests-can-you-trust-the-results/articleshow/75387833.cms", "urlToImage": null, "publishedAt": "2020-04-26T10:11:40Z", "content": "The researchers worked around the clock, in shifts of three to five hours, hoping to stave off weariness and keep their minds sharp for the delicate task.\r\nThey set up lines of laboratory volunteers: medical residents, postdoctoral students, even experienced … [+11078 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Bloomberg", "title": "WHO warns patients could catch coronavirus more than once - Livemint", "description": "This came after governments suggested that they could issue an immunity passport.Chile was the first country to announce plans to issue immunity cards based partly on antibody tests", "url": "https://www.livemint.com/news/world/who-warns-patients-could-catch-coronavirus-more-than-once-11587885584035.html", "urlToImage": null, "publishedAt": "2020-04-26T08:19:56Z", "content": "Catching Covid-19 once may not protect you from getting it again, according to the World Health Organization, a finding that could jeopardize efforts to allow people to return to work after recovering from the virus.There is currently no evidence that people … [+2362 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Women face anxiety over pregnancy and birth in US - TRT World", "description": "For many women, being pregnant comes with its own set of fears and anxiety. But being pregnant during the Covid-19 pandemic takes those fears to a whole new ...", "url": "https://www.youtube.com/watch?v=gagwijdvCR0", "urlToImage": null, "publishedAt": "2020-04-26T08:10:16Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Indore strain may be deadlier, will send samples to NIV: Doctors - Times of India", "description": "India News: Doctors treating Covid-19 cases in Indore say a more virulent strain may be wreaking havoc in the city, which has emerged as the coronavirus hotspot i", "url": "https://timesofindia.indiatimes.com/india/indore-strain-may-be-deadlier-will-send-samples-to-niv-doctors/articleshow/75386670.cms", "urlToImage": null, "publishedAt": "2020-04-26T07:51:39Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "News18.com"}, "author": "PTI", "title": "Covid-19: Unsung Mining Heroes Brave Odds to Produce Coal, Keep Power Plants Running - News18", "description": "Undeterred by the fear of death, 57-year-old Asif Khan has kept his nose to the grindstone to dig out coal so that the country's power plants can keep running at a time when people have been forced to stay indoors due to the COVID-19 crisis.", "url": "https://www.news18.com/news/india/covid-19-unsung-mining-heroes-brave-odds-to-produce-coal-keep-power-plants-running-2593207.html", "urlToImage": null, "publishedAt": "2020-04-26T07:18:02Z", "content": "Undeterred by the fear of death, 57-year-old Asif Khan has kept his nose to the grindstone to dig out coal so that the country's power plants can keep running at a time when people have been forced to stay indoors due to the COVID-19 crisis. \r\nWith the countr… [+3153 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The Virus: Latest developments in the COVID-19 pandemic, 26 April | ABC News - ABC News (Australia)", "description": "Jeremy Fernandez takes you through the key developments in Australia's battle against the spread of coronavirus. In this epsiode, we look at the first human ...", "url": "https://www.youtube.com/watch?v=N446G4fqPuA", "urlToImage": null, "publishedAt": "2020-04-26T06:41:34Z", "content": null}, {"source": {"id": null, "name": "Theweek.in"}, "author": null, "title": "'Bored' truck driver plays cards with friends, leads to 24 getting COVID-19 - THE WEEK", "description": "Two instances accounted for about 40 cases in the city in the last couple of days", "url": "https://www.theweek.in/news/india/2020/04/26/bored-truck-driver-plays-cards-with-friends-leads-to-24-getting-covid-19.html", "urlToImage": null, "publishedAt": "2020-04-26T06:13:35Z", "content": "A bored truck driver's efforts to kill time by indulging in a game of cards with friends and neighbours led to the infection of coronavirus in 24 people in one locality of Vijayawada city in Andhra Pradesh, Krishna district collector A. Md Imtiaz said. A soci… [+1026 chars]"}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "Longjam Dineshwori", "title": "Prescriptions for antidepressants and anti-anxiety drugs surge amidst COVID-19 pandemic - TheHealthSite", "description": "According to a report prescriptions of anti-anxiety medications rose by 34.1% between mid-February and mid-March in the US.", "url": "https://www.thehealthsite.com/news/prescriptions-for-antidepressants-and-anti-anxiety-drugs-surge-amidst-covid-19-pandemic-741891/", "urlToImage": null, "publishedAt": "2020-04-26T06:06:59Z", "content": "Stress about health, finances and uncertainty about the future amidst the COVID-19 pandemic is taking a serious toll on the mental health of people worldwide. In India, there has been a massive spike in patients with mental illness since the coronavirus outbr… [+4292 chars]"}, {"source": {"id": null, "name": "Sfchronicle.com"}, "author": "Matthias Gafni, Jill Tucker", "title": "Exclusive: Autopsy report of first known coronavirus death in U.S. says disease caused Santa Clara woman’s heart to rupture - San Francisco Chronicle", "description": "<p>The Santa Clara woman suffered a massive heart attack because of COVID-19, an autopsy report obtained by The Chronicle shows.</p>", "url": "https://www.sfchronicle.com/bayarea/article/Exclusive-Autopsy-report-of-first-known-15226422.php", "urlToImage": null, "publishedAt": "2020-04-26T05:15:36Z", "content": "The Santa Clara woman whose death from COVID-19 is the earliest so far known in the United States suffered a massive heart attack caused by coronavirus infection, signs of which were found throughout her body, according to an autopsy report obtained exclusive… [+4283 chars]"}, {"source": {"id": null, "name": "Telanganatoday.com"}, "author": "Telangana Today", "title": "Developing strategies for management of Covid-19 - Telangana Today", "description": "We have witnessed several catastrophes and the way they were handled by governments with inputs from science. Today, in a knowledge-based society that uses Information Technology tools extensively, it has become possible to rapidly bring out products by short…", "url": "https://telanganatoday.com/developing-strategies-for-management-of-covid-19", "urlToImage": null, "publishedAt": "2020-04-26T04:44:53Z", "content": "We have witnessed several catastrophes and the way they were handled by governments with inputs from science. Today, in a knowledge-based society that uses Information Technology tools extensively, it has become possible to rapidly bring out products by short… [+8264 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "IANS", "title": "No evidence proves antibodies can protect from second wave: WHO - India TV News", "description": "There is currently no evidence that people who have recovered from COVID-19 and have antibodies are protected from a second infection, the World Health Organization (WHO) said in a daily situation report.", "url": "https://www.indiatvnews.com/news/world/no-evidence-proves-antibodies-can-protect-from-second-wave-who-611321", "urlToImage": null, "publishedAt": "2020-04-26T01:43:31Z", "content": "Image Source : APNo evidence proves antibodies can protect from second wave: WHO\r\nThere is currently no evidence that people who have recovered from COVID-19 and have antibodies are protected from a second infection, the World Health Organization (WHO) said i… [+1540 chars]"}, {"source": {"id": null, "name": "Manoramaonline.com"}, "author": "Reuters", "title": "Could warmer weather help contain the coronavirus? - Onmanorama", "description": "Here's what we know about seasonal features of disease outbreaks.", "url": "https://english.manoramaonline.com/lifestyle/health/2020/04/25/could-warmer-weather-help-contain-coronavirus.html", "urlToImage": null, "publishedAt": "2020-04-26T01:01:18Z", "content": "The world is looking for signs that the arrival of warmer weather in the northern hemisphere could slow the spread of the coronavirus outbreak, which has killed more than 1,90,000 people and sent the global economy into a tailspin as countries impose lockdown… [+3652 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Home care workers say they need PPE equipment - KGW News", "description": "Home care providers are essential workers who put their clients and families at risk as they venture out into the world to get their duties done. They say th...", "url": "https://www.youtube.com/watch?v=n8L80xNxlXk", "urlToImage": null, "publishedAt": "2020-04-26T00:40:17Z", "content": null}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Jayashree Nandi & Anonna Dutt", "title": "Virus could cling to air pollutants - Hindustan Times", "description": "India has among the highest particulate matter (PM) concentrations globally.", "url": "https://www.hindustantimes.com/india-news/virus-could-cling-to-air-pollutants/story-3IVTDluMJ7UIGGZlm7L64J.html", "urlToImage": null, "publishedAt": "2020-04-26T00:12:00Z", "content": "SARS-CoV-2, the virus that causes Covid-19, can cling to air pollutants, tests conducted in Italy have found -- a finding which, if validated, should cause concern in India, especially Delhi, where air pollution is a recurring problem, although both the resea… [+4772 chars]"}, {"source": {"id": null, "name": "China.org.cn"}, "author": "杨希", "title": "No evidence suggests people with COVID-19 antibodies protected from secondary infection: WHO - China.org.cn", "description": null, "url": "http://www.china.org.cn/world/2020-04/26/content_75976358.htm", "urlToImage": null, "publishedAt": "2020-04-26T00:04:15Z", "content": "There is currently no evidence that people who have recovered from COVID-19 and have antibodies are protected from a second infection, the World Health Organization (WHO) said in a daily situation report on Saturday.\r\nAlthough many studies show that people wh… [+1182 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: The father of 13 self isolating with Covid-19 - BBC News", "description": "The Hann family have found lockdown a struggle but say they feel \"privileged\" as they pull together.", "url": "https://www.bbc.com/news/uk-scotland-tayside-central-52426962", "urlToImage": null, "publishedAt": "2020-04-25T23:05:02Z", "content": "Image copyrightLesley MartinImage caption\r\n The father of one of Scotland's largest families - Roy Hann - has tested positive for Covid-19\r\nWhen lockdown measures were first announced, Roy and Emma Hann gave their children strict routines and organised family… [+3801 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "VIDEO: Coronavirus pandemic changing Ramadan celebrations - WFSB 3", "description": "This year, Ramadan celebrations are looking very different because of the coronavirus pandemic.", "url": "https://www.youtube.com/watch?v=6Pp13Nbk12I", "urlToImage": null, "publishedAt": "2020-04-25T22:57:49Z", "content": "This year, Ramadan celebrations are looking very different because of the coronavirus pandemic."}, {"source": {"id": null, "name": "Nzherald.co.nz"}, "author": "NZ Herald", "title": "Covid-19 coronavirus: Healthy young people dying of virus-related strokes - New Zealand Herald", "description": "A terrifying warning has been issued about people with mild or no symptoms of the virus.", "url": "https://www.nzherald.co.nz/world/news/article.cfm?c_id=2&objectid=12327627", "urlToImage": null, "publishedAt": "2020-04-25T22:53:21Z", "content": "Young people, with mild to no symptoms of Covid-19, are dying of strokes related to the virus, doctors have warned.\r\n The experts say Covid-19 seems to be the cause for sudden strokes in adults in their 30s and 40s, who are otherwise healthy.\r\n Doctors in the… [+1525 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Chanel Georgina", "title": "Hair loss treatment: The ‘most effective’ remedy to boost hair growth - how to make it - Express", "description": "HAIR LOSS can be upsetting for men and women alike. What's the 'most effective' remedy to boost hair growth? And how do you make it?", "url": "https://www.express.co.uk/life-style/health/1273911/hair-loss-treatment-coconut-milk-how-to-make-it", "urlToImage": null, "publishedAt": "2020-04-25T22:30:57Z", "content": "According to Dr Blossom Kochhar, the \"most effective\" remedy for natural hair growth is the use of coconut milk.\r\nSpecifically, Dr Kochhar advises to \"take coconut milk from a fresh coconut\" – and not to use the liquid from a carton.\r\nCoconut milks is rich in… [+182 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Why has Spain been hit so hard by the coronavirus pandemic? - India Today", "description": "Experts pointed to the country's sociable lifestyle and close ties between young and older family members as significant factors in the virus's spread.", "url": "https://www.indiatoday.in/world/story/why-spain-hit-hard-by-coronavirus-pandemic-1671126-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T22:00:06Z", "content": "In Spain, one of the hardest-hit countries in the pandemic, the coronavirus spread quickly and widely without being detected, especially among the elderly, experts told news agency AFP.\r\nWhile they stressed it was too early to carry out a detailed analysis, t… [+4429 chars]"}, {"source": {"id": null, "name": "Sbs.com.au"}, "author": null, "title": "'No evidence' people with coronavirus are immunised: WHO - SBS News", "description": "While the global death toll of coronavirus passes 200,000, the World Health Organization warns there is no evidence of immunity to the disease.", "url": "https://www.sbs.com.au/news/no-evidence-people-with-coronavirus-are-immunised-says-who", "urlToImage": null, "publishedAt": "2020-04-25T21:37:23Z", "content": "The World Health Organization has warned that recovering from coronavirus might not protect people from reinfection as the death toll from the pandemic passed 200,000 around the globe.\r\nGovernments are struggling to limit the economic devastation unleashed by… [+7190 chars]"}, {"source": {"id": null, "name": "Standardmedia.co.ke"}, "author": "Reuters", "title": "20 promising drugs and vaccines in the fight against Covid-19 - The Standard", "description": "Researchers are burning the midnight oil to come up with a solution to ease the strain on healthcare systems.", "url": "https://www.standardmedia.co.ke/health/article/2001369135/20-promising-drugs-and-vaccines-in-the-fight-against-covid-19", "urlToImage": null, "publishedAt": "2020-04-25T21:00:00Z", "content": "<ul><li> Reuters 26th Apr 2020 00:00:00 GMT +0300 </li></ul> With much of the world living in lockdown, the spread of the new coronavirus, Sars-CoV-2, that was first detected in China late last year is beginning to slow in some places.\r\nAs of April 19, 2.4 mi… [+13697 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": null, "title": "WHO warns malaria deaths could double during virus pandemic - cgtn.com", "description": "The new coronavirus pandemic could severely disrupt access to anti-malaria nets and drugs in sub-Saharan", "url": "https://africa.cgtn.com/2020/04/25/who-warns-malaria-deaths-could-double-during-virus-pandemic/", "urlToImage": null, "publishedAt": "2020-04-25T20:47:00Z", "content": "Aedes aegypti Mosquito. Close up a Mosquito sucking human blood.Aedes aegypti Mosquito. Close up a Mosquito sucking human blood,Mosquito Vector-borne diseases,Chikungunya.Dengue fever.Rift Valley fever.Yellow fever.Zika.Mosquito on skin\r\nThe new coronavirus p… [+3281 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nTom Morgan", "title": "Coronavirus test for anyone traced to a known carrier - Telegraph.co.uk", "description": "The technology should eventually allow symptomless workers to return to their jobs quicker", "url": "https://www.telegraph.co.uk/news/2020/04/25/coronavirus-test-anyone-traced-known-carrier/", "urlToImage": null, "publishedAt": "2020-04-25T20:30:00Z", "content": "In the letter to public health agencies and local authorities, he says the app will work in unison with a call-based system for those without the technology.\r\nHe also refers to the Government's huge recruitment drive to carry out the extra testing. \"There wil… [+2492 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Peter Stubley", "title": "First credible evidence emerges of person being killed by meteor - The Independent", "description": "Researchers find official records documenting fatal strike in Iraq in 1888", "url": "https://www.independent.co.uk/news/science/meteor-man-death-first-person-killed-iraq-turkey-ottoman-empire-a9484231.html", "urlToImage": null, "publishedAt": "2020-04-25T20:00:42Z", "content": "The odds of being struck and killed by a meteorite are said to be as low as one in 250,000.\r\nThere has been no credible and well-documented evidence of any human being befalling this unfortunate fate.\r\nBut researchers now say they have found three separate of… [+16481 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Mehr Gill", "title": "Explained: Types of human coronaviruses and the symptoms they cause - The Indian Express", "description": "While there are hundreds of coronaviruses, there are seven that we know can infect humans.", "url": "https://indianexpress.com/article/explained/types-of-human-coronaviruses-and-symptoms-6368444/", "urlToImage": null, "publishedAt": "2020-04-25T19:50:19Z", "content": "Written by Mehr Gill\r\n | New Delhi | \r\nUpdated: April 25, 2020 6:09:09 pm\r\nHuman coronaviruses were first characterised in the mid-1960s and they are mostly considered to be responsible for causing upper respiratory tract infections in children. (AP illustrat… [+6888 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "'No evidence' that recovered COVID-19 patients cannot be reinfected: WHO - Reuters", "description": "The World Health Organization (WHO) said on Saturday that there was currently \"no evidence\" that people who have recovered from COVID-19 and have antibodies are protected from a second coronavirus infection.", "url": "https://www.reuters.com/article/us-health-coronavirus-who-idUSKCN2270FB", "urlToImage": null, "publishedAt": "2020-04-25T19:16:55Z", "content": "GENEVA (Reuters) - The World Health Organization (WHO) said on Saturday that there was currently “no evidence” that people who have recovered from COVID-19 and have antibodies are protected from a second coronavirus infection. \r\nIn a scientific brief, the Uni… [+1753 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "FDA warns against the use of malaria drugs to treat COVID-19 - Yahoo Finance", "description": "\"We always have to follow medical professionals and the advice of medical doctors when it comes to any type of medical issues,' says Special Pathogens Specia...", "url": "https://www.youtube.com/watch?v=2Csl_N9URsI", "urlToImage": null, "publishedAt": "2020-04-25T19:07:55Z", "content": null}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Ariana Eunjung Cha", "title": "Young and middle-aged people, barely sick with covid-19, are dying of strokes - The Washington Post", "description": "Doctors sound alarm about patients in their 30s and 40s left debilitated or dead by strokes. Some didn’t even know they were infected by coronavirus.", "url": "https://www.washingtonpost.com/health/2020/04/24/strokes-coronavirus-young-patients/", "urlToImage": null, "publishedAt": "2020-04-25T18:18:21Z", "content": "Oxley gasped when he got to the patients age and covid-19 status: 44, positive.\r\nThe man was among several recent stroke patients in their 30s to 40s who were all infected with the coronavirus. The median age for that type of severe stroke is 74.\r\nAs Oxley, a… [+9467 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Jayashree Nandi", "title": "2 cell types are entry points for virus - Hindustan Times", "description": "The respiratory tract is filled with numerous cells, among which are goblet cells and ciliated cells.", "url": "https://www.hindustantimes.com/india-news/2-cell-types-are-entry-points-for-virus/story-VZ250MIqdc4r0OIzxsTqPJ.html", "urlToImage": null, "publishedAt": "2020-04-25T17:54:31Z", "content": "Scientists have identified two types of cells in the nose that are likely to be point of infection for the Sars-CoV-2 virus, which causes Covid-19, in the body.\r\nThe respiratory tract is filled with numerous cells, among which are goblet cells and ciliated ce… [+2449 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "WHO: Why should I get vaccinated? - World Health Organization (WHO)", "description": "Without vaccines, we are at risk of serious illness and disability from diseases like measles, meningitis, tetanus and polio. In today' interconnected world,...", "url": "https://www.youtube.com/watch?v=9nadnOxvE74", "urlToImage": null, "publishedAt": "2020-04-25T17:33:39Z", "content": null}, {"source": {"id": null, "name": "Ladbible.com"}, "author": "Claire Reid", "title": "Six-Month-Old Baby Beats Coronavirus While Battling Heart And Lung Problems - LADbible", "description": "Adorable baby Erin Bates has also been battling lung and heart problems", "url": "https://www.ladbible.com/community/daily-ladness-six-month-old-baby-overcomes-coronavirus-20200425", "urlToImage": null, "publishedAt": "2020-04-25T16:12:14Z", "content": "A six-month old baby has overcome coronavirus while also battling problems with her lungs and heart.\r\nAdorable Erin Bates was already recovering from major surgery following issues with her heart and windpipe when she was diagnosed with covid-19. \r\nLess than … [+2287 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "No clear evidence that people who recover from COVID-19 are protected from second infection: WHO - Goa Chronicle", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMie2h0dHBzOi8vZ29hY2hyb25pY2xlLmNvbS9uby1jbGVhci1ldmlkZW5jZS10aGF0LXBlb3BsZS13aG8tcmVjb3Zlci1mcm9tLWNvdmlkLTE5LWFyZS1wcm90ZWN0ZWQtZnJvbS1zZWNvbmQtaW5mZWN0aW9uLXdoby0yL9IBf2h0dHBzOi8vZ29hY2hyb25pY2xlLmNvbS9uby1jbGVhci1ldmlkZW5jZS10aGF0LXBlb3BsZS13aG8tcmVjb3Zlci1mcm9tLWNvdmlkLTE5LWFyZS1wcm90ZWN0ZWQtZnJvbS1zZWNvbmQtaW5mZWN0aW9uLXdoby0yL2FtcC8?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T16:02:07Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "World Malaria Day: Governments urged to prevent rise in deaths - Al Jazeera English", "description": "On World Malaria Day, health officials are warning governments to move fast to prevent a rise in Malaria-related deaths. In Kenya, thousands of people have l...", "url": "https://www.youtube.com/watch?v=64nKBK4kq_w", "urlToImage": null, "publishedAt": "2020-04-25T15:59:04Z", "content": "On World Malaria Day, health officials are warning governments to move fast to prevent a rise in Malaria-related deaths.In Kenya, thousands of people have lost their homes after seasonal torrential rains destroyed them. Now, mosquitos are thriving in the wet … [+340 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "HRD wants universities to study how India handled 1918 Spanish flu, revived economy - Moneycontrol", "description": "The HRD Ministry has been encouraging academic institutions to make research contributions to aid the fight against the deadly coronavirus.", "url": "https://www.moneycontrol.com/news/india/hrd-wants-universities-to-study-how-india-handled-1918-spanish-flu-revived-economy-5189901.html", "urlToImage": null, "publishedAt": "2020-04-25T15:48:35Z", "content": "The HRD Ministry has asked universities to study how India handled the Spanish flu pandemic in 1918 and what measures were taken to boost the economy. The ministry has also advised the universities to set up research teams and study the levels of awareness of… [+1713 chars]"}, {"source": {"id": null, "name": "Nydailynews.com"}, "author": "Muri Assunção", "title": "Coronavirus in Italy earlier than previously thought - New York Daily News", "description": "“In January for sure, but maybe even before.&quot;", "url": "https://www.nydailynews.com/coronavirus/ny-coronavirus-first-cases-italy-january-much-earlier-according-study-20200424-plmph6zq4rckzckqsvbpoqiyli-story.html", "urlToImage": null, "publishedAt": "2020-04-25T15:40:38Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "WATCH | National curfew and mandatory cloth face masks to come into effect under Level 4 - News24", "description": "As of 1 May, a national curfew from 20:00 to 05:00 will be in place and it will be applicable to everyone except essential workers traveling to and from work...", "url": "https://www.youtube.com/watch?v=dNs8wczQKNM", "urlToImage": null, "publishedAt": "2020-04-25T15:15:23Z", "content": null}, {"source": {"id": null, "name": "Indiantelevision.com"}, "author": "https://www.facebook.com/ITVNewz", "title": "Godrej Group urges people to take precautionary measures on world malaria day - Indiantelevision.com", "description": "MUMBAI: On World Malaria Day, Godrej Group has urged people to take precautionary measures against vector-borne diseases like malaria, dengue during the ongoing COVID-19 pandemic. The conglomerate has released a digital film to highlight EMBED (Elimination of…", "url": "https://www.indiantelevision.com/mam/marketing/mam/godrej-group-urges-people-to-take-precautionary-measures-on-world-malaria-day-200425", "urlToImage": null, "publishedAt": "2020-04-25T14:05:57Z", "content": "MUMBAI: On World Malaria Day, Godrej Group has urged people to take precautionary measures against vector-borne diseases like malaria, dengue during the ongoing COVID-19 pandemic. The conglomerate has released a digital film to highlight EMBED (Elimination of… [+4044 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "AP", "title": "Italy to ease lockdown on May 4, give free masks - India TV News", "description": "Italy will start distributing free protective masks to nursing homes, many of which have been devastated by coronavirus infections and deaths.", "url": "https://www.indiatvnews.com/news/world/italy-ease-coronavirus-lockdown-may-4-covid-19-free-masks-611217", "urlToImage": null, "publishedAt": "2020-04-25T13:03:04Z", "content": "Image Source : APItaly to ease lockdown on May 4\r\nItaly will start distributing free protective masks to nursing homes, many of which have been devastated by coronavirus infections and deaths. Domenico Arcuri, the governments commissioner for the pandemic, sa… [+797 chars]"}, {"source": {"id": null, "name": "Swarajyamag.com"}, "author": null, "title": "Coronavirus And Smoking: French Researchers Suggest Nicotine Could Protect Against Coronavirus - Swarajya", "description": "", "url": "https://swarajyamag.com/news-brief/coronavirus-and-smoking-french-researchers-suggest-nicotine-could-protect-against-coronavirus", "urlToImage": null, "publishedAt": "2020-04-25T11:31:00Z", "content": null}, {"source": {"id": "the-irish-times", "name": "The Irish Times"}, "author": "The Irish Times", "title": "WHO warns against idea of coronavirus ‘immunity passports’ - The Irish Times", "description": "Health agency warns governments against issuing ‘immunity passports’", "url": "https://www.irishtimes.com/news/world/coronavirus-no-evidence-that-recovered-patients-are-immune-says-who-1.4238216", "urlToImage": null, "publishedAt": "2020-04-25T11:23:08Z", "content": "The World Health Organisation (WHO) said on Saturday that there was currently no evidence that people who have recovered from coronavirus and have antibodies are protected from a second coronavirus infection.\r\nIn a scientific brief, the United Nations agency … [+1685 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "India.com News Desk", "title": "Coronavirus Will be Destroyed by Acids Present in Stomach, Ramdev Makes Bizarre Claim - India.com", "description": "New Delhi: At a time when the entire world is struggling to combat the spread of coronavirus outbreak, Yoga guru Ramdev has come up with a bizarre solution to treat COVID-19. Speaking at an event orga", "url": "https://www.india.com/news/india/coronavirus-will-be-destroyed-by-acids-present-in-stomach-ramdev-makes-bizarre-claim-4010634/", "urlToImage": null, "publishedAt": "2020-04-25T11:18:51Z", "content": "New Delhi: At a time when the entire world is struggling to combat the spread of coronavirus outbreak, Yoga guru Ramdev has come up with a bizarre solution to treat COVID-19. Speaking at an event organised by a media organisation,  Ramdev claimed that if COVI… [+1570 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Jayashree Nandi", "title": "Bats cannot directly infect humans with Covid-19: Scientists - Hindustan Times", "description": "According to scientists, Sars-Cov-2 may have diverged from the closest coronavirus found in bats called RaTG13, about 40 to 70 years ago, indicating that the bat virus cannot directly infect humans.", "url": "https://www.hindustantimes.com/india-news/bats-cannot-directly-infect-humans-with-covid-19-scientists/story-uuEwHKcI0x266H1fxawFbN.html", "urlToImage": null, "publishedAt": "2020-04-25T09:30:44Z", "content": "Sixty-four scientists have said bats do not spread Covid-19 after reports of people requesting local authorities to clear trees over a fear of the colonies the winged mammals host.\r\nThe chiropterologists issuing the statement said they came together after rep… [+3518 chars]"}, {"source": {"id": null, "name": "Financialexpress.com"}, "author": "FE Online", "title": "Cotton, natural silk, chiffon make best materials for homemade masks against COVID-19: Study - The Financial Express", "description": "They said the performance of these fabric layers was close to that of an N95 mask material.  According to the study, substituting the chiffon with natural silk or flannel, or simply using a cotton quilt with cotton-polyester batting, produced similar results.", "url": "https://www.financialexpress.com/lifestyle/health/cotton-natural-silk-chiffon-make-best-materials-for-homemade-masks-against-covid-19-study/1939446/", "urlToImage": null, "publishedAt": "2020-04-25T09:04:27Z", "content": "As people resort to making their own cloth masks due to shortage of surgical and N95 varieties in the wake of the COVID-19 pandemic, a new study says a combination of cotton with natural silk or chiffon can filter out aerosol particles provided that the mask … [+2378 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "ANI", "title": "106-year-old woman who survived Spanish Flu, now beats Covid-19 too - Livemint", "description": "Ana del Valle is the oldest survivor of the pandemic outbreaks in Spain.Ana was born in October 1913 and in less than six months she will turn 107", "url": "https://www.livemint.com/news/world/106-year-old-woman-who-survived-spanish-flu-now-beats-coronavirus-too-11587798144700.html", "urlToImage": null, "publishedAt": "2020-04-25T07:15:52Z", "content": "Madrid: We may have all heard that miracles do happen, but sadly not all of us have the chance to witness them in our daily lives, especially during a pandemic today which brings the world to a standstill.Citing a similar story of survival, The Olive Press, a… [+2495 chars]"}, {"source": {"id": null, "name": "Deccanchronicle.com"}, "author": null, "title": "Amid rising death toll, FDA warns of the side effects of Hydroxychloroquine - Deccan Chronicle", "description": "COVID-19 death toll in India rises to 775 as the number of cases climb to 24,506, Health Ministry says", "url": "https://www.deccanchronicle.com/nation/current-affairs/250420/amid-rising-death-toll-fda-warns-of-the-side-effects-of-hydroxychloro.html", "urlToImage": null, "publishedAt": "2020-04-25T07:05:00Z", "content": "New Delhi: Here are the latest updates on the coronavirus crisis in India and other parts of the world on Saturday.\r\n11:40 a.m.\r\nUGC panels recommend academic session in varsities from September and online exams wherever possible.\r\n11:36 a.m.\r\nAmerican Senato… [+1603 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Callum Hoare", "title": "‘Reservoir for viruses’ China told to permanently ban bat trade to prevent next pandemic - Express.co.uk", "description": "CHINA must permanently ban the hunting trade and consumption of wildlife animals, including bats, or a future pandemic similar to coronavirus is inevitable, research shows.", "url": "https://www.express.co.uk/news/world/1273464/china-xi-jinping-bat-animal-trade-coronavirus-pandemic-covid19-wuhan-seafood-market-spt", "urlToImage": null, "publishedAt": "2020-04-25T07:00:00Z", "content": null}, {"source": {"id": null, "name": "Latestly.com"}, "author": "Ashwani Mishra", "title": "World Malaria Day 2020: Quotes By Influential Personalities To Raise Awareness About Deadly Disease - LatestLY", "description": "World Malaria Day is observed on April 25 to recognise the efforts undertaken by the world in control of the deadly disease that is Malaria. Each year the Malaria Day has a theme and this year the theme is 'Zero Malaria Starts with Me. On World Malaria Day, w…", "url": "https://www.latestly.com/social-viral/world-malaria-day-2020-quotes-by-influential-personalities-to-raise-awareness-about-deadly-disease-1707820.html", "urlToImage": null, "publishedAt": "2020-04-25T06:56:49Z", "content": "World Malaria Day is observed on April 25 each year to recognise the efforts undertaken by the world in control of the deadly disease that is Malaria. The WHO and its member states recognise Malaria as an important challenge to a healthy existence and hence r… [+3270 chars]"}, {"source": {"id": null, "name": "Medicaldialogues.in"}, "author": "Dr Ishwar Gilada", "title": "Perspective: Better preparedness needed while harping on initial success with Convalescent Plasma Therapy ... - Medical Dialogues", "description": "On 24th April, 2020, the Delhi Government announced initial success with this Convalescent Plasma...", "url": "https://medicaldialogues.in/pulmonology/perspective/perspective-better-preparedness-needed-while-harping-on-initial-success-with-convalescent-plasma-therapy-in-covid-19-patients-65173", "urlToImage": null, "publishedAt": "2020-04-25T06:56:13Z", "content": "On 24th April, 2020, the Delhi Government announced initial success with this Convalescent Plasma therapy in some critically ill Covid-19 patients. Delhi Chief Minister appealed the recovered Covid-19 patients to come forward and donate plasma to benefit othe… [+7735 chars]"}, {"source": {"id": null, "name": "Weather.com"}, "author": "Deekshith Nevil Pinto", "title": "World Malaria Day: Would Coronavirus Revive or Derail India's Success Story Against Malaria? - The Weather Channel", "description": "The novel coronavirus is restricting the ongoing healthcare services that helped countries to fight several deadly diseases like Malaria.", "url": "https://weather.com/en-IN/india/coronavirus/news/2020-04-25-world-malaria-day-covid-19-revive-derail-india-success-story", "urlToImage": null, "publishedAt": "2020-04-25T06:34:18Z", "content": "On December 4, 2019, the World Health Organisation (WHO) released the World Malaria Report 2019a comprehensive analysis of the global Malaria situation. The report showed that India was one of the only two success stories among 11 countries facing the world's… [+7093 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "1752 Coronavirus Cases Reported On Friday, Biggest Single Day Spike | Coronavirus Outbreak - CNBC-TV18", "description": "India's fight against coronavirus has reached on the critical phase as the total number of coronavirus cases have crossed 23,000. Out of which 1750 cases wer...", "url": "https://www.youtube.com/watch?v=GnPn5O0s-v4", "urlToImage": null, "publishedAt": "2020-04-25T04:48:57Z", "content": null}, {"source": {"id": null, "name": "Kashmirlife.net"}, "author": "KL News Network", "title": "Coronavirus not manipulated or constructed: WHO - Kashmir Life", "description": "Srinagar All available evidence to date suggests that the novel coronavirus has a natural animal origin and was not a manipulated or constructed virus, the World Health Organization (WHO) said.", "url": "https://kashmirlife.net/coronavirus-not-manipulated-or-constructed-who-230999/", "urlToImage": null, "publishedAt": "2020-04-25T04:17:58Z", "content": "Srinagar\r\nAll available evidence to date suggests that the novel coronavirus has a natural animal origin and was not a manipulated or constructed virus, the World Health Organization (WHO) said.\r\nMany researchers have been able to look at the genomic features… [+999 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": "Maggie Fox", "title": "COVID-19 causing blood clots, sudden strokes in young adults, doctors say - CTV News", "description": "The new coronavirus appears to be causing sudden strokes in adults in their 30s and 40s who are not otherwise terribly ill, doctors reported Wednesday.", "url": "https://www.ctvnews.ca/health/coronavirus/covid-19-causing-blood-clots-sudden-strokes-in-young-adults-doctors-say-1.4910674", "urlToImage": null, "publishedAt": "2020-04-25T03:40:15Z", "content": "The new coronavirus appears to be causing sudden strokes in adults in their 30s and 40s who are not otherwise terribly ill, doctors reported Wednesday.\r\nThey said patients may be unwilling to call 911 because they have heard hospitals are overwhelmed by coron… [+2516 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "G Thing: Pet fashion designer finds unique ways to give back to animal rescue crews - PIX11 News", "description": "She's one of the most in demand New York fashion designers for dog and cats.", "url": "https://www.youtube.com/watch?v=WcRkfwYZcdU", "urlToImage": null, "publishedAt": "2020-04-25T03:02:18Z", "content": "Sign in to report inappropriate content.\r\nSign in"}, {"source": {"id": null, "name": "Timesofisrael.com"}, "author": null, "title": "Scientists in Italy find coronavirus on air pollution particles - The Times of Israel", "description": "In preliminary study, researchers detect distinct virus genes on airborne pollutants, suggesting disease could travel farther by air than previously assumed", "url": "https://www.timesofisrael.com/scientists-in-italy-find-coronavirus-on-air-pollution-particles/", "urlToImage": null, "publishedAt": "2020-04-25T01:06:00Z", "content": "In a preliminary study, scientists in Italy detected the coronavirus on particles of air pollution.\r\nIt is still unclear whether the virus is viable or able to cause infections when carried by pollution, according to The Guardian, which first publicized the f… [+1690 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Today, The U.S. Passed 50000 Deaths Due To COVID-19 | MTP Daily | MSNBC - MSNBC", "description": "Today, the U.S. passed 50,000 deaths due to COVID-19. Chuck Todd says, \"At this rate, in just a few days, more Americans will have died from Coronavirus over...", "url": "https://www.youtube.com/watch?v=1B5UdkzxcbE", "urlToImage": null, "publishedAt": "2020-04-24T23:32:05Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus: White House task force addresses national COVID-19 response - KTLA 5", "description": "Update: Federal officials were providing updates on the government's response to COVID-19. #WhiteHouse #coronavirus #COVID19", "url": "https://www.youtube.com/watch?v=18CeqywkFLg", "urlToImage": null, "publishedAt": "2020-04-24T22:05:28Z", "content": null}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Lateshia Beachum", "title": "Researchers found coronavirus in a patient’s eyes — days after it left her nose - The Washington Post", "description": "A new medical report shows contagious particles of coronavirus can be found in the eyes.", "url": "https://www.washingtonpost.com/health/2020/04/24/researchers-found-coronavirus-patients-eyes-days-after-it-left-her-nose/", "urlToImage": null, "publishedAt": "2020-04-24T20:49:43Z", "content": "The report demonstrates that the novel coronavirus can exist in an infected persons eye fluids at probable contagious levels, increasing the need for people to be cognizant about their hand hygiene and to keep their hands away from their face, experts say.\r\nT… [+3742 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "Reuters", "title": "Coronavirus and COVID-19: Fact versus fiction - Deccan Herald", "description": "U.S. President Donald Trump's musings about whether disinfectants and ultraviolet light can be inserted into patients' bodies to treat COVID-19 have alarmed doctors and drawn warnings from the makers of Lysol, Dettol and Clorox. Here are some other claims tha…", "url": "https://www.deccanherald.com/science-and-environment/coronavirus-and-covid-19-fact-versus-fiction-829603.html", "urlToImage": null, "publishedAt": "2020-04-24T20:48:45Z", "content": "U.S. President Donald Trump's musings about whether disinfectants and ultraviolet light can be inserted into patients' bodies to treat COVID-19 have alarmed doctors and drawn warnings from the makers of Lysol, Dettol and Clorox.\r\nHere are some other claims th… [+3054 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "5 Things in 5 Minutes in Germany - Can Germany endure a second COVID-19 wave? - TRT World", "description": "This week we are looking at: -The possibility of second coronavirus wave with restrictions loosened -Thousands of students sit final exams, social distancing...", "url": "https://www.youtube.com/watch?v=_RdD5uYofW0", "urlToImage": null, "publishedAt": "2020-04-24T17:38:10Z", "content": null}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Les Steed", "title": "How does key worker testing work and what time can I apply for a coronavirus test? - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11469520/key-worker-coronavirus-testing-how-what-time/", "urlToImage": null, "publishedAt": "2020-04-24T17:35:15Z", "content": "MATT HANCOCK announced that testing can now be provided for up to seven million key workers and emergency staff.\r\nHere's how to get tested if you are an essential worker who believes that you or a household member has coronavirus.\r\n Matt Hancock said key work… [+6641 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Staff Correspondent", "title": "Serum Institute eyes COVID-19 vaccine by October - Frontline", "description": "It is being developed by University of Oxford; clinical trials in India soon, says CEO.", "url": "https://www.thehindu.com/sci-tech/health/serum-institute-eyes-covid-19-vaccine-by-october/article31427592.ece", "urlToImage": null, "publishedAt": "2020-04-24T17:24:47Z", "content": "City-based Serum Institute of India has said that it expects the vaccine for coronavirus (COVID-19) developed by the University of Oxford in the market by October or November provided the safety and efficacy of the product is established during trials.\r\nState… [+2349 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Does COVID-19 Cause Blood Clot Complications? | NBC New York - NBC New York", "description": "A small study of five critically ill COVID-19 patients at Mount Sinai Hospital in New York City could have major implications for how doctors respond to the ...", "url": "https://www.youtube.com/watch?v=twPd0YvY3T0", "urlToImage": null, "publishedAt": "2020-04-24T17:18:33Z", "content": null}, {"source": {"id": null, "name": "Oregonlive.com"}, "author": null, "title": "Vitamins C, D can help prevent coronavirus, Oregon State University researcher says - OregonLive", "description": "Adrian Gombart of OSU’s Linus Pauling Institute, along with his collaborators at universities across the world, said public health officials should issue a clear set of nutritional guidelines to complement the existing advice about washing hands to prevent th…", "url": "https://www.oregonlive.com/coronavirus/2020/04/vitamins-c-d-can-help-prevent-coronavirus-oregon-state-university-researcher-says.html", "urlToImage": null, "publishedAt": "2020-04-24T15:37:02Z", "content": "Supplements containing vitamins C and D, along with other micronutrients, can be a safe, effective and low-cost means to fight off the novel coronavirus and other acute respiratory tract diseases, according to an Oregon State University researcher.\r\nAdrian Go… [+5436 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "David Nikel", "title": "Sweden Health Chief Admits ‘It’s Not Over’ As Coronavirus Cases Leap - Forbes", "description": "Following an additional 131 deaths reported in the last 24 hours, Sweden’s COVID-19 death toll now stands at 2,152.", "url": "https://www.forbes.com/sites/davidnikel/2020/04/24/sweden-health-chief-admits-its-not-over-as-coronavirus-cases-leap/", "urlToImage": null, "publishedAt": "2020-04-24T15:09:59Z", "content": "Sweden's state epidemiologist Anders Tegnell has said the number of COVID-19 deaths in Sweden have ... [+] been higher than expected.\r\nAFP via Getty Images\r\nSwedens state epidemiologist Anders Tegnell has announced a record daily high of coronavirus cases for… [+3119 chars]"}, {"source": {"id": null, "name": "Euronews.com"}, "author": null, "title": "World Immunization Week: WHO highlights other diseases as coronavirus vaccine trials begin - Euronews", "description": "As coronavirus vaccine trials begin in the UK and get the green light in Germany, the World Health Organization warns other diseases must not be neglected.", "url": "https://www.euronews.com/2020/04/23/coronavirus-in-europe-vaccine-trials-begin-in-uk-and-get-green-light-in-germany", "urlToImage": null, "publishedAt": "2020-04-24T14:52:08Z", "content": "The beginning of UK clinical trials this week to find a coronavirus vaccine coincides with the start of World Immunization Week -- encouraging the use of vaccines to protect people against disease generally.\r\nThe event is promoted by the World Health Organiza… [+2089 chars]"}, {"source": {"id": null, "name": "Newsclick.in"}, "author": null, "title": "COVID-19: Vaccine Candidate Developed in China Reported to Have Protected Monkeys - NewsClick", "description": "SARS-CoV-2 was directly put into the lungs of eight Rhesus Macaques. None of the monkeys that had been vaccinated were seen to have developed a full-blown infection.", "url": "https://www.newsclick.in/COVID-19-vaccine-candidate-developed-china-reported-protected-monkeys", "urlToImage": null, "publishedAt": "2020-04-24T14:43:35Z", "content": "While the rush for a vaccine against COVID-19 is on, new candidate vaccines are continuing to enter the initial human trial phase. The one developed by a Beijing-based Biotech company, Sinovac Biotech, is reported to have been used on Rhesus Macaque monkeys, … [+3540 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Coronavirus pandemic | Over 50% consumers quit smoking during lockdown: Report - Moneycontrol", "description": "The survey revealed that over half of those who were interviewed had quit smoking during the ongoing lockdown while nearly 30 percent had reduced their daily consumption.", "url": "https://www.moneycontrol.com/news/business/coronavirus-pandemic-over-50-consumers-quit-smoking-during-lockdown-report-5187161.html", "urlToImage": null, "publishedAt": "2020-04-24T13:43:19Z", "content": "During the lockdown period in India, the consumption of cigarettes has taken a hit. A survey of over 100 smokers, conducted by IIFL Securities, found that around 58 percent respondents have quit smoking following the implementation of the nationwide lockdown … [+2003 chars]"}, {"source": {"id": null, "name": "Swarajyamag.com"}, "author": null, "title": "Novel Coronavirus Is A Result Of Crazy Experiments At Wuhan Institute of Virology: Top Russian Microbiologist - Swarajya", "description": "", "url": "https://swarajyamag.com/insta/novel-coronavirus-is-a-result-of-crazy-experiments-at-wuhan-institute-of-virology-top-russian-microbiologist", "urlToImage": null, "publishedAt": "2020-04-24T13:42:15Z", "content": null}, {"source": {"id": null, "name": "Businessinsider.in"}, "author": "Aylin Woodward", "title": "5 young New Yorkers with mild COVID-19 were recently hospitalized with strokes. Doctors say the coronavirus ca - Business Insider India", "description": "Although the coronavirus is primarily a respiratory disease that affects the lungs, it can cause heart, kidney, and brain problems. Doctors have reported blood", "url": "https://www.businessinsider.in/science/news/5-young-new-yorkers-with-mild-covid-19-were-recently-hospitalized-with-strokes-doctors-say-the-coronavirus-can-cause-blood-clots-/articleshow/75355741.cms", "urlToImage": null, "publishedAt": "2020-04-24T13:32:00Z", "content": "Doctors treating COVID-19\r\n patients have begun to document ways in which the disease impacts far more than just the lungs.\r\nExperts have reported kidney issues, heart problems, and more recently, blood clots appearing in various parts of patients' bodies. Su… [+4046 chars]"}]}