{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "That spots and flashes in your vision might be due to this type of migraine - Times of India", "description": "But not all kind of migraines are accompanied by headaches. Sometimes it is painless and involves visual disturbanc", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/that-spots-and-flashes-in-your-vision-might-be-due-to-this-type-of-migraine/articleshow/75494413.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-75494560,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-699370/75494560.jpg", "publishedAt": "2020-05-02T01:41:14Z", "content": "Those who have migraines know how difficult it is to deal with the situation. The throbbing or the pulsing sensation usually experienced on one side of the head can interfere with your daily activity. But not all kind of migraines are accompanied by headaches… [+1945 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Can a coronavirus vaccine be fast-tracked? - ABC 10 News", "description": "Can a coronavirus vaccine be fast-tracked?", "url": "https://www.youtube.com/watch?v=nw7z7V7JMhY", "urlToImage": "https://i.ytimg.com/vi/nw7z7V7JMhY/maxresdefault.jpg", "publishedAt": "2020-05-02T01:24:20Z", "content": null}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "AFP", "title": "Blood pressure medicines don't raise COVID-19 risk: Research - Deccan Herald", "description": "Blood pressure medicines do not increase the risk of COVID-19 infection nor do they increase the risk of becoming seriously ill with the disease, three major studies said Friday, positive news for the millions of people who take them. Follow latest updates on…", "url": "https://www.deccanherald.com/science-and-environment/blood-pressure-medicines-dont-raise-covid-19-risk-research-832541.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/article_images/2020/05/02/Allopathic%20medicine-min-1588373030.jpg", "publishedAt": "2020-05-01T22:43:50Z", "content": "Blood pressure medicines do not increase the risk of COVID-19 infection nor do they increase the risk of becoming seriously ill with the disease, three major studies said Friday, positive news for the millions of people who take them.\r\nFollow latest updates o… [+2768 chars]"}, {"source": {"id": null, "name": "Indianewengland.com"}, "author": null, "title": "COVID-19 vaccine may take at least 9 months: Bill Gates - India New England", "description": "San Francisco– While it appears that only a COVID-19 vaccine may take us back to normal, its development may take at least nine months to two years, billionaire philanthropist Bill Gates has …", "url": "https://indianewengland.com/2020/05/covid-19-vaccine-may-take-at-least-9-months-bill-gates/", "urlToImage": "https://indianewengland.com/wp-content/uploads/2019/09/modi-e1569519354477.png", "publishedAt": "2020-05-01T19:03:26Z", "content": "San Francisco– While it appears that only a COVID-19 vaccine may take us back to normal, its development may take at least nine months to two years, billionaire philanthropist Bill Gates has said.\r\nEven though several drugs are also being tested to treat COVI… [+2067 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Caitlin O'Kane", "title": "\"COVID toes\" and other skin symptoms may be a sign of coronavirus - CBS News", "description": "\"I have seen more toes in the past two weeks in my clinic than I have in my entire previous career combined,\" one dermatologist tells CBS News.", "url": "https://www.cbsnews.com/news/covid-toes-coronavirus-symptom-frosbite-skin/", "urlToImage": "https://cbsnews2.cbsistatic.com/hub/i/r/2020/04/30/15c25e4a-b4bc-4e01-ab9d-1131498b4e81/thumbnail/1200x630g8/6b15d4c71e8434bdf51d4ffebbad2ae2/screen-shot-2020-04-30-at-1-31-23-pm.png", "publishedAt": "2020-05-01T18:32:43Z", "content": "There is still much to learn about the novel coronavirus, including a wide range of symptoms that appears to be expanding. Common symptoms of the respiratory illness include fever, cough, shortness of breath and chills, but some doctors have reported less obv… [+5134 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "IANS", "title": "In US, coronavirus will be inescapable for at least 18-24 months: Report - Livemint", "description": "The coronavirus cases increased to 1,070,032 with over 63,000 deaths in the US, according to Johns Hopkins University.'Authorities should plan for the worst-case scenario, which involves a large second peak of cases in the fall of 2020,' says Minnesota-based …", "url": "https://www.livemint.com/news/world/in-us-coronavirus-will-be-inescapable-for-at-least-18-24-months-report-11588357292481.html", "urlToImage": "https://images.livemint.com/img/2020/05/01/600x338/931ee0ccd4f84a96bb44e0e854554180-931ee0ccd4f84a96bb44e0e854554180-1_1588357722191_1588357748343.jpg", "publishedAt": "2020-05-01T18:31:57Z", "content": "Washington: As the US battles the unabated rise of coronavirus cases as well as deaths, a new study from Minnesota-based Center for Infectious Disease Research and Policy (CIDRAP) has said that COVID-19 virus may well last 18 to 24 months, especially given th… [+3561 chars]"}, {"source": {"id": null, "name": "Nationalheraldindia.com"}, "author": "IANS", "title": "New genes linked to severe childhood speech disorder discovered - National Herald", "description": "Researchers have discovered nine new genes linked to the most severe type of childhood speech disorder (CAS) -- apraxia, in which a child has difficulty making accurate movements when speaking.", "url": "https://www.nationalheraldindia.com/health/new-genes-linked-to-severe-childhood-speech-disorder-discovered", "urlToImage": "https://gumlet.assettype.com/nationalherald%2F2019-02%2F04f64b50-47eb-4a17-aea5-5119eb2dab90%2Fgenes.jpg?rect=0%2C72%2C1920%2C1008&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2020-05-01T18:19:38Z", "content": "The genetic variations were caused by spontaneously and not inherited from their parents, the study, published in the journal Neurology, said.\r\nAccording to the researchers, one in 1,000 children has apraxia, and despite intensive investigation, the genetic o… [+352 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Sanchita Sharma", "title": "India must consider ways to get access to remdesivir: Nirmal K Ganguly - Hindustan Times", "description": "Remdesivir is an experimental antiviral drug developed by the US-based pharma major Gilead Sciences. It failed in trials against the Ebola virus and was found to have limited effects among patients in Wuhan, China, where the illness was first detected last ye…", "url": "https://www.hindustantimes.com/india-news/india-must-consider-ways-to-get-access-to-remdesivir-nirmal-k-ganguly/story-aFjSJwEpEeudDzZWLfsrcK.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/05/01/Pictures/_f20ba798-8bd6-11ea-8f61-783f666b6086.jpg", "publishedAt": "2020-05-01T18:18:32Z", "content": "The antiviral drug, remdesivir, emerged as the first successful treatment against the coronavirus disease (Covid-19) after a US government-funded trial on 1,063 people found it could effectively block the virus and boost recovery. “The data shows remdesivir h… [+4429 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Mayo Clinic Q&A podcast: Cancer treatment during the COVID-19 pandemic - Mayo Clinic", "description": "Because cancer treatments can weaken the immune system, cancer patients are at increased risk of complications from COVID-19. Despite these concerns, cancer ...", "url": "https://www.youtube.com/watch?v=xmCbVl_Gnl8", "urlToImage": "https://i.ytimg.com/vi/xmCbVl_Gnl8/hqdefault.jpg", "publishedAt": "2020-05-01T18:06:17Z", "content": null}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Roni Caryn Rabin", "title": "What Is ‘Covid Toe’? Maybe a Strange Sign of Coronavirus Infection - The New York Times", "description": "Dermatologists say the lesions should prompt testing for the virus, even though many patients have no other symptoms.", "url": "https://www.nytimes.com/2020/05/01/health/coronavirus-covid-toe.html", "urlToImage": "https://static01.nyt.com/images/2020/04/30/science/30VIRUS-COVIDTOE/30VIRUS-COVIDTOE-facebookJumbo.jpg", "publishedAt": "2020-05-01T18:02:24Z", "content": "Before the coronavirus outbreak, Dr. Lindy Fox, a dermatologist in San Francisco, used to see four or five patients a year with chilblains painful red or purple lesions that typically emerge on fingers or toes in the winter.\r\nOver the past few weeks, she has … [+6949 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Italy's Tally of Daily Covid-19 Deaths Dips With 269 New Fatalities, 1,965 Fresh Cases - News18", "description": "The total death toll since the outbreak came to light on Feb. 21 now stands at 28,236, the agency said, the second highest in the world after that of the United States.", "url": "https://www.news18.com/news/world/italys-tally-of-daily-covid-19-deaths-dips-with-269-new-fatalities-1965-fresh-cases-2601811.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/04/1587381427_nurse-italy.jpg", "publishedAt": "2020-05-01T17:57:46Z", "content": "Deaths from the COVID-19 epidemic in Italy climbed by 269 on Friday, down from 285 the day before, the Civil Protection Agency said, while the daily tally of new infections stood at 1,965 against 1,872 on Thursday.\r\nThe total death toll since the outbreak cam… [+758 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "IANS", "title": "Not disinfecting your phones? Mobiles may be 'Trojan horses' for Covid-19 - Livemint", "description": "According to the researchers, community transmission could occur when an infected person touched their phone and then a pole on a bus which was grasped by an elderly person.Mobile devices were 'five-star hotels with premium heated spas, free buffet for microb…", "url": "https://www.livemint.com/technology/tech-news/not-disinfecting-your-phones-mobiles-may-be-trojan-horses-for-covid-19-11588337257574.html", "urlToImage": "https://images.livemint.com/img/2020/05/01/600x338/AFP_1Q05YA_1584596633859_1588350318937.jpg", "publishedAt": "2020-05-01T16:25:38Z", "content": "Sydney: Are you disinfecting your phone? If not, do it now. Mobile phones could be acting as 'Trojan horses' for coronavirus, warn researchers, urging billions of users worldwide to decontaminate their devices daily.While all the studies predate the current p… [+2895 chars]"}, {"source": {"id": null, "name": "Businessinsider.in"}, "author": "Aaron Holmes", "title": "Millions of people have used this app to log their COVID-19 symptoms — and data suggests the set of symptoms g - Business Insider India", "description": "Nearly 3.5 million people are using an app daily to report whether they're experiencing symptoms of COVID-19. The Covid Symptom Tracker app, built by researchers", "url": "https://www.businessinsider.in/tech/news/millions-of-people-have-used-this-app-to-log-their-covid-19-symptoms-and-data-suggests-the-set-of-symptoms-governments-initially-warned-about-was-too-narrow/articleshow/75495815.cms", "urlToImage": "https://www.businessinsider.in/photo/75495815/millions-of-people-have-used-this-app-to-log-their-covid-19-symptoms-and-data-suggests-the-set-of-symptoms-governments-initially-warned-about-was-too-narrow.jpg?imgsize=204048", "publishedAt": "2020-05-01T16:25:00Z", "content": "As governments prepare to lift COVID-19 lockdowns across the globe, real-time data from an app with millions of users could provide a critical tool to help policymakers understand the spread of the virus.\r\nNearly 3.5 million people have been using the Covid S… [+2166 chars]"}, {"source": {"id": null, "name": "Healthissuesindia.com"}, "author": "Kerean Watts", "title": "herpes - Hyderus Cyf", "description": "Health issues in India", "url": "https://www.healthissuesindia.com/tag/herpes/", "urlToImage": "https://www.healthissuesindia.com/wp-content/uploads/2020/05/53228323_s.jpg", "publishedAt": "2020-05-01T16:07:44Z", "content": "For some, herpes is a badge of shame. However, there is no need for this to be the case. Herpes, in fact, is relatively common. Globally, there are billions of people living with the diseases according to research by the University of Bristol, the World Healt… [+83 chars]"}, {"source": {"id": null, "name": "Un.org"}, "author": null, "title": "Vaccine bottlenecks from COVID lockdown put children's lives at stake: UNICEF - UN News", "description": "Help is needed urgently to distribute vaccines worldwide amid dramatic shortages because of COVID-19 restrictions, the UN Children’s Fund (UNICEF) said on Friday. It has warned that youngsters’ lives “are at stake” owing to the dramatic decline in commercial …", "url": "https://news.un.org/en/story/2020/05/1063002", "urlToImage": "https://global.unitednations.entermediadb.net/assets/mediadb/services/module/asset/downloads/preset/Libraries/Production+Library/01-05-2020-UNICEF-Venezuela-measles.jpg/image770x420cropped.jpg", "publishedAt": "2020-05-01T15:49:16Z", "content": "Governments, the private sector, the airline industry, and others have been approached to free up freight space at an affordable cost, and to work with us to find ways around the transport disruptions we face, said UNICEF spokesperson Marixie Mercado.\r\nCompou… [+2891 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Why BAME people may be more at risk from coronavirus - Guardian News", "description": "NHS staff from black, Asian and minority ethnic backgrounds may be given roles away from the frontline under plans to reduce their disproportionately high de...", "url": "https://www.youtube.com/watch?v=XPF35H9RLNE", "urlToImage": "https://i.ytimg.com/vi/XPF35H9RLNE/maxresdefault.jpg", "publishedAt": "2020-05-01T15:28:47Z", "content": "NHS staff from black, Asian and minority ethnic backgrounds may be given roles away from the frontline under plans to reduce their disproportionately high death rate from Covid-19. The Guardian revealed last week that minority groups were over-represented by … [+436 chars]"}, {"source": {"id": null, "name": "Biospace.com"}, "author": "Gail Dutton", "title": "Geneius Develops Off-the-Shelf T Cell Therapy Targeting SARS-CoV-2 - BioSpace", "description": "The assumption is that by increasing the number of antigen-specific T cells in the body, the patient’s immune system can overwhelm the SARS-CoV-2 virus, halting the disease.", "url": "https://www.biospace.com/article/geneius-develops-off-the-shelf-t-cell-therapy-targeting-sars-cov-2/", "urlToImage": "https://www.biospace.com/getasset/4eb2bdd0-5f6e-4649-97af-54124a4db171/;w=625;h=350", "publishedAt": "2020-05-01T15:03:52Z", "content": "Geneius Biotechnology is developing T cells as a quasi-personalized, off-the-shelf, therapy and preventive measure against COVID-19. The assumption is that by increasing the number of antigen-specific T cells in the body, the patients immune system can overwh… [+4762 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "Trending Desk", "title": "Study Claims Meat-eaters Have Better Mental Health Than Vegetarians - News18", "description": "The scientists at the University of Alabama reviewed 18 studies with more than 160,000 people to examine the relationship between meat-eaters and their mental condition.", "url": "https://www.news18.com/news/lifestyle/study-claims-meat-eaters-have-better-mental-health-than-vegetarians-2601593.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2018/08/meat_AFP2.jpg", "publishedAt": "2020-05-01T14:46:37Z", "content": "A group of US-based researchers claims in a new study that meat consumers are less likely to be depressed when compared with vegetarians and vegans.\r\nThe scientists at the University of Alabama reviewed 18 studies with more than 160,000 people to examine the … [+1885 chars]"}, {"source": {"id": null, "name": "Medicinenet.com"}, "author": null, "title": "ECMO: Technology That Might Help COVID Patients When Ventilators Can't - MedicineNet", "description": "Many people who are seriously ill with COVID-19 end up on ventilators to help them breathe, but sometimes, even ventilators aren't enough. That's when a device called ECMO may help.", "url": "https://www.medicinenet.com/script/main/art.asp?articlekey=231035", "urlToImage": "https://images.medicinenet.com/images/facebook/medicinenet/fb-mnet-default.jpg", "publishedAt": "2020-05-01T14:30:47Z", "content": "By Serena GordonHealthDay ReporterFRIDAY, May 1, 2020 (HealthDay News) -- Many people who are seriously ill with COVID-19 end up on ventilators to help them breathe, but sometimes, even ventilators aren't enough. That's when a device called ECMO may help.\r\nEC… [+3661 chars]"}, {"source": {"id": null, "name": "Weforum.org"}, "author": "Sam Leakey, World Economic Forum", "title": "A leading COVID-19 vaccine scientist answers our questions - World Economic Forum", "description": "After warning of the risks of a global pandemic at Davos in 2019, Professor Robin Shattock shares insights on his effort to develop a vaccine against COVID-19.", "url": "https://www.weforum.org/agenda/2020/05/covid19-vaccine-researcher-questions/", "urlToImage": "https://assets.weforum.org/article/image/responsive_medium_18yDUxiZbizvaM49NP_wQ5Hdou0aFIePk4J4vjqs39k.jpg", "publishedAt": "2020-05-01T14:19:23Z", "content": "<ul><li>An innovative approach to COVID-19 vaccine development using RNA offers advantages in speed and scalability, if tests prove successful.</li><li>Although effective vaccines may be identified in 12 to 18 months, it could take significantly longer before… [+9613 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "IANS", "title": "Hangover in morning? Drink plant extracts to relieve symptoms - India TV News", "description": "Various natural remedies have been recommended to ease hangover symptoms, but there is as yet no strong scientific evidence for their use.", "url": "https://www.indiatvnews.com/lifestyle/news-hangover-morning-drink-plant-extracts-symptoms-613202", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2020/05/hangover-1588337141.jpg", "publishedAt": "2020-05-01T13:27:29Z", "content": "Image Source : INSTAGRAMThe plant extracts included Barbados cherry (Acerola), prickly pear, ginkgo Biloba, willow and ginger root.\r\nIf you are suffering from headache and nausea after a drinking fiesta with friends last evening, read this carefully. A plant … [+2661 chars]"}, {"source": {"id": null, "name": "Financialexpress.com"}, "author": "FE Online", "title": "Scientists develop fast, sensitive antibody blood test for COVID-19 - The Financial Express", "description": "To help identify people with current or past exposure to SARS-CoV-2, the researchers, including those from Southern Medical University in China, wanted to develop a fast, sensitive antibody test.", "url": "https://www.financialexpress.com/lifestyle/health/scientists-develop-fast-sensitive-antibody-blood-test-for-covid-19/1945736/", "urlToImage": "https://images.financialexpress.com/2020/05/covid-19-blood-test.jpg", "publishedAt": "2020-05-01T13:09:38Z", "content": "Scientists have developed a quick, sensitive test for antibodies against the novel coronavirus in human blood that could help doctors track a person’s exposure to COVID-19, as well as confirm suspected cases that tested negative by other methods.\r\nBecause COV… [+2098 chars]"}, {"source": {"id": null, "name": "Medicaldialogues.in"}, "author": "Hina Zahid", "title": "Smoking tobacco may increase lung entry points for COVID-19 virus - Medical Dialogues", "description": "Researchers at Baylor College of Medicine, the University of South Carolina and other institutions...", "url": "https://medicaldialogues.in/pulmonology/news/smoking-tobacco-may-increase-lung-entry-points-for-covid-19-virus-65361", "urlToImage": "https://medicaldialogues.in/h-upload/2020/04/24/1200x630_127780-lung.jpg?width=1200&height=630", "publishedAt": "2020-05-01T12:45:30Z", "content": "Researchers at Baylor College of Medicine, the University of South Carolina and other institutions have identified tobacco smoking as a potential risk factor for infection of the COVID-19 virus.The new study has been published in American Journal of Respirato… [+1920 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Livemint", "title": "What coronavirus research to trust? Rush to publish creates confusion - Livemint", "description": "Health-policy experts and a weary public are struggling to make sense of it all. .Early research released in the middle of a health crisis can result in more confusion than clarification", "url": "https://www.livemint.com/news/world/what-coronavirus-research-to-trust-rush-to-publish-creates-confusion-11588335651408.html", "urlToImage": "https://images.livemint.com/img/2020/05/01/600x338/virus1_1581012107602_1588336573833.jpg", "publishedAt": "2020-05-01T12:42:32Z", "content": "NEW YORK :\r\nOn April 22, researchers at Northwell Health, a major hospital system in the New York area, reported a stunning 88% death rate among Covid-19 patients on ventilators. The number was published in the prestigious Journal of the American Medical Asso… [+9375 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ETtech", "title": "How AI steered doctors toward a possible Coronavirus treatment - ETtech.com", "description": "Many AI researchers and data scientists around the world have turned their attention to Covid-19, hoping they can accelerate efforts to understand how it is spreading, treat people who have it and find a vaccine.", "url": "https://tech.economictimes.indiatimes.com/news/technology/how-ai-steered-doctors-toward-a-possible-coronavirus-treatment/75491573", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-75491573,imgsize-254859,width-800,height-434,overlay-ettech/how-ai-steered-doctors-toward-a-possible-coronavirus-treatment.jpg", "publishedAt": "2020-05-01T12:27:00Z", "content": "By Cade MetzIn late January, researchers at BenevolentAI, an artificial intelligence startup in central London, turned their attention to the coronavirus.\r\nWithin two days, using technologies that can scour scientific literature related to the virus, they pin… [+6291 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "PTI", "title": "Personal protective equipment used by COVID-19 medical staff may cause serious skin injuries: Study - Deccan Herald", "description": "More than 40 per cent of medical staff treating COVID-19-infected patients may experience serious skin injury related to the use of personal protective equipment such as masks, goggles, face shields, and protective gowns, according to a study. According to th…", "url": "https://www.deccanherald.com/international/personal-protective-equipment-used-by-covid-19-medical-staff-may-cause-serious-skin-injuries-study-832312.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/article_images/2020/05/01/PPE-1588334755.jpg", "publishedAt": "2020-05-01T12:01:03Z", "content": "More than 40 per cent of medical staff treating COVID-19-infected patients may experience serious skin injury related to the use of personal protective equipment such as masks, goggles, face shields, and protective gowns, according to a study.\r\nAccording to t… [+3097 chars]"}, {"source": {"id": null, "name": "Gametransfers.com"}, "author": "macappsworld.com", "title": "The coronavirus vaccine can take two years for making it a full-fledged cure- sources from the lab - GameTransfers", "description": "As every part of the world is scrambling to get back on their feet, all the while trying to curtail the pandemic. It is an uphill task for the researchers and scientists to work out a cure so fast. It has to be effective enough to provide long term b", "url": "https://gametransfers.com/the-coronavirus-vaccine/", "urlToImage": "https://gametransfers.com/wp-content/uploads/2020/05/coronavirus-vaccine.jpg", "publishedAt": "2020-05-01T11:48:00Z", "content": "As every part of the world is scrambling to get back on their feet, all the while trying to curtail the pandemic. It is an uphill task for the researchers and scientists to work out a cure so fast. It has to be effective enough to provide long term benefits t… [+3756 chars]"}, {"source": {"id": null, "name": "Weforum.org"}, "author": "Johnny  Wood", "title": "These are the ways doctors think coronavirus can attack the body - World Economic Forum", "description": "A study of more than 400 hospitalized cases of COVID-19 in Wuhan, China, found almost one fifth of patients suffered cardiac injuries from the disease.", "url": "https://www.weforum.org/agenda/2020/05/covid-19-lungs-heart-blood-brain/", "urlToImage": "https://assets.weforum.org/article/image/responsive_medium_VXtQWvmg_j4d1aC_lsP6LSWAOZk8L-gZOmcp3c48I4A.JPG", "publishedAt": "2020-05-01T10:27:49Z", "content": "<ul><li>The coronavirus pandemic has impacted millions of people in countries around the world.</li><li>Studies show COVID-19 can attack organs like the heart and brain, as well as the respiratory system.</li><li>A growing body of research is revealing new in… [+4876 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Testing not enough, scientists examine sewage to gauge spread of coronavirus - India Today", "description": "Scientists are turning to wastewater for an indication of how many people have been infected by the SARS-CoV-2 coronavirus. \"Sewage-based epidemiology is an indication of what may be missed by case-based surveillance,\" an expert said.", "url": "https://www.indiatoday.in/science/story/sewage-coronavirus-surveillance-1673298-2020-05-01", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202005/2020-04-04T111226Z_431468955_R_0-647x363.png?YjDHc2jnJtsn5g7TYHFMp7dYsnKe.SI2", "publishedAt": "2020-05-01T10:19:06Z", "content": "Given that most Indians are unlikely to be tested for Covid-19, scientists are taking a cue from the country's surveillance programme for polio and turning to sewage to get a clearer snapshot of how many people are infected with the coronavirus.\r\nWastewater e… [+6718 chars]"}, {"source": {"id": null, "name": "China.org.cn"}, "author": "", "title": "Sri Lanka's health minister warns of dengue virus as rains set in - China.org.cn", "description": null, "url": "http://www.china.org.cn/world/Off_the_Wire/2020-05/01/content_75999193.htm", "urlToImage": null, "publishedAt": "2020-05-01T09:56:37Z", "content": "COLOMBO, May 1 (Xinhua) -- Sri Lanka's Health Minister Pavithra Wanniarachchi Friday warned the public against a dengue outbreak due to expected monsoonal rains across the island country.\r\nThe government information department, in a statement quoting Wanniara… [+1292 chars]"}, {"source": {"id": null, "name": "Telanganatoday.com"}, "author": "Telangana Today", "title": "COVID-19 triggers depletion of immune system cells: Study - Telangana Today", "description": "Beijing: COVID-19 patients have significantly low counts of a cell type that plays a crucial role in immune response, with lower numbers of these cells indicating more severe disease, according to a study whose findings may lead to the development of new ther…", "url": "https://telanganatoday.com/covid-19-triggers-depletion-of-immune-system-cells-study", "urlToImage": "https://cdn.telanganatoday.com/wp-content/uploads/2020/05/Coronavirus.jpg", "publishedAt": "2020-05-01T09:09:08Z", "content": "Beijing: COVID-19 patients have significantly low counts of a cell type that plays a crucial role in immune response, with lower numbers of these cells indicating more severe disease, according to a study whose findings may lead to the development of new ther… [+2832 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": null, "title": "Coronavirus Outbreak: Governments knew a pandemic was a threat – here's why they weren't better prepared - Firstpost", "description": "Every country needs to understand and learn from how others are analysing, planning and have dealt with similar emergencies in the past.", "url": "https://www.firstpost.com/health/coronavirus-outbreak-governments-knew-a-pandemic-was-a-threat-heres-why-they-werent-better-prepared-8320321.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/05/file-20200427-145544-1beia09-2.jpg", "publishedAt": "2020-05-01T06:24:51Z", "content": null}, {"source": {"id": null, "name": "Sciencedaily.com"}, "author": null, "title": "Scientists regenerate neurons in mice with spinal cord injury and optic nerve damage - Science Daily", "description": "Each year thousands of patients face life-long losses in sensation and motor function from spinal cord injury and related conditions in which axons are badly damaged or severed. New research in mice shows, however, that gains in functional recovery from these…", "url": "https://www.sciencedaily.com/releases/2020/04/200430113041.htm", "urlToImage": null, "publishedAt": "2020-05-01T02:54:00Z", "content": "Like power lines in an electrical grid, long wiry projections that grow outward from neurons -- structures known as axons -- form interconnected communication networks that run from the brain to all parts of the body. But unlike an outage in a power line, whi… [+4129 chars]"}, {"source": {"id": null, "name": "Www.rfi.fr"}, "author": "RFI", "title": "Chinese firm 'ready to mass produce' experimental coronavirus vaccine - RFI English", "description": "A Chinese pharmaceutical company carrying out human trials for a coronavirus vaccine says it’s ready to start producing its product on a mass scale.", "url": "http://www.rfi.fr/en/science-and-technology/20200430-chinese-firm-ready-to-mass-produce-experimental-coronavirus-vaccine-sinovac-biotech", "urlToImage": "http://s.rfi.fr/media/display/50e98d5a-7e6e-11ea-9c14-005056a98db9/w:1240/p:16x9/2020-04-10T000000Z_254498373_RC2M1G9ZU8TC_RTRMADP_3_HEALTH-CORONAVIRUS-VACCINE.JPG", "publishedAt": "2020-05-01T01:01:42Z", "content": "A Chinese pharmaceutical company carrying out human trials for a coronavirus vaccine says its ready to start producing its product on a mass scale. \r\n Sinovac Biotech  the first company in the world to market a vaccine for the H1N1 swine flu  has claimed grea… [+1411 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "France records lowest Covid-19 weekday death toll rise since end-March - FRANCE 24 English", "description": "The number of people who died of coronavirus infection in France increased by 289 or 1.2 percent to 24,376 on Thursday, the lowest increase on a weekday sinc...", "url": "https://www.youtube.com/watch?v=mDlM02t2nUA", "urlToImage": "https://i.ytimg.com/vi/mDlM02t2nUA/hqdefault.jpg", "publishedAt": "2020-04-30T23:24:56Z", "content": "The number of people who died of coronavirus infection in France increased by 289 or 1.2 percent to 24,376 on Thursday, the lowest increase on a weekday since end March, government data showed. \r\nSubscribe to France 24 now:http://f24.my/youtubeEN\r\nFRANCE 24 l… [+279 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Punjab sees 105 more Covid-19 cases in highest single-day spike - Times of India", "description": "India News: CHANDIGARH: Punjab on Thursday saw 105 new cases of coronavirus, the highest single-day spike, with 87 of them those who returned to the state either .", "url": "https://timesofindia.indiatimes.com/india/punjab-sees-105-more-covid-19-cases-in-highest-single-day-spike/articleshow/75476597.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-75476640,width-1070,height-580,imgsize-63349,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2020-04-30T23:12:48Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Medpagetoday.com"}, "author": "Molly Walker", "title": "HCQ, the Immune System, and COVID-19: Unanswered Questions - MedPage Today", "description": "Experts urge more research, not anecdotal data, prior to widespread use", "url": "https://www.medpagetoday.com/infectiousdisease/covid19/86246", "urlToImage": "https://clf1.medpagetoday.com/media/images/86xxx/86246.jpg", "publishedAt": "2020-04-30T21:30:10Z", "content": "Using hydroxychloroquine (HCQ) to treat COVID-19 has been surrounded by more hype than data, with too little known about how the virus affects the immune system, investigators said.\r\n\"[T]he known and potent immunomodulatory effects of [HCQ and its close cousi… [+4184 chars]"}, {"source": {"id": null, "name": "Boomlive.in"}, "author": "AFP", "title": "No, Aspirin Mixed With Lemon Juice And Honey Will Not Cure COVID-19 - BOOM", "description": "Facebook posts claim that aspirin, lemon juice and honey have been combined to make a home remedy...", "url": "https://www.boomlive.in/world/no-aspirin-mixed-with-lemon-juice-and-honey-will-not-cure-covid-19-7892", "urlToImage": "https://www.boomlive.in/h-upload/2020/04/30/920696-aspirin.jpg", "publishedAt": "2020-04-30T20:56:08Z", "content": "Multiple Facebook posts claim that aspirin, lemon juice and honey have been combined to make a \"home remedy\" for COVID-19 in Italy. The claim is misleading; the World Health Organization (WHO) has warned against self-medicating for COVID-19, saying there is n… [+1844 chars]"}, {"source": {"id": null, "name": "Financialexpress.com"}, "author": "FE Online", "title": "Graded opening of economy needed to protect livelihood: Niti Aayog CEO - The Financial Express", "description": "The Centre on Wednesday gave clear indications that the ongoing nationwide lockdown will be extended beyond May 3 but with \"considerable relaxations\" to people and services in \"many districts\".", "url": "https://www.financialexpress.com/economy/graded-opening-of-economy-needed-to-protect-livelihood-niti-aayog-ceo/1944800/", "urlToImage": "https://images.financialexpress.com/2020/04/1-682.jpg", "publishedAt": "2020-04-30T17:07:54Z", "content": "Advocating strict containment measures in ‘red zones’, Niti Aayog CEO Amitabh Kant on Thursday said the economy should kickstart with full supply chains to protect livelihood of people. The Centre on Wednesday gave clear indications that the ongoing nationwid… [+624 chars]"}, {"source": {"id": null, "name": "Greatandhra.com"}, "author": "GREATANDHRA BUREAU", "title": "Covid-19 May Not Go Away Even After A Vaccine.. - Greatandhra.com", "description": "The debates are going on about Covid-19 and the earliest possibility of getting a vaccine to combat it.", "url": "https://www.greatandhra.com/articles/special-articles/covid-19-may-not-go-away-even-after-a-vaccine-104368", "urlToImage": "https://www.greatandhra.com/newphotos7/Coronavirus-Vaccine1588260686.jpg", "publishedAt": "2020-04-30T15:31:26Z", "content": "The debates are going on about Covid-19 and the earliest possibility of getting a vaccine to combat it. But shockingly, some researchers are saying that the arrival of vaccine may not put a permanent end to the virus. \r\n\"Why the world has imposed lockdown? Is… [+1087 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "Sagar Kulkarni", "title": "Is novel coronavirus killing more men than women? - Deccan Herald", "description": "More men are succumbing to the coronavirus outbreak in India than women. According to the Health Ministry data, of the 1,075 COVID-19 deaths reported across the country, 65% were men, while the remaining 35% were women. For latest updates and live news on cor…", "url": "https://www.deccanherald.com/science-and-environment/is-novel-coronavirus-killing-more-men-than-women-831951.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/article_images/2020/04/30/file79wefyc60kl12qqsx219-1588259920.jpg", "publishedAt": "2020-04-30T15:18:40Z", "content": "More men are succumbing to the coronavirus outbreak in India than women.\r\nAccording to the Health Ministry data, of the 1,075 COVID-19 deaths reported across the country, 65% were men, while the remaining 35% were women.\r\nFor latest updates and live news on c… [+2026 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Riya Baibhawi", "title": "COVID-19: Tigers tested for virus in US, photos break internet - Republic World - Republic World", "description": "Wildlife expert and photographer, Ron Magill shared photographs of samples being collected from tiger’s mouth, nose etc. for coronavirus", "url": "https://www.republicworld.com/entertainment-news/whats-viral/covid-19-tigers-tested-for-coronavirus-in-us-photographs-emerge.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/sjsv2woi5nxsvzzu_1588256316.jpeg?tr=f-jpeg", "publishedAt": "2020-04-30T14:42:54Z", "content": "After a tiger at New York's Bronx Zoo tested positive for COVID-19, scepticism arose about the animals contracting the virus. Amid all this, a series of photographs which show tiger being tested have caught everybody's attention. Taking to Twitter, Wildlife e… [+2067 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "New Reports on Virus in Kids Fuel Uncertainty on Schools - Bloomberg", "description": null, "url": "https://www.bloomberg.com/tosv2.html?vid=&uuid=f0b6c790-8c0f-11ea-a8be-4d542a008af6&url=L25ld3MvYXJ0aWNsZXMvMjAyMC0wNC0zMC9jaGlsZHJlbi13aXRoLWNvcm9uYXZpcnVzLW1heS1iZS1qdXN0LWFzLWluZmVjdGlvdXMtYXMtYWR1bHRz", "urlToImage": null, "publishedAt": "2020-04-30T14:16:12Z", "content": "To continue, please click the box below to let us know you're not a robot."}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Health check: How to cope with stress and anxiety during the pandemic - WFAA", "description": "For people who struggled with anxiety and depression before COVID-19, this can be an especially hard time. Health and wellness reporter Sonia Azad offers som...", "url": "https://www.youtube.com/watch?v=l48BiUk6Q3I", "urlToImage": "https://i.ytimg.com/vi/l48BiUk6Q3I/hqdefault.jpg", "publishedAt": "2020-04-30T13:37:33Z", "content": "For people who struggled with anxiety and depression before COVID-19, this can be an especially hard time. Health and wellness reporter Sonia Azad offers some guidance from a Dallas psychiatrist."}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Should You Stop Having Ice-cream to Prevent Covid-19? This is What the Govt and WHO Say - News18", "description": "In another recent claim that coronavirus spread can be contained by avoiding ice-cream was doing rounds until it was rejected by the PIB.", "url": "https://www.news18.com/news/buzz/should-you-stop-having-ice-cream-to-prevent-covid-19-this-is-what-the-govt-and-who-say-2599899.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/03/You-dont-have-to-be-a-man-to-do-a-mans-jpb-1.jpg", "publishedAt": "2020-04-30T13:34:25Z", "content": "As the contagious coronavirus continues to spread around the world, fake health advise on social media has been seen to be on rise.\r\nAnother recent claim doing the rounds states that the coronavirus spread can be contained by avoiding ice-cream, until the PIB… [+1344 chars]"}, {"source": {"id": null, "name": "Businessinsider.in"}, "author": "Mia Jankowicz", "title": "A rare condition in children, which doctors fear is linked to the coronavirus, has been recorded in around 100 - Business Insider India", "description": "Almost 100 children in 6 countries have been reported infected with a rare condition that doctors suspect could have a connection to the coronavirus, according", "url": "https://www.businessinsider.in/science/news/a-rare-condition-in-children-which-doctors-fear-is-linked-to-the-coronavirus-has-been-recorded-in-around-100-kids-across-6-countries/articleshow/75474598.cms", "urlToImage": "https://www.businessinsider.in/photo/75474598/a-rare-condition-in-children-which-doctors-fear-is-linked-to-the-coronavirus-has-been-recorded-in-around-100-kids-across-6-countries.jpg?imgsize=783960", "publishedAt": "2020-04-30T13:19:00Z", "content": "Around 100 children in 6 countries have been reported as having a rare complication that doctors fear could be related to coronavirus, The Guardian reported. \r\nThe World Health Organization has put its clinical network on alert since UK health officials first… [+2674 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Bloomberg", "title": "Dead coronavirus particles muddy the outcome of covid-19 patient's test result - Livemint", "description": "Coronavirus patients who remain positive weeks after diagnosis may harbor dead virus particles that can’t be distinguished from infectious ones in standard tests, say scientists", "url": "https://www.livemint.com/news/india/dead-coronavirus-particles-muddy-the-outcome-of-test-results-11588250764951.html", "urlToImage": "https://images.livemint.com/img/2020/04/30/600x338/9ab39872-5baf-11ea-9c69-d6eb4bacb74c_1583076698066_1588251088823.jpg", "publishedAt": "2020-04-30T12:56:44Z", "content": "Coronavirus patients who remain positive weeks after diagnosis may harbor dead virus particles that cant be distinguished from infectious ones in standard tests, scientists in South Korea found.The so-called SARS-CoV-2 virus dies one-to-two weeks after infect… [+3318 chars]"}, {"source": {"id": null, "name": "Biospectrumasia.com"}, "author": null, "title": "CEPI invests $3.5M in Clover Australia for COVID-19 vaccine - BSA bureau", "description": "This initial CEPI investment will support Clover Australia in its efforts to initiate a phase 1 clinical trial in Australia", "url": "https://www.biospectrumasia.com/news/37/15879/cepi-invests-3-5m-in-clover-australia-for-covid-19-vaccine.html", "urlToImage": "https://www.biospectrumasia.com/uploads/articles/shutterstock_hcq_1024x686-15879.jpg", "publishedAt": "2020-04-30T12:33:53Z", "content": "This initial CEPI investment will support Clover Australia in its efforts to initiate a phase 1 clinical trial in Australia\r\nNorway based CEPI, the Coalition for Epidemic Preparedness Innovations has announced a ninth worldwide collaboration to develop a COVI… [+2419 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "First pregnancy complications may up risk of future premature birth - Daijiworld.com", "description": null, "url": "https://www.daijiworld.com/404Error.aspx", "urlToImage": null, "publishedAt": "2020-04-30T12:14:17Z", "content": "Daijiworld Residency,Airport Road, Bondel Post,Mangalore - 575 008 \r\n Karnataka IndiaTelephone : +91-824-2982023.General Enquiry: office@daijiworld.com,News &amp; Info : news@daijiworld.com"}, {"source": {"id": null, "name": "Dailyo.in"}, "author": null, "title": "Good news on Covid-19: Drugs, sunshine, vaccine aid in India's war with coronavirus - DailyO", "description": "The India story is looking good as compared to the rest of the world.", "url": "https://www.dailyo.in/variety/coronavirus-in-india-covid-19-hydroxychloroquine-indian-pharmaceuticals-covid-vaccine/story/1/32802.html", "urlToImage": "https://akm-img-a-in.tosshub.com/sites/dailyo/fb_feed_images/story_image/202004/fb_covid-swab-test_r_043020053949.jpg", "publishedAt": "2020-04-30T12:11:18Z", "content": "India emerges among the top in the fight against Covid-19 — from sunshine to the vaccine to the Covid-19 drug, we have it all right here in India.\r\nSome would say, it’s been a dreadful few weeks. Holed up in homes and worrying ourselves sick that the virus co… [+5155 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "The ventilator question: Why Covid-19 patients starve of oxygen - India Today", "description": "A study in China found that 53 per cent Covid-19 patients died of respiratory problems. In many cases, the patients were able to breathe mechanically but the body lacked oxygen.", "url": "https://www.indiatoday.in/coronavirus-outbreak/story/the-ventilator-question-why-covid-19-patients-starve-of-oxygen-1672908-2020-04-30", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202004/Coronavirus_Prague_ICU_AP-PTI-647x363.jpeg?E.abPyKQ_NSVi5_G3pkEtM6ZgpBGlITY", "publishedAt": "2020-04-30T11:48:50Z", "content": "Health experts and authorities maintain that only about 15 per cent of Covid-19 patients actually need hospitalization, treatment in ICU, oxygen supply for breathing or ventilator support. Around 1 out of every 6 people who gets COVID-19 becomes seriously ill… [+4068 chars]"}, {"source": {"id": null, "name": "Medicaldialogues.in"}, "author": "Hina Zahid", "title": "Men have double the death rate compared to women in COVID-19 infection - Medical Dialogues", "description": "It is established that elderly and those with certain pre-existing conditions appear to be at...", "url": "https://medicaldialogues.in/pulmonology/news/men-have-double-the-death-rate-compared-to-women-in-covid-19-infection-65329", "urlToImage": "https://medicaldialogues.in/h-upload/2020/04/11/1200x630_127064-coronavirus.jpg?width=1200&height=630", "publishedAt": "2020-04-30T11:30:16Z", "content": "It is established that elderly and those with certain pre-existing conditions appear to be at greater risk.\r\nAccording to a new study appearing in Frontiers in Public Health,Men are more than twice as likely to die of COVID-19 than women, regardless of age, \r… [+3294 chars]"}, {"source": {"id": null, "name": "Thejakartapost.com"}, "author": "The Jakarta Post", "title": "Men may be 2.5 times more likely to die from COVID-19 than women - The Jakarta Post - Jakarta Post", "description": "Men may be more likely to die from COVID-19 than women, according to new research.", "url": "https://www.thejakartapost.com/life/2020/04/30/men-may-be-25-times-more-likely-to-die-from-covid-19-than-women.html", "urlToImage": "https://img.jakpost.net/c/2020/04/24/2020_04_24_93636_1587701302._large.jpg", "publishedAt": "2020-04-30T11:09:00Z", "content": "New Chinese research has found that men may be more likely to develop a more severe case of COVID-19 and die from the disease than women, although it's still unclear why.\r\nCarried out by doctors at Beijing Tongren Hospital, the new study set out to investigat… [+2926 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus outbreak: How a secretive organization helped China hoard PPE - Global News", "description": "Before alerting the public to the danger posed by the novel coronavirus, Beijing quietly began gathering personal protective equipment (PPE), such as N95 mas...", "url": "https://www.youtube.com/watch?v=VwTCRygJi9M", "urlToImage": "https://i.ytimg.com/vi/VwTCRygJi9M/maxresdefault.jpg", "publishedAt": "2020-04-30T11:00:15Z", "content": null}, {"source": {"id": null, "name": "Livescience.com"}, "author": "Laura Geggel", "title": "Are 'covid toes' a real symptom of the coronavirus? - Livescience.com", "description": "", "url": "https://www.livescience.com/frostbite-toes-covid-19.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/oDTNRUusqWcgXatU9e9fpY-1200-80.jpg", "publishedAt": "2020-04-30T11:00:00Z", "content": "A frostbite\r\n-like rash on a person's toes might be a symptom of the new coronavirus\r\n, according to anecdotal evidence from dermatologists around the world. \r\nHowever, research is needed to determine whether this peculiar rash is truly caused by  COVID-19.\r\n… [+3421 chars]"}, {"source": {"id": null, "name": "Socialnews.xyz"}, "author": null, "title": "9/11 rescuers have elevated levels of fatty liver disease: Study - SocialNews.XYZ", "description": "New York, April 30 (SocialNews.XYZ) Researchers have found that toxin exposure appears to have contributed to dramatically higher rates of fatty liver disease among first responders, who were at the World Trade Center site after... - Social News XYZ", "url": "https://www.socialnews.xyz/2020/04/30/9-11-rescuers-have-elevated-levels-of-fatty-liver-disease-study/", "urlToImage": "https://i0.wp.com/www.socialnews.xyz/wp-content/uploads/2019/01/29/6d195ba61d7c245fcabbae40819257da.jpg?fit=1999%2C902&quality=90&zoom=1&ssl=1", "publishedAt": "2020-04-30T10:44:16Z", "content": "Home » General » Study » 9/11 rescuers have elevated levels of fatty liver disease: Study\r\nNew York, April 30 (SocialNews.XYZ) Researchers have found that toxin exposure appears to have contributed to dramatically higher rates of fatty liver disease among fir… [+2128 chars]"}, {"source": {"id": null, "name": "Theprint.in"}, "author": "Mohana Basu", "title": "CSIR to test sepsis drug in asymptomatic Covid patients and those who have recovered - ThePrint", "description": "CSIR will launch trials to see if sepsis drug can stop Covid-19 from progressing in asymptomatic patients & if it can prevent it from redeveloping in recovered patients.", "url": "https://theprint.in/health/csir-to-test-sepsis-drug-in-asymptomatic-covid-patients-and-those-who-have-recovered/411813/", "urlToImage": "https://d2c7ipcroan06u.cloudfront.net/wp-content/uploads/2020/04/Bloodsmaples.jpg", "publishedAt": "2020-04-30T10:30:43Z", "content": "New Delhi: Scientists at the Council of Scientific and Industrial Research (CSIR)will launch two separate trials to test if a drug used to treat sepsis and liver cirrhosis can stop Covid-19 infection from progressing in asymptomatic patients and whether the s… [+3317 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "The Hindu", "title": "Work-related stress may up risk for peripheral artery disease - The Hindu", "description": "The study is published in the Journal of the American Heart Association and researchers evaluated the records of 139,000 men and women for the findings", "url": "https://www.thehindu.com/sci-tech/health/work-related-stress-may-up-risk-for-peripheral-artery-disease/article31472062.ece", "urlToImage": "https://www.thehindu.com/sci-tech/health/oi2hcw/article31472061.ece/ALTERNATES/LANDSCAPE_615/upset-26815021920", "publishedAt": "2020-04-30T10:20:56Z", "content": "People who reported work-related stress were more likely to be hospitalised for peripheral artery disease compared to those who did not report work-related stress, according to a study.\r\nPeripheral artery disease, or PAD, is a cardiovascular disease that occu… [+2240 chars]"}, {"source": {"id": null, "name": "Dailypioneer.com"}, "author": "The Pioneer", "title": "Smart contact lenses developed to diagnose, treat diabetes - Daily Pioneer", "description": "A team of researchers has developed wirelessly driven 'smart contact lens' technology that can detect diabetes and further treat diabetic retinopathy - a common visual health condition associated with the disease - just by wearing them.\n\nThe team from Pohang …", "url": "https://www.dailypioneer.com/2020/pioneer-health/smart-contact-lenses-developed-to-diagnose--treat-diabetes.html", "urlToImage": "https://www.dailypioneer.com/uploads/2020/story/images/big/smart-contact-lenses-developed-to-diagnose--treat-diabetes-2020-04-30.jpg", "publishedAt": "2020-04-30T09:44:32Z", "content": "A team of researchers has developed wirelessly driven 'smart contact lens' technology that can detect diabetes and further treat diabetic retinopathy - a common visual health condition associated with the disease - just by wearing them.\r\nThe team from Pohang … [+2136 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Lower Hygiene Levels, Higher Smoking Habits: Here's Why Men Fare Worse with Covid-19 Than Women - News18", "description": "In Italy, an analysis of more than 127,700 COVID-19 cases found that 52.9% of all infected people were men and 47.1% women. Among Italy’s first 14,860 deaths, almost 68% were men.", "url": "https://www.news18.com/news/buzz/lower-hygiene-levels-higher-smoking-habits-heres-why-men-fare-worse-with-covid-19-than-women-2599429.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/04/1587998950_women.jpg", "publishedAt": "2020-04-30T09:34:41Z", "content": "London: Death and infection tolls from the COVID-19 pandemic spreading around the world point to men being more likely than women to contract the disease and to suffer severe or critical complications if they do.\r\nHere are some insights from research and expe… [+2598 chars]"}, {"source": {"id": null, "name": "Bloombergquint.com"}, "author": "Andrew Davis", "title": "Children Don’t Pass Covid-19 to Adults, Report Indicates - BloombergQuint", "description": "There doesn’t appear to be cases of a child passing Covid-19 to an adult, according to a new report.", "url": "https://www.bloombergquint.com/coronavirus-outbreak/children-don-t-pass-covid-19-to-adults-report-indicates", "urlToImage": "https://images.assettype.com/bloombergquint%2F2020-04%2F08d5ecc7-f8eb-48aa-b3f7-fe70af6a7664%2F361015659.jpg?rect=0%2C1344%2C9504%2C4990&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2020-04-30T09:32:38Z", "content": ""}, {"source": {"id": null, "name": "Expresshealthcare.in"}, "author": "EH News Bureau", "title": "Goblet, ciliated cells in nose likely COVID-19 entry points - Express Healthcare", "description": "Identification of these cells by researchers involved in Human Cell Atlas Lung Biological Network could help explain high transmission rate of virus", "url": "https://www.expresshealthcare.in/news/goblet-ciliated-cells-in-nose-likely-covid-19-entry-points/419604/", "urlToImage": "https://cdn.expresshealthcare.in/wp-content/uploads/2020/03/04162320/GettyImages-1208623485-e1583319314816.jpg", "publishedAt": "2020-04-30T08:12:00Z", "content": "Identification of these cells by researchers involved in Human Cell Atlas Lung Biological Network could help explain high transmission rate of virus\r\nScientists, including experts at Newcastle University, have discovered that goblet and ciliated cells in the … [+4702 chars]"}, {"source": {"id": null, "name": "Biospectrumindia.com"}, "author": "SCI Knowledge Interlinks", "title": "IIT-G, Hester Biosciences to develop COVID-19 vaccine - BSI bureau", "description": "BioSpectrum is an integrated B2B media platform for the healthcare and bioscience industry in India and Asia.", "url": "https://www.biospectrumindia.com/", "urlToImage": "https://www.biospectrumindia.com/bundles/interlinksapp/app/app-asia/images/logo1.jpg", "publishedAt": "2020-04-30T07:30:01Z", "content": "Ashirwad Bungalow, First floor,36/A/2, S.No. 270, Pallod Farms, Near Bank of Baroda, Baner Road, Pune, Maharashtra, India 411045\r\nMob : +91-9579069369"}, {"source": {"id": null, "name": "Theprint.in"}, "author": "Max Nisen", "title": "What a second wave of Covid-19 could look like - ThePrint", "description": "One model of Covid-19’s future transmission dynamics suggests the size of outbreaks will vary drastically depending on seasonality and duration of people’s immunity.", "url": "https://theprint.in/health/what-a-second-wave-of-covid-19-could-look-like/411712/", "urlToImage": "https://d2c7ipcroan06u.cloudfront.net/wp-content/uploads/2020/04/Test-.jpg", "publishedAt": "2020-04-30T06:43:59Z", "content": "The world is beginning to loosen restrictions that have been put in place to limit the spread of Covid-19. Leaders of countries, states and cities are finding they have little choice but to return to economic activity well before an effective vaccine or treat… [+6044 chars]"}, {"source": {"id": "vice-news", "name": "Vice News"}, "author": "David Gilbert", "title": "Chinese Scientists Find Evidence Coronavirus Can Float in the Air for Hours - VICE", "description": "The research also suggests that virus droplets that have landed on the surface of nurses' PPE could be knocked back into the air.", "url": "https://www.vice.com/en_in/article/akw534/chinese-scientists-find-evidence-coronavirus-can-float-in-the-air-for-hours", "urlToImage": "https://video-images.vice.com/test-uploads/articles/5ea94cabc9d46200989e6959/lede/1588158670727-AP_20057262537937.jpeg?crop=1xw:0.8426xh;0xw,0.1295xh&resize=1200:*", "publishedAt": "2020-04-30T05:22:00Z", "content": "This article originally appeared on VICE US.\r\nResearchers in China who examined how the coronavirus spread through two Wuhan hospitals at the height of the outbreak there have found evidence that it can be transmitted through the air.\r\nThe research was publis… [+3517 chars]"}, {"source": {"id": null, "name": "Kashmirlife.net"}, "author": "KL News Network", "title": "Men are more than twice as likely to die from COVID19 - Kashmir Life", "description": "Srinagar Men and women are equally likely to contract the deadly coronavirus (COVID-19), but men are more than twice as likely to die from the disease as compared to women, warn researchers.", "url": "https://kashmirlife.net/men-are-more-than-twice-as-likely-to-die-from-covid19-231709/", "urlToImage": "https://kashmirlife.net/wp-content/uploads/2020/04/IMG_0486.jpg", "publishedAt": "2020-04-30T05:16:29Z", "content": "Srinagar\r\nMen and women are equally likely to contract the deadly coronavirus (COVID-19), but men are more than twice as likely to die from the disease as compared to women, warn researchers.\r\nThe results, published in the journal Frontiers in Public Health, … [+2918 chars]"}, {"source": {"id": null, "name": "Thenewleam.com"}, "author": "https://www.facebook.com/thenewleam", "title": "Can biodiversity loss lead to more infectious disease spread? - The New Leam", "description": "A section of scientists say there is a ‘biodiversity dilution effect’ in which declining biodiversity results in increased infectious-disease transmission.", "url": "https://thenewleam.com/2020/04/can-biodiversity-loss-lead-to-more-infectious-disease-spread/", "urlToImage": "https://thenewleam.com/wp-content/uploads/2020/04/rhinos-768x512.jpg", "publishedAt": "2020-04-30T05:15:00Z", "content": "A section of scientists say there is a biodiversity dilution effect in which declining biodiversity results in increased infectious-disease transmission.Do biodiversity losses aggravate transmission of infectious diseases spread by animals to humans? The jury… [+9845 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Lifestyle Desk", "title": "Childhood trauma, abuse increases risk of cardiovascular disease in middle age: Study - The Indian Express", "description": "Researchers found that people exposed to higher levels of childhood family environment adversity were more than 50 per cent likely to have a cardiovascular disease such as heart attack or stroke.", "url": "https://indianexpress.com/article/lifestyle/health/childhood-trauma-abuse-increases-risk-of-cardiovascular-disease-in-middle-age-study-6385092/", "urlToImage": "https://images.indianexpress.com/2020/04/trauma1.jpg?w=759", "publishedAt": "2020-04-30T04:44:01Z", "content": "By: Lifestyle Desk | New Delhi | \r\nPublished: April 30, 2020 10:00:27 am\r\nChildren experiencing such adversity were predisposed to higher rates of lifelong stress, smoking, anxiety, depression and a sedentary lifestyle that persisted in adulthood. (Source: Ge… [+2441 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Lisa Shumaker", "title": "U.S. coronavirus outbreak soon to be deadlier than any flu since 1967 as deaths top 60,000 - Reuters India", "description": "U.S. deaths from the novel coronavirus topped 60,000 on Wednesday and the outbreak will soon be deadlier than any flu season since 1967, according to a Reuters tally.", "url": "https://in.reuters.com/article/health-coronavirus-usa-casualties-idINKBN22C0C7", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200430&t=2&i=1516960055&w=1200&r=LYNXMPEG3T06C", "publishedAt": "2020-04-30T04:24:01Z", "content": "(Reuters) - U.S. deaths from the novel coronavirus topped 60,000 on Wednesday and the outbreak will soon be deadlier than any flu season since 1967, according to a Reuters tally. \r\nAmerica's worst flu season in recent years was in 2017-2018 when more than 61,… [+2215 chars]"}, {"source": {"id": null, "name": "Morungexpress.com"}, "author": null, "title": "Most people want billionaires to pitch in to aid poverty and inequality - Morung Express", "description": "Philanthropist Bill Gates (L) embraces Facebook's Mark Zuckerberg during an announcement of the Chan Zuckerberg Initiative to \"cure, prevent or manage all disease\" by the end of the century during a news conference at UCSF Mission Bay in San Francisco, Califo…", "url": "https://morungexpress.com/most-people-want-billionaires-pitch-aid-poverty-and-inequality-0", "urlToImage": "https://morungexpress.com/sites/default/files/field/image/gates.jpg", "publishedAt": "2020-04-30T03:18:25Z", "content": "Philanthropist Bill Gates (L) embraces Facebook's Mark Zuckerberg during an announcement of the Chan Zuckerberg Initiative to \"cure, prevent or manage all disease\" by the end of the century during a news conference at UCSF Mission Bay in San Francisco, Califo… [+3977 chars]"}]}