{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "France sees lowest weekday COVID-19 death toll increase since end March - Reuters India", "description": "The number of people who died of coronavirus infection in France increased by 289 or 1.2% to 24,376 on Thursday, the lowest increase on a weekday since end March, government data showed.", "url": "https://in.reuters.com/article/health-coronavirus-france-casualties-idINKBN22D4AO", "urlToImage": "https://s1.reutersmedia.net/resources/r/?m=02&d=20200501&t=2&i=1517111566&w=1200&r=LYNXMPEG402OA", "publishedAt": "2020-05-01T03:34:56Z", "content": "PARIS (Reuters) - The number of people who died of coronavirus infection in France increased by 289 or 1.2% to 24,376 on Thursday, the lowest increase on a weekday since end March, government data showed. \r\nOn Sunday, only 242 new deaths were reported, but on… [+1182 chars]"}, {"source": {"id": null, "name": "Thenewsopediaindia.co.in"}, "author": "rishixkumar00", "title": "Full text: Coronavirus vaccine could take two years, humankind has never had a more urgent task, writes... - The Newsopedia", "description": "One of the questions I get asked the most these days is when the world will be able to go back to the way things were in December before", "url": "https://www.thenewsopediaindia.co.in/news/world/full-text-coronavirus-vaccine-could-take-two-years-humankind-has-never-had-a-more-urgent-task-writes-bill-gates/", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2017/11/Bill-Gates_Getty_social.jpg", "publishedAt": "2020-05-01T02:56:07Z", "content": "One of the questions I get asked the most these days is when the world will be able to go back to the way things were in December before the coronavirus pandemic. My answer is always the same: when we have an almost perfect drug to treat COVID-19, or when alm… [+15183 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Bill Gates Says Virus Vaccine Could Take as Little as 9 Months - Bloomberg", "description": null, "url": "https://www.bloomberg.com/tosv2.html?vid=&uuid=21c86be0-8b57-11ea-a0a2-972d6e96f0a3&url=L25ld3MvYXJ0aWNsZXMvMjAyMC0wNC0zMC9iaWxsLWdhdGVzLXNheXMtdmlydXMtdmFjY2luZS1jb3VsZC10YWtlLWFzLWxpdHRsZS1hcy05LW1vbnRocw==", "urlToImage": null, "publishedAt": "2020-04-30T21:02:52Z", "content": "To continue, please click the box below to let us know you're not a robot."}, {"source": {"id": null, "name": "Boomlive.in"}, "author": "AFP", "title": "No, Aspirin Mixed With Lemon Juice And Honey Will Not Cure COVID-19 - BOOM", "description": "Facebook posts claim that aspirin, lemon juice and honey have been combined to make a home remedy...", "url": "https://www.boomlive.in/world/no-aspirin-mixed-with-lemon-juice-and-honey-will-not-cure-covid-19-7892", "urlToImage": "https://www.boomlive.in/h-upload/2020/04/30/920696-aspirin.jpg", "publishedAt": "2020-04-30T20:56:08Z", "content": "Multiple Facebook posts claim that aspirin, lemon juice and honey have been combined to make a \"home remedy\" for COVID-19 in Italy. The claim is misleading; the World Health Organization (WHO) has warned against self-medicating for COVID-19, saying there is n… [+1844 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "COVID-19 Threatens Lifesaving Immunization Services for Other Deadly Diseases - Doctors Without Borders / MSF-USA", "description": "Even under normal circumstances, parents in many parts of the world struggle to get their children the vaccinations they need to protect against deadly infec...", "url": "https://www.youtube.com/watch?v=vLn1PglGZDY", "urlToImage": "https://i.ytimg.com/vi/vLn1PglGZDY/maxresdefault.jpg", "publishedAt": "2020-04-30T20:31:14Z", "content": null}, {"source": {"id": null, "name": "Health.com"}, "author": "Leah Groth", "title": "Is Muscle Pain a Symptom of Coronavirus? Doctors Explain How it Feels, and Why it Happens - Health.com", "description": "The CDC just added it to their list of COVID-19 symptoms. Here's what you need to know.", "url": "https://www.health.com/condition/infectious-diseases/coronavirus/is-muscle-pain-a-symptom-of-coronavirus", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=%5B980%2C706%5D&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F12%2F2020%2F04%2F30%2Fpain-GettyImages-516362508.jpg", "publishedAt": "2020-04-30T19:54:17Z", "content": "The US Centers for Disease Control and Prevention recently added six new COVID-19 symptoms to its official list. Now, in addition to the standard dry cough, shortness of breath, and fever, the CDC also lists chills, repeated shaking with chills, headache, sor… [+4884 chars]"}, {"source": {"id": null, "name": "Newindianexpress.com"}, "author": "PTI", "title": "Indians, ethnic minority medical workers in UK to be risk-assessed for coronavirus - The New Indian Express", "description": "The move follows the government setting up a Public Health England (PHE) inquiry into the higher proportion of BAME deaths among the over 100 NHS workers who have died due to the virus.", "url": "https://www.newindianexpress.com/world/2020/apr/30/indians-ethnic-minority-medical-workers-in-uk-to-be-risk-assessed-for-coronavirus-2137579.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2020/4/30/w600X390/AP20121489838111.jpg", "publishedAt": "2020-04-30T18:05:00Z", "content": "LONDON: Indian-origin and other ethnic minority healthcare workers on the frontlines of the coronavirus pandemic within the UK's state-funded National Health Service (NHS) should be risk-assessed for greater susceptibility to the deadly virus, according to ne… [+3308 chars]"}, {"source": {"id": null, "name": "Sciencemag.org"}, "author": null, "title": "The mystery of the pandemic's 'happy hypoxia' - Science Magazine", "description": "> Science's COVID-19 coverage is supported by the Pulitzer Center. \n\n\n\nAmong the many surprises of the new coronavirus is one that seems to defy basic biology: infected patients with extraordinarily low blood-oxygen levels, or hypoxia, scrolling on their phon…", "url": "https://science.sciencemag.org/content/368/6490/455.full", "urlToImage": "https://science.sciencemag.org/content/368/6490/F1.medium.gif", "publishedAt": "2020-04-30T17:52:09Z", "content": "Science's COVID-19 coverage is supported by the Pulitzer Center.\r\nA pulse oximeter on a COVID-19 patient's finger measures blood oxygenation.\r\nPHOTO: MARCO BERTORELLO/AFP VIA GETTY IMAGES\r\nAmong the many surprises of the new coronavirus is one that seems to d… [+6526 chars]"}, {"source": {"id": null, "name": "Venturebeat.com"}, "author": "Jeremy Horwitz", "title": "Researchers develop smart contact lenses to monitor and treat diabetes - VentureBeat", "description": "A South Korean team is preparing for clinical trials of a wearable that will check glucose levels and administer sight-saving medicine directly to the eyes.", "url": "https://venturebeat.com/2020/04/30/researchers-develop-smart-contact-lenses-to-monitor-and-treat-diabetes/", "urlToImage": "https://venturebeat.com/wp-content/uploads/2020/04/postech-contactlens.jpg?w=1200&strip=all", "publishedAt": "2020-04-30T17:25:52Z", "content": "While much of the focus on wearable visual technology has been on glasses or contact lenses that promise to augment human sight, a South Korean research team has announced a different sort of innovation: smart contact lenses that can preserve the sight and br… [+1796 chars]"}, {"source": {"id": null, "name": "Trtworld.com"}, "author": "TRTWorld", "title": "These are the possible coronavirus vaccines in the pipeline - TRT World", "description": "From the US to China, scientists are racing to develop a drug that can fight the deadly pandemic.", "url": "https://www.trtworld.com/magazine/these-are-the-possible-coronavirus-vaccines-in-the-pipeline-35911", "urlToImage": "https://cdni0.trtworld.com/w480/h270/q75/77509_USA20200425HEALTHCORONAVIRUSVACCINEREUTERS_1588263768980.JPG", "publishedAt": "2020-04-30T17:23:40Z", "content": "From the US to China, scientists are racing to develop a drug that can fight the deadly pandemic.\r\nThousands of scientists are racing to develop vaccines and treatments to fight the new coronavirus pandemic, which has killed more than 228,000 people and infec… [+5352 chars]"}, {"source": {"id": null, "name": "Indianewengland.com"}, "author": null, "title": "Tobacco smoking potential risk factor for coronavirus: Study - India New England", "description": "New York– While several studies have highlighted the risks that smoking can have on lung health, a new study has identified tobacco smoking as a potential risk factor for infection of the COV…", "url": "https://indianewengland.com/2020/04/tobacco-smoking-potential-risk-factor-for-coronavirus-study/", "urlToImage": "https://indianewengland.com/wp-content/uploads/2019/06/Cigarette-light.jpg", "publishedAt": "2020-04-30T17:19:56Z", "content": "New York– While several studies have highlighted the risks that smoking can have on lung health, a new study has identified tobacco smoking as a potential risk factor for infection of the COVID-19 virus.\r\nThe current findings, published in the journal America… [+2233 chars]"}, {"source": {"id": null, "name": "Financialexpress.com"}, "author": "FE Online", "title": "Graded opening of economy needed to protect livelihood: Niti Aayog CEO - The Financial Express", "description": "The Centre on Wednesday gave clear indications that the ongoing nationwide lockdown will be extended beyond May 3 but with \"considerable relaxations\" to people and services in \"many districts\".", "url": "https://www.financialexpress.com/economy/graded-opening-of-economy-needed-to-protect-livelihood-niti-aayog-ceo/1944800/", "urlToImage": "https://images.financialexpress.com/2020/04/1-682.jpg", "publishedAt": "2020-04-30T17:07:54Z", "content": "Advocating strict containment measures in ‘red zones’, Niti Aayog CEO Amitabh Kant on Thursday said the economy should kickstart with full supply chains to protect livelihood of people. The Centre on Wednesday gave clear indications that the ongoing nationwid… [+624 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "Sagar Kulkarni", "title": "Is novel coronavirus killing more men than women? - Deccan Herald", "description": "More men are succumbing to the coronavirus outbreak in India than women. According to the Health Ministry data, of the 1,075 COVID-19 deaths reported across the country, 65% were men, while the remaining 35% were women. For latest updates and live news on cor…", "url": "https://www.deccanherald.com/science-and-environment/is-novel-coronavirus-killing-more-men-than-women-831951.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/article_images/2020/04/30/file79wefyc60kl12qqsx219-1588259920.jpg", "publishedAt": "2020-04-30T15:18:40Z", "content": "More men are succumbing to the coronavirus outbreak in India than women.\r\nAccording to the Health Ministry data, of the 1,075 COVID-19 deaths reported across the country, 65% were men, while the remaining 35% were women.\r\nFor latest updates and live news on c… [+2026 chars]"}, {"source": {"id": null, "name": "Fm100.com"}, "author": null, "title": "4 ways to promote better mental health during the COVID-19 pandemic - FM100.3", "description": "As confirmed cases of COVID-19 rise past 4,300 in Utah, many are dealing with stressors that may affect your mental health.", "url": "https://fm100.com/2020/04/30/4-ways-to-promote-better-mental-health-during-the-covid-19-pandemic/", "urlToImage": "https://fm100.com/wp-content/uploads/sites/12/2020/04/family-doing-doing-arts-and-crafts-3912427-1024x683.jpg", "publishedAt": "2020-04-30T15:05:52Z", "content": "As confirmed cases of COVID-19 coronavirus rise past 4,300 in Utah, many residents are dealing with stressors that may affect mental health.\r\n“Right now, just using the word ‘pandemic’ or ‘quarantine,’ sets a lot of people off into this panicky space,” said D… [+4375 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Jonathan M. Gitlin, Ars Technica", "title": "Jaguar Envisions Car Design for a Post-Pandemic World - WIRED", "description": "Julian Thomson, the automaker's director of design, shares his predictions for what drivers can look forward to.", "url": "https://www.wired.com/story/jaguar-envisions-car-design-for-a-post-pandemic-world/", "urlToImage": "https://media.wired.com/photos/5ea7530b4e08ae0008803bf1/191:100/w_1280,c_limit/Transpo-New%2520Jaguar%2520F-TYPE_Just%2520Imagine%2520Film_Behind%2520the%2520Scenes_Horses_020320.jpg", "publishedAt": "2020-04-30T14:11:24Z", "content": "Adapting to the coronavirus lockdown and the move en masse to working from home has been easier for some professions than others. We've been doing it since day one here at Ars, because typing at a computer is just as easy to do at home as it is in a crowded o… [+3976 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Bloomberg", "title": "Dead coronavirus particles muddy the outcome of covid-19 patient's test result - Livemint", "description": "Coronavirus patients who remain positive weeks after diagnosis may harbor dead virus particles that can’t be distinguished from infectious ones in standard tests, say scientists", "url": "https://www.livemint.com/news/india/dead-coronavirus-particles-muddy-the-outcome-of-test-results-11588250764951.html", "urlToImage": "https://images.livemint.com/img/2020/04/30/600x338/9ab39872-5baf-11ea-9c69-d6eb4bacb74c_1583076698066_1588251088823.jpg", "publishedAt": "2020-04-30T12:56:44Z", "content": "Coronavirus patients who remain positive weeks after diagnosis may harbor dead virus particles that cant be distinguished from infectious ones in standard tests, scientists in South Korea found.The so-called SARS-CoV-2 virus dies one-to-two weeks after infect… [+3318 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "France and UK sound alarm over children's heart inflammation possibly linked to coronavirus - FRANCE 24 English", "description": "France has reported more than a dozen of children with inflammation around the heart, after the UK sounded an alarm about a new disease with possible links t...", "url": "https://www.youtube.com/watch?v=-D5_0lwu6wA", "urlToImage": "https://i.ytimg.com/vi/-D5_0lwu6wA/maxresdefault.jpg", "publishedAt": "2020-04-30T12:44:52Z", "content": "France has reported more than a dozen of children with inflammation around the heart, after the UK sounded an alarm about a new disease with possible links to Covid-19. French Minister Olivier Veran said that there was not yet enough evidence to confirm the l… [+547 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Admin", "title": "Work-related stress may up risk for peripheral artery disease - Alder News", "description": null, "url": "https://www.thehindu.com/sci-tech/health/work-related-stress-may-up-risk-for-peripheral-artery-disease/article31472062.ece/", "urlToImage": "https://aldernews.com/wp-content/uploads/2020/04/upset-26815021920-300x187.jpeg", "publishedAt": "2020-04-30T12:01:57Z", "content": "People who reported work-related stress were more likely to be hospitalised for peripheral artery disease compared to those who did not report work-related stress, according to a study.\r\nPeripheral artery disease, or PAD, is a cardiovascular disease that occu… [+2240 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "The ventilator question: Why Covid-19 patients starve of oxygen - India Today", "description": "A study in China found that 53 per cent Covid-19 patients died of respiratory problems. In many cases, the patients were able to breathe mechanically but the body lacked oxygen.", "url": "https://www.indiatoday.in/coronavirus-outbreak/story/the-ventilator-question-why-covid-19-patients-starve-of-oxygen-1672908-2020-04-30", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202004/Coronavirus_Prague_ICU_AP-PTI-647x363.jpeg?E.abPyKQ_NSVi5_G3pkEtM6ZgpBGlITY", "publishedAt": "2020-04-30T11:48:50Z", "content": "Health experts and authorities maintain that only about 15 per cent of Covid-19 patients actually need hospitalization, treatment in ICU, oxygen supply for breathing or ventilator support. Around 1 out of every 6 people who gets COVID-19 becomes seriously ill… [+4068 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus outbreak: How a secretive organization helped China hoard PPE - Global News", "description": "Before alerting the public to the danger posed by the novel coronavirus, Beijing quietly began gathering personal protective equipment (PPE), such as N95 mas...", "url": "https://www.youtube.com/watch?v=VwTCRygJi9M", "urlToImage": "https://i.ytimg.com/vi/VwTCRygJi9M/maxresdefault.jpg", "publishedAt": "2020-04-30T11:00:15Z", "content": null}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Vaccine 'could be ready by end of year' - BBC News", "description": "AstraZeneca will make and distribute Oxford University's coronavirus vaccine if it proves effective.", "url": "https://www.bbc.co.uk/news/business-52483359", "urlToImage": "https://ichef.bbci.co.uk/images/ic/1024x576/p08by614.jpg", "publishedAt": "2020-04-30T10:53:24Z", "content": "Media captionOxford 'started developing coronavirus vaccine in January'\r\nA coronavirus vaccine could be available for limited use by the end of the year, AstraZeneca's chief executive Pascal Soriot has said.\r\nThe pharmaceutical giant has agreed to manufacture… [+2224 chars]"}, {"source": {"id": null, "name": "Theprint.in"}, "author": "Mohana Basu", "title": "CSIR to test sepsis drug in asymptomatic Covid patients and those who have recovered - ThePrint", "description": "CSIR will launch trials to see if sepsis drug can stop Covid-19 from progressing in asymptomatic patients & if it can prevent it from redeveloping in recovered patients.", "url": "https://theprint.in/health/csir-to-test-sepsis-drug-in-asymptomatic-covid-patients-and-those-who-have-recovered/411813/", "urlToImage": "https://d2c7ipcroan06u.cloudfront.net/wp-content/uploads/2020/04/Bloodsmaples.jpg", "publishedAt": "2020-04-30T10:30:43Z", "content": "New Delhi: Scientists at the Council of Scientific and Industrial Research (CSIR)will launch two separate trials to test if a drug used to treat sepsis and liver cirrhosis can stop Covid-19 infection from progressing in asymptomatic patients and whether the s… [+3317 chars]"}, {"source": {"id": null, "name": "Chroniclelive.co.uk"}, "author": "Jonathan Walker", "title": "Why we still don't know exactly how many people are dying in coronavirus crisis - Chronicle Live", "description": "Senior Government scientist says it will take some time before we know the full death toll", "url": "https://www.chroniclelive.co.uk/news/north-east-news/coronavirus-uk-deaths-total-full-18173136", "urlToImage": "https://i2-prod.chroniclelive.co.uk/incoming/article18152562.ece/ALTERNATES/s1200/0_JS210907473.jpg", "publishedAt": "2020-04-30T08:41:10Z", "content": "We won't know the true death toll from the Covid-19 crisis for some time, a senior Government scientist has revealed.\r\nSpeaking at the daily Downing Street press conference, Deputy Chief Medical Officer for England Prof Jonathan Van-Tam said every country in … [+2446 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Sangeeta Ojha", "title": "Should you avoid ice creams to prevent coronavirus? What government has to say - Livemint", "description": "The World Health Organization has clarified that there is no scientific evidence to support the claim, PIB clarified in a tweet.To avoid the spread of coronavirus, one needs to wash hands frequently and wear a mask while traveling and in crowded place", "url": "https://www.livemint.com/news/india/should-you-avoid-ice-creams-to-prevent-coronavirus-what-government-has-to-say-11588231978863.html", "urlToImage": "https://images.livemint.com/img/2020/04/30/600x338/Vanilla-ke3--621x414@LiveMint_1588232626935.jpg", "publishedAt": "2020-04-30T07:45:50Z", "content": "Many fraudulent messages are being circulated on social media related to the spread of the novel coronavirus. The latest rumour doing the round is that Covid-19 spreads through ice-creams and other chilled products. The government today rubbished claims linki… [+1616 chars]"}, {"source": {"id": null, "name": "Thewire.in"}, "author": "Abhijit Mohanty", "title": "COVID-19 Is a Cautionary Tale for Climate Change Related Health Hazards - The Wire", "description": "Deforestation is forcing animals to find new habitats for survival, driving them into close contact with humans and creating conditions for pathogens to move from animals to humans.", "url": "https://science.thewire.in/environment/coronavirus-climate-change-health/", "urlToImage": "https://cdn.thewire.in/wp-content/uploads/2020/04/30125244/download-1.jpeg", "publishedAt": "2020-04-30T07:33:30Z", "content": "An aerial view of a tract of Amazon jungle after it was cleared by farmers in Itaituba, Para, Brazil September 26, 2019. Photo: Reuters/Ricardo Moraes\r\nClimate change is already amplifying the spread of infectious diseases beyond their natural geographic rang… [+9608 chars]"}, {"source": {"id": null, "name": "Theweek.in"}, "author": null, "title": "Coronavirus can stay hidden in lungs after patients recover: Study - THE WEEK", "description": "Current mass testing samples do not use samples from deep inside the lungs", "url": "https://www.theweek.in/news/health/2020/04/30/coronavirus-can-stay-hidden-in-lungs-after-patients-recover-study.html", "urlToImage": "https://www.theweek.in/content/dam/week/news/sci-tech/2019/May/Coronavirus-covid-19-infecting-respiratory-system-Pandemic-medical-health-shut.jpg", "publishedAt": "2020-04-30T07:21:00Z", "content": "There were reports earlier this month of over 160 people in South Korea who had recovered from the coronavirus testing positive for the disease again. Similar cases were reported from China, Macau, Taiwan, Vietnam and other placesall places where the coronavi… [+2337 chars]"}, {"source": {"id": null, "name": "Theprint.in"}, "author": "Max Nisen", "title": "What a second wave of Covid-19 could look like - ThePrint", "description": "One model of Covid-19’s future transmission dynamics suggests the size of outbreaks will vary drastically depending on seasonality and duration of people’s immunity.", "url": "https://theprint.in/health/what-a-second-wave-of-covid-19-could-look-like/411712/", "urlToImage": "https://d2c7ipcroan06u.cloudfront.net/wp-content/uploads/2020/04/Test-.jpg", "publishedAt": "2020-04-30T06:43:59Z", "content": "The world is beginning to loosen restrictions that have been put in place to limit the spread of Covid-19. Leaders of countries, states and cities are finding they have little choice but to return to economic activity well before an effective vaccine or treat… [+6044 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Brigitte Fernandes", "title": "Facebook CEO Mark Zuckerberg & Priscilla Chan to fund nine-month COVID-19 research study - Republic World - Republic World", "description": "Facebook CEO Mark Zuckerberg and his wife Priscilla Chan announced that they will fund a nine-month research project to better understand of COVID-19 under CZI", "url": "https://www.republicworld.com/world-news/rest-of-the-world-news/facebook-ceo-and-wife-donates-13-dollars-6-cents-million-to-study-covid-situation.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/hfodsjxmf9flqk0w_1588219242.jpeg?tr=f-jpeg", "publishedAt": "2020-04-30T06:41:00Z", "content": "Facebook CEO Mark Zuckerberg and his wife Priscilla Chan on Wednesday announced that they will fund a nine-month research project to better understand the prevalence of Coronavirus in the Bay Area under their Chan Zuckerberg Initiative (CZI). The couple has d… [+2191 chars]"}, {"source": {"id": null, "name": "Thewire.in"}, "author": "Kabir Agarwal", "title": "Coronavirus: Why Frequent Hand Washes Are Not Feasible for Millions of Indians - The Wire", "description": "Around 800 million people in the country face high to extreme water stress, according to a 2019 Niti Ayog report.", "url": "https://science.thewire.in/health/coronavirus-hand-wash-water/", "urlToImage": "https://cdn.thewire.in/wp-content/uploads/2020/04/30111634/gallery-ds-X_tEarX6svc-unsplash-copy-scaled.jpg", "publishedAt": "2020-04-30T06:31:21Z", "content": "New Delhi: One of the most crucial protective measures against the novel coronavirus is the frequent washing of hands with soap. The mixture of soap and water accompanied by the thorough rubbing of hands kills the virus within seconds the consensus appears to… [+7315 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "AFP", "title": "'Don't waste a minute': Chinese firm readies mass vaccine production - Economic Times", "description": "Sinovac Biotech, which is conducting one of the four clinical trials that have been authorised in China, has claimed great progress in its research and promising results among monkeys.", "url": "https://economictimes.indiatimes.com/news/international/business/dont-waste-a-minute-chinese-firm-readies-mass-vaccine-production/articleshow/75465334.cms", "urlToImage": "https://img.etimg.com/thumb/msid-75465331,width-1070,height-580,imgsize-594730,overlay-economictimes/photo.jpg", "publishedAt": "2020-04-30T05:55:26Z", "content": "BEIJING: A researcher in a lab coat in Beijing holds up the hopes of humanity in his fingers: \"Coronavac\", an experimental vaccine against the coronavirus that has upended the world.\r\nSinovac Biotech, which is conducting one of the four clinical trials that h… [+3448 chars]"}, {"source": {"id": null, "name": "Sentinelassam.com"}, "author": "Aparna Chanda", "title": "‘Nations like India must play key role in developing COVID-19 vaccine’ Says WHO - The Sentinel Assam", "description": "Countries like India, Indonesia and Thailand that are among the world’s largest vaccine manufacturers from the South-East Asia region must", "url": "https://www.sentinelassam.com/national-news/nations-like-india-must-play-key-role-in-developing-covid-19-vaccine-says-who/", "urlToImage": "https://www.sentinelassam.com/wp-content/uploads/2020/03/WHO.jpg", "publishedAt": "2020-04-30T05:44:32Z", "content": "NEW DELHI: Countries like India, Indonesia and Thailand that are among the worlds largest vaccine manufacturers from the South-East Asia region must play a lead role in overcoming the ongoing COVID-19 pandemic, the World Health Organisaion (WHO) said on Wedne… [+1834 chars]"}, {"source": {"id": "vice-news", "name": "Vice News"}, "author": "David Gilbert", "title": "Chinese Scientists Find Evidence Coronavirus Can Float in the Air for Hours - VICE", "description": "The research also suggests that virus droplets that have landed on the surface of nurses' PPE could be knocked back into the air.", "url": "https://www.vice.com/en_in/article/akw534/chinese-scientists-find-evidence-coronavirus-can-float-in-the-air-for-hours", "urlToImage": "https://video-images.vice.com/test-uploads/articles/5ea94cabc9d46200989e6959/lede/1588158670727-AP_20057262537937.jpeg?crop=1xw:0.8426xh;0xw,0.1295xh&resize=1200:*", "publishedAt": "2020-04-30T05:22:00Z", "content": "This article originally appeared on VICE US.\r\nResearchers in China who examined how the coronavirus spread through two Wuhan hospitals at the height of the outbreak there have found evidence that it can be transmitted through the air.\r\nThe research was publis… [+3517 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Lisa Shumaker", "title": "U.S. coronavirus outbreak soon to be deadlier than any flu since 1967 as deaths top 60,000 - Reuters India", "description": "U.S. deaths from the novel coronavirus topped 60,000 on Wednesday and the outbreak will soon be deadlier than any flu season since 1967, according to a Reuters tally.", "url": "https://in.reuters.com/article/health-coronavirus-usa-casualties-idINKBN22C0C7", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200430&t=2&i=1516960055&w=1200&r=LYNXMPEG3T06C", "publishedAt": "2020-04-30T04:24:01Z", "content": "(Reuters) - U.S. deaths from the novel coronavirus topped 60,000 on Wednesday and the outbreak will soon be deadlier than any flu season since 1967, according to a Reuters tally. \r\nAmerica's worst flu season in recent years was in 2017-2018 when more than 61,… [+2215 chars]"}, {"source": {"id": null, "name": "Kalingatv.com"}, "author": "IANS", "title": "HCQ improves the health condition of COVID-19 patients:US doctors' body - Kalinga TV", "description": "New York:  A team of US doctors has claimed that hydroxychloroquine, an anti-malarial drug termed potential \"game-changer\" for COVID-19 by President Donald Trump, has improved the survival and recovery odds for about 90 per cent of patients infected", "url": "https://kalingatv.com/world/hcq-has-90-chance-of-helping-covid-19-patients-us-doctors-body/", "urlToImage": "https://cdn.kalingatv.com/wp-content/uploads/2020/04/Hydroxychloroquine-tablets-1.jpg", "publishedAt": "2020-04-30T04:17:00Z", "content": "New York:  A team of US doctors has claimed that hydroxychloroquine, an anti-malarial drug termed potential “game-changer” for COVID-19 by President Donald Trump, has improved the survival and recovery odds for about 90 per cent of patients infected with the … [+2209 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "US Coronavirus Outbreak Soon to be Deadlier Than Any Flu Since 1967 as Deaths Top 60,000 - News18", "description": "The only deadlier flu seasons were in 1967 when about 100,000 Americans died, 1957 when 116,000 died and the Spanish flu of 1918 when 675,000 died in the US.", "url": "https://www.news18.com/news/world/us-coronavirus-outbreak-soon-to-be-deadlier-than-any-flu-since-1967-as-deaths-top-60000-2598717.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/04/1588218597_united-states-flu-pandemic.jpg", "publishedAt": "2020-04-30T04:09:53Z", "content": "US deaths from the novel coronavirus topped 60,000 on Wednesday and the outbreak will soon be deadlier than any flu season since 1967, according to a Reuters tally.\r\nAmerica's worst flu season in recent years was in 2017-2018 when more than 61,000 people died… [+2084 chars]"}, {"source": {"id": null, "name": "Gadgetsnow.com"}, "author": "Gadgets Now Bureau", "title": "Mobile phone data may help predict COVID-19 spread two weeks in advance: Study - Gadgets Now", "description": "Tracking the aggregated movements of people using their mobile phone data may help predict the geographical and temporal spread of COVID-19 infections up to two weeks ahead of time, according to a study. The research, published in the journal Nature, analysed…", "url": "https://www.gadgetsnow.com/tech-news/mobile-phone-data-may-help-predict-covid-19-spread-two-weeks-in-advance-study/articleshow/75455830.cms", "urlToImage": "https://static.toiimg.com/photo/75455830.cms", "publishedAt": "2020-04-30T03:20:04Z", "content": "Tracking the aggregated movements of people using their mobile phone data may help predict the geographical and temporal spread of COVID-19 infections up to two weeks ahead of time, according to a study. The research, published in the journal Nature, analysed… [+1631 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": "India Today Television", "title": "Covid-19 unit set up for cops in UP; IIT Guwahati to work on vaccine; more - India Today", "description": "The Uttar Pradesh government have set up a Covid-19 unit for the police personnel in the state and their families. The Covid-19 unit will provide guidelines and consultations to the cops working on the frontline.\nMeanwhile, Indian Institute of Technology (IIT…", "url": "https://www.indiatoday.in/india/video/covid-19-unit-set-up-for-cops-in-up-iit-guwahati-to-work-on-vaccine-more-1672688-2020-04-30", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/video/202004/coronavirus_lucknow_doctor_5-647x363.jpeg?3GtTaus0mfTSerHfO4e28XISNuX.IWFc", "publishedAt": "2020-04-30T03:15:30Z", "content": "The Uttar Pradesh government have set up a Covid-19 unit for the police personnel in the state and their families. The Covid-19 unit will provide guidelines and consultations to the cops working on the frontline.\r\nMeanwhile, Indian Institute of Technology (II… [+167 chars]"}, {"source": {"id": null, "name": "Wionews.com"}, "author": "WION Web Team", "title": "More evidence emerges suggesting coronavirus originated in Wuhan lab - WION", "description": "There are many who claim that Wuhan lab is the source of this virus", "url": "https://www.wionews.com/world/more-evidence-emerges-suggesting-coronavirus-originated-in-wuhan-lab-295645", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2020/04/17/137117-china-afpp.jpg", "publishedAt": "2020-04-30T01:55:36Z", "content": "More evidence has emerged which support the theory that coronavirus originated in a virology lab in Wuhan in China.\r\nThe Washington Times says that the Wuhan lab is the \"most likely\" source of the coronavirus. This claim is part of an unfinished document whic… [+1611 chars]"}, {"source": {"id": null, "name": "Newindianexpress.com"}, "author": "Omjasvin MD", "title": "Antibody testing: A way forward - The New Indian Express", "description": "Experts say the intermediate process can help identify antibodies until a vaccine is found", "url": "https://www.newindianexpress.com/cities/chennai/2020/apr/30/antibody-testing-a-way-forward-to-identify-herd-immunity-ratio-feel-experts-2137240.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2020/4/28/w600X390/covid-19_testing-_EPS.jpg", "publishedAt": "2020-04-30T01:22:00Z", "content": "CHENNAI: Even as the worry over COVID-19 looms large over our heads, the State and the country is nearing the end of phase 2 of the lockdown. Experts believe that antibody testing is one of the ways to move forward and identify the herd immunity ratio, at lea… [+1750 chars]"}, {"source": {"id": null, "name": "Todaynewspaper.in"}, "author": "todaynewspaper.in", "title": "Covid-19 and forgotten lesson from Spanish Flu that killed 4 crore people - Todaynewspaper", "description": "History repeats itself. It's an old cliché that we hear often. The Covid-19 pandemic has…", "url": "https://todaynewspaper.in/covid-19-and-forgotten-lesson-from-spanish-flu-that-killed-4-crore-people/", "urlToImage": "https://s0.wp.com/i/blank.jpg", "publishedAt": "2020-04-30T01:12:57Z", "content": "History repeats itself. Its an old cliché that we hear often. The Covid-19 pandemic has brought back conversations around past pandemics. Four of them are being talked about the most 2009 Swine Flu, 1968 Hong Kong Flu, 1957-58 Asian Flu and 1918-20 Spanish Fl… [+5184 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Aniruddha Ghosal | AP", "title": "Plan to use malaria drug in Mumbai slums temporarily shelved - Washington Post", "description": "Authorities in Mumbai have temporarily shelved a plan to give the much-touted but largely untested anti-malarial drug hydroxychloroquine to thousands of people living in the city’s crowded slums", "url": "https://www.washingtonpost.com/business/plan-to-use-malaria-drug-in-mumbai-slums-temporarily-shelved/2020/04/29/1587f168-8a7e-11ea-80df-d24b35a568ae_story.html", "urlToImage": "", "publishedAt": "2020-04-30T01:01:00Z", "content": "India, which reached the grim milestone of over 1,000 deaths from the virus on Wednesday, is one of the few countries that has pushed for the use of hydroxychloroquine, as a precautionary measure among high-risk groups such as health care workers or people wh… [+2504 chars]"}, {"source": {"id": null, "name": "Medicaldialogues.in"}, "author": "Dr. Kamal Kant Kohli", "title": "First pregnancy complications increase risk of future premature birth: BMJ - Medical Dialogues", "description": "Researchers at Norway have found that first pregnancy complications are linked to increased risk of...", "url": "https://medicaldialogues.in/obstetrics-gynaecology/news/first-pregnancy-complications-increase-risk-of-future-premature-birth-bmj-65263", "urlToImage": "https://medicaldialogues.in/h-upload/2020/02/06/1200x630_124045-pregnant-women-2.jpg?width=1200&height=630", "publishedAt": "2020-04-30T00:00:10Z", "content": "Researchers at Norway have found that first pregnancy complications are linked to increased risk of future premature birth. These findings could help to identify women at increased risk of preterm delivery. The new study has been published in the journal The … [+3172 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus outbreak: Inside an ICU as frontline workers go to extremes to care for the sick - Global News", "description": "For the second day, Global News goes inside the ICU at Humber River Hospital to show how doctors and nurses are dealing with the sickest coronavirus patients...", "url": "https://www.youtube.com/watch?v=C_6LmdxtwOc", "urlToImage": "https://i.ytimg.com/vi/C_6LmdxtwOc/maxresdefault.jpg", "publishedAt": "2020-04-29T23:48:00Z", "content": null}, {"source": {"id": null, "name": "Indianewengland.com"}, "author": null, "title": "Family abuse in childhood tied to heart attacks, strokes as adult - India New England", "description": "New York– Parents, read this carefully. Children who experience trauma, abuse, neglect and family dysfunction are at increased risk of having heart disease in their 50s and 60s, warn research…", "url": "https://indianewengland.com/2020/04/family-abuse-in-childhood-tied-to-heart-attacks-strokes-as-adult/", "urlToImage": "https://indianewengland.com/wp-content/uploads/2018/02/Heart-hand-e1517950702324.jpg", "publishedAt": "2020-04-29T21:34:04Z", "content": "New York– Parents, read this carefully. Children who experience trauma, abuse, neglect and family dysfunction are at increased risk of having heart disease in their 50s and 60s, warn researchers.\r\nPublished in the Journal of the American Heart Association, th… [+1839 chars]"}, {"source": {"id": null, "name": "Insider.com"}, "author": "MK Manoylov", "title": "Can depression cause insomnia? Yes, the conditions are closely related - Insider - INSIDER", "description": "Depression and insomnia can create a vicious cycle, and it's important to treat both conditions. Here's how to do it.", "url": "https://www.insider.com/can-depression-cause-insomnia", "urlToImage": "https://i.insider.com/5e67ad561122cf6362110f13?width=1200&format=jpeg", "publishedAt": "2020-04-29T21:07:14Z", "content": "Depression and insomnia often go hand-in-hand. That's because depression can disrupt many aspects that help control our sleep-wake cycle. \r\nThis disruption can make it difficult to fall asleep, stay asleep, or both. Here's what you need to know about how depr… [+5681 chars]"}, {"source": {"id": null, "name": "Thehansindia.com"}, "author": "The Hans India", "title": "Nations like India must play key role in developing Covid-19 vaccine: WHO - The Hans India", "description": "Countries like India, Indonesia and Thailand that are among the worlds largest vaccine manufacturers ...", "url": "https://www.thehansindia.com/featured/womenia/nations-like-india-must-play-key-role-in-developing-covid-19-vaccine-who-619917", "urlToImage": "https://assets.thehansindia.com/h-upload/2020/04/29/1200x630_965373-who.jpg?width=1200&height=630", "publishedAt": "2020-04-29T20:20:02Z", "content": "Countries like India, Indonesia and Thailand that are among the world's largest vaccine manufacturers from the South-East Asia region must play a lead role in overcoming the ongoing COVID-19 pandemic,\" the World Health Organisaion (WHO) said on Wednesday.\r\nGe… [+1982 chars]"}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": "Pinkvilla Desk", "title": "What is Colon Infection? Signs, causes, treatment and prevention of this health condition - PINKVILLA", "description": "Colon Infection Symptoms: Right from signs to causes to treatment, here is everything you need to know about the health disorder.", "url": "https://www.pinkvilla.com/lifestyle/health-fitness/what-colon-infection-signs-causes-treatment-and-prevention-health-condition-528392", "urlToImage": "https://www.pinkvilla.com/files/styles/fbimagesection/public/what_is_colon_infection_social.jpg?itok=n_5D4I3e", "publishedAt": "2020-04-29T18:45:01Z", "content": null}, {"source": {"id": null, "name": "Medscape.com"}, "author": null, "title": "COVID-19: Contact Tracing, Isolation Have Impact, Study Shows - Medscape", "description": "The initiative implemented in Shenzen, China, over a 4-week period led to faster confirmation of new cases, and potentially reduced the number of new infections that arose from each case.", "url": "https://www.medscape.com/viewarticle/929659", "urlToImage": "https://img.medscape.com/thumbnail_library/is_200429_contact_tracing_coronavirus_800x450.jpg", "publishedAt": "2020-04-29T18:24:27Z", "content": "Editor's note: Find the latest COVID-19 news and guidance in Medscape's Coronavirus Resource Center.\r\nFROM LANCET INFECTIOUS DISEASE\r\nA far-reaching surveillance initiative was implemented in Shenzhen, China, to isolate and contact trace people suspected of h… [+4389 chars]"}, {"source": {"id": null, "name": "Barrons.com"}, "author": null, "title": "How an Economist Reads Models of the Coronavirus Pandemic - Barron's", "description": "", "url": "https://www.barrons.com/articles/the-danger-of-overreliance-on-epidemiological-models-51588179008", "urlToImage": "https://images.barrons.com/im-180849/social", "publishedAt": "2020-04-29T18:04:00Z", "content": "We navigate reality using models, whether we like it or not. Sometimes they are as simple as the inner map we turn to in order to get from one room to another in the middle of the night. Sometimes they take a more elaborate form, like the wind tunnels used to… [+6964 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "R. Prasad", "title": "One mutated coronavirus type dominates globally - The Hindu", "description": "A2a type enhances the efficiency of entry of the virus into human cells", "url": "https://www.thehindu.com/sci-tech/science/one-mutated-coronavirus-type-dominates-globally/article31464783.ece", "urlToImage": "https://www.thehindu.com/sci-tech/science/nqh8h4/article31464781.ece/ALTERNATES/LANDSCAPE_615/VBK-CORONA-RESEARCH-REUTERS", "publishedAt": "2020-04-29T17:04:59Z", "content": "Scientists at the National Institute of Biomedical Genomics (NIBMG), Kalyani, West Bengal, have found that the novel coronavirus has undergone mutations to form 10 different types (clades). Of the 10, one specific type called A2a has become predominant and is… [+2440 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "India TV News Desk", "title": "6 new symptoms of coronavirus, as confirmed by US' agency CDC - India TV News", "description": "The Centers for Disease Control and Prevention or CDC issued a list of six symptoms of novel coronavirus, which differs from the list released by World Health Organisation (WHO) earlier.", "url": "https://www.indiatvnews.com/fyi/coronavirus-symptoms-cdc-us-agency-covid-19-who-612585", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2020/04/coronavirus-1588176261.jpeg", "publishedAt": "2020-04-29T16:39:26Z", "content": "Image Source : AP6 new symptoms of coronavirus, as confirmed by US' agency CDC\r\nThe Centers for Disease Control and Prevention, or CDC, issued a list of six symptoms of novel coronavirus, which differs from the list released by the World Health Organisation (… [+2157 chars]"}, {"source": {"id": null, "name": "Moneycontrol.com"}, "author": null, "title": "Hello! This is... | Demystifying herd immunity and what it means for India's fight against COVID-19 - Moneycontrol.com", "description": "Watch renowned epidemiologist Doctor Jayaprakash Muliyil’s most incisive and direct conversation about the science (without the fancy jargons) behind immunity with Network 18's Kartik Malhotra.", "url": "https://www.moneycontrol.com/news/trends/health-trends/hello-this-is-demystifying-herd-immunity-and-what-it-means-for-indias-fight-against-covid-19-5204471.html", "urlToImage": "https://static-news.moneycontrol.com/static-mcnews/2020/04/maxresdefault-2-770x433.jpg", "publishedAt": "2020-04-29T16:17:00Z", "content": "What are Indias options in dealing with the Covid-19 pandemic? Is staying locked down the best way to pound the curve or is it better to go out and take the virus head-on, and in the process develop herd immunity? What will happen to mortality rates, especial… [+737 chars]"}, {"source": {"id": null, "name": "Genengnews.com"}, "author": "John Sterling", "title": "Team Gains Insights on How Bladder Cancer Is Linked to Smoking - Genetic Engineering & Biotechnology News", "description": "Scientists from the University of York recreated DNA damage caused by toxins from smoking to understand more about the causes of bladder cancer and its link to smoking. The scientists found that the smoke toxin left its distinctive fingerprints on the DNA of …", "url": "https://www.genengnews.com/news/team-gains-insights-on-how-bladder-cancer-is-linked-to-smoking/", "urlToImage": "https://www.genengnews.com/wp-content/uploads/2020/04/Apr29_2020_PhilRoberts_ExtractingRNAFromBladder.jpg", "publishedAt": "2020-04-29T16:00:00Z", "content": "Scientists from the University of York say they have recreated how toxins from smoking cause unique patterns of DNA damage. The discovery could help researchers better understand the cause of bladder cancer and the link to smoking, according to the university… [+3560 chars]"}, {"source": {"id": null, "name": "Vasculardiseasemanagement.com"}, "author": null, "title": "AHA: Work-Related Stress Linked to Increased Risk for Peripheral Artery Disease - Vascular Disease Management", "description": "April 29, 2020 -- People who reported work-related stress were more likely to be hospitalized for peripheral artery disease compared to those who did not report work-related stress, according to new research published today in the Journal of the American Hear…", "url": "https://www.vasculardiseasemanagement.com/content/aha-work-related-stress-linked-increased-risk-peripheral-artery-disease", "urlToImage": "https://s3.amazonaws.com/HMP/vdmsocial.png", "publishedAt": "2020-04-29T15:47:54Z", "content": "April 29, 2020 -- People who reported work-related stress were more likely to be hospitalized for peripheral artery disease compared to those who did not report work-related stress, according to new research published today in the Journal of the American Hear… [+3544 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Neuroendocrine cancer: Everything you need to know about the cancer that Irrfan Khan was diagnosed with - Times of India", "description": "Neuroendocrine cancer is one form of rare cancer that affects the specialized cells of the body. These mostly inclu", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/everything-you-need-to-know-about-the-cancer-that-irrfan-khan-was-diagnosed-with/articleshow/75449793.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-75449758,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-953131/75449758.jpg", "publishedAt": "2020-04-29T15:34:26Z", "content": null}, {"source": {"id": null, "name": "Inventiva.co.in"}, "author": "Vanshika Chopra", "title": "Can Your Pet Animal Be Infected With Coronavirus? All Your Questions Answered. - Inventiva", "description": "Coronavirus is spreading rapidly in the entire world. Total cases in the world has reached 3.12M.\nPeople are shut inside their homes and only going out for esse", "url": "https://www.inventiva.co.in/trends/vanshika/can-your-pet-animal-be-infected-with-coronavirus-all-your-questions-answered/", "urlToImage": "https://www.inventiva.co.in/wp-content/uploads/2020/04/pets-coronavirus.jpg", "publishedAt": "2020-04-29T14:46:12Z", "content": "Coronavirus is spreading rapidly in the entire world. Total cases in the world has reached 3.12M.\r\nPeople are shut inside their homes and only going out for essential activities. They are taking all necessary measures. However, one question hovers over the mi… [+3004 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Prasun Sonwalkar", "title": "Covid-19 triggers collateral damage fears, 18,000 UK cancer patients may die - Hindustan Times", "description": "According to campaign group Macmillan Cancer Support, nearly 18,000 people with cancer in England could die as the pandemic has forced hospitals to suspend treatment and deterred patients from seeking NHS care.", "url": "https://www.hindustantimes.com/world-news/covid-19-triggers-collateral-damage-fears-18-000-uk-cancer-patients-may-die/story-DVZOzVCk2vRpMwcfNEA8gI.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/04/29/Pictures/virus-outbreak-britain_5b679196-8a21-11ea-804e-137f71f5151d.jpg", "publishedAt": "2020-04-29T14:28:42Z", "content": "Focussing on population infected by coronavirus and suspending treatment of cancer patients in the UK could lead to death of over 18,000 infected by the malignancy, experts forecast, as the country moved to widen groups eligible for testing of Sars-Cov-2, the… [+2027 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Patrick Knox", "title": "Dr Anthony Fauci backed $7.4m funding for controversial Wuhan lab blamed for causing Covid-19 by conspiracy - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11507231/dr-fauci-7-4-million-funding-wuhan-lab-blamed-covid-19-conspiracy/", "urlToImage": "https://www.thesun.co.uk/wp-content/uploads/2020/04/RB-COMP-LAB-1.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "publishedAt": "2020-04-29T13:47:45Z", "content": "WHITE House virus expert Dr Anthony Fauci reportedly backed funding for a controversial lab in China that is blamed for causing the Covid-19 pandemic.\r\nDr Fauci's National Institute for Allergy and Infectious Diseases (NIAID) allegedly shelled out $7.4 millio… [+2836 chars]"}, {"source": {"id": null, "name": "Medicalxpress.com"}, "author": "Science X staff", "title": "Most SARS-CoV-2-positive pregnant women asymptomatic at screening - Medical Xpress", "description": "Universal severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) testing of pregnant women presenting for delivery in New York City revealed that most positive patients were asymptomatic, according to a research letter published online April 13 in the N…", "url": "https://medicalxpress.com/news/2020-04-sars-cov-positive-pregnant-women-asymptomatic-screening.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2020/mostsarscov2.jpg", "publishedAt": "2020-04-29T13:44:25Z", "content": "Universal severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) testing of pregnant women presenting for delivery in New York City revealed that most positive patients were asymptomatic, according to a research letter published online April 13 in the N… [+1928 chars]"}, {"source": {"id": null, "name": "Aninews.in"}, "author": null, "title": "Study reveals e-cigarette users experience vascular damage similar to that of smokers of combustible cigarettes - ANI News", "description": "Washington D.C. [USA], April 29 (ANI): An eye-opening study for those who have switched their traditional cigarettes to e-cigarettes advocates that using e-cigarettes damages the arteries and blood vessel function much like smoking traditional cigarettes.", "url": "https://www.aninews.in/news/lifestyle/fitness/study-reveals-e-cigarette-users-experience-vascular-damage-similar-to-that-of-smokers-of-combustible-cigarettes20200429190401", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/__sized__/sdfsdfsdfdf_keeA6ZO-thumbnail-154x87-70.jpg", "publishedAt": "2020-04-29T13:34:40Z", "content": "ANI | Updated: Apr 29, 2020 19:04 IST\r\nWashington D.C. [USA], April 29 (ANI): An eye-opening study for those who have switched their traditional cigarettes to e-cigarettes advocates that using e-cigarettes damages the arteries and blood vessel function much l… [+3079 chars]"}, {"source": {"id": null, "name": "Dnaindia.com"}, "author": "DNA", "title": "Child's home environment can impact risk of developing depression - DNA India", "description": "Children's rearing environment has a meaningful impact on their risk for major depression later in life, a recent study has found and also noted the importance of nurturing environments when a child is at risk. The research was published in the American Journ…", "url": "https://www.dnaindia.com/india/video-child-s-home-environment-can-impact-risk-of-developing-depression-2822937", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/2020/04/29/904032-00000003.jpg", "publishedAt": "2020-04-29T12:41:15Z", "content": "©2020 Diligent Media Corporation Ltd."}, {"source": {"id": null, "name": "Newindianexpress.com"}, "author": "AFP", "title": "US govt reveals details of sunlight study on coronavirus - The New Indian Express", "description": "US President Donald Trump raised eyebrows last week when he used his daily live national press briefing to ask whether light could become a medical treatment.", "url": "https://www.newindianexpress.com/world/2020/apr/29/us-govt-reveals-details-of-sunlight-study-on-coronavirus-2136971.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2020/4/29/w600X390/Sunlight_1.jpg", "publishedAt": "2020-04-29T12:03:00Z", "content": "WASHINGTON: The US Department of Homeland Security revealed to AFP on Tuesday new technical details regarding its highly anticipated study into how ultraviolet radiation destroys the new coronavirus, saying that its experiment had accurately mimicked natural … [+3752 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Hitender Rao", "title": "Rapid testing for Covid-19 with Korean kits to start in Haryana from tomorrow - Hindustan Times", "description": "Blood-based rapid tests are largely used as a tool for surveillance with respect to the formation of antibody in persons exposed to coronavirus. However, it can’t substitute the real time reverse transcription polymerase chain reaction test (RT-PCR) test", "url": "https://www.hindustantimes.com/cities/rapid-testing-for-covid-19-with-korean-kits-to-start-in-haryana-from-tomorrow/story-L9uPpbVwTGGkXYCXhZ8O4J.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/04/29/Pictures/_4abba88a-8a0a-11ea-804e-137f71f5151d.jpg", "publishedAt": "2020-04-29T11:14:00Z", "content": "CHANDIGARH: Haryana will start rapid antibody (blood-based) tests from Thursday to intensify surveillance of suspected coronavirus carriers in the state. The state government will use 25,000 rapid test kits manufactured by a South Korean company, SD Biosensor… [+2438 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "COVID-19: Will The Proposed Vaccine Trial Be Tested In Nigeria? - Channels Television", "description": "Don't forget to subscribe: https://bit.ly/2Hb8hjx Watch more interesting videos: https://bit.ly/34ogCaw Follow Channels Television On: Facebook: https://www....", "url": "https://www.youtube.com/watch?v=Fo_oNJLUqtY", "urlToImage": "https://i.ytimg.com/vi/Fo_oNJLUqtY/maxresdefault.jpg", "publishedAt": "2020-04-29T10:44:35Z", "content": null}, {"source": {"id": null, "name": "Trtworld.com"}, "author": "TRTWorld", "title": "Covid-19 mars UN immunisation drive risking South Asia children - TRT World", "description": "Coronavirus pandemic has interrupted vaccine supply chains and left families fearful of attending clinics, says UNICEF.", "url": "https://www.trtworld.com/life/covid-19-mars-un-immunisation-drive-risking-south-asia-children-35861", "urlToImage": "https://cdni0.trtworld.com/w480/h270/q75/65002_AFG191014POLIOVACCINEAP_1588154271259.jpeg", "publishedAt": "2020-04-29T10:43:25Z", "content": "Coronavirus pandemic has interrupted vaccine supply chains and left families fearful of attending clinics, says UNICEF.\r\nA health worker gives a vaccination to a child during a polio campaign in the old part of Kabul, Afghanistan on October 14, 2019.\r\n (Rahma… [+2778 chars]"}, {"source": {"id": null, "name": "Brinkwire.com"}, "author": null, "title": "Why does COVID-19 affect old people more than young people?. - Brinkwire", "description": null, "url": "https://en.brinkwire.com/news/why-does-covid-19-affect-old-people-more-than-young-people/", "urlToImage": null, "publishedAt": "2020-04-29T09:27:25Z", "content": "As we age, our lung tissue becomes stifferand this is a phenomenon that SARS-CoV-2 may be exploiting. Caroline Uhler and G. V. Shivashankar outline their hypothesis.\r\nThe new coronavirus strikes both young and old. But the more severe cases and the higher rat… [+3273 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "PTI", "title": "Hydroxychloroquine to be Given to Health Workers Treating Covid-19 Patients, Says Maharashtra Govt - News18", "description": "State health secretary Pradeep Vyas in a recent circular said the medicine will be given to doctors, nurses and medical staff involved in the treatment of Covid-19 patients and suspects, as well as contacts of those testing positive for the disease.", "url": "https://www.news18.com/news/india/hydroxychloroquine-to-be-given-to-health-workers-treating-covid-19-patients-says-maharashtra-govt-2597393.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2017/07/medicines_AFP10.jpg", "publishedAt": "2020-04-29T08:14:15Z", "content": "Health workers involved in the treatment of coronavirus patients will be given hydroxychloroquine (HCQ) tablets as a preventive medication, the Maharashtra government has said and issued guidelines on the use of the drug.\r\nState health secretary Pradeep Vyas … [+1898 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "India TV Video Desk", "title": "'Versatile and talented' Irrfan Khan will be greatly missed: Rahul Gandhi - India TV News", "description": "'Versatile and talented' Irrfan Khan will be greatly missed: Rahul Gandhi", "url": "https://www.indiatvnews.com/video/news/versatile-and-talented-irrfan-khan-will-be-greatly-missed-rahul-gandhi-612406", "urlToImage": "https://thumbs.indiatvnews.com/vod/0_51aovpcr_big_thumb.jpg", "publishedAt": "2020-04-29T08:06:29Z", "content": "'Versatile and talented' Irrfan Khan will be greatly missed: Rahul Gandhi"}, {"source": {"id": null, "name": "Aninews.in"}, "author": null, "title": "To understand causes of bladder cancer, scientists recreate DNA damage caused by toxins from smoking - ANI News", "description": "Washington D.C. [USA], April 29 (ANI): In a bid to understand more about the causes of bladder cancer, researchers recreated DNA damage caused by toxins from smoking.", "url": "https://www.aninews.in/news/health/to-understand-causes-of-bladder-cancer-scientists-recreate-dna-damage-caused-by-toxins-from-smoking20200429120504", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/__sized__/dnafeb2_2u1g3FY_fS9vRl2-thumbnail-154x87-70.jpg", "publishedAt": "2020-04-29T06:35:00Z", "content": "ANI | Updated: Apr 29, 2020 12:05 IST\r\nWashington D.C. [USA], April 29 (ANI): In a bid to understand more about the causes of bladder cancer, researchers recreated DNA damage caused by toxins from smoking.The causes of bladder cancer remain largely unknown, h… [+1714 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "AFP", "title": "U.S. government reveals details of sunlight study on coronavirus - Deccan Herald", "description": "The US Department of Homeland Security revealed to AFP on Tuesday new technical details regarding its highly anticipated study into how ultraviolet radiation destroys the new coronavirus, saying that its experiment had accurately mimicked natural sunlight. A …", "url": "https://www.deccanherald.com/international/world-news-politics/us-government-reveals-details-of-sunlight-study-on-coronavirus-831279.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/article_images/2020/04/29/tRUMP%201-1588132817.jpg", "publishedAt": "2020-04-29T04:00:17Z", "content": "The US Department of Homeland Security revealed to AFP on Tuesday new technical details regarding its highly anticipated study into how ultraviolet radiation destroys the new coronavirus, saying that its experiment had accurately mimicked natural sunlight.\r\nA… [+3727 chars]"}]}