{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Lauran Neergaard", "title": "'COVID toes,' other rashes latest possible rare virus signs - The Associated Press", "description": "Skin doctors suddenly are looking at a lot of toes — whether by emailed picture or video visit — as concern grows that for some people, a sign of COVID-19 may pop up in an unusual...", "url": "https://apnews.com/6dcacfca0f7e1bd9f9ca5e5b98c4296b", "urlToImage": "https://storage.googleapis.com/afs-prod/media/c3e243d61f834250bb0f64659c29879a/3000.jpeg", "publishedAt": "2020-05-17T12:20:37Z", "content": "Skin doctors suddenly are looking at a lot of toes whether by emailed picture or video visit as concern grows that for some people, a sign of COVID-19 may pop up in an unusual spot.\r\nBoston dermatologist Esther Freeman expected to see skin complaints as the p… [+3410 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Lucy Clarke-Billings", "title": "Baby dies of coronavirus-related Kawasaki disease two hours after this adorable photo - Mirror Online", "description": "EXCLUSIVE: Alexander Parsons is believed to be UK's youngest victim of Kawasaki syndrome as his heartbroken mum begs 'don't let more suffer like my boy'", "url": "https://www.mirror.co.uk/news/uk-news/baby-dies-coronavirus-related-kawasaki-22039416", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article22039015.ece/ALTERNATES/s1200/3_Alexander-Parsons.jpg", "publishedAt": "2020-05-17T10:50:41Z", "content": "A heartbroken mum told how her baby son died in her arms after being struck down by a rare childhood illness linked to Covid-19.\r\nEight-month-old Alexander Parsons is believed to be the youngest victim of Kawasaki disease, and illness which inflames blood ves… [+5008 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dr. Sanjay Gupta, CNN Chief Medical Correspondent", "title": "Dr. Sanjay Gupta: If the United States were my patient - CNN", "description": "For a moment, think of the United States as a human body. Full of heart and mind. Bile and blood. Muscle and fat. Like any body, it has its strengths and weaknesses, and must consistently work to prevent disease and optimize function. It needs to nourish itse…", "url": "https://www.cnn.com/2020/05/17/health/coronavirus-human-body-gupta-essay/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200515164238-20200515-gupta-coronavirus-us-body-super-tease.jpg", "publishedAt": "2020-05-17T10:13:07Z", "content": "(CNN)For a moment, think of the United States as a human body. Full of heart and mind. Bile and blood. Muscle and fat. Like any body, it has its strengths and weaknesses, and must consistently work to prevent disease and optimize function. It needs to nourish… [+7657 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Elizabeth Chuck, Erika Edwards", "title": "Doctors couldn't help these COVID-19 patients with their endless symptoms. So they turned to one another. - NBCNews.com", "description": "COVID-19 is as mystifying as it is isolating. Those who get it are often separated from their loved ones and seeking answers that the medical community does not yet have. As a result, millions of coronavirus survivors and family members of patients are turnin…", "url": "https://www.nbcnews.com/health/health-news/doctors-couldn-t-help-these-covid-19-patients-their-endless-n1208116", "urlToImage": "https://media4.s-nbcnews.com/j/newscms/2020_20/3351486/200515-long-term-covid-19-patient-diana-berrent-2-se-1106a_887c6c29a0bb7c5856a18b5081fde103.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-05-17T10:13:00Z", "content": "Jennifer English was sick, scared and confused. For two weeks, the Oregon City, Oregon, single mother had had no sense of taste, a fever that reached 102.5 degrees and an uncomfortable tightness in her chest.\r\nEnglish, 46, who helps manage a restaurant and ba… [+10467 chars]"}, {"source": {"id": null, "name": "Inverse.com"}, "author": "Maximilian de Courten, Vasso Apostolopoulos, Barbora de Courten", "title": "Are you wearing gloves or a mask to the shops? You might be doing it wrong - Inverse", "description": "Many people in the community are wearing face masks and gloves in an attempt to protect themselves against the coronavirus.", "url": "https://www.inverse.com/mind-body/are-you-wearing-gloves-a-mask-to-the-shops-you-might-be-doing-it-wrong", "urlToImage": "https://imgix.bustle.com/uploads/shutterstock/2020/5/13/d15760ba-6b57-421a-af36-ecd2b3539e49-shutterstock-1666714501.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "publishedAt": "2020-05-17T10:00:00Z", "content": "Many people in the community are wearing face masks and gloves in an attempt to protect themselves against the coronavirus.\r\nThey might put on these items to go to the shops, or perhaps when taking a walk through the neighborhood.\r\nThe evidence on whether the… [+4599 chars]"}, {"source": {"id": null, "name": "Npr.org"}, "author": "", "title": "A Pediatrician Treating Adults In The COVID-19 Pandemic Remembers His Patients - NPR", "description": "A pediatric cardiologist working at a hospital in the Bronx reflects on treating adults after part of the Children's Hospital at Montefiore Medical Center was converted to an adult COVID-19 unit.", "url": "https://www.npr.org/2020/05/17/852719312/she-wasn-t-alone-a-doctor-reflects-on-new-york-city-s-coronavirus-peak", "urlToImage": "https://media.npr.org/assets/img/2020/05/13/covid_diary_drlorenzoni_015_wide-989bcccdb476b3af83ea577582ccc8d8e1faa7f4.jpg?s=1400", "publishedAt": "2020-05-17T09:02:40Z", "content": "Dr. Ray Lorenzoni is in his second year of a pediatric cardiology fellowship at the Children's Hospital at Montefiore Medical Center in the Bronx. In March, he was recruited to treat adult COVID-19 patients during New York City's peak.\r\nElias Williams for NPR… [+6430 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Dennis Wagner", "title": "Aftershock: If coronavirus swells in a second wave later this year, will the nation be ready? - USA TODAY", "description": "Is the United States prepared – medically, economically and emotionally? The answer from epidemiologists, economists and futurists: Probably not.", "url": "https://www.usatoday.com/story/news/2020/05/17/coronavirus-peak-america-ready-second-wave-fall/3096338001/", "urlToImage": "https://www.gannett-cdn.com/presto/2020/05/08/USAT/26d76e03-44cc-416b-8add-1e6515aec215-AP_Virus_Outbreak_Pennsylvania_Unemployment.jpg?crop=5221,2937,x1,y544&width=3200&height=1680&fit=bounds", "publishedAt": "2020-05-17T07:40:05Z", "content": "The Director of the National Institute of Allergy and Infectious Diseases, Dr. Anthony Fauci says the government is working on several potential vaccines for COVID-19. (May 12)\r\nAP Domestic\r\nPaul Romer, a Nobel Prize-winning economist, envisions a day when al… [+13003 chars]"}, {"source": {"id": null, "name": "Timesofisrael.com"}, "author": null, "title": "Speech droplets that linger in air up to 14 minutes may spread virus — study - The Times of Israel", "description": "Research published in peer-reviewed journal PNAS; separate un-reviewed studies suggest link between lack of Vitamin D, severity of COVID-19", "url": "https://www.timesofisrael.com/speech-droplets-that-linger-in-air-up-to-14-minutes-may-spread-virus-study/", "urlToImage": "https://static.timesofisrael.com/www/uploads/2020/05/AP_20137691043345-1024x640.jpg", "publishedAt": "2020-05-17T06:29:17Z", "content": "According to a new study, speech can generate thousands of mini-droplets that, in a closed environment, can hang in the air for up to 14 minutes and lead to transmission of the novel coronavirus, SARS CoV-2.\r\nThe research was published this past week in The P… [+5008 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Bruce Y. Lee", "title": "Can Vitamin D Help With Covid-19 Coronavirus? Here Is The Science - Forbes", "description": "Should you be taking Vitamin D supplements during the pandemic?", "url": "https://www.forbes.com/sites/brucelee/2020/05/17/can-vitamin-d-help-with-covid-19-coronavirus-here-is-the-science/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F1022017940%2F0x0.jpg", "publishedAt": "2020-05-17T05:27:32Z", "content": "(Photo: Getty)\r\nGetty\r\nThere is a D in Covid-19. But can a lack of Vitamin D make you more susceptible to the Covid-19 coronavirus? Well, some studies have suggested this possibility. However, before you rush to the store and start hoarding Vitamin D suppleme… [+6906 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Yesica Fisch", "title": "Inside the rush to secure Rio de Janeiro's few COVID-19 beds - The Associated Press", "description": "DUQUE DE CAXIAS, Brazil (AP) — Specialists stood over intubated patients in the intensive care unit, reviewing charts and jotting down notes. They conversed in low voices, barely audible amid the...", "url": "https://apnews.com/142dfb5061fcfa957577ec88118d754d", "urlToImage": "https://storage.googleapis.com/afs-prod/media/42207429900d4912990a6b9f42f67e4a/3000.jpeg", "publishedAt": "2020-05-17T04:13:54Z", "content": "DUQUE DE CAXIAS, Brazil (AP) Specialists stood over intubated patients in the intensive care unit, reviewing charts and jotting down notes. They conversed in low voices, barely audible amid the incessant beeps from patients monitors.\r\nTwo empty beds were in s… [+2666 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "PTI", "title": "Mathematical modeling suggests containment of COVID-19 possible - The Indian Express", "description": "The government has drawn out a containment plan as clusters posing high risk of further spread of COVID-19 have emerged.", "url": "https://indianexpress.com/article/coronavirus/india-covid-19-containment-6413803/", "urlToImage": "https://images.indianexpress.com/2020/05/covid-9.jpg?w=759", "publishedAt": "2020-05-17T04:04:19Z", "content": "By: PTI | New Delhi | \r\nUpdated: May 17, 2020 9:28:41 am\r\nThe cluster containment strategy aims to contain the spread of the disease within a defined geographic area by early detection of cases, breaking the chain of transmission and thus preventing its sprea… [+4898 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Rebecca Rosenberg, Vincent Barone", "title": "Pharma Bro Martin Shkreli denied early prison release despite coronavirus fears - New York Post ", "description": "Adding insult to injury, the judge called the infamous Pharma Bro “delusional” and “self-aggrandizing” in turning down his get-out-of-jail bid.", "url": "https://nypost.com/2020/05/16/martin-shkreli-denied-early-prison-release-despite-coronavirus-fears/", "urlToImage": "https://thenypost.files.wordpress.com/2020/05/pharma-bro-remains-jailed.jpg?quality=90&strip=all&w=1200", "publishedAt": "2020-05-17T03:18:00Z", "content": "The Pharma Bro is staying behind bars another three years, despite his claimed fears of being at risk from the coronavirus.\r\nA federal judge in Brooklyn has denied Martin Shkrelis request to be released early, citing his good health and low-risk at the Allenw… [+1599 chars]"}, {"source": {"id": null, "name": "Ksn.com"}, "author": null, "title": "Several coronavirus cases linked to group events at Lake Perry - KSN-TV", "description": "SHAWNEE COUNTY, Kan. (KSNT) – The Shawnee County Health Department said it is investigating several cases of coronavirus linked to group events that happened in May at Lake Perry. Health officials …", "url": "https://www.ksn.com/news/health/coronavirus/coronavirus-in-kansas/several-coronavirus-cases-linked-to-group-events-at-lake-perry/", "urlToImage": "https://www.ksn.com/wp-content/uploads/sites/13/2020/05/LAKE.jpg?w=960&h=540&crop=1&resize=1280,720", "publishedAt": "2020-05-17T02:01:00Z", "content": "SHAWNEE COUNTY, Kan. (KSNT) The Shawnee County Health Department said it is investigating several cases of coronavirus linked to group events that happened in May at Lake Perry.\r\nHealth officials say at least 10 people who went to those lake gatherings have c… [+1450 chars]"}, {"source": {"id": null, "name": "Japantimes.co.jp"}, "author": "Internal Submission", "title": "Spraying disinfectants in effort to kill coronavirus can be 'harmful,' WHO says - The Japan Times", "description": "The WHO said streets are not considered \"reservoirs of infection,\" adding that spraying disinfectants can be \"dangerous for human health.\"", "url": "https://www.japantimes.co.jp/news/2020/05/17/world/science-health-world/spraying-disinfectants-coronavirus-harmful/", "urlToImage": "https://cdn.japantimes.2xx.jp/wp-content/uploads/2020/05/np_file_12398-870x580.jpeg", "publishedAt": "2020-05-17T01:38:00Z", "content": "Geneva – Spraying disinfectant on the streets, as practiced in some countries, does not eliminate the new coronavirus and even poses a health risk, the World Health Organization warned on Saturday.\r\nIn a document on cleaning and disinfecting surfaces as part … [+2036 chars]"}, {"source": {"id": null, "name": "Wfmz.com"}, "author": "", "title": "Lehigh Valley Health Network reopens locations for services - 69News WFMZ-TV", "description": "During the coronavirus outbreak, nearly half of the therapy locations were closed to help reduce spread of the infection.", "url": "https://www.wfmz.com/health/coronavirus/lehigh-valley-health-network-reopens-locations-for-services/article_5681d74c-9799-11ea-9934-a7695747dd8b.html", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/wfmz.com/content/tncms/assets/v3/editorial/b/ec/becc6c83-78dd-5765-b7e4-ed5a22212e1b/5d72b7450234d.image.jpg?resize=1120%2C630", "publishedAt": "2020-05-17T01:28:41Z", "content": "LEHIGH VALLEY, Pa. -- Lehigh Valley Health Network (LVHN) and Coordinated Health Rehabilitation Services have reopened for outpatient physical, occupational and speech therapy services as well as outpatient cardiac rehabilitation services. \r\nAccording to a st… [+1921 chars]"}, {"source": {"id": null, "name": "As.com"}, "author": "AS English", "title": "Coronavirus US live updates: cases, deaths, news and stimulus checks, today - AS.com Móvil", "description": "Live coverage of the Covid-19 pandemic in the United States: breaking news, updates and statistics as they emerge throughout today, 16/17 May 2020.", "url": "https://en.as.com/en/2020/05/17/other_sports/1589667933_992659.html", "urlToImage": "https://as01.epimg.net/en/imagenes/2020/05/17/other_sports/1589667933_992659_1589668176_noticia_normal.jpg", "publishedAt": "2020-05-17T01:02:04Z", "content": "MLB-League proposes rigorous testing among guidelines for return\r\nPlayers may have to skip the showers and spitting will not be allowed under guidelines proposed by Major League Baseball to bring America's pastime back during the COVID-19 pandemic.\r\nAs many a… [+924 chars]"}, {"source": {"id": null, "name": "Lostcoastoutpost.com"}, "author": "LoCO Staff", "title": "Five New Cases Confirmed Saturday, Including Another Staff Member at Alder Bay Assisted Living - Lost Coast Outpost", "description": "SEE ALSO:", "url": "https://lostcoastoutpost.com/2020/may/16/may-16-2020-five-new-cases-confirmed-today/", "urlToImage": "https://lostcoastoutpost.com/loco-media/cache/e7/08/e708d23afcd95b99340dc0f07b676e46.jpg", "publishedAt": "2020-05-17T00:28:10Z", "content": "Humboldt Countys total number of confirmed COVID-19 cases is now 77 as five additional positive cases were confirmed today.\r\nTesting conducted by Humboldt County Public Health at Alder Bay Assisted Living found an additional staff person at the facility posit… [+2070 chars]"}, {"source": {"id": null, "name": "Wcax.com"}, "author": "WCAX", "title": "Plattsburgh parties lead to rise in coronavirus cases - WCAX", "description": "'This rise in cases is very disturbing because it was preventable,” said John Kanoza, the County’s Director of Public Health.", "url": "https://www.wcax.com/content/news/Plattsburgh-parties-lead-to-rise-in-coronavirus-cases-570538281.html", "urlToImage": "https://media.graytvinc.com/images/plattsburgh14.jpg", "publishedAt": "2020-05-16T23:35:23Z", "content": "PLATTSBURGH, N.Y. (WCAX) Health officials in New York's North Country say several recent parties are to blame for new cases of COVID-19.\r\nNine new lab-confirmed positive cases of COVID-19 in Clinton County are associated with several recent parties in Plattsb… [+1045 chars]"}, {"source": {"id": null, "name": "Oregonlive.com"}, "author": "The Associated Press", "title": "Two Washington residents, sick with coronavirus-like symptoms December, test positive for COVID-19 antibodies - OregonLive", "description": "But the positive serology tests can’t determine whether the people had the coronavirus in December, weeks before the disease was officially detected in the United States.", "url": "https://www.oregonlive.com/coronavirus/2020/05/two-washington-residents-sick-with-coronavirus-like-symptoms-december-test-positive-for-covid-19-antibodies.html", "urlToImage": "https://www.oregonlive.com/resizer/Z-IUlqfi5ykpgiUotMIi4Lgwr9Q=/1280x0/smart/cloudfront-us-east-1.images.arcpublishing.com/advancelocal/X6LWGUXZYNCOBNRQHMJ7X5SKI4.JPG", "publishedAt": "2020-05-16T23:02:39Z", "content": "SEATTLE (AP) Two people in Washington state who recall being sick in December have since had blood tests showing they developed antibodies for the coronavirus, but health officials arent counting them in their official case counts.\r\nThe positive serology test… [+1871 chars]"}, {"source": {"id": null, "name": "Rapidcityjournal.com"}, "author": "Journal Staff", "title": "UPDATED: Department of Health says Rapid Ride driver may have exposed riders to coronavirus - Rapid City Journal", "description": "PIERRE, S.D. – State Health officials announced Saturday, May 16, that a Rapid Ride Transit driver has tested positive for COVID-19.", "url": "https://rapidcityjournal.com/news/updated-department-of-health-says-rapid-ride-driver-may-have-exposed-riders-to-coronavirus/article_082644b5-8fc7-55f5-a554-7f780ea3a2e9.html", "urlToImage": "https://bloximages.chicago2.vip.townnews.com/rapidcityjournal.com/content/tncms/assets/v3/editorial/3/4b/34b172ca-442d-5c16-88aa-2043d0940db7/5ec04912db12c.image.png?crop=175%2C98%2C0%2C14&resize=356%2C200&order=crop%2Cresize", "publishedAt": "2020-05-16T22:42:41Z", "content": "\"City officials have been working with State Health officials on this specific case and have determined the timelines for which the driver may have been able to transmit the virus to others,\" he said. \"RTS Manager Megan Gould indicates the driver was wearing … [+945 chars]"}, {"source": {"id": null, "name": "Kxan.com"}, "author": "Chelsea Moreno", "title": "Austin Public Health announces changes to online COVID-19 case tracker dashboard - KXAN.com", "description": "Austin Public Health officials announced changes that will be made to the city and Travis County’s COVID-19 case tracker dashboard on Saturday.", "url": "https://www.kxan.com/news/coronavirus/austin-public-health-announces-changes-to-online-covid-19-case-tracker-dashboard/", "urlToImage": "https://www.kxan.com/wp-content/uploads/sites/40/2020/05/2e719b0636bf4b0386a7b75d960f49cc-1-2-1-1-1-2-1.jpg?w=1280&h=720&crop=1", "publishedAt": "2020-05-16T22:29:00Z", "content": "AUSTIN (KXAN) The Austin and Travis County COVID-19 case tracker dashboard will undergo changes Sunday in an effort to provide further comprehensive data to the public, Austin Public Health officials announced on Saturday. \r\nThe new dashboard design will incl… [+1287 chars]"}, {"source": {"id": null, "name": "Patch.com"}, "author": "Nick Garber", "title": "Coronavirus Deaths Reach 1,000 In Washington - Seattle, WA Patch", "description": "State health officials confirmed 337 new coronavirus cases in Washington Saturday. Catch up on other recent developments.", "url": "https://patch.com/washington/seattle/coronavirus-deaths-reach-1-000-washington", "urlToImage": "https://patch.com/img/cdn20/getty/23562214/20200516/061744/styles/patch_image/public/gettyimages-1213357362___16175040834.jpg", "publishedAt": "2020-05-16T22:22:15Z", "content": null}, {"source": {"id": null, "name": "Komonews.com"}, "author": "KOMO News Staff", "title": "Coronavirus death toll tops 1,000 in Wash. as new cases hit 2-week high - KATU", "description": "The death toll from coronavirus has now topped 1,000 in Washington state, according to reports from individual counties, and the number of new confirmed cases statewide hit a two-week high. At least nine fatalities from the virus were recorded over the past d…", "url": "http://komonews.com/news/coronavirus/coronavirus-death-toll-tops-1000-in-wash-as-new-cases-hit-2-week-high", "urlToImage": "http://static-12.sinclairstoryline.com/resources/media/88bb132a-53d7-47a8-a502-608c3545483a-large16x9_200509_komo_covid_coronavirus_harborview_hospital_02.jpg?1589667666926", "publishedAt": "2020-05-16T22:22:00Z", "content": null}, {"source": {"id": null, "name": "Pantagraph.com"}, "author": "JULIE GERKE julie.gerke@lee.net", "title": "McLean County loses 5th resident to COVID - Bloomington Pantagraph", "description": "A hospital patient connected to a nursing home has become McLean County's fifth fatality related to the COVID-19 pandemic.", "url": "https://www.pantagraph.com/news/local/mclean-county-loses-5th-resident-to-covid/article_f3a84744-de82-5acf-b0cd-3b68f65b2705.html", "urlToImage": "https://bloximages.chicago2.vip.townnews.com/pantagraph.com/content/tncms/assets/v3/editorial/a/55/a555456a-5ac0-5c15-bf98-1761bd4c6d25/5ebdf6f2c98e4.image.jpg?crop=1736%2C977%2C0%2C108&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-05-16T21:58:00Z", "content": "BLOOMINGTON  A hospital patient connected to a nursing home has become McLean County's fifth fatality related to the COVID-19 pandemic.\r\nIn a statement Saturday, the health department said the person, who had other health problems, died late Friday afternoon.… [+1145 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "No new coronavirus deaths reported in SC; total case count hits 8,500 - The State", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiP2h0dHBzOi8vd3d3LnRoZXN0YXRlLmNvbS9uZXdzL2Nvcm9uYXZpcnVzL2FydGljbGUyNDI3ODY1ODEuaHRtbNIBP2h0dHBzOi8vYW1wLnRoZXN0YXRlLmNvbS9uZXdzL2Nvcm9uYXZpcnVzL2FydGljbGUyNDI3ODY1ODEuaHRtbA?oc=5", "urlToImage": null, "publishedAt": "2020-05-16T21:57:06Z", "content": null}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Frances Mulraney For Dailymail.com", "title": "States where coronavirus cases are rising and falling: Increase in South Dakota, New Jersey drops - Daily Mail", "description": "New cases of coronavirus continue to increase in South Dakota, Arkansas and Maine despite much of the United States now beginning to reopen. decline in new cases.", "url": "https://www.dailymail.co.uk/news/article-8326265/States-coronavirus-cases-rising-falling-Increase-South-Dakota-New-Jersey-drops.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/05/16/21/28477262-0-image-a-5_1589660199063.jpg", "publishedAt": "2020-05-16T21:35:04Z", "content": "Arkansas, Maine, and South Dakota, are still seeing large rises in new coronavirus cases even as 19 states reported a decline in cases this week and the majority of the United States started to lift its lockdown measures,\r\nSouth Dakota, which had a 134 percen… [+13327 chars]"}, {"source": {"id": null, "name": "Aa.com.tr"}, "author": null, "title": "New deaths from coronavirus drop dramatically in France - Anadolu Agency", "description": "Saturday revealed sizable movement downward in number of coronavirus fatalities, while infections still rise - Anadolu Agency", "url": "https://www.aa.com.tr/en/europe/new-deaths-from-coronavirus-drop-dramatically-in-france/1843577", "urlToImage": "https://cdnuploads.aa.com.tr/uploads/Contents/2020/05/16/thumbs_b_c_1e007c91ebd28ba2626826757c8fcb40.jpg?v=222810", "publishedAt": "2020-05-16T19:29:13Z", "content": "PARIS\r\nThe number of fatalities in France on Saturday plummeted after a week that proved uneven at best, according to the latest statistics reported by the French Health Ministry.\r\nA total of 96 fatalities were registered on Saturday, a dropping compared to t… [+1459 chars]"}, {"source": {"id": null, "name": "Cbslocal.com"}, "author": "CBS Boston", "title": "Tewksbury K9 Helps Officer Find 133 Bags Of Fentanyl - CBS Boston", "description": "Tewksbury Police arrested a man for drug trafficking after K9 Leo helped locate 133 bags of fentanyl, the department said Saturday.", "url": "https://boston.cbslocal.com/2020/05/16/aaron-gribbin-tewksbury-police-k9-helps-officer-find-133-bags-fentanyl-arrest/", "urlToImage": "https://boston.cbslocal.com/wp-content/uploads/sites/3859903/2020/05/tewksburyk9.jpg?w=1024", "publishedAt": "2020-05-16T18:42:57Z", "content": "TEWKSBURY (CBS) — Tewksbury Police arrested a man for drug trafficking after K9 Leo helped locate 133 bags of fentanyl, the department said Saturday.\r\nAaron Gribbin, 26, of Manchester, New Hampshire was arrested Friday after police were called to Andover Stre… [+530 chars]"}, {"source": {"id": null, "name": "Ktla.com"}, "author": "Associated Press", "title": "Every week, L.A. has thousands of coronavirus tests not being used - KTLA Los Angeles", "description": "With ample coronavirus tests and not enough sick people seeking them, the mayor of Los Angeles recently did something on a scale no other major U.S. city had done — allow anyone with or without sym…", "url": "https://ktla.com/news/local-news/every-week-l-a-still-has-thousands-of-coronavirus-tests-not-being-used/", "urlToImage": "https://ktla.com/wp-content/uploads/sites/4/2020/05/GettyImages-1224728310.jpg?w=1280&h=720&crop=1", "publishedAt": "2020-05-16T18:37:03Z", "content": "With ample coronavirus tests and not enough sick people seeking them, the mayor of Los Angeles recently did something on a scale no other major U.S. city had done allow anyone with or without symptoms to be tested as often as they want.\r\nA website to book a t… [+6755 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Emily Sohn", "title": "Some studies raise concerns about sunscreen chemicals. But if you dig deeper, evidence is still lacking, experts say. - The Washington Post", "description": "Despite what can seem like alarming research, a dermatologist says the products are not necessarily dangerous.", "url": "https://www.washingtonpost.com/health/some-studies-raise-concerns-about-sunscreen-chemicals-but-if-you-dig-deeper-evidence-is-still-lacking-experts-say/2020/05/15/90ca2f84-7e68-11ea-8013-1b6da0e4a2b7_story.html", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=&w=1440", "publishedAt": "2020-05-16T18:01:18Z", "content": "It can feel like a lose-lose scenario: If you put sunscreen on, you risk damage from chemical ingredients. If you dont, you risk UV damage from the sun.\r\nExperts say there is still no evidence that chemical sunscreens cause harm, especially if used on limited… [+6519 chars]"}, {"source": {"id": null, "name": "Grandforksherald.com"}, "author": null, "title": "North Dakota sees spike in COVID-19 cases as Fargo area testing disparity continues to grow - Grand Forks Herald", "description": "Cass County, which includes Fargo, accounts for more than 68% of the active COVID-19 cases but only about 22% of the total tests done in North Dakota.", "url": "https://www.grandforksherald.com/newsmd/coronavirus/6494438-North-Dakota-sees-spike-in-COVID-19-cases-as-Fargo-area-testing-disparity-continues-to-grow", "urlToImage": "https://www.fccnn.com/incoming/4971509-8h6wmd-coronavirus-covid-19-nih4.jpg/alternates/BASE_LANDSCAPE/coronavirus-covid-19-nih4.jpg", "publishedAt": "2020-05-16T18:00:00Z", "content": "BISMARCK The North Dakota Department of Health on Saturday, May 16, announced88 new cases of COVID-19, most of which came from the state's hotspot and largest metro area. It's the second highest number of new cases confirmed in a single day since the outbreak… [+3437 chars]"}, {"source": {"id": null, "name": "Komonews.com"}, "author": "Thomas Yazwinski | KEPR-TV News & KOMO News Staff", "title": "3 workers killed, 277 infected in coronavirus outbreak at E. Wash. beef plant - KATU", "description": "WALLULA, Wash. - An outbreak of COVID-19 at an Eastern Washington meatpacking plant has now killed three employees there and infected 277 other employees. A memorial with photos of the three employees who died now sits outside the entrance to the Tyson Fresh …", "url": "http://komonews.com/news/local/3-workers-killed-277-infected-in-coronavirus-outbreak-at-e-wash-beef-plant", "urlToImage": "http://static-41.sinclairstoryline.com/resources/media/3c5cad76-0af6-4c9f-9549-07a67b99cc9c-large16x9_tysonmemorial.jpg?1589651595873", "publishedAt": "2020-05-16T17:55:00Z", "content": null}, {"source": {"id": null, "name": "Staradvertiser.com"}, "author": "Associated Press", "title": "Criminals who hide their faces with masks taking advantage of pandemic, police say - Honolulu Star-Advertiser", "description": "CHICAGO >> The way the FBI tells it, William Rosario Lopez put on a surgical mask and walked into the Connecticut convenience store looking to the world like a typical pandemic-era shopper as he picked up plastic wrap, fruit snacks and a few other items. Then…", "url": "https://www.staradvertiser.com/2020/05/16/breaking-news/criminals-who-hide-their-faces-with-masks-taking-advantage-of-pandemic-police-say/", "urlToImage": "https://www.staradvertiser.com/wp-content/uploads/2020/05/web1_9989711-7246d1beb2d04363acb201978a2a102d.jpg", "publishedAt": "2020-05-16T17:50:41Z", "content": "CHICAGO &gt;&gt; The way the FBI tells it, William Rosario Lopez put on a surgical mask and walked into the Connecticut convenience store looking to the world like a typical pandemic-era shopper as he picked up plastic wrap, fruit snacks and a few other items… [+5434 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "France says coronavirus death toll rises to 27,625 - Reuters", "description": "French health authorities reported 96 new coronavirus deaths on Saturday, as the country eases from a two month lockdown.", "url": "https://www.reuters.com/article/us-health-coronavirus-france-idUSKBN22S0SG", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200516&t=2&i=1518873656&w=1200&r=LYNXMPEG4F0NO", "publishedAt": "2020-05-16T17:29:00Z", "content": "PARIS (Reuters) - French health authorities reported 96 new coronavirus deaths on Saturday, as the country eases from a two month lockdown. \r\nIn a statement, the health ministry said the figure had fallen slightly from 104 fatalities on Friday. This brings Fr… [+606 chars]"}, {"source": {"id": null, "name": "Kget.com"}, "author": "Karen Cruz-Orduña", "title": "Kern Public Health officials confirm one additional death, 45 new COVID-19 cases, bringing total to 1,483 - KGET 17", "description": "BAKERSFIELD, Calif. (KGET) — The Kern County Public Health Services Department confirmed one new COVID-19 related death Saturday morning, bringing the county’s death toll to 25. Officials ann…", "url": "https://www.kget.com/health/coronavirus/kern-public-health-officials-confirm-one-additional-death-45-new-covid-19-cases-bringing-total-to-1483/", "urlToImage": "https://www.kget.com/wp-content/uploads/sites/2/2020/05/Screen-Shot-2020-05-16-at-10.16.45-AM.png?w=1280&h=720&crop=1", "publishedAt": "2020-05-16T17:16:00Z", "content": "BAKERSFIELD, Calif. (KGET) The Kern County Public Health Services Department confirmed one new COVID-19 related death Saturday morning, bringing the county’s death toll to 25. \r\nOfficials announced 45 new COVID-19 cases in Kern County, bringing the total to 1… [+729 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Jon Levine", "title": "YouTube censors epidemiologist Knut Wittkowski for opposing lockdown - New York Post ", "description": "Big Tech companies are aggressively tamping down on COVID-19 “misinformation” — opinions and ideas contrary to official pronouncements. Dr. Knut M. Wittkowski, former head of biostatist…", "url": "https://nypost.com/2020/05/16/youtube-censors-epidemiologist-knut-wittkowski-for-opposing-lockdown/", "urlToImage": "https://thenypost.files.wordpress.com/2020/05/200516-knut-wittkowski.jpg?quality=90&strip=all&w=1200", "publishedAt": "2020-05-16T17:14:49Z", "content": "Big Tech companies are aggressively tamping down on COVID-19 “misinformation” opinions and ideas contrary to official pronouncements.\r\nDr. Knut M. Wittkowski, former head of biostatistics, epidemiology and research design at Rockefeller University, says YouTu… [+4107 chars]"}, {"source": {"id": null, "name": "Jsonline.com"}, "author": "Mark Johnson", "title": "'Something we've never seen before': Scientists still trying to understand baffling, unpredictable coronavirus - Milwaukee Journal Sentinel", "description": "As Americans debate reopening, the nation is still averaging about 1,000 COVID-19 deaths a day, roughly two 9/11 attacks every week.", "url": "https://www.jsonline.com/story/news/2020/05/16/what-we-up-against-scientists-still-trying-grasp-coronavirus/3121824001/", "urlToImage": "https://www.gannett-cdn.com/presto/2020/03/17/PMJS/c4600f7e-5c0b-4a81-a068-62be9971b8dd-COVID-19_testing__UW.jpg?crop=2852,1604,x148,y170&width=1600&height=800&fit=bounds", "publishedAt": "2020-05-16T16:57:59Z", "content": "The new coronavirus has spread like wildfire, killed  and spared  people of all ages and all health conditions, baffled doctors, defied guidance and conventional wisdom, and produced an unprecedented array of symptoms.\r\nThere's never been a virus like it.\r\n\"T… [+10181 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Andrew Freedman, Joel Achenbach", "title": "Summer weather could help fight coronavirus spread but won’t halt the pandemic - The Washington Post", "description": "Heat, humidity and sunshine are helpful, but the virus still spreads in warm-weather countries, and experts warn against complacency.", "url": "https://www.washingtonpost.com/health/summer-weather-could-help-fight-coronavirus-spread-but-wont-halt-the-pandemic/2020/05/15/70ee90e2-95f6-11ea-9f5e-56d8239bf9ad_story.html", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/7QYSUREXCII6VAVUZDNRMH7W4U.jpg&w=1440", "publishedAt": "2020-05-16T16:24:34Z", "content": "The best way to think about weather is as a secondary factor here, said Mohammad Jalali, an assistant professor at Harvard Medical School who has researched how weather affects the spread of viruses.\r\nThe effect of weather on the coronavirus has been the subj… [+7833 chars]"}, {"source": {"id": null, "name": "Bringmethenews.com"}, "author": "Joe Nelson", "title": "Minnesota reaches 700 COVID-19 deaths, ICU cases rising - Bring Me The News", "description": "Minnesota has now exceeded 700 deaths from the disease caused by the new coronavirus.", "url": "https://bringmethenews.com/minnesota-news/minnesota-reaches-700-covid-19-deaths-icu-cases-rising", "urlToImage": "https://bringmethenews.com/.image/t_share/MTcxNTk1Njg4MDYzMjgwNDg4/49530315718_d43ceca61a_k.jpg", "publishedAt": "2020-05-16T16:16:55Z", "content": "Another 17 people have died from COVID-19, bringing Minnesota's death toll from the disease to 700, according to Saturday's update from the Department of Health. \r\nThe deaths include one victim in their 40s while the 16 others were at least 70 years of age. F… [+1825 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Fran Kritz", "title": "Televisits may be here to stay for doctors, patients - San Antonio Express-News", "description": "With social distancing guidelines and stay-at-home orders in place, people are turning to televisits for relief.", "url": "https://www.washingtonpost.com/health/telemedicine-keeps-doctors-and-patients-connected-at-a-safe-remove/2020/05/14/5f1fa262-742b-11ea-ae50-7148009252e3_story.html", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/STBVGXUWAAI6VH26K3MCHG7ZVU.jpg&w=1440", "publishedAt": "2020-05-16T15:55:00Z", "content": "The terms telehealth, telemedicine and e-health have nuances when used legally, but for consumers, they are usually used interchangeably and refer to health care provided by a professional in a non-face-to-face manner, says Mei Wa Kwang, executive director of… [+9525 chars]"}, {"source": {"id": null, "name": "Triblive.com"}, "author": "Zach Brendza", "title": "Allegheny County reports 13 coronavirus cases, 2 deaths - TribLIVE", "description": "Allegheny County reported 13 more covid-19 cases and two deaths Saturday. The new figures bring the total number of coronavirus cases in the county to 1,595 and total deaths to 143. Of the reported coronavirus cases in the county, 59% of them have been 50 yea…", "url": "https://triblive.com/local/pittsburgh-allegheny/allegheny-county-reports-13-coronavirus-cases-2-deaths/", "urlToImage": "https://triblive.com/wp-content/uploads/2020/05/2650293_web1_ptr-GenericPGH003-051420.jpg", "publishedAt": "2020-05-16T15:21:31Z", "content": "You are solely responsible for your comments and by using TribLive.com you agree to our\r\nTerms of Service.\r\nWe moderate comments. Our goal is to provide substantive commentary for a general readership. By screening submissions, we provide a space where reader… [+1626 chars]"}, {"source": {"id": null, "name": "Kpax.com"}, "author": "", "title": "Montana lab at forefront of coronavirus vaccine research - KPAX-TV", "description": "There’s encouraging news about a potential coronavirus vaccine now being tested on humans and monkeys.", "url": "https://www.kpax.com/news/coronavirus/montana-lab-at-forefront-of-coronavirus-vaccine-research", "urlToImage": "https://ewscripps.brightspotcdn.com/dims4/default/0aec70f/2147483647/strip/true/crop/1280x672+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2Fa0%2F6b%2F8f1b9a334e1eb9a4705ae4b648fc%2Fnih-resaerchers.jpg", "publishedAt": "2020-05-16T15:20:32Z", "content": "NEW YORK The director of the National Institute of Health says no corners will be cut in the search for a vaccine -- which is going on here in Montana -- and theres encouraging news about a potential vaccine now being tested on humans and monkeys. \r\nNIH resea… [+1521 chars]"}, {"source": {"id": null, "name": "Kron4.com"}, "author": "The Associated Press", "title": "Coronavirus masks a boon for crooks who hide their faces - KRON4", "description": "The way the FBI tells it, William Rosario Lopez put on a surgical mask and walked into the Connecticut convenience store looking to the world like a typical pandemic-era shopper as he picked up pla…", "url": "https://www.kron4.com/health/coronavirus/coronavirus-masks-a-boon-for-crooks-who-hide-their-faces/", "urlToImage": "https://www.kron4.com/wp-content/uploads/sites/11/2020/05/masks.jpg?w=800&h=533&crop=1&resize=1280,720", "publishedAt": "2020-05-16T14:40:00Z", "content": "CHICAGO (AP) The way the FBI tells it, William Rosario Lopez put on a surgical mask and walked into the Connecticut convenience store looking to the world like a typical pandemic-era shopper as he picked up plastic wrap, fruit snacks and a few other items. Th… [+5397 chars]"}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Todd Wasserman", "title": "A Chinese rocket weighing 18 tons falls to Earth as space junk crisis hits a tipping point - CNBC", "description": "An 18-ton Chinese rocket plummeted toward Earth and landed in the Atlantic Ocean on May 11. The incident shows how space debris threatens the planet, satellites and spacecraft.", "url": "https://www.cnbc.com/2020/05/16/chinese-rocket-falls-to-earth-space-debris-problem-worsens.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/103023841-GettyImages-474381690.jpg?v=1589572014", "publishedAt": "2020-05-16T14:32:16Z", "content": "In this May 5, 2020, file photo released by Xinhua News Agency, China's new large carrier rocket Long March 5B blasts off from the Wenchang Space Launch Center in southern China's Hainan Province.\r\nSince humans first went up in space in 1961, we've done a poo… [+4824 chars]"}, {"source": {"id": null, "name": "Vox.com"}, "author": "Matthew Yglesias", "title": "Covid-19 antibodies: Spanish study has a scary takeaway about coronavirus immunity - Vox.com", "description": "One of the worst coronavirus outbreaks in the world isn’t anything close to a worst-case scenario.", "url": "https://www.vox.com/2020/5/16/21259492/covid-antibodies-spain-serology-study-coronavirus-immunity", "urlToImage": "https://cdn.vox-cdn.com/thumbor/speziRo2IO2m67UqJipTzrtzsjk=/0x618:4724x3091/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19980621/1213054120.jpg.jpg", "publishedAt": "2020-05-16T14:13:23Z", "content": "Spain has had one of the worst Covid-19 outbreaks in the world, which makes a recently completed antibody-testingstudy of the Spanish population so significant and so scary.\r\nPreliminary results from a well-designed survey of antibody presence among Spaniards… [+6955 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Paula Froelich", "title": "Who is Judy Mikovits, the woman behind banned 'Plandemic' conspiracy video? - New York Post ", "description": "This week, social media networks scrambled to take down the 26-minute “Plandemic Movie,” a viral conspiracy video spreading false claims about the coronavirus. Among the discredited, bo…", "url": "https://nypost.com/2020/05/16/who-is-judy-mikovits-the-woman-behind-the-banned-plandemic/", "urlToImage": "https://thenypost.files.wordpress.com/2020/05/plandemic-34.jpg?quality=90&strip=all&w=1200", "publishedAt": "2020-05-16T13:02:20Z", "content": "This week, social media networks scrambled to take down the 26-minute “Plandemic Movie,” a viral conspiracy video spreading false claims about the coronavirus.\r\nAmong the discredited, bogus and inflammatory claims that were made by the discredited former rese… [+3095 chars]"}, {"source": {"id": null, "name": "Kyodonews.net"}, "author": "KYODO NEWS", "title": "8 coronavirus vaccine candidates in clinical trial: WHO - Kyodo News Plus", "description": "Eight novel coronavirus vaccine candidates are in clinical trial with another 110 in various stages of development, as governments around the world scramble to contain the virus, according to World Health Organization data.", "url": "https://english.kyodonews.net", "urlToImage": "https://img.kyodonews.net/english/public/images/posts/d74e14fd06fb9ddbbd7ee2542adce0d9/cropped_image_l.jpg", "publishedAt": "2020-05-16T13:01:19Z", "content": "Eight novel coronavirus vaccine candidates are in clinical trial with another 110 in various stages of development, as governments around the world scramble to contain the virus, according to World Health Organization data.\r\nPharmaceutical companies and healt… [+2166 chars]"}, {"source": {"id": null, "name": "Military.com"}, "author": "Hope Yen", "title": "VA Says it Won’t Stop Use of Unproven Drug on Vets for Now - Military.com", "description": "As of Friday, 11,883 veterans had been confirmed to be infected with the virus.", "url": "https://www.military.com/daily-news/2020/05/16/va-says-it-wont-stop-use-unproven-drug-vets-now.html", "urlToImage": "https://images04.military.com/sites/default/files/2020-04/wilkie_virus_3000.jpeg", "publishedAt": "2020-05-16T12:00:00Z", "content": "WASHINGTON (AP) Facing growing criticism, the Department of Veterans Affairs said Friday that it will not halt use of an unproven malaria drug on veterans with COVID-19 but that fewer of its patients are now taking it.\r\nIn responses provided to Congress and o… [+6383 chars]"}, {"source": {"id": null, "name": "Wthr.com"}, "author": "https://www.facebook.com/WTHR13/, TEGNA, The Associated Press", "title": "Indiana coronavirus updates for Saturday, May 16, 2020 - WTHR", "description": "Saturday's latest updates on the coronavirus pandemic.", "url": "https://www.wthr.com/article/indiana-coronavirus-updates-saturday-may-16-2020", "urlToImage": "https://www.wthr.com/sites/default/files/styles/article_image/public/2020/03/04/obj_coronavirus_getty_wildpixel_970.jpg?itok=xawgYZvZ", "publishedAt": "2020-05-16T09:58:59Z", "content": "INDIANAPOLIS (WTHR/TEGNA/AP) Saturday's latest updates on the coronavirus pandemic.\r\nCommunity Health Network President, CEO donates convalescent plasma to help COVID-19 patients\r\nCommunity Health Network President and CEO Bryan Mills donated convalescent pla… [+4731 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: A third of hospital patients develop dangerous blood clots - BBC News", "description": "The virus appears to be making people's blood much more sticky, medical experts say.", "url": "https://www.bbc.com/news/health-52662065", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/4C3F/production/_112291591_2d7199ac-c008-4f0a-98e6-0fb0e7b8301e.jpg", "publishedAt": "2020-05-16T07:20:48Z", "content": "Image copyrightBrian McClure Image caption\r\n Brian McClure was admitted to hospital with pneumonia as a result of Covid-19\r\nUp to 30% of patients who are seriously ill with coronavirus are developing dangerous blood clots, according to medical experts.\r\nThey … [+3849 chars]"}, {"source": {"id": null, "name": "Kcrg.com"}, "author": "KCRG-TV9 News Staff", "title": "One case of PMIS reported in eastern Iowa - KCRG", "description": "There is a case of Pediatric Multi-system Inflammatory Syndrome in eastern Iowa, as of Friday night. That's according to the Polk County Pediatric Medical Collaborative.", "url": "https://www.kcrg.com/content/news/One-case-of-PMIS-reported-in-eastern-Iowa-570527511.html", "urlToImage": "https://media.graytvinc.com/images/MGN_1280x720_70508B00-UTMEO.jpg", "publishedAt": "2020-05-16T03:51:49Z", "content": "POLK COUNTY, Iowa (KCRG) - There is a case of Pediatric Multi-system Inflammatory Syndrome in eastern Iowa, as of Friday night.\r\nThat's according to the Polk County Pediatric Medical Collaborative. The syndrome, also known as PMIS and is possibly connected to… [+362 chars]"}, {"source": {"id": null, "name": "Krem.com"}, "author": "Regina Ahn", "title": "Comparing deaths caused by the flu, coronavirus in 2020 - KREM.com", "description": "So far, the coronavirus has killed more people in Washington and the United States as a whole, according to the Centers for Disease Control and Prevention.", "url": "https://www.krem.com/article/news/health/coronavirus/comparing-flu-coronavirus-deaths/293-4db122a3-952d-4284-bf6b-cb3491a5de14", "urlToImage": "https://media.krem.com/assets/KREM/images/19ddd527-a009-4930-830d-718584f71251/19ddd527-a009-4930-830d-718584f71251_1140x641.jpg", "publishedAt": "2020-05-16T03:43:00Z", "content": "SPOKANE, Wash. Amid the novel coronavirus pandemic, a lot of discussion has taken place about if the virus is more or less severe than influenza.\r\nA lot more is known about the flu, as it has been around in many different forms for hundreds of years.\r\nIn the … [+964 chars]"}, {"source": {"id": null, "name": "Kdvr.com"}, "author": "Matt Mauro", "title": "Fewer COVID-19 deaths reported in Colorado after health department changes fatality categorization - FOX31 Denver", "description": "DENVER (KDVR) — Nearly 300 fewer people have died directly from COVID-19 in Colorado than originally reported, after the Colorado Department of Health and Environment changed the death statis…", "url": "https://kdvr.com/news/coronavirus/fewer-covid-19-deaths-reported-in-colorado-after-health-department-changes-fatality-categorization/", "urlToImage": "https://kdvr.com/wp-content/uploads/sites/11/2020/03/march-10-20-cdphe-1.jpeg?w=1280&h=720&crop=1", "publishedAt": "2020-05-16T03:31:00Z", "content": "DENVER (KDVR) — Nearly 300 fewer people have died directly from COVID-19 in Colorado than originally reported, after the Colorado Department of Health and Environment changed the death statistics Friday.\r\nCDPHE now reports that as of May 9, 878 people had die… [+1896 chars]"}, {"source": {"id": null, "name": "Cbsaustin.com"}, "author": "Melanie Barden", "title": "New inflammatory illness in children with COVID-19 a factor when reopening schools - KEYE TV CBS Austin", "description": "This week, the CDC issued an alert to healthcare providers about a new inflammatory illness in children with COVID-19. It&rsquo;s called Pediatric Inflammatory Multisystem Syndrome (PIMS) and has appeared as an extremely rare response to COVID-19 in cases inv…", "url": "http://cbsaustin.com/news/local/new-inflammatory-illness-in-children-with-covid-19-a-factor-when-reopening-schools", "urlToImage": "http://static-41.sinclairstoryline.com/resources/media/e453d5a0-ecbd-4ffc-8ef3-c7343dbdd58a-large16x9_schoolpic.JPG?1589598530743", "publishedAt": "2020-05-16T03:16:07Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Twin Falls County Idaho concerned about surge in coronavirus - Idaho Statesman", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiRWh0dHBzOi8vd3d3LmlkYWhvc3RhdGVzbWFuLmNvbS9uZXdzL2Nvcm9uYXZpcnVzL2FydGljbGUyNDI3NzA2NzYuaHRtbNIBAA?oc=5", "urlToImage": null, "publishedAt": "2020-05-16T02:46:54Z", "content": null}, {"source": {"id": null, "name": "Localnews8.com"}, "author": "CNN", "title": "A surprising way you may risk getting Covid-19 - Local News 8 - LocalNews8.com", "description": "Much of what we understand about the transmission of infectious diseases is derived from odd outbreaks in far-flung places. For example, we learned more about measles from its rapid spread on an isolated Polynesian island in 1911 and about influenza from peop…", "url": "https://localnews8.com/health/2020/05/15/a-surprising-way-you-may-risk-getting-covid-19/", "urlToImage": "https://s3.us-east-1.wasabisys.com/localnews8.com/2020/05/200513084543-biologist-erin-bromage-live-video-3.jpg", "publishedAt": "2020-05-16T01:24:36Z", "content": "Much of what we understand about the transmission of infectious diseases is derived from odd outbreaks in far-flung places. For example, we learned more about measles from its rapid spread on an isolated Polynesian island in 1911 and about influenza from peop… [+4495 chars]"}, {"source": {"id": null, "name": "Abc15.com"}, "author": "https://www.abc15.com/about-us/staff/dave-biscobing", "title": "Arizona uses Hacienda rape case as example for withholding COVID-19 info - ABC15 Arizona", "description": "In response to a lawsuit filed by media outlets, outside attorneys for the Arizona Department of Health Services argued releasing names and locations of long-term care facilities of coronavirus outbreaks would violate state medical privacy laws and hurt the b…", "url": "https://www.abc15.com/news/local-news/investigations/arizona-uses-hacienda-rape-case-as-example-for-withholding-covid-19-info", "urlToImage": "https://ewscripps.brightspotcdn.com/dims4/default/3acd6e7/2147483647/strip/true/crop/2548x1338+0+92/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F82%2F6a%2F19408504477aa5e6a92096188582%2Fducey-press-conference.png", "publishedAt": "2020-05-16T01:23:00Z", "content": "In response to a lawsuit filed by media outlets, outside attorneys for the Arizona Department of Health Services argued releasing names and locations of long-term care facilities of coronavirus outbreaks would violate state medical privacy laws and hurt the b… [+3725 chars]"}, {"source": {"id": null, "name": "Bgr.com"}, "author": "Chris Smith", "title": "Promising coronavirus studies show that there’s hope for long-lasting immunity - BGR", "description": "Researchers studying the immune response of patients who have survived the novel coronavirus found evidence that can answer a few of our most pressing questions. The researchers identified the role of T cells in the immune response, and the early findings sug…", "url": "https://bgr.com/2020/05/15/coronavirus-immunity-after-recovery-new-studies-detail-immune-response/", "urlToImage": "https://boygeniusreport.files.wordpress.com/2020/05/rsz_10631476i.jpg?quality=70&strip=all", "publishedAt": "2020-05-16T00:32:59Z", "content": "<ul><li>Researchers studying the immune response of patients who have survived the novel coronavirus found evidence that can answer a few of our most pressing questions.</li><li>The researchers identified the role of T cells in the immune response, and the ea… [+5074 chars]"}, {"source": {"id": null, "name": "Oklahoman.com"}, "author": "Chris Casteel", "title": "Antibody testing in Oklahoma shows 3% have encountered COVID-19 - Oklahoman.com", "description": "Expanded testing in Oklahoma for antibodies to COVID-19 has shown about 3% of those tested have been exposed to the virus, according to a report from the state’s interim epidemiologist. \n Aaron Wendelboe, who compiles a weekly report updating elements of the …", "url": "https://oklahoman.com/article/5662470/antibody-testing-in-oklahoma-shows-3-have-encountered-covid-19", "urlToImage": "https://cdn2.newsok.biz/cache/r960_blur-b3c71de9ab76eda549ea343146747e06.jpg", "publishedAt": "2020-05-15T22:53:08Z", "content": "Expanded testing in Oklahoma for antibodies to COVID-19 has shown about 3% of those tested have been exposed to the virus, according to a report from the states interim epidemiologist.\r\nAaron Wendelboe, who compiles a weekly report updating elements of the pa… [+1726 chars]"}, {"source": {"id": null, "name": "Postbulletin.com"}, "author": null, "title": "A Rochester house party that went viral - PostBulletin.com", "description": "An April house party led to an outbreak of nearly 20 COVID-19 infections.", "url": "https://www.postbulletin.com/newsmd/coronavirus/6492970-A-Rochester-house-party-that-went-viral", "urlToImage": "https://www.postbulletin.com/incoming/5047115-d9h4v5-COVID-19-test/alternates/BASE_LANDSCAPE/COVID-19%20test", "publishedAt": "2020-05-15T22:51:47Z", "content": "Olmsted County's top public health official said the rapid response of investigators was key to containing an outbreak of COVID-19 that was linked to a Rochester house party held in mid-April, after Gov. Walz issued his stay-at-home decree.Officials say an un… [+4751 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "A look at the costs of a coronavirus vaccine - Yahoo Finance", "description": "#coronavirusvaccine #COVID-19 #coronavirus As COVID-19 infections rise worldwide, pharmaceutical companies working on coronavirus vaccines have floated promi...", "url": "https://www.youtube.com/watch?v=nFhPKZVfLaA", "urlToImage": "https://i.ytimg.com/vi/nFhPKZVfLaA/hqdefault.jpg", "publishedAt": "2020-05-15T20:59:43Z", "content": null}, {"source": {"id": null, "name": "Masslive.com"}, "author": "Tanner Stening | tstening@masslive.com", "title": "Massachusetts officials confirm 110 new coronavirus deaths, 1,239 new cases three days before state unveils p - MassLive.com", "description": "The state's Department of Public Health released the latest coronavirus statistics on Friday.", "url": "https://www.masslive.com/coronavirus/2020/05/massachusetts-officials-confirm-110-new-coronavirus-deaths-1239-new-cases-three-days-before-state-unveils-plan-to-reopen.html", "urlToImage": "https://www.masslive.com/resizer/4sUVbxzoC9WCaaFDvNFQtGh1wCo=/1280x0/smart/cloudfront-us-east-1.images.arcpublishing.com/advancelocal/COVLQSUKRJF7LAYV2YKSDGR76E.jpg", "publishedAt": "2020-05-15T20:44:00Z", "content": "Public health officials reported another 110 coronavirus deaths on Friday, bringing the number of statewide fatalities to 5,592.\r\nHealth officials also confirmed 1,239 new cases of the virus, for a total of now 83,421 across Massachusetts. Thats based on 11,3… [+2689 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Kelly McLaughlin", "title": "Sweden shows why herd immunity for coronavirus won't work in America - Business Insider - Business Insider", "description": "Health officials have called the concept of herd immunity dangerous and said it could take years to reach without a vaccine.", "url": "https://www.businessinsider.com/americans-call-herd-immunity-sweden-experiment-coronavirus-not-working-2020-5", "urlToImage": "https://i.insider.com/5ebebe341918246eca3c5fe7?width=1200&format=jpeg", "publishedAt": "2020-05-15T20:31:45Z", "content": "Business Insider\r\nAs Americans agitate for the reopening the economy in the middle of the coronavirus pandemic, some of them are looking at one strategy to make it feasible: herd immunity.\r\nYou don't need to look further than Sweden's anti-lockdown experiment… [+4943 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Chris Ciaccia", "title": "Coronavirus infections would plunge if 80 percent of people wore masks, study says - Fox News", "description": "The Centers for Disease Control and Prevention has recommended wearing masks in public settings to slow the spread of the coronavirus pandemic. A new study suggests that cases of COVID-19 could be cut significantly if 80 percent of people heeded this advice.", "url": "https://www.foxnews.com/science/coronavirus-infections-plunge-80-percent-wore-masks", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2020/04/iStock-1211188222.jpg", "publishedAt": "2020-05-15T19:30:19Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox. Sign up here.\r\nThe Centers for Disease Control and Prevention has recommended wearing masks in public settings to slow the spread of the coronavirus pandemic. A new study suggests … [+2528 chars]"}, {"source": {"id": null, "name": "Kpbs.org"}, "author": "Tarryn Mento", "title": "Rady Re-Evaluating Recent Kawasaki Cases For New Pediatric Illness Tied To Coronavirus - KPBS", "description": "San Diego's Children's Hospital is reviewing patients it recently treated for Kawasaki disease to determine if they were actually suffering from a similar but rare new illness connected to the novel coronavirus.", "url": "https://www.kpbs.org/news/2020/may/15/kawaski-pediatric-illness-associated-covid-19/", "urlToImage": "https://kpbs.media.clients.ellingtoncms.com/img/photos/2019/02/18/kawasaki.jpg", "publishedAt": "2020-05-15T19:07:33Z", "content": "San Diego's Children's Hospital is reviewing patients it recently treated for Kawasaki disease to determine if they were actually suffering from a similar but rare new illness connected to the novel coronavirus.\r\nAired: May 15, 2020 | \r\n+ Subscribe to this po… [+3566 chars]"}, {"source": {"id": null, "name": "Theblaze.com"}, "author": "Aaron Colen", "title": "Former neurosurgeon says masks are ineffective against COVID-19 and can cause health problems - TheBlaze.com", "description": "'One should not attack and insult those who have chosen not to wear a mask'", "url": "https://www.theblaze.com/news/former-neurosurgeon-masks-ineffective", "urlToImage": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yMzI4MjkxOC9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTU5MTg2OTE1OX0.th3oZRXoDSegSTgaRN7rosaNdFza4Z1ULGqJ0bm233A/img.jpg?width=1200&coordinates=0%2C59%2C0%2C59&height=600", "publishedAt": "2020-05-15T18:59:40Z", "content": "A former neurosurgeon wrote an op-ed published Thursday warning that face masks are not only ineffective against the novel coronavirus that causes COVID-19, but they can be potentially dangerous in some circumstances.\r\nDr. Russell Blaylock wrote for Technocra… [+2677 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Mirel Zaman", "title": "Is It Normal For Face Masks To Smell Bad? - Yahoo Lifestyle", "description": "“Quick question. Does anybody else’s face mask smell weird?”This single question, posed in a company Slack channel, unleashed the veritable flood gates. Peop...", "url": "https://www.yahoo.com/lifestyle/normal-face-masks-smell-bad-185650299.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/LoLbuZSjxUEbQYPN9VBr.Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD0xNTM2LjYwMDIzNDQ2NjU4ODU-/https://s.yimg.com/uu/api/res/1.2/ghtbO4g92J8hnPZqTCDuPQ--~B/aD0xMDI0O3c9ODUzO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/refinery29_778/6819da51490238d3eee05a3b10dda720", "publishedAt": "2020-05-15T18:56:00Z", "content": "NEW YORK, NEW YORK MAY 13: A woman wearing a mask carries a camera in Central Park amid the coronavirus pandemic on May 13, 2020 in New York City. COVID-19 has spread to most countries around the world, claiming over 297,000 lives with over 4.4 million cases.… [+3019 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Plasma Treatment Shows Promise For Coronavirus Patients | TODAY - TODAY", "description": "The first nationwide study of convalescent plasma – the transfusion of antibody-rich blood of a recovered patient to a sick one – has concluded the therapy i...", "url": "https://www.youtube.com/watch?v=8_fTe1tlmq8", "urlToImage": "https://i.ytimg.com/vi/8_fTe1tlmq8/maxresdefault.jpg", "publishedAt": "2020-05-15T18:00:04Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "When will a coronavirus vaccine be ready? One just got fast-tracked by the FDA - Miami Herald", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiQmh0dHBzOi8vd3d3Lm1pYW1paGVyYWxkLmNvbS9uZXdzL2Nvcm9uYXZpcnVzL2FydGljbGUyNDI3NTk4ODEuaHRtbNIBQmh0dHBzOi8vYW1wLm1pYW1paGVyYWxkLmNvbS9uZXdzL2Nvcm9uYXZpcnVzL2FydGljbGUyNDI3NTk4ODEuaHRtbA?oc=5", "urlToImage": null, "publishedAt": "2020-05-15T15:57:38Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Kids Infected with Syndrome Possibly Linked to COVID-19 | NowThis - NowThis News", "description": "A puzzling new syndrome has infected dozens of kids in the U.S. — and it could be related to COVID-19. » Subscribe to NowThis: http://go.nowth.is/News_Subscr...", "url": "https://www.youtube.com/watch?v=gh7JjwEQ150", "urlToImage": "https://i.ytimg.com/vi/gh7JjwEQ150/maxresdefault.jpg", "publishedAt": "2020-05-15T13:00:00Z", "content": "A puzzling new syndrome has infected dozens of kids in the U.S. and it could be related to COVID-19.» Subscribe to NowThis: http://go.nowth.is/News_Subscribe» Sign up for our newsletter KnowThis to get the biggest stories of the day delivered straight to your… [+1082 chars]"}]}