{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Startribune.com"}, "author": "Christopher Snowbeck", "title": "Minnesota COVID-19 deaths double in one week - Minneapolis Star Tribune", "description": "Nursing homes are fueling the virus toll. Case counts also are rising, with Gov. Gov. Tim Walz calling Nobles County a \"hot spot\" in an executive order.", "url": "https://www.startribune.com/minnesota-deaths-double-in-one-week/569956302/", "urlToImage": null, "publishedAt": "2020-04-26T00:53:26Z", "content": "It took 28 days for Minnesota to lose 121 people to COVID-19. It took just seven more for the count to double.\r\nState health officials announced 23 more deaths Saturday, pushing the statewide total to 244 since the first Minnesotan to die from the virus was r… [+6543 chars]"}, {"source": {"id": "politico", "name": "Politico"}, "author": "DEBRA KAHN", "title": "First recorded Covid death in US was from massive heart attack, autopsy says - POLITICO", "description": "County officials announced the death earlier this week.", "url": "https://www.politico.com/states/california/story/2020/04/25/first-recorded-covid-death-in-us-was-from-massive-heart-attack-autopsy-says-9422714", "urlToImage": null, "publishedAt": "2020-04-26T00:41:11Z", "content": "An illustration of the coronavirus. | CDC via AP\r\nSAN FRANCISCO A Santa Clara County woman who is the earliest recorded death from Covid-19 in the United States died of a massive heart attack, according to an autopsy conducted by the county's medical examiner… [+1192 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "Dallas County Reports 4 Additional Deaths, 75 New Cases of the Coronavirus - India Gone Viral", "description": "Dallas County on Saturday reported four additional deaths from the new coronavirus and 75 more cases. Two of the people who died — a man in his 80s and a woman in her 90s — had been residents of long-", "url": "https://indiagoneviral.com/health/2020/04/26/dallas-county-reports-4-additional-deaths-75-new-cases-of-the-coronavirus-fort-worth/42555/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-26T00:03:25Z", "content": "Dallas County on Saturday reported four additional deaths from the new coronavirus and 75 more cases.\r\nTwo of the people who died a man in his 80s and a woman in her 90s had been residents of long-term care facilities in Dallas. The other two cases included a… [+508 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "Ninety-six percent of inmates in four state prisons who tested positive for coronavirus were asymptomatic: report | TheHill - India Gone Viral", "description": "An overwhelmingly majority of inmates from four states' prison systems that tested positive for COVID-19 have been asymptomatic, according to Reuters.Between Arkansas, North Carolina, Ohio and Virgini", "url": "https://indiagoneviral.com/health/2020/04/26/ninety-six-percent-of-inmates-in-four-state-prisons-who-tested-positive-for-coronavirus-were-asymptomatic-report-thehill/42560/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-26T00:02:54Z", "content": "An overwhelmingly majority of inmates from four states’ prison systems that tested positive for COVID-19 have been asymptomatic, according to Reuters.\r\nBetween Arkansas, North Carolina, Ohio and Virginia, 3,277 inmates tested positive for the virus. Of that n… [+1892 chars]"}, {"source": {"id": null, "name": "Mercurynews.com"}, "author": "Leonardo Castañeda", "title": "Why researchers are testing 5,700 people for COVID-19 in San Francisco’s Mission District - The Mercury News", "description": "Researchers hope testing everyone in a Latino-heavy census tract will shed light on racial disparities in COVID-19 deaths", "url": "https://www.mercurynews.com/why-researchers-are-testing-5700-people-for-covid-19-in-san-franciscos-mission-district", "urlToImage": null, "publishedAt": "2020-04-25T23:49:30Z", "content": "SAN FRANCISCO Doctors and volunteers fanned out early Saturday morning to pop-up testing centers in the city’s heavily Latino Mission District for an unprecedented effort to test all 5,700 residents in one census tract in hopes the data collected will help ex… [+5371 chars]"}, {"source": {"id": null, "name": "Oregonlive.com"}, "author": "Aimee Green | The Oregonian/OregonLive, Shane Dixon Kavanaugh | The Oregonian", "title": "Coronavirus in Oregon: 1 new death, more than 2,250 known cases - OregonLive", "description": "The number of new positive test results grew by 76.", "url": "https://www.oregonlive.com/coronavirus/2020/04/coronavirus-in-oregon-1-new-death-more-than-2250-known-cases.html", "urlToImage": null, "publishedAt": "2020-04-25T23:28:00Z", "content": "Oregon officials on Saturday reported 1 new death from the novel coronavirus and 76 new cases -- bringing the total number of deaths to 87 and known cases to 2,253.\r\nThe Oregon Health Authority reported that the latest death was a 59-year-old Lane County man … [+2700 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Nathan Layne", "title": "Beaches eyed as United States takes steps toward reopening - Reuters", "description": "Many Americans flocked to beaches on Saturday as one Florida county expanded access and California experienced a heat wave, even as new coronavirus cases hit a record high in the United States the day before and deaths topped 200,000 worldwide.", "url": "https://www.reuters.com/article/us-health-coronavirus-usa-idUSKCN2270NY", "urlToImage": null, "publishedAt": "2020-04-25T23:23:23Z", "content": "(Reuters) - Many Americans flocked to beaches on Saturday as one Florida county expanded access and California experienced a heat wave, even as new coronavirus cases hit a record high in the United States the day before and deaths topped 200,000 worldwide. \r\n… [+5492 chars]"}, {"source": {"id": null, "name": "Ktuu.com"}, "author": "KTUU News", "title": "UPDATE: State reports no new cases of COVID-19 Saturday - KTUU.com", "description": "The Alaska Department of Health and Social Services reported no new cases of COVID-19 in the previous 24-hour reporting period, but Southeast Alaska Regional Health Consortium reported the first case of COVID-19 in Sitka Saturday afternoon.", "url": "https://www.ktuu.com/content/news/No-new-cases-of-COVID-19-reported-in-Alaska-Saturday-569952441.html", "urlToImage": null, "publishedAt": "2020-04-25T23:15:00Z", "content": "ANCHORAGE, Alaska (KTUU) Update: 3:09 p.m.Southeast Alaska Regional Health Consortium in Sitka has confirmed one new case of COVID-19 in Sitka Saturday, the first case reported in the Sitka community.\r\nThat case, first reported Saturday afternoon after the of… [+2794 chars]"}, {"source": {"id": null, "name": "Villages-news.com"}, "author": null, "title": "Villages officials look ahead to 'new norm' in wake of Coronavirus crisis - Villages-News", "description": "Officials in The Villages are looking ahead to a “new norm” in the wake of the Coronavirus crisis. We've got details.", "url": "https://www.villages-news.com/2020/04/25/villages-officials-look-ahead-to-new-norm-in-wake-of-coronavirus-crisis/", "urlToImage": null, "publishedAt": "2020-04-25T23:08:07Z", "content": "Officials in The Villages are looking ahead to a new norm in the wake of the Coronavirus crisis.\r\nRegional recreation centers and their swimming pools will be reopening on May 4. It will be the first wave of an envisioned phased reopening across Floridas Frie… [+1942 chars]"}, {"source": {"id": null, "name": "Wjla.com"}, "author": "ABC7", "title": "CDC adds six new symptoms linked to the coronavirus - WJLA", "description": "The Centers for Disease Control and Prevention has added six new symptoms linked to the coronavirus. The agency had previously only listed fever, cough, and shortness of breath or difficulty breathing as symptoms to watch for. &ldquo;People with COVID-19 have…", "url": "http://wjla.com/news/coronavirus/cdc-symptoms-covid", "urlToImage": null, "publishedAt": "2020-04-25T22:21:00Z", "content": null}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Anita Bennett", "title": "Coronavirus In L.A. County: 48 More Deaths And 607 New Cases Confirmed - Deadline", "description": "Coronavirus continues to claim lives across Los Angeles County. New figures released Saturday show 607 additional cases of COVID-19 and 48 more deaths in the county over the past 24 hours. Two of those deaths were reported by the city of Long Beach, the Los A…", "url": "https://deadline.com/2020/04/coronavirus-in-l-a-county-48-more-deaths-and-607-new-cases-confirmed-1202917903/", "urlToImage": null, "publishedAt": "2020-04-25T22:08:36Z", "content": "Coronavirus continues to claim lives across Los Angeles County. New figures released Saturday show 607 additional cases of COVID-19 and 48 more deaths in the county over the past 24 hours.\r\nTwo of those deaths were reported by the city of Long Beach, the Los … [+1143 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "US coronavirus: Some states begin to reopen as US closes in on 1 million coronavirus cases - msnNOW", "description": "A few states this weekend are running a tricky experiment: Trying to reopen certain businesses and services amid the coronavirus pandemic, even against the advice of some health experts who say it risks dangerously spiking the number of cases.", "url": "https://www.cnn.com/2020/04/25/health/us-coronavirus-saturday/index.html", "urlToImage": null, "publishedAt": "2020-04-25T22:00:00Z", "content": "A few states this weekend are running a tricky experiment: Trying to reopen certain businesses and services amid the coronavirus pandemic, even against the advice of some health experts who say it risks dangerously spiking the number of cases.\r\nBing COVID-19 … [+19109 chars]"}, {"source": {"id": null, "name": "Lostcoastoutpost.com"}, "author": "LoCO Staff", "title": "'Case Count Remains at 53,' Says HumCo Joint Information Center - Lost Coast Outpost", "description": "Humboldt County’s case count remains 53. No additional cases were confirmed today.", "url": "https://lostcoastoutpost.com/2020/apr/25/april-25-2020-covid-19-case-count-remains-at-53/", "urlToImage": null, "publishedAt": "2020-04-25T21:46:33Z", "content": "Humboldt County’s case count remains 53. No additional cases were confirmed today.\r\nHumboldt County Health Officer Dr. Teresa Frankovich said, “As always, it is encouraging to see no positive cases, but we recognize that we will see some increase in cases as … [+6433 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Robert Gearty", "title": "Long Island man, 100, dies from coronavirus, a century after Spanish flu took his twin brother - Fox News", "description": "The coronavirus has killed a 100-year-old Long Island man who went through life remembering the twin brother he lost to the 1918-19 Spanish Flu pandemic when they were weeks-old infants.", "url": "https://www.foxnews.com/us/long-island-man-dies-coronavirus-century-after-spanish-flu-took-twin-brother", "urlToImage": null, "publishedAt": "2020-04-25T21:45:20Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox. Sign up here.\r\nThe coronavirus has killed a 100-year-old Long Island man who went through life remembering the twin brother he lost to the 1918-19 Spanish Flu pandemic when they we… [+2460 chars]"}, {"source": {"id": null, "name": "Wmur.com"}, "author": "Sarah Murphy", "title": "7 new deaths related to COVID-19 reported in NH; most deaths announced in a single day - WMUR Manchester", "description": "6 deaths tied to institutions with outbreaks", "url": "https://www.wmur.com/article/7-new-deaths-related-to-covid-19-reported-most-deaths-announced-in-a-single-day/32277313", "urlToImage": null, "publishedAt": "2020-04-25T21:33:16Z", "content": "CONCORD, N.H. —Seven more people in New Hampshire have died from complications of COVID-19, health officials said Saturday. This is the most deaths announced in a single day related to the coronavirus. Six of the deaths were of residents at institutions with … [+1463 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Gina Kolata", "title": "Amid the Coronavirus Crisis, Heart and Stroke Patients Go Missing - The New York Times", "description": "Emergency physicians are seeing declines in the number of patients arriving with cardiac problems. Some say they were afraid to go to the hospital.", "url": "https://www.nytimes.com/2020/04/25/health/coronavirus-heart-stroke.html", "urlToImage": null, "publishedAt": "2020-04-25T21:26:25Z", "content": "Bishnu Virachan was a bicycle deliveryman for a grocery store in Queens. With New York City locked down, he was busier than ever.\r\nBut in early April, as he was watching television, he felt a pain in my heart. It frightened him, but he did not go to the emerg… [+6192 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Coronavirus updates: ‘No evidence’ to suggest recovered patients are immune; state passes 13K cases - Tacoma News Tribune", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiRWh0dHBzOi8vd3d3LnRoZW5ld3N0cmlidW5lLmNvbS9uZXdzL2Nvcm9uYXZpcnVzL2FydGljbGUyNDIyNzg1NzYuaHRtbNIBRWh0dHBzOi8vYW1wLnRoZW5ld3N0cmlidW5lLmNvbS9uZXdzL2Nvcm9uYXZpcnVzL2FydGljbGUyNDIyNzg1NzYuaHRtbA?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T21:25:20Z", "content": null}, {"source": {"id": "politico", "name": "Politico"}, "author": null, "title": "Fauci calls for at least doubling virus testing before reopening country - POLITICO", "description": "Public health experts have called for increased testing to get a clearer picture of the pandemic's scope.", "url": "https://www.politico.com/news/2020/04/25/anthony-fauci-coronavirus-testing-reopen-207962", "urlToImage": null, "publishedAt": "2020-04-25T21:04:25Z", "content": "Public health experts have called for increased testing to get a clearer picture of the pandemic's scope, as well as to identify, isolate and trace contacts for infected patients.\r\nHigh rates of positive results could mean there's not enough testing, Fauci sa… [+938 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Alexander Martin", "title": "Coronavirus: World Health Organisation warns against 'immunity passports' - Sky News", "description": "Scientific studies show most people who recovered from infection have antibodies to the coronavirus, but not all may be immune.", "url": "https://news.sky.com/story/coronavirus-world-health-organisation-warns-against-immunity-passports-11978682", "urlToImage": null, "publishedAt": "2020-04-25T20:18:07Z", "content": null}, {"source": {"id": null, "name": "Qz.com"}, "author": "Lila MacLellan", "title": "DIY coronavirus masks more protective if enhanced with pantyhose - Quartz", "description": "Could a pantyhose-enhanced face mask help spare you from Covid-19?", "url": "https://qz.com/1845741/diy-coronavirus-masks-more-protective-if-enhanced-with-pantyhose/", "urlToImage": null, "publishedAt": "2020-04-25T20:07:27Z", "content": "The homemade masks that millions are wearing in the US and elsewhere have always been a better-than-nothing solution for preventing the spread of the virus that causes Covid-19.\r\nTheyre not recommended to protect the wearer. Only N95 respirators can effective… [+2831 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Julie Steenhuysen", "title": "Special Report: Countries, companies risk billions in race for coronavirus vaccine - Reuters", "description": "In the race to develop a vaccine to end the COVID-19 pandemic, governments, charities and Big Pharma firms are sinking billions of dollars into bets with extraordinarily low odds of success.", "url": "https://www.reuters.com/article/us-health-coronavirus-vaccine-specialrep-idUSKCN2270U1", "urlToImage": null, "publishedAt": "2020-04-25T19:51:02Z", "content": "(Reuters) - In the race to develop a vaccine to end the COVID-19 pandemic, governments, charities and Big Pharma firms are sinking billions of dollars into bets with extraordinarily low odds of success. \r\nThey’re fast-tracking the testing and regulatory revie… [+16271 chars]"}, {"source": {"id": null, "name": "Npr.org"}, "author": "", "title": "As States Reopen, Health Experts Seek To Understand Coronavirus's Early Silent Spread - NPR", "description": "Medical examiners are now screening for possible coronavirus connections in late January. Emerging evidence suggests it spread far earlier and more widely than initially believed.", "url": "https://www.npr.org/2020/04/25/844098976/as-states-open-up-health-experts-seek-to-understand-coronaviruss-early-silent-sp", "urlToImage": null, "publishedAt": "2020-04-25T19:50:41Z", "content": "Beachgoers return to Port Hueneme Beach, Calif., on Thursday. Ventura County beaches and parks have been scheduled to reopen this week with some restrictions.\r\nMark J. Terrill/AP\r\nAs health officials across the country try to slow the coronavirus pandemic, a … [+6529 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Sara Dorn", "title": "Cyclist who angered Chris Cuomo is father of Johns Hopkins doctor - New York Post ", "description": "The biker who blasted CNN anchor Chris Cuomo as a “bully” in a roadside dispute in East Hampton is explaining why he cares so much the infected news anchor wasn’t social distancing — because …", "url": "https://nypost.com/2020/04/25/biker-in-social-distancing-spat-with-chris-cuomo-is-dad-of-doctor/", "urlToImage": null, "publishedAt": "2020-04-25T19:32:31Z", "content": "The biker who blasted CNN anchor Chris Cuomo as a bully in a roadside dispute in East Hampton is explaining why he cares so much the infected news anchor wasn’t social distancing because he’s the father of a Baltimore physician.\r\nMy daughter is a doctor at Jo… [+1429 chars]"}, {"source": {"id": null, "name": "Kxan.com"}, "author": "Harley Tamplin", "title": "Williamson County confirms first COVID-19 cluster at nursing home - KXAN.com", "description": "Authorities in Williamson County have confirmed the area’s first cluster of COVID-19 cases at a nursing home.", "url": "https://www.kxan.com/news/coronavirus/nursing-home-investigations/williamson-county-confirms-first-covid-19-cluster-at-nursing-home/", "urlToImage": null, "publishedAt": "2020-04-25T18:48:00Z", "content": "WILLIAMSON COUNTY, Texas (KXAN) Authorities in Williamson County have confirmed the areas first cluster of COVID-19 cases at a nursing home.\r\nIn total, 46 people have been diagnosed with the coronavirus at the same facility, including residents and staff.\r\nTh… [+2100 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "William Mansell, Ella Torres, Christina Carrega", "title": "Coronavirus live updates: Over 200,000 now dead from COVID-19 - ABC News", "description": "", "url": "https://abcnews.go.com/US/coronavirus-live-updates-135-inmates-test-positive-covid/story?id=70343518", "urlToImage": null, "publishedAt": "2020-04-25T18:30:50Z", "content": "A pandemic of the novel coronavirus has now killed over 200,000 people worldwide.\r\nMore than 2.8 million people across the globe have been diagnosed with COVID-19, the disease caused by the new respiratory virus, according to data compiled by the Center for S… [+15631 chars]"}, {"source": {"id": null, "name": "Kmbc.com"}, "author": "National Desk Staff", "title": "National coronavirus updates: Worldwide coronavirus death toll passes 200,000 - KMBC Kansas City", "description": "All over the country, blue-collar and salaried workers have raised their hands to make medical equipment.", "url": "https://www.kmbc.com/article/national-coronavirus-updates-april-25/32275158", "urlToImage": null, "publishedAt": "2020-04-25T18:23:00Z", "content": "The latest:\r\n<ul><li>There have been more than 936,000 coronavirus cases in the United States, according to the Johns Hopkins University tally.</li><li>The U.S. death toll has surpassed 53,000 people, according to Hopkins.</li><li>Globally, there have been mo… [+10149 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "WHO warns against coronavirus 'immunity passports' - Al Jazeera English", "description": "UN health agency says there is 'no evidence' that recovered coronavirus patients are protected from reinfection.", "url": "https://www.aljazeera.com/news/2020/04/warns-coronavirus-immunity-passports-200425150532564.html", "urlToImage": null, "publishedAt": "2020-04-25T18:15:49Z", "content": "The United Nations's health agency has warned there is no scientific evidence to prove that people who have recovered from the coronavirus develop immunity against potential infection in the future.\r\nThe World Health Organization (WHO) gave the warning on Sat… [+2432 chars]"}, {"source": {"id": null, "name": "Inverse.com"}, "author": "Abela Mahimbo, David Isaacs, Melissa Kang, Melanie Wong", "title": "Why are some people with Covid-19 asymptomatic? Evidence points to 2 factors - Inverse", "description": "Recent studies suggest as many as 80% or more of those infected are “silent carriers”, showing no or very mild symptoms.", "url": "https://www.inverse.com/science/covid-19-asymptomatic", "urlToImage": null, "publishedAt": "2020-04-25T17:58:15Z", "content": "SARS-CoV-2, the coronavirus which causes COVID-19, has infected almost 2.5 million people around the world and claimed 170,000 lives.\r\nBut some people dont even get symptoms. Recent studies suggest as many as 80 percentor more of those infected are silent car… [+5687 chars]"}, {"source": {"id": null, "name": "Pressdemocrat.com"}, "author": null, "title": "Sonoma County considers loosening stay-at-home order's restrictions on construction, real estate - Santa Rosa Press Democrat", "description": "County Health Officer Dr. Sundari Mase faces a critical decision: How much will she relax the stay-home order that she has already signaled will be renewed before it expires Friday.", "url": "https://www.pressdemocrat.com/news/10920710-181/sonoma-county-considers-changes-to", "urlToImage": null, "publishedAt": "2020-04-25T17:49:22Z", "content": "But the financial toll has been swift and brutal in California, where more than a half-million residents filed unemployment claims just last week, more than any other state. All told, 1 in 6 Californians have lost jobs, according to state figures. \r\nLocal voi… [+3277 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Sylvie Corbet", "title": "Virus lockdowns an extra ordeal for special-needs children - The Associated Press", "description": "PARIS (AP) — Weeks into France's strict coronavirus lockdown, Mohammed, a 14-year-old with autism, took a pickax and started hitting the wall of his family's house. His explanation: “Too...", "url": "https://apnews.com/f4ae1dafd842d2d1fe2135f9b696618a", "urlToImage": null, "publishedAt": "2020-04-25T17:45:35Z", "content": "PARIS (AP) Weeks into Frances strict coronavirus lockdown, Mohammed, a 14-year-old with autism, took a pickax and started hitting the wall of his familys house.\r\nHis explanation: Too long at home, too hard to wait.\r\nThe disruptions in daily life caused by the… [+5966 chars]"}, {"source": {"id": null, "name": "Ksn.com"}, "author": null, "title": "3,056 total cases with 117 deaths in Kansas; 279 new cases of the coronavirus - KSN-TV", "description": "The number of coronavirus cases is up 279 since Friday. There has been a reduction of one death due to an investigation determining that one death was not COVID-19 related.", "url": "https://www.ksn.com/news/health/coronavirus/coronavirus-in-kansas/3056-total-cases-with-117-deaths-in-kansas-279-new-cases-of-the-coronavirus/", "urlToImage": null, "publishedAt": "2020-04-25T17:33:00Z", "content": "WICHITA, Kan. (KSNW) - After weeks of closed and empty dining rooms, restaurants are getting eager to serve again, \"As much as we miss everyone and we want everyone to come back in and have a big party and business as usual. We really wanna make sure everyone… [+437 chars]"}, {"source": {"id": null, "name": "Spectrumnews1.com"}, "author": "Amber Smith, Spectrum News Staff", "title": "Poisonings on Rise as Families Fight Coronavirus - Spectrum News 1", "description": "Huge increases are happening across the country", "url": "https://spectrumnews1.com/ky/lexington/news/2020/04/25/kentuckians-poisoning-themselves-fighting-covid-19", "urlToImage": null, "publishedAt": "2020-04-25T16:49:00Z", "content": "LOUISVILLE, Ky.  A new report from the Centers for Disease Control and Prevention says calls to poison control centers across the country received more than 45,000 calls tied to cleaners and disinfectants in the first three months of the year. That is a 20% j… [+1851 chars]"}, {"source": {"id": null, "name": "Lee.net"}, "author": "Associated Press, CNN", "title": "Virus briefing: States reopen despite lack of tracking, and more to know this weekend - Richmond.com", "description": "\"Contact tracing\" falls short in most states including three that began reopening businesses this weekend. View an interactive guide and catch up on the COVID-19 pandemic.", "url": "https://news.lee.net/news/national/virus-briefing-states-reopen-despite-lack-of-tracking-and-more-to-know-this-weekend/article_8cde8d70-870a-11ea-9389-93ad71569e9c.html", "urlToImage": null, "publishedAt": "2020-04-25T16:15:00Z", "content": "Three U.S. states began loosening lockdown orders on their pandemic-wounded businesses, even as the confirmed U.S. death toll from the coronavirus soared past 50,000 and despite warnings from health experts that such steps may be coming too early.\r\nAs more st… [+2173 chars]"}, {"source": {"id": null, "name": "Ktar.com"}, "author": "", "title": "Arizona coronavirus cases increase to 6,280, death toll reaches 273 - KTAR.com", "description": "With 235 new positive tests for coronavirus reported by the state health department Saturday morning, Arizona has surpassed the 6,200-case mark.", "url": "https://ktar.com/story/3095911/arizona-coronavirus-cases-increase-to-6280-death-toll-reaches-273/", "urlToImage": null, "publishedAt": "2020-04-25T16:14:00Z", "content": "PHOENIX — With 235 new positive tests for coronavirus reported by the state health department Saturday morning, Arizona has surpassed the 6,200-case mark.\r\nThe state now has 6,280 cases with seven new deaths, bringing the death toll to 273.\r\nThere have been 6… [+2916 chars]"}, {"source": {"id": null, "name": "Kcra.com"}, "author": "KCRA Staff", "title": "5,000+ coronavirus cases tied to California nursing homes - KCRA Sacramento", "description": "More than 5,000 people connected to California nursing homes have tested positive for the novel coronavirus over time, according to new data released by the state Department of Public Health.", "url": "https://www.kcra.com/article/5000-coronavirus-cases-tied-to-california-nursing-homes/32274543", "urlToImage": null, "publishedAt": "2020-04-25T16:09:28Z", "content": "More than 5,000 people connected to California nursing homes have tested positive for the novel coronavirus over time, according to new data released by the state Department of Public Health.\r\nThe data, which was updated Friday, also shows there have been nea… [+2127 chars]"}, {"source": {"id": null, "name": "Dailyvoice.com"}, "author": null, "title": "Hospital: First Critical NJ Patients To Receive COVID-19 Plasma Make 'Remarkable' Recoveries - Daily Voice", "description": "The first two New Jersey residents to receive plasma transfusions for critical cases of COVID-19 -- a 63-year-old teacher and a 61-year-old old opera singer – were released from the hospital after making", "url": "https://dailyvoice.com/new-jersey/burlington/news/hospital-first-critical-nj-patients-to-receive-covid-19-plasma-make-remarkable-recoveries/787124/", "urlToImage": null, "publishedAt": "2020-04-25T16:09:00Z", "content": "The first two New Jersey residents to receive plasma transfusions for critical cases of COVID-19 -- a 63-year-old teacher and a 61-year-old old opera singer were released from the hospital after making \"remarkable\" recoveries, Virtua Voorhees Health System an… [+2571 chars]"}, {"source": {"id": null, "name": "Fox8.com"}, "author": "CNNwire", "title": "5-month-old daughter of a New York firefighter dies from coronavirus - WJW FOX 8 News Cleveland", "description": "A New York firefighter’s infant daughter has died from coronavirus, her family says, making her one of the youngest known victims of the virus.", "url": "https://fox8.com/news/coronavirus/5-month-old-daughter-of-a-new-york-firefighter-dies-from-coronavirus/", "urlToImage": null, "publishedAt": "2020-04-25T16:08:53Z", "content": "(CNN) — A New York firefighter’s infant daughter has died from coronavirus, her family says, making her one of the youngest known victims of the virus.\r\nFive-month-old Jay-Natalie, the daughter of New York City firefighter Jerel La Santa and Board of Educatio… [+2469 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Janelle Griffith", "title": "Detroit health care worker dies after being denied coronavirus test 4 times, daughter says - NBC News", "description": "A Detroit health care worker died April 17 of COVID-19, after being denied a coronavirus test four times by her hospital employer, her daughter said.", "url": "https://www.nbcnews.com/news/us-news/detroit-health-care-worker-dies-after-being-denied-coronavirus-test-n1192076", "urlToImage": null, "publishedAt": "2020-04-25T15:39:23Z", "content": "Deborah Gatewood had two years to go before she could retire from a Detroit hospital.\r\nBut Gatewood, a phlebotomist for three decades, will never celebrate that milestone.\r\nShe died April 17 from symptoms related to the coronavirus.\r\nHer daughter said that pr… [+3067 chars]"}, {"source": {"id": null, "name": "Wsfa.com"}, "author": "WSFA Staff", "title": "Over 200 killed, 52,600 confirmed COVID-19 cases in Alabama - WSFA", "description": "According to the latest numbers from ADPH, over 71,300 people across the state have been tested.", "url": "https://www.wsfa.com/2020/04/25/over-killed-confirmed-covid-cases-alabama/", "urlToImage": null, "publishedAt": "2020-04-25T15:28:00Z", "content": "MONTGOMERY, Ala. (WSFA) - Nearly a month after the state announced its first COVID-19 related death, the Alabama Department of Public Health reports more than 200 have died from the virus.\r\nAccording to the latest numbers from ADPH, over 71,300 people across … [+1350 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Sandra G. Boodman", "title": "She fell more than 30 times. For three years, doctors couldn’t explain why. - The Washington Post", "description": "A bevy of specialists tried to help but seemed stymied by her symptoms — and their narrow focus.", "url": "https://www.washingtonpost.com/health/medical-mysteries/she-fell-more-than-30-times-for-three-years-doctors-couldnt-explain-why/2020/04/24/685c2eaa-62f5-11ea-acca-80c22bbee96f_story.html", "urlToImage": null, "publishedAt": "2020-04-25T15:11:19Z", "content": "The 10 doctors she consulted between 2016 and 2019 four orthopedists, three neurologists, a rheumatologist, a podiatrist and her internist reached disparate conclusions. One suggested she was clumsy. Others suspected her problem was primarily orthopedic or co… [+8899 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Producer recorded talk between kids about Covid-19 - CNN", "description": "A CNN producer heard her daughter speaking with a friend, talking about coronavirus, and decided to film it. Child psychiatrist Dr. Wanjiku F.M. Njoroge explains how to talk to your children when tough questions on race and Covid-19 come up.", "url": "https://www.cnn.com/videos/health/2020/04/25/producer-daughter-video-chat-coronavirus-covid-19-sesame-street-town-hall-sot-vpx.cnn", "urlToImage": null, "publishedAt": "2020-04-25T14:48:32Z", "content": "Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds."}, {"source": {"id": null, "name": "Aol.com"}, "author": "Joe Peters", "title": "Ultraviolet light can be used against coronavirus, just not in the way Trump imagines - AOL", "description": "Commercially available UV products might help ease the transition out of a total lockdown by reducing the risk of contagion.", "url": "https://www.aol.com/article/news/2020/04/25/ultraviolet-light-can-be-used-against-coronavirus-just-not-in-the-way-trump-imagines/24100202/", "urlToImage": null, "publishedAt": "2020-04-25T14:27:24Z", "content": "WASHINGTON President Trumps mention Thursday of treating COVID-19 with ultraviolet light was part of a rambling digression that included speculation about administering disinfectants to patients, prompting confusion and alarm from medical experts.\r\nThe presid… [+47465 chars]"}, {"source": {"id": null, "name": "Wchstv.com"}, "author": "SHANNON STOWERS", "title": "W.Va. adds 10 positive COVID-19 cases Saturday morning - WCHS-TV8", "description": "West Virginia added 10 positive coronavirus cases to its total Saturday morning, health officials confirmed. The state's total now stands at 1,020, according to the West Virginia Department of Health and Human Resources. No new deaths were reported as of 10 a…", "url": "http://wchstv.com/news/local/wva-adds-10-more-positive-covid-19-cases-saturday-morning", "urlToImage": null, "publishedAt": "2020-04-25T14:14:00Z", "content": null}, {"source": {"id": null, "name": "Abs-cbn.com"}, "author": "Agence France-Presse", "title": "WHO: ‘No evidence’ that people who recovered from COVID-19 are immunized - ABS-CBN News", "description": "There is not enough evidence about the effectiveness of antibody-mediated immunity to guarantee the accuracy of an \"immunity passport\" or \"risk-free certificate.\"", "url": "https://news.abs-cbn.com/overseas/04/25/20/who-people-recovered-covid-19-immunized", "urlToImage": null, "publishedAt": "2020-04-25T13:52:00Z", "content": "The World Health Organization (WHO) warned on Saturday that there is no evidence that people who test positive for the new coronavirus are immunized and protected against reinfection.\r\nThe warning suggests that the issuance of \"immune passports\" may promote t… [+2075 chars]"}, {"source": {"id": null, "name": "Northcountrynow.com"}, "author": null, "title": "11 new COVID-19 cases reported to St. Lawrence County Public Health, eight hospitalized - North Country Now", "description": null, "url": "https://www.northcountrynow.com/news/11-new-covid-19-cases-reported-st-lawrence-county-public-health-eight-hospitalized-0279172", "urlToImage": null, "publishedAt": "2020-04-25T13:36:16Z", "content": "St. Lawrence County Public Health officials say 11 new cases of COVID-19 have been reported to them, bringing the county's total up to 162.\r\nThe positive cases in St Lawrence County, as of April 24, are located in Hammond, Fowler, Ogdensburg, Oswegatchie, Mac… [+2755 chars]"}, {"source": {"id": null, "name": "Today.com"}, "author": "TODAY.com", "title": "Why are people having more vivid dreams during the coronavirus pandemic? - Today.com", "description": "Weekend TODAY’s Peter Alexander recounts a weird dream he recently had. Then, Harvard dream researcher Deirdre Barrett explains why some people, like Peter, are having vivid dreams during the global coronavirus pandemic. She says some reasons may include slee…", "url": "https://www.today.com/video/why-are-people-having-more-vivid-dreams-during-the-coronavirus-pandemic-82562629869", "urlToImage": null, "publishedAt": "2020-04-25T13:16:19Z", "content": "Weekend TODAYs Peter Alexander recounts a weird dream he recently had. Then, Harvard dream researcher Deirdre Barrett explains why some people, like Peter, are having vivid dreams during the global coronavirus pandemic. She says some reasons may include sleep… [+71 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "'It's Nothing I've Ever Seen Before': Health Care Workers Share Their COVID-19 Stories - NBC New York", "description": "What is it like to be a worker at a hospital treating COVID-19 patients? Greg Cergol reports.", "url": "https://www.youtube.com/watch?v=2xPm5FVxo3U", "urlToImage": null, "publishedAt": "2020-04-25T12:15:10Z", "content": "Sign in to report inappropriate content.\r\nSign in"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandee LaMotte, CNN", "title": "Stressed pets: Reducing their anxiety now and when you go back to work - CNN", "description": "Not all of our pets are thrilled we're home 24/7: Here's how to recognize signs of stressed pets, help them, and prepare our pets for when we return to work.", "url": "https://www.cnn.com/2020/04/25/health/stressed-pets-coronavirus-wellness/index.html", "urlToImage": null, "publishedAt": "2020-04-25T11:45:49Z", "content": null}, {"source": {"id": "the-irish-times", "name": "The Irish Times"}, "author": "The Irish Times", "title": "Coronavirus: No evidence that recovered patients are immune, says WHO - The Irish Times", "description": "Health agency warns governments against issuing ‘immunity passports’", "url": "https://www.irishtimes.com/news/world/coronavirus-no-evidence-that-recovered-patients-are-immune-says-who-1.4238216", "urlToImage": null, "publishedAt": "2020-04-25T11:30:48Z", "content": "The World Health Organisation (WHO) said on Saturday that there was currently no evidence that people who have recovered from coronavirus and have antibodies are protected from a second coronavirus infection.\r\nIn a scientific brief, the United Nations agency … [+1685 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Dale Smith", "title": "Coronavirus antibody testing a big deal? What to know about the promising serology tests - CNET", "description": "Tests that detect whether you've recovered from COVID-19 might help doctors and government officials navigate the pandemic. Here's what you should know.", "url": "https://www.cnet.com/how-to/coronavirus-antibody-testing-a-big-deal-what-to-know-about-the-promising-serology-tests/", "urlToImage": null, "publishedAt": "2020-04-25T10:10:29Z", "content": "Antibody testing looks for evidence that a person has been infected with the coronavirus SARS-CoV-2, but not the virus itself.\r\nJames Martin/CNET\r\nFor the most up-to-date news and information about the coronavirus pandemic, visit the WHO website.\r\nAs some are… [+7629 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "'No evidence' that recovered COVID-19 patients cannot be reinfected: WHO - Reuters", "description": "The World Health Organization (WHO) said on Saturday that there was currently \"no evidence\" that people who have recovered from COVID-19 and have antibodies are protected from a second coronavirus infection.", "url": "https://www.reuters.com/article/us-health-coronavirus-who-idUSKCN2270FB", "urlToImage": null, "publishedAt": "2020-04-25T09:50:00Z", "content": "GENEVA (Reuters) - The World Health Organization (WHO) said on Saturday that there was currently “no evidence” that people who have recovered from COVID-19 and have antibodies are protected from a second coronavirus infection. \r\nIn a scientific brief, the Uni… [+1753 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Michael Wilson", "title": "March, April, May: City’s Mood Darkens as Crisis Feels Endless - The New York Times", "description": "With no clues about when the pandemic might subside, short-term discomfort is becoming long-term despair: “I feel like I have accepted this, and given up.”", "url": "https://www.nytimes.com/2020/04/25/nyregion/nyc-coronavirus-crisis.html", "urlToImage": null, "publishedAt": "2020-04-25T09:43:43Z", "content": "With no clues about when the pandemic might subside, short-term discomfort is becoming long-term despair: I feel like I have accepted this, and given up.\r\nApril 25, 2020\r\nA walk in the park brings tense flare-ups: Back off, youre too close. Oh really? Then st… [+7411 chars]"}, {"source": {"id": null, "name": "Bostonglobe.com"}, "author": null, "title": "WHO says you could catch coronavirus more than once - The Boston Globe", "description": "“There is currently no evidence that people who have recovered from COVID-19 and have antibodies are protected from a second infection,” the United Nations agency said in an April 24 statement.", "url": "https://www.bostonglobe.com/2020/04/25/nation/who-says-you-could-catch-coronavirus-more-than-once/", "urlToImage": null, "publishedAt": "2020-04-25T09:35:16Z", "content": "Catching Covid-19 once may not protect you from getting it again, according to the World Health Organization, a finding that could jeopardize efforts to allow people to return to work after recovering from the virus.\r\nThere is currently no evidence that peopl… [+2099 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "UW to lead national study of drug promoted by President Trump to fight coronavirus - India Gone Viral", "description": "Researchers at the University of Washington on Friday announced a major new study of the malaria drug President Donald Trump has praised as a possible, low-cost cure for COVID-19.The clinical trial is", "url": "https://indiagoneviral.com/health/2020/04/25/uw-to-lead-national-study-of-drug-promoted-by-president-trump-to-fight-coronavirus/42019/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-25T08:08:14Z", "content": "Researchers at the University of Washington on Friday announced a major new study of the malaria drug President Donald Trump has praised as a possible, low-cost cure for COVID-19.\r\nThe clinical trial is one of dozens around the world aimed at providing defini… [+4531 chars]"}, {"source": {"id": null, "name": "Thejakartapost.com"}, "author": "The Jakarta Post", "title": "Success against malaria gives solutions for COVID-19 - The Jakarta Post - Jakarta Post", "description": "Today is World Malaria Day, a day when we remind ourselves of a disease that has killed more people in history than any other.", "url": "https://www.thejakartapost.com/academia/2020/04/25/success-against-malaria-gives-solutions-for-covid-19.html", "urlToImage": null, "publishedAt": "2020-04-25T04:56:00Z", "content": "Today is World Malaria Day, a day when we remind ourselves of a disease that has killed more people in history than any other.\r\nAs the world is focused on bringing the deadly COVID-19 pandemic under control, reflecting on the progress made in the fight agains… [+4107 chars]"}, {"source": {"id": null, "name": "Wkrn.com"}, "author": "CB Cotton", "title": "Vanderbilt releases new projections about COVID-19 spread after economic re-open - WKRN News 2", "description": "Researchers at Vanderbilt University Medical Center have released a new study with projections on what could happen if COVID-19 continues to spread, once the economy re-opens.", "url": "https://www.wkrn.com/community/health/coronavirus/vanderbilt-releases-new-projections-about-covid-19-spread-after-economic-re-open/", "urlToImage": null, "publishedAt": "2020-04-25T03:36:00Z", "content": "NASHVILLE, Tenn. (WKRN) Researchers at Vanderbilt University Medical Center have released a new study with projections on what could happen if COVID-19 continues to spread, once the economy re-opens.\r\n“What they [Friday’s projections] demonstrate today is wha… [+2313 chars]"}, {"source": {"id": null, "name": "Fox17.com"}, "author": "WZTV Staff", "title": "Mt. Juliet Police looking for suspect who ran away from officer - WZTV", "description": "UPDATE:The Mt. Juliet Police Department has taken the suspect accused of running from an officer into custody. K9 Majlo tracked the suspect's scent to his location. Officers say the suspect is a 25-year-old man with multiple felony warrants out of Nashville, …", "url": "http://fox17.com/news/local/mt-juliet-police-looking-for-suspect-who-ran-away-from-officer", "urlToImage": null, "publishedAt": "2020-04-25T02:48:27Z", "content": null}, {"source": {"id": null, "name": "Wlos.com"}, "author": "Kimberly King", "title": "Disagreement among Asheville, Henderson County leaders over extended stay home order - WLOS", "description": "Gov. Roy Cooper&rsquo;s extended stay home order coupled with a vague outline of phases for reopening North Carolina&rsquo;s economy is being met with mixed reviews by leaders in democratic-led Buncombe County and Republican-led Henderson County. WLOS. On Fri…", "url": "http://wlos.com/news/local/disagreement-among-asheville-henderson-county-leaders-over-extended-stay-home-order", "urlToImage": null, "publishedAt": "2020-04-25T02:35:25Z", "content": null}, {"source": {"id": null, "name": "Kfyrtv.com"}, "author": "Valley News Live", "title": "Doosan Bobcat tells employees at Gwinner plant to stay home due to possible COVID-19 case - KFYR-TV", "description": "Doosan Bobcat says it has asked employees to not report to work on Friday after a presumptive positive case of COVID-19.", "url": "https://www.kfyrtv.com/content/news/Doosan-Bobcat-tells-employees-at-Gwinner-plant-to-stay-home-due-to-possible-COVID-19-case-569938901.html", "urlToImage": null, "publishedAt": "2020-04-25T00:14:00Z", "content": "GWINNER, N.D. (Valley News Live) - Doosan Bobcat says it has asked employees to not report to work on Friday after a presumptive positive case of COVID-19.\r\nAccording to a statement, an employee at the Gwinner plant self-disclosed of possibly having the infec… [+611 chars]"}, {"source": {"id": null, "name": "Npr.org"}, "author": null, "title": "Meet 'Spot': The Robot That Could Help Doctors Remotely Treat COVID-19 Patients - NPR", "description": "Developed by Boston Dynamics, the four-legged robot can travel difficult terrain. Brigham and Women's Hospital is testing its value, starting with initial patient interviews, to reduce staff exposure.", "url": "https://www.npr.org/sections/coronavirus-live-updates/2020/04/24/844770815/meet-spot-the-robot-that-could-help-doctors-remotely-treat-covid-19-patients", "urlToImage": null, "publishedAt": "2020-04-24T22:50:40Z", "content": "Spot, a four-legged robot, is being tested at Boston's Brigham and Women's Hospital as a way to treat some COVID-19 patients.\r\nBoston Dynamics\r\nBrigham and Women's Hospital in Boston has been testing a new piece of hardware to help them treat coronavirus case… [+1741 chars]"}, {"source": {"id": null, "name": "Inquirer.com"}, "author": "Ariana Eunjung Cha, Washington Post", "title": "Healthy people in their 30s and 40s, barely sick with COVID-19, are dying from strokes - The Philadelphia Inquirer", "description": "Thomas Oxley wasn't even on call the day he received the page to come into Mount Sinai Beth Israel Hospital in Manhattan. There weren't enough doctors to treat all the emergency stroke patients, and he was needed in the operating room.", "url": "https://www.inquirer.com/health/coronavirus/coronavirus-stroke-young-people-20200424.html", "urlToImage": null, "publishedAt": "2020-04-24T22:49:29Z", "content": "Thomas Oxley wasn't even on call the day he received the page to come into Mount Sinai Beth Israel Hospital in Manhattan. There weren't enough doctors to treat all the emergency stroke patients, and he was needed in the operating room.\r\nThe patient's chart ap… [+8996 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Two more long-term care centers in St. Clair County reporting coronavirus outbreaks - Belleville News-Democrat", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiOmh0dHBzOi8vd3d3LmJuZC5jb20vbmV3cy9jb3JvbmF2aXJ1cy9hcnRpY2xlMjQyMjc0OTgxLmh0bWzSATpodHRwczovL2FtcC5ibmQuY29tL25ld3MvY29yb25hdmlydXMvYXJ0aWNsZTI0MjI3NDk4MS5odG1s?oc=5", "urlToImage": null, "publishedAt": "2020-04-24T21:55:31Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "What to know about protecting pets from coronavirus, caring for them if you’re sick - The State", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiP2h0dHBzOi8vd3d3LnRoZXN0YXRlLmNvbS9uZXdzL2Nvcm9uYXZpcnVzL2FydGljbGUyNDIyNzM5NTYuaHRtbNIBP2h0dHBzOi8vYW1wLnRoZXN0YXRlLmNvbS9uZXdzL2Nvcm9uYXZpcnVzL2FydGljbGUyNDIyNzM5NTYuaHRtbA?oc=5", "urlToImage": null, "publishedAt": "2020-04-24T21:37:13Z", "content": null}, {"source": {"id": null, "name": "Abc6onyourside.com"}, "author": "Stephen Loiaconi", "title": "Biden benefits from staying out of spotlight amid coronavirus outbreak, experts say - ABC6OnYourSide.com", "description": "Former Vice President Joe Biden is building a lead over President Donald Trump in key swing states, new polls suggest, as voters question Trump&rsquo;s response to the coronavirus outbreak and pay relatively little attention to anything Biden is doing at all.…", "url": "http://abc6onyourside.com/news/nation-world/biden-benefits-from-staying-out-of-spotlight-amid-coronavirus-outbreak-experts-say", "urlToImage": null, "publishedAt": "2020-04-24T21:37:00Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Ashley Abramson", "title": "Why Doctors Aren't Wearing Makeup With Surgical Masks and N95s - yahoo.com", "description": "Experts say it can affect the ability of some masks to be reused, as well as potentially make them less effective.", "url": "https://www.yahoo.com/lifestyle/why-doctors-arent-wearing-makeup-171739846.html", "urlToImage": null, "publishedAt": "2020-04-24T17:17:00Z", "content": "If youre wearing a cloth face covering, its important to follow CDC guidelines to prevent the spread of droplets during the COVID-19 pandemic. For example, make sure your mask covers both your nose and mouth, that you wash your hands after taking it off, and … [+3040 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Tim Herrera", "title": "What Is Convalescent Plasma, and Why Do We Care About It? - The New York Times", "description": "Plasma from people who have recovered from Covid-19 may help others fight the disease.", "url": "https://www.nytimes.com/2020/04/24/smarter-living/coronavirus-convalescent-plasma-antibodies.html", "urlToImage": null, "publishedAt": "2020-04-24T16:30:09Z", "content": "A medical procedure doctors have used to treat novel diseases for a century has emerged as a focal point in the fight against Covid-19: convalescent plasma.\r\nConva-what-now?\r\nConvalescent plasma is the term used for plasma that is removed from the blood of a … [+8375 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Elisabeth Buchwald", "title": "‘We don’t eat our countertops,’ yet many Americans are using cleaning products meant for them on their fruits and vegetables, National Poison Control Center official says - MarketWatch", "description": "Poison control centers across the U.S. saw a 20% increase in calls last month compared to 2019.", "url": "https://www.marketwatch.com/story/we-dont-eat-our-countertops-yet-many-americans-are-using-cleaning-products-meant-for-them-on-their-fruits-and-vegetables-says-national-poison-control-center-official-2020-04-24", "urlToImage": null, "publishedAt": "2020-04-24T15:11:26Z", "content": "Shortages of cleaning supplies amid the coronavirus pandemic are leading many Americans to get creative. But that creativity and compulsion to clean and disinfect more may be causing more harm than good.Last month, calls to poison control centers surged by ne… [+4139 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Gerald Imray", "title": "Fight against malaria could be set back 20 years, WHO warns - The Associated Press", "description": "CAPE TOWN, South Africa (AP) — One of the hard lessons the World Health Organization learned during the Ebola outbreak in West Africa was this: Other diseases can be forgotten and take a deadlier...", "url": "https://apnews.com/f56bd3aa90391e091c3a39d4fcc6f515", "urlToImage": null, "publishedAt": "2020-04-24T12:06:45Z", "content": "CAPE TOWN, South Africa (AP) One of the hard lessons the World Health Organization learned during the Ebola outbreak in West Africa was this: Other diseases can be forgotten and take a deadlier toll.\r\nThe WHO is now warning that the battle against malaria in … [+2837 chars]"}, {"source": {"id": null, "name": "Wgme.com"}, "author": "WGME", "title": "Doctors say 'COVID Toes' could be a new symptom of the coronavirus - WGME", "description": "*Warning. This video contains material that some viewers may find disturbing due to the graphic nature*Doctors say a condition known as \"COVID toes\" may be a new symptom of the coronavirus. Doctors treating COVID-19 patients say they're noticing lesions on pe…", "url": "http://wgme.com/news/coronavirus/doctors-say-covid-toes-could-be-a-new-symptom-of-the-coronavirus-04-24-2020", "urlToImage": null, "publishedAt": "2020-04-24T11:03:00Z", "content": null}, {"source": {"id": null, "name": "Rawstory.com"}, "author": "Kaiser Health News", "title": "Seniors with COVID-19 show unusual symptoms, doctors say - Raw Story", "description": "Older adults with COVID-19, the illness caused by the coronavirus, have several “atypical” symptoms, complicating efforts to ensure they get timely and appropriate treatment, according to physicians. COVID-19 is typically signaled by three symptoms: a fever, …", "url": "https://www.rawstory.com/2020/04/seniors-with-covid-19-show-unusual-symptoms-doctors-say/", "urlToImage": null, "publishedAt": "2020-04-24T09:56:16Z", "content": "Older adults with COVID-19, the illness caused by the coronavirus, have several atypical symptoms, complicating efforts to ensure they get timely and appropriate treatment, according to physicians.\r\nCOVID-19 is typically signaled by three symptoms: a fever, a… [+6329 chars]"}]}