{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": "cnbc", "name": "CNBC"}, "author": "Daniel Bukszpan Acorns", "title": "Google, Facebook, Twitter team up to support addiction recovery during pandemic - CNBC", "description": "Google, Facebook and Twitter have partnered with the nonprofit Center for Safe Internet Pharmacies to launch Tech Together, offering support to individuals with substance use disorder.", "url": "https://www.cnbc.com/2020/04/25/google-facebook-twitter-support-addiction-recovery-during-pandemic.html", "urlToImage": null, "publishedAt": "2020-04-25T18:44:49Z", "content": "Google, Facebook and Twitter have partnered with the nonprofit Center for Safe Internet Pharmacies (CSIP) to launch Tech Together (TechTogether.co), an online platform to offer support to individuals with substance use disorders. The site is a collection of r… [+7412 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Sylvie Corbet", "title": "Virus lockdowns an extra ordeal for special-needs children - The Associated Press", "description": "PARIS (AP) — Weeks into France's strict coronavirus lockdown, Mohammed, a 14-year-old with autism, took a pickax and started hitting the wall of his family's house. His explanation: “Too...", "url": "https://apnews.com/f4ae1dafd842d2d1fe2135f9b696618a", "urlToImage": null, "publishedAt": "2020-04-25T17:45:35Z", "content": "PARIS (AP) Weeks into Frances strict coronavirus lockdown, Mohammed, a 14-year-old with autism, took a pickax and started hitting the wall of his familys house.\r\nHis explanation: Too long at home, too hard to wait.\r\nThe disruptions in daily life caused by the… [+5966 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Erik Ortiz", "title": "Coronavirus survivors detail despair, recovery: 'You're a miracle' - NBC News", "description": "In the face of mounting infection rates and death tolls, it can be difficult to remember that most people infected with COVID-19 do recover and survive.", "url": "https://www.nbcnews.com/news/us-news/coronavirus-survivors-detail-despair-recovery-you-re-miracle-n1191831", "urlToImage": null, "publishedAt": "2020-04-25T17:44:42Z", "content": "They are survivors of severe cases of the coronavirus, most of them had been hospitalized, some of them hooked up to ventilators for several days and none of them ever wanting to experience the misery, uncertainty and loneliness of the illness ever again.\r\n\"I… [+4613 chars]"}, {"source": {"id": null, "name": "Sfgate.com"}, "author": "Hearst Television", "title": "National coronavirus updates: No evidence people who had virus immune from second infection, WHO warns - SF Gate", "description": "The latest:", "url": "https://www.sfgate.com/news/article/National-coronavirus-updates-US-death-toll-15225716.php", "urlToImage": null, "publishedAt": "2020-04-25T17:22:03Z", "content": "National coronavirus updates: Worldwide coronavirus death toll passes 200,000\r\nThe latest:\r\n<ul><li>There have been more than 924,000 coronavirus cases in the United States, according to the Johns Hopkins University tally.</li><li>The U.S. death toll has surp… [+9491 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "March, April, May: City’s Mood Darkens as Crisis Feels Endless - India Gone Viral", "description": "With no clues about when the pandemic might subside, short-term discomfort is becoming long-term despair: “I feel like I have accepted this, and given up.”April 25, 2020ImageNew York City’s sidewalks,", "url": "https://indiagoneviral.com/health/2020/04/25/march-april-may-citys-mood-darkens-as-crisis-feels-endless/42269/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-25T16:08:44Z", "content": "With no clues about when the pandemic might subside, short-term discomfort is becoming long-term despair: I feel like I have accepted this, and given up.\r\nApril 25, 2020\r\nImage\r\nNew York Citys sidewalks, like this one in the Williamsburg section of Brooklyn, … [+6728 chars]"}, {"source": {"id": null, "name": "Vox.com"}, "author": "Zeeshan Aleem", "title": "WHO warns against coronavirus “immunity passports” due to reinfection concerns - Vox.com", "description": "It says there is “currently no evidence” that someone cannot be reinfected.", "url": "https://www.vox.com/2020/4/25/21235946/coronavirus-immunity-passport-who-infection-twice", "urlToImage": null, "publishedAt": "2020-04-25T15:44:16Z", "content": "The World Health Organization (WHO) released a scientific brief on Saturday recommending countries refrain from issuing certificates of immunity to people who have been infected with the novel coronavirus, warning there is currently no evidence that someone c… [+7993 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Shona Ghosh", "title": "Trump aides demanded hydroxychloroquine for millions: Vanity Fair - Business Insider - Business Insider", "description": "Hydroxychloroquine, repeatedly touted by President Trump as a potential cure, one drug trial in Brazil had to be abandoned after patients died.", "url": "https://www.businessinsider.com/emails-trump-aides-mass-distribution-hydroxychloroquine-unproven-2020-4", "urlToImage": null, "publishedAt": "2020-04-25T15:09:05Z", "content": "Trump administration officials concocted a plan to distribute millions of doses of the unproven drug hydroxychloroquine to COVID-19 outpatients, according to emails obtained by Vanity Fair.\r\nHydroxychloroquine is an effective anti-malarial drug, but despite b… [+2294 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "World leaders agree action on Covid-19 vaccine –video - Guardian News", "description": "Global leaders have pledged to accelerate cooperation on a coronavirus vaccine and to share research, treatment and medicines across the globe as part of a W...", "url": "https://www.youtube.com/watch?v=NLSnWeeZuXg", "urlToImage": null, "publishedAt": "2020-04-25T14:43:15Z", "content": "Global leaders have pledged to accelerate cooperation on a coronavirus vaccine and to share research, treatment and medicines across the globe as part of a World Health Organization initiative. The United States did not take part in the pledge, made at a virt… [+255 chars]"}, {"source": {"id": null, "name": "Nxstrib.com"}, "author": null, "title": "5-month-old daughter of New York firefighter dies from coronavirus - WHNT News 19", "description": "(CNN) — A New York firefighter’s infant daughter has died from coronavirus, her family says, making her one of the youngest known victims of the virus. Five-month-old Jay-Natalie, …", "url": "https://nxstrib.com/nmw/news/coronavirus/5-month-old-daughter-of-new-york-firefighter-dies-from-coronavirus/", "urlToImage": null, "publishedAt": "2020-04-25T14:38:00Z", "content": "(CNN) — A New York firefighter’s infant daughter has died from coronavirus, her family says, making her one of the youngest known victims of the virus.\r\nFive-month-old Jay-Natalie, the daughter of New York City firefighter Jerel La Santa and Board of Educatio… [+2484 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Tal Axelrod", "title": "CDC adds six more symptoms for coronavirus | TheHill - The Hill", "description": "The Centers for Disease Control and Prevention (CDC) added six new symptoms for the coronavirus to its website as officials still grapple with gauging the illness’s scope.", "url": "https://thehill.com/policy/healthcare/494640-cdc-adds-six-more-symptoms-for-coronavirus", "urlToImage": null, "publishedAt": "2020-04-25T14:25:21Z", "content": "The Centers for Disease Control and Prevention (CDC) added six new symptoms for the coronavirus to its website as officials grapple with gauging the illness's scope.\r\nThe new symptoms for the disease are chills, repeated shaking with chills, muscle pain, head… [+623 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Christina Maxouris, CNN", "title": "This 2-year-old boy was adopted over Zoom after coronavirus pandemic canceled court hearings - CNN", "description": "Kimberly Wieneke adopted 2-year-old Jaden over a Zoom video call after coronavirus pandemic forced courts to close.", "url": "https://www.cnn.com/2020/04/25/us/arkansas-boy-zoom-adoption-coronavirus-trnd/index.html", "urlToImage": null, "publishedAt": "2020-04-25T14:14:46Z", "content": null}, {"source": {"id": null, "name": "Ktiv.com"}, "author": "Keith W. Bliven", "title": "109 New COVID-19 Cases Reported in Woodbury County - KTIV", "description": "That brings the total of positive cases that have been detected in the county to 396.", "url": "https://ktiv.com/2020/04/25/109-new-covid-19-cases-reported-in-woodbury-county/", "urlToImage": null, "publishedAt": "2020-04-25T13:56:59Z", "content": "SIOUX CITY (KTIV) -- On Saturday theSiouxland District Health Department reported an additional 109 confirmed positive cases of COVID-19.\r\nSOURCE: SIOUXLAND DISTRICT HEALTH DEPARTMENT\r\nThat brings the total of positive cases that have been detected in the cou… [+259 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Turlock nursing home says three residents, three staffers contracted coronavirus - Modesto Bee", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiPWh0dHBzOi8vd3d3Lm1vZGJlZS5jb20vbmV3cy9jb3JvbmF2aXJ1cy9hcnRpY2xlMjQyMjg1NzM2Lmh0bWzSAT1odHRwczovL2FtcC5tb2RiZWUuY29tL25ld3MvY29yb25hdmlydXMvYXJ0aWNsZTI0MjI4NTczNi5odG1s?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T13:29:40Z", "content": null}, {"source": {"id": null, "name": "Wfmynews2.com"}, "author": null, "title": "Rudd Farm temporarily closes operation after multiple workers test positive for COVID-19 - WFMYNews2.com", "description": "“Out of an abundance of caution and out of concern for our workers and their families, we are closing our operation to the public at this time.\"", "url": "https://www.wfmynews2.com/article/news/local/rudd-farm-temporarily-closes-operation/83-55eeda2c-9c46-46b2-a99c-69553c39229c", "urlToImage": null, "publishedAt": "2020-04-25T13:28:00Z", "content": "GREENSBORO, N.C. Popular strawberry grower Rudd Farm in Greensboro is temporarily closing its operation after several workers have tested positive for coronavirus.\r\nOne of our workers advised us of feeling sick and has tested positive for the coronavirus. Aft… [+1051 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Shopping robots come into their own in locked-down English town - Reuters", "description": "A fleet of robots on wheels that deliver shopping in the English town of Milton Keynes have seen their popularity surge as residents are stuck indoors due to the coronavirus lockdown.", "url": "https://www.reuters.com/article/us-health-coronavirus-britain-robotic-de-idUSKCN22709V", "urlToImage": null, "publishedAt": "2020-04-25T12:35:17Z", "content": "MILTON KEYNES, England (Reuters) - A fleet of robots on wheels that deliver shopping in the English town of Milton Keynes have seen their popularity surge as residents are stuck indoors due to the coronavirus lockdown. \r\nThe robots, which come up roughly to a… [+1631 chars]"}, {"source": {"id": null, "name": "France24.com"}, "author": "NEWS WIRES", "title": "'No evidence' that recovering from Covid-19 gives people immunity, WHO says - FRANCE 24 English", "description": "The World Health Organization warned on Saturday that recovering from coronavirus may not protect people from reinfection as the death toll from the pandemic approached 200,000 around the globe.", "url": "https://www.france24.com/en/20200425-no-evidence-that-recovering-from-covid-19-gives-people-immunity-who-says", "urlToImage": null, "publishedAt": "2020-04-25T12:11:51Z", "content": "The World Health Organization warned on Saturday that recovering from coronavirus may not protect people from reinfection as the death toll from the pandemic approached 200,000 around the globe.\r\n Governments across the world are struggling to limit the econo… [+6426 chars]"}, {"source": {"id": null, "name": "Npr.org"}, "author": "", "title": "Some States Shouldn't Ease Social Distancing Until At Least June, Modelers Say : Shots - Health News - NPR", "description": "Some states are moving forward, but many would be wise to wait, according to experts at the University of Washington. Here's their estimate for each state's safe date to open.", "url": "https://www.npr.org/sections/health-shots/2020/04/25/844088634/when-is-it-safe-to-ease-social-distancing-heres-what-one-model-says-for-each-sta", "urlToImage": null, "publishedAt": "2020-04-25T11:03:06Z", "content": "South Carolina has permitted retail stores to reopen to customers. It's one of a handful of states easing up on some social distancing restrictions.\r\nDustin Chambers/Bloomberg via Getty Images\r\nAcross the U.S. state leaders are now grappling with the challeng… [+4740 chars]"}, {"source": {"id": null, "name": "Timesofisrael.com"}, "author": null, "title": "WWII veteran dies from coronavirus 100 years after his twin died of Spanish Flu - The Times of Israel", "description": "Grandson of Philip Kahn says he would often warn that history repeats itself, 'knew the irony of what was going on' after he began coughing", "url": "https://www.timesofisrael.com/wwii-veteran-dies-from-coronavirus-100-years-after-his-twin-died-of-spanish-flu/", "urlToImage": null, "publishedAt": "2020-04-25T10:58:18Z", "content": "A US military veteran of World War II has died from the coronavirus, over a century after his twin brother died in the Spanish Flu pandemic.\r\nPhilip Kahn, 100, died at his home in Long Island last week, with his doctor saying tests showed he had contracted CO… [+2225 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Dale Smith", "title": "Coronavirus antibody testing a big deal? What to know about the promising serology tests - CNET", "description": "Tests that detect whether you've recovered from COVID-19 might help doctors and government officials navigate the pandemic. Here's what you should know.", "url": "https://www.cnet.com/how-to/coronavirus-antibody-testing-a-big-deal-what-to-know-about-the-promising-serology-tests/", "urlToImage": null, "publishedAt": "2020-04-25T10:10:29Z", "content": "Antibody testing looks for evidence that a person has been infected with the coronavirus SARS-CoV-2, but not the virus itself.\r\nJames Martin/CNET\r\nFor the most up-to-date news and information about the coronavirus pandemic, visit the WHO website.\r\nAs some are… [+7629 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Katie Conner", "title": "20 places you can buy a face mask or cloth covering online - CNET", "description": "Here's where to find a variety of face masks and cloth coverings online in many designs, patterns and colors.", "url": "https://www.cnet.com/how-to/20-places-you-can-buy-a-face-mask-or-cloth-covering-online/", "urlToImage": null, "publishedAt": "2020-04-25T10:10:20Z", "content": "For the most up-to-date news and information about the coronavirus pandemic, visit the WHO website.\r\nTo help prevent the spread of coronavirus while in public, face masks and cloth coverings have increasingly become part of our daily attire. The Centers for D… [+6703 chars]"}, {"source": {"id": null, "name": "Kcra.com"}, "author": null, "title": "Q&A: How convalescent plasma can help COVID-19 patients - KCRA Sacramento", "description": "The race continues to develop treatments for patients battling COVID-19. One of them is called convalescent plasma therapy, which involves taking plasma from donors who have recovered from the virus and giving it to those who are critically ill.", "url": "https://www.kcra.com/article/qanda-how-convalescent-plasma-can-help-covid-19-patients/32274421", "urlToImage": null, "publishedAt": "2020-04-25T08:17:28Z", "content": "The race continues to develop treatments for patients battling COVID-19. \r\nOne of them is called convalescent plasma therapy. It involves taking plasma from donors who have recovered from the novel coronavirus and giving it to those who are critically ill. \r\n… [+2921 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rosa Flores, Sara Weisfeldt and Arman Azad, CNN", "title": "2 studies show many people who tested positive for Covid-19 displayed no symptoms - CNN", "description": "Two coronavirus studies released Friday -- one involving almost 2,000 people from Florida and the other from a Washington state nursing home -- came to the same conclusion: Many of the people who tested positive for the virus didn't know it they had it becaus…", "url": "https://www.cnn.com/2020/04/24/us/2-asymptomatic-coronavirus-studies/index.html", "urlToImage": null, "publishedAt": "2020-04-25T04:54:54Z", "content": null}, {"source": {"id": null, "name": "Wkrn.com"}, "author": "CB Cotton", "title": "Vanderbilt releases new projections about COVID-19 spread after economic re-open - WKRN News 2", "description": "Researchers at Vanderbilt University Medical Center have released a new study with projections on what could happen if COVID-19 continues to spread, once the economy re-opens.", "url": "https://www.wkrn.com/community/health/coronavirus/vanderbilt-releases-new-projections-about-covid-19-spread-after-economic-re-open/", "urlToImage": null, "publishedAt": "2020-04-25T03:36:00Z", "content": "NASHVILLE, Tenn. (WKRN) Researchers at Vanderbilt University Medical Center have released a new study with projections on what could happen if COVID-19 continues to spread, once the economy re-opens.\r\n“What they [Friday’s projections] demonstrate today is wha… [+2313 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "BBC", "title": "Coronavirus: US death toll passes 50,000 in world's deadliest outbreak - Yahoo News", "description": "A grim milestone is passed by the world's deadliest outbreak, although US mortality rate is comparatively low.", "url": "https://news.yahoo.com/us-coronavirus-virus-death-toll-151834675.html", "urlToImage": null, "publishedAt": "2020-04-25T03:02:26Z", "content": "Volunteer wearing mask in NYC\r\nThe US virus death toll has surpassed 50,000, according to data from Johns Hopkins University, in what is the world's deadliest Covid-19 outbreak.\r\nMore than 3,000 deaths came in the last 24 hours, and there are now over 870,000… [+4030 chars]"}, {"source": {"id": null, "name": "Ksn.com"}, "author": null, "title": "Sedgwick County reports Covid-19 cluster at car dealership, possible public exposure - KSN-TV", "description": "SEDGWICK COUNTY, Kan. (KSNW) – The Sedgwick County Health Department and Mel Hambelton Ford of Wichita confirmed Friday a cluster of five COVID-19 cases at the car dealership located at 11625 W. Ke…", "url": "https://www.ksn.com/top-stories/sedgwick-county-reports-covid-19-cluster-at-car-dealership-possible-public-exposure/", "urlToImage": null, "publishedAt": "2020-04-25T02:50:00Z", "content": "SEDGWICK COUNTY, Kan. (KSNW) The Sedgwick County Health Department and Mel Hambelton Ford of Wichita confirmed Friday a cluster of five COVID-19 cases at the car dealership located at 11625 W. Kellogg Drive, Wichita.\r\nThe Sedgwick County Health Department sai… [+1514 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Washington state reporting 12,977 COVID-19 cases, 723 deaths - Tacoma News Tribune", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiRWh0dHBzOi8vd3d3LnRoZW5ld3N0cmlidW5lLmNvbS9uZXdzL2Nvcm9uYXZpcnVzL2FydGljbGUyNDIyNjg1MzYuaHRtbNIBRWh0dHBzOi8vYW1wLnRoZW5ld3N0cmlidW5lLmNvbS9uZXdzL2Nvcm9uYXZpcnVzL2FydGljbGUyNDIyNjg1MzYuaHRtbA?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T02:25:16Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Don’t drink hand sanitizer: Poison center calls up 20% during pandemic, CDC says - Miami Herald", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiQmh0dHBzOi8vd3d3Lm1pYW1paGVyYWxkLmNvbS9uZXdzL2Nvcm9uYXZpcnVzL2FydGljbGUyNDIyODQ5OTYuaHRtbNIBQmh0dHBzOi8vYW1wLm1pYW1paGVyYWxkLmNvbS9uZXdzL2Nvcm9uYXZpcnVzL2FydGljbGUyNDIyODQ5OTYuaHRtbA?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T02:23:45Z", "content": null}, {"source": {"id": null, "name": "Nydailynews.com"}, "author": "Joseph Wilkinson", "title": "32% of Americans think coronavirus vaccine being withheld - New York Daily News", "description": "The Illuminati are at it again.", "url": "https://www.nydailynews.com/coronavirus/ny-coronavirus-vaccine-exists-survey-americans-not-very-smart-20200425-6npkngldxfhgtmlzuyvkq66bfe-story.html", "urlToImage": null, "publishedAt": "2020-04-25T02:21:00Z", "content": null}, {"source": {"id": null, "name": "Kutv.com"}, "author": "Kelly Vaughen", "title": "Drive-in movie theater cancels Friday opening due to county public health order - KUTV 2News", "description": "The Redwood Drive-In Theater in West Valley City had plans to reopen Friday night but was ordered to remain closed by the Salt Lake County Health Department. The health department told the drive-in that opening tonight would be in violation of the county&rsqu…", "url": "http://kutv.com/news/local/drive-in-movie-theater-cancels-friday-opening-due-to-county-public-health-order", "urlToImage": null, "publishedAt": "2020-04-25T01:40:46Z", "content": null}, {"source": {"id": null, "name": "Abc7chicago.com"}, "author": null, "title": "Illinois coronavirus: Stunning new numbers for COVID-19 cases in IL nursing homes - WLS-TV", "description": "New data from the Illinois Department of Public Health shows COVID-19 cases grew exponentially since last week.  Coronavirus cases are now in more counties and more facilities.", "url": "https://abc7chicago.com/coronavirus-illinois-coronavrus-nursing-home-update/6128158/", "urlToImage": null, "publishedAt": "2020-04-25T01:37:54Z", "content": "CHICAGO (WLS) -- New data from the Illinois Department of Public Health shows COVID-19 cases grew exponentially since last week. Coronavirus cases are now in more counties and more facilities.\"All of these sort of group communal settings are opportunities for… [+1874 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Charles Creitz", "title": "CNN's Chris Cuomo was 'like a boiling pot' in Easter clash over breaking quarantine, cyclist says - Fox News", "description": "CNN's Chris Cuomo resembled \"a boiling pot\" when he was confronted for not self-quarantining with the coronavirus earlier this month, a Long Island, N.Y., bicyclist told Fox News Friday night.", "url": "https://www.foxnews.com/media/cnns-chris-cuomo-was-like-a-boiling-pot-in-confrontation-over-breaking-quarantine-cyclist-says", "urlToImage": null, "publishedAt": "2020-04-25T01:21:45Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox. Sign up here.\r\nCNN's Chris Cuomo resembled \"a boiling pot\" when he was confronted for not self-quarantining with the coronavirus earlier this month, a Long Island, N.Y., bicyclist … [+2783 chars]"}, {"source": {"id": null, "name": "Krcrtv.com"}, "author": "Adam Robinson", "title": "Fourth death due to COVID-19 in Shasta County, 30 confirmed cases - KRCRTV.COM", "description": "Two more Shasta County residents are confirmed infected with the novel coronavirus (COVID-19), bringing the total cases in the county to 30. Sadly, another patient has died due to COVID-19. The patient was a man in his 90s, according to the Shasta County Coro…", "url": "http://krcrtv.com/news/coronavirus/fourth-death-due-to-covid-19-in-shasta-county-30-confirmed-cases", "urlToImage": null, "publishedAt": "2020-04-25T01:19:49Z", "content": null}, {"source": {"id": null, "name": "Azcentral.com"}, "author": "Katie Surma", "title": "Sonora Quest Laboratories launch COVID-19 antibody testing in Arizona - AZCentral", "description": "Sonora Quest expects to perform 1,000 to 3,000 tests a day initially with a one day to four day turnaround time.", "url": "https://www.azcentral.com/story/news/local/arizona-health/2020/04/24/covid-19-antibody-tests-available-through-sonora-quest-laboratories/3023952001/", "urlToImage": null, "publishedAt": "2020-04-25T01:07:37Z", "content": "Sonora Quest Laboratories is now antibody testing for COVID-19 in Arizona and individuals can get a test with a physician's prescription.\r\nAntibody testing, also called serology testing, can indicate whether an individual has been exposed to COVID-19 and deve… [+2854 chars]"}, {"source": {"id": null, "name": "Khou.com"}, "author": "KHOU 11 Staff", "title": "Mayor Turner: The curve has flattened - KHOU.com", "description": "Though the curve has flatted, Mayor Sylvester Turner warned we have to continue to follow guidelines.", "url": "https://www.khou.com/article/news/health/coronavirus/houston-and-harris-county-flattening-the-curve/285-4ace18e3-0fa6-4bd2-88d8-e27f35723aa6", "urlToImage": null, "publishedAt": "2020-04-25T00:28:00Z", "content": "HOUSTON Houston Mayor Sylvester Turner said doctors are telling him the curve has flattened and indicating that if we haven't hit the peak yet, we're close.\r\nHealth experts say everyone must continue following guidelines, including social distancing so the tr… [+3864 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Nick Givas", "title": "National Guard sent to California nursing homes to stop coronavirus spread - Fox News", "description": "California National Guard medical teams were sent to several nursing homes in Los Angeles County earlier this week, to help stem the tide of the novel coronavirus outbreak.", "url": "https://www.foxnews.com/us/national-guard-california-nursing-homes-coronavirus", "urlToImage": null, "publishedAt": "2020-04-25T00:19:23Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox. Sign up here.\r\nCalifornia National Guard medical teams were sent to several nursing homes in Los Angeles County earlier this week to help stem the tide of the novel coronavirus out… [+1422 chars]"}, {"source": {"id": null, "name": "Abc12.com"}, "author": "ABC12 News Team", "title": "New state data shows spread of coronavirus in Michigan nursing homes - ABC 12 News", "description": "The data shows 275 cases in Mid-Michigan facilities and more than 2,200 statewide.", "url": "https://www.abc12.com/content/news/New-state-data-shows-spread-of-coronavirus-in-Michigan-nursing-homes-569938671.html", "urlToImage": null, "publishedAt": "2020-04-25T00:13:27Z", "content": "LANSING (WJRT) (4/24/2020) - The Michigan Department of Health and Human Services began reporting the number of coronavirus cases in nursing homes and long-term care facilities on Friday.\r\nThe data shows 275 cases in Mid-Michigan facilities and more than 2,20… [+1407 chars]"}, {"source": {"id": null, "name": "Oregonlive.com"}, "author": "Shane Dixon Kavanaugh | The Oregonian/OregonLive", "title": "Oregon’s strict social distancing averted 70,000 coronavirus infections, new analysis suggests - OregonLive", "description": "“Our collective efforts are working,” said Dr. Dean Sidelinger, the state’s epidemiologist.", "url": "https://www.oregonlive.com/coronavirus/2020/04/oregons-strict-social-distancing-averted-70000-coronavirus-infections-new-analysis-shows.html", "urlToImage": null, "publishedAt": "2020-04-24T23:56:00Z", "content": "Oregons aggressive steps to slow the spread of the novel coronavirus may have averted more than 70,000 infections, including almost 1,500 hospitalizations, according to a new analysis released Friday by state health officials.\r\nThe projections, provided by th… [+3044 chars]"}, {"source": {"id": null, "name": "Abc3340.com"}, "author": "Associated Press", "title": "A sly move: Maine woman wrestles attacking fox into scalding pot - Alabama's News Leader", "description": "GRAY, Maine (AP) &mdash; A fox that was attacking a Maine woman quickly found its goose was cooked when she wrestled into a pot meant for scalding chickens. Eliza Ruth Watson, 37, of Gray, tried to scare the fox away while she was gardening Thursday. Instead,…", "url": "http://abc3340.com/news/offbeat/a-sly-move-maine-woman-wrestles-attacking-fox-into-scalding-pot", "urlToImage": null, "publishedAt": "2020-04-24T23:27:00Z", "content": null}, {"source": {"id": null, "name": "Waow.com"}, "author": "Amanda Lojewski", "title": "Can mosquitoes transmit COVID-19? - WAOW", "description": "As temperatures warm up, we are that much closer to mosquito season and one thing you may be wondering is can mosquitoes transmit COVID-19?", "url": "https://waow.com/2020/04/24/can-mosquitoes-transmit-covid-19/", "urlToImage": null, "publishedAt": "2020-04-24T23:08:49Z", "content": "WAUSAU, Wis. (WAOW) -- As temperatures warm up, we are that much closer to mosquito season and one thing you may be wondering is can mosquitoes transmit COVID-19?\r\nSome viruses spread more during cold weather months but that doesn't mean its impossible to get… [+661 chars]"}, {"source": {"id": null, "name": "Wwmt.com"}, "author": "Andrew Feather   |   Newschannel 3", "title": "COVID-19 hospitalizations trending down statewide, trending up in West Michigan - WWMT-TV", "description": "The average number of people hospitalized with COVID-19 in Michigan decreased by more than 15% over the past week. The seven-day average of hospitalizations in the state shows the average number of hospitalized patients dropped from more than 3,800 to just ov…", "url": "http://wwmt.com/news/coronavirus/covid-19-hospitalizations-trending-down-statewide-trending-up-in-west-michigan", "urlToImage": null, "publishedAt": "2020-04-24T22:52:00Z", "content": null}, {"source": {"id": null, "name": "Fox17.com"}, "author": "SkyWatch 17 Chief Meteorologist Katy Morgan", "title": "CODE RED: Severe storms with damaging wind possible Saturday - WZTV", "description": "FOX 17 News is in a Code Red Weather Alert for the chance of severe storms Saturday afternoon, mainly east of I-65. Chief Meteorologist Katy Morgan expects a low pressure system to move across Middle Tennessee this weekend. Damaging wind will be the primary t…", "url": "http://fox17.com/news/local/code-red-severe-storms-with-damaging-wind-possible-saturday", "urlToImage": null, "publishedAt": "2020-04-24T22:42:00Z", "content": null}, {"source": {"id": null, "name": "Medscape.com"}, "author": null, "title": "COVID-19 Daily: Doctor Support Hotline, New Mortality Data - Medscape", "description": "These are the coronavirus stories you need to know about today.", "url": "https://www.medscape.com/viewarticle/929383", "urlToImage": null, "publishedAt": "2020-04-24T22:32:41Z", "content": "Editor's note: Find the latest COVID-19 news and guidance in Medscape's Coronavirus Resource Center.\r\nHere are the coronavirus stories Medscape's editors around the globe think you need to know about today: \r\nDoctor Support Hotline\r\nIn late March, a Philadelp… [+5308 chars]"}, {"source": {"id": null, "name": "Abc6onyourside.com"}, "author": "Stephen Loiaconi", "title": "Biden benefits from staying out of spotlight amid coronavirus outbreak, experts say - ABC6OnYourSide.com", "description": "Former Vice President Joe Biden is building a lead over President Donald Trump in key swing states, new polls suggest, as voters question Trump&rsquo;s response to the coronavirus outbreak and pay relatively little attention to anything Biden is doing at all.…", "url": "http://abc6onyourside.com/news/nation-world/biden-benefits-from-staying-out-of-spotlight-amid-coronavirus-outbreak-experts-say", "urlToImage": null, "publishedAt": "2020-04-24T21:37:00Z", "content": null}, {"source": {"id": null, "name": "Wcti12.com"}, "author": "WLOS staff", "title": "Protesters in Macon County want NC economy reopened - WLOS", "description": "There was a peaceful protest COVID-19 restrictions Friday in Macon County. WLOS. Protesters had to stay inside their vehicles as they drove down Franklin's Main Street. They want Gov. Roy Cooper to reopen North Carolina's economy. On Thursday, the governor ex…", "url": "http://wcti12.com/news/state-news/protesters-in-macon-county-want-nc-economy-reopened", "urlToImage": null, "publishedAt": "2020-04-24T21:25:00Z", "content": null}, {"source": {"id": null, "name": "Al.com"}, "author": "Amy Yurkanin | ayurkanin@al.com", "title": "Alabama poison expert on disinfectant: ‘We should not make the cure worse than the disease.’ - AL.com", "description": "Less than 24 hours after President Donald Trump made comments about using disinfectants to kill coronavirus inside the body, an expert from Alabama warned residents not to consume them", "url": "https://www.al.com/news/2020/04/alabama-poison-expert-on-disinfectant-we-should-not-make-the-cure-worse-than-the-disease.html", "urlToImage": null, "publishedAt": "2020-04-24T20:19:00Z", "content": "Less than one day after President Donald Trump touted disinfectants ability to kill coronavirus, a poisoning expert in Alabama warned residents not to consume bleach and other cleaning products.\r\nBleach and disinfectants are not for human consumption, said An… [+2567 chars]"}, {"source": {"id": null, "name": "Abc7news.com"}, "author": null, "title": "Coronavirus outbreak: 10 residents die at Redwood City nursing home - KGO-TV", "description": "\"We will never be the same, but then again, none of us will be,\" said the elderly care facility in a statement.", "url": "https://abc7news.com/redwood-city-nursing-home-coronavirus-outbreak-gordon-manor-deaths/6127477/", "urlToImage": null, "publishedAt": "2020-04-24T20:15:12Z", "content": "SAN FRANCISCO (KGO) -- Ten residents at Gordon Manor assisted living facility in Redwood City have passed away as a result of novel coronavirus.RELATED: I-Team uncovers disturbing details about Hayward nursing facility, site of Bay Area's largest COVID-19 out… [+2924 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "New pandemic model estimates coronavirus outbreak was spreading earlier than U.S. realized - CBS News", "description": "A New York Times analysis of the modeling estimates New York City had 10,000 infections by March 1, two weeks before social distancing guidelines were put in place.", "url": "https://www.cbsnews.com/news/coronavirus-pandemic-model-outbreaks-earlier-cities-new-york/", "urlToImage": null, "publishedAt": "2020-04-24T20:06:45Z", "content": "New information suggests the coronavirus was spreading rapidly in the US much earlier than first thought.  Only 23 coronavirus cases in several major cities had been reported by March 1, but analysis from a Northeastern University pandemic model estimates the… [+2211 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Miami-Dade has tens of thousands of missed coronavirus infections, UM survey finds - Miami Herald", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiQmh0dHBzOi8vd3d3Lm1pYW1paGVyYWxkLmNvbS9uZXdzL2Nvcm9uYXZpcnVzL2FydGljbGUyNDIyNjA0MDYuaHRtbNIBQmh0dHBzOi8vYW1wLm1pYW1paGVyYWxkLmNvbS9uZXdzL2Nvcm9uYXZpcnVzL2FydGljbGUyNDIyNjA0MDYuaHRtbA?oc=5", "urlToImage": null, "publishedAt": "2020-04-24T19:58:39Z", "content": null}, {"source": {"id": null, "name": "Dallasnews.com"}, "author": "Tom Steele", "title": "Dallas County officials report 71 new coronavirus cases, 5 more deaths - The Dallas Morning News", "description": "For the fifth straight day, fewer than 100 new cases of COVID-19 were reported among Dallas County residents. Friday’s announcement of 71 additional...", "url": "https://www.dallasnews.com/news/public-health/2020/04/24/dallas-county-officials-report-71-new-coronavirus-cases-5-more-deaths/", "urlToImage": null, "publishedAt": "2020-04-24T19:33:30Z", "content": "Updated at 8:40 p.m.: Revised to include latest data from Ellis County.\r\nFor the fifth straight day, fewer than 100 new cases of COVID-19 were reported among Dallas County residents.\r\nFridays announcement of 71 additional positive coronavirus tests brought th… [+4974 chars]"}, {"source": {"id": "national-geographic", "name": "National Geographic"}, "author": null, "title": "What you need to know about your cats and coronavirus - National Geographic", "description": "Cases of cats acquiring coronavirus are rare—and there is no evidence the disease could spread from pets to humans.", "url": "https://www.nationalgeographic.com/animals/2020/04/how-to-protect-your-pets-coronavirus/", "urlToImage": null, "publishedAt": "2020-04-24T18:38:44Z", "content": null}, {"source": {"id": null, "name": "Kget.com"}, "author": "Joseph Luiz", "title": "Kern Public Health confirms 36 new COVID-19 cases - KGET 17", "description": "BAKERSFIELD, Calif. (KGET) — The Kern County Public Health Services Department confirmed 36 new COVID-19 cases this morning, bringing the county’s total cases to 744. There are 433 cases amon…", "url": "https://www.kget.com/health/coronavirus/kern-public-health-confirms-36-new-covid-19-cases/", "urlToImage": null, "publishedAt": "2020-04-24T17:34:00Z", "content": "BAKERSFIELD, Calif. (KGET) The Kern County Public Health Services Department confirmed 36 new COVID-19 cases this morning, bringing the county’s total cases to 744. \r\nThere are 433 cases among those 18 to 49 years old. Those between 50 and 64 represent 181 ca… [+641 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Beth Mole", "title": "Experts demolish studies suggesting COVID-19 is no worse than flu - Ars Technica", "description": "Authors of widely publicized antibody studies “owe us all an apology,” one expert says.", "url": "https://arstechnica.com/science/2020/04/experts-demolish-studies-suggesting-covid-19-is-no-worse-than-flu/", "urlToImage": null, "publishedAt": "2020-04-24T17:33:00Z", "content": "Enlarge/ A COVID-19 blood test is administered outside of Delmont Medical Care on April 22, 2020 in Franklin Square, New York. The test identifies antibodies to the coronavirus. \r\n135 with 85 posters participating\r\nFrustrated statisticians and epidemiologists… [+9053 chars]"}, {"source": {"id": null, "name": "Dailycommercial.com"}, "author": "Frank  Jolley", "title": "Lake man latest to die from COVID-19 - Daily Commercial", "description": "A Lake County man is latest area resident to die from the COVID-19 coronavirus. His death was reported Thursday evening in the Florida Department of", "url": "https://www.dailycommercial.com/article/20200424/NEWS/200428911", "urlToImage": null, "publishedAt": "2020-04-24T17:21:00Z", "content": "A Lake County man is latest area resident to die from the COVID-19 coronavirus. His death was reported Thursday evening in the Florida Department of Health’s late update, bringing the local death count from the coronavirus to 21. State officials have not rele… [+3907 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Tara Parker-Pope", "title": "What’s a Pulse Oximeter, and Do I Really Need One at Home? - The New York Times", "description": "A tiny fingertip device can give you valuable information about your health during a bout of Covid-19 or any respiratory illness.", "url": "https://www.nytimes.com/2020/04/24/well/live/coronavirus-pulse-oximeter-oxygen.html", "urlToImage": null, "publishedAt": "2020-04-24T16:05:24Z", "content": "After working for 10 days at Bellevue Hospital in New York, Dr. Richard Levitan decided to share what he had learned about Covid-19. Too many patients were showing up at the hospital with perilously low oxygen levels, putting them at risk for severe complicat… [+8004 chars]"}, {"source": {"id": null, "name": "Nejm.org"}, "author": null, "title": "Presymptomatic SARS-CoV-2 Infections and Transmission in a Skilled Nursing Facility - nejm.org", "description": "Original Article from The New England Journal of Medicine — Presymptomatic SARS-CoV-2 Infections and Transmission in a Skilled Nursing Facility", "url": "https://www.nejm.org/doi/full/10.1056/NEJMoa2008457", "urlToImage": null, "publishedAt": "2020-04-24T16:03:34Z", "content": "Twenty-three days after identifying the first resident with SARS-CoV-2 infection, Facility A had a 64% prevalence of Covid-19 among residents, with a case fatality rate of 26% despite early adoption of infection-control measures. In addition, Covid-19 was dia… [+7968 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Elisabeth Buchwald", "title": "‘We don’t eat our countertops,’ yet many Americans are using cleaning products meant for them on their fruits and vegetables, National Poison Control Center official says - MarketWatch", "description": "Poison control centers across the U.S. saw a 20% increase in calls last month compared to 2019.", "url": "https://www.marketwatch.com/story/we-dont-eat-our-countertops-yet-many-americans-are-using-cleaning-products-meant-for-them-on-their-fruits-and-vegetables-says-national-poison-control-center-official-2020-04-24", "urlToImage": null, "publishedAt": "2020-04-24T15:11:26Z", "content": "Shortages of cleaning supplies amid the coronavirus pandemic are leading many Americans to get creative. But that creativity and compulsion to clean and disinfect more may be causing more harm than good.Last month, calls to poison control centers surged by ne… [+4139 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "David Nikel", "title": "Sweden Health Chief Admits ‘It’s Not Over’ As Coronavirus Cases Leap - Forbes", "description": "Following an additional 131 deaths reported in the last 24 hours, Sweden’s COVID-19 death toll now stands at 2,152.", "url": "https://www.forbes.com/sites/davidnikel/2020/04/24/sweden-health-chief-admits-its-not-over-as-coronavirus-cases-leap/", "urlToImage": null, "publishedAt": "2020-04-24T15:09:59Z", "content": "Sweden's state epidemiologist Anders Tegnell has said the number of COVID-19 deaths in Sweden have ... [+] been higher than expected.\r\nAFP via Getty Images\r\nSwedens state epidemiologist Anders Tegnell has announced a record daily high of coronavirus cases for… [+3119 chars]"}, {"source": {"id": null, "name": "Wchstv.com"}, "author": "JEFF MORRIS, ANNA MOORE", "title": "Another COVID-19 death reported in W.Va.; state death toll at 32 - WCHS-TV8", "description": "UPDATED, 5:05 p. m. 4/24/20. West Virginia topped the 1,000-mark Friday afternoon for an overall total of positive COVID-19 cases. The state Department of Health and Human Resources reported that the state had a total of 1,010 positive virus cases as of 5 p. …", "url": "http://wchstv.com/news/local/another-covid-19-death-reported-in-wva-state-death-toll-at-32", "urlToImage": null, "publishedAt": "2020-04-24T14:07:00Z", "content": null}, {"source": {"id": null, "name": "Bgr.com"}, "author": "Chris Smith", "title": "The most unusual coronavirus symptom is also the most dangerous - BGR", "description": "The newest observed coronavirus symptom is also the most dangerous one and can appear in patients who don’t even experience other symptoms. Doctors have noticed an increase in strokes caused by blood clots in young adults, who might be reluctant to seek medic…", "url": "https://bgr.com/2020/04/24/coronavirus-symptoms-stroke-after-blood-clots-in-young-patients/", "urlToImage": null, "publishedAt": "2020-04-24T14:02:10Z", "content": "<ul><li>The newest observed coronavirus symptom is also the most dangerous one and can appear in patients who don’t even experience other symptoms.</li><li>Doctors have noticed an increase in strokes caused by blood clots in young adults, who might be relucta… [+3622 chars]"}, {"source": {"id": null, "name": "Pjmedia.com"}, "author": null, "title": "The Mystery of Patricia Dowd: First COVID-19 Death? - PJ Media", "description": "Was Patricia Dowd the first COVID-19 death in the United States?", "url": "https://pjmedia.com/news-and-politics/the-mystery-of-patricia-dowd-first-covid-19-death/", "urlToImage": null, "publishedAt": "2020-04-24T13:36:50Z", "content": "There's a story a few days ago that Patricia Dowd, a woman in Santa Clara County, Calif., who died on February 6, died of COVID-19, making hers the first COVID-19 death in the U.S.Keep your eye on the ball here. Here's the headline:\r\n County of Santa Clara Id… [+3714 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Harmony Otete Omeife, Lecturer, University of Central Lancashire", "title": "Coronavirus: distancing and handwashing could lower flu rates – but it's still too early to tell - Yahoo News", "description": "Early evidence from Japan suggests protective measures against COVID-19 may also be protecting us against influenza.", "url": "https://uk.news.yahoo.com/coronavirus-distancing-handwashing-could-lower-124101776.html", "urlToImage": null, "publishedAt": "2020-04-24T12:41:00Z", "content": "In order to slow the spread of COVID-19, many countries around the world have implemented protective strategies. These include quarantine and social distancing, school closures, and closing restaurants and other public places. Governments have also advised pe… [+5599 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Gerald Imray", "title": "Fight against malaria could be set back 20 years, WHO warns - The Associated Press", "description": "CAPE TOWN, South Africa (AP) — One of the hard lessons the World Health Organization learned during the Ebola outbreak in West Africa was this: Other diseases can be forgotten and take a deadlier...", "url": "https://apnews.com/f56bd3aa90391e091c3a39d4fcc6f515", "urlToImage": null, "publishedAt": "2020-04-24T12:06:45Z", "content": "CAPE TOWN, South Africa (AP) One of the hard lessons the World Health Organization learned during the Ebola outbreak in West Africa was this: Other diseases can be forgotten and take a deadlier toll.\r\nThe WHO is now warning that the battle against malaria in … [+2837 chars]"}, {"source": {"id": null, "name": "Bostonglobe.com"}, "author": null, "title": "You’re not the only one having vivid dreams in quarantine - The Boston Globe", "description": "Googling “weird dreams in quarantine” yields 5,800,000 results. So what’s happening? We asked a Harvard Medical School dream expert.", "url": "https://www.bostonglobe.com/2020/04/24/lifestyle/youre-not-only-one-having-vivid-dreams-quarantine/", "urlToImage": null, "publishedAt": "2020-04-24T11:23:00Z", "content": "Bob Dylan, wearing a Celtics uniform, came up with a possible COVID-19 cure in a Boston coffee shop. Abraham Lincoln (who is much shorter in real life) was sewing face masks. I was there, too. OK, I might have dreamed this. But Im not the only one having weir… [+3023 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Erika Edwards", "title": "Doctors report uptick in surprising coronavirus complication: dangerous blood clots - NBC News", "description": "Coronavirus patients are developing blood clots at higher rates. Does the virus cause blood to clot, or is it the result of inflammation? Regular anticoagulants aren't working.", "url": "https://www.nbcnews.com/health/health-news/doctors-report-uptick-surprising-coronavirus-complication-dangerous-blood-clots-n1190491", "urlToImage": null, "publishedAt": "2020-04-24T08:33:27Z", "content": "Three weeks ago, critical care pulmonologist Hugh Cassiere encountered something he hadn't seen in 24 years of practicing medicine.\r\nA 45-year-old man arrived at the hospital where Cassiere works, North Shore University Hospital on Long Island, New York, with… [+4346 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Death rewrites timeline of US COVID-19 outbreak | WNT - ABC News", "description": "Patricia Dowd, 57, died in Santa Clara County, California, in February, three weeks before the first documented coronavirus death in the U.S. WATCH THE FULL ...", "url": "https://www.youtube.com/watch?v=pzTtusYk1p0", "urlToImage": null, "publishedAt": "2020-04-23T23:46:51Z", "content": null}, {"source": {"id": null, "name": "Salon.com"}, "author": "Alex Henderson", "title": "CDC director contradicts Trump's claim he was \"misquoted\" on potential for fall coronavirus outbreak - Salon", "description": "\"I'm accurately quoted in the Washington Post\"", "url": "https://www.salon.com/2020/04/23/cdc-director-contradicts-trumps-claim-he-was-misquoted-on-potential-for-fall-coronavirus-outbreak_partner/", "urlToImage": null, "publishedAt": "2020-04-23T20:56:27Z", "content": "At his nightly White House press conference on Wednesday, April 22, President Donald Trump was hoping that the three health officials he had with him — Dr. Robert Redfield of the Centers for Disease Control and Prevention (CDC), Dr. Anthony Fauci and Dr. Debo… [+2323 chars]"}, {"source": {"id": null, "name": "Prevention.com"}, "author": "Jake Smith", "title": "“COVID Toes” May Be a New, Rare Symptom of Coronavirus, According to Doctors - Prevention.com", "description": "In some patients, these lesions could be the first—or only—sign of COVID-19.", "url": "https://www.prevention.com/health/a32237221/coronavirus-symptom-covid-toes/", "urlToImage": null, "publishedAt": "2020-04-23T20:22:00Z", "content": "<ul><li>Another unusual symptom of the novel coronavirus has surfaced: discolored toes that look swollen and feel painful to the touch. </li><li>Dubbed “COVID toes,” the rare symptom presents mostly in younger patients.</li><li>Doctors explain what COVID toes… [+5789 chars]"}, {"source": {"id": null, "name": "Iflscience.com"}, "author": "Madison Dapcevich", "title": "Researchers Identify Top Underlying Conditions Associated With Extreme Covid-19 Cases - IFLScience", "description": "In an analysis of thousands of Covid-19 patients admitted to dozens of hospitals in the New York metropolitan area, a team of researchers has determined th", "url": "https://www.iflscience.com/health-and-medicine/researchers-identify-top-underlying-conditions-associated-with-extreme-covid-19-cases/", "urlToImage": null, "publishedAt": "2020-04-23T20:17:00Z", "content": "In an analysis of thousands of Covid-19 patients admitted to dozens of hospitals in the New York metropolitan area, a team of researchers has determined that those with preexisting hypertension, obesity, and diabetes are more likely to have severe cases of th… [+3059 chars]"}, {"source": {"id": null, "name": "Bigthink.com"}, "author": "Derek Beres", "title": "Nearly 1,500 volunteers sign up to be infected with COVID-19 - Big Think", "description": "Human-challenge trials are not without risk, but they could speed up the process.", "url": "https://bigthink.com/coronavirus/coronavirus-vaccination", "urlToImage": null, "publishedAt": "2020-04-23T19:32:16Z", "content": "<ul><li>1Day Sooner recruited nearly 1,500 volunteers for a potential human-challenge trial to test for COVID-19 vaccines.</li><li>Human-challenge trials could help expedite the process that clinical trials must endure. </li><li>At least six COVID-19 vaccinat… [+4190 chars]"}, {"source": {"id": null, "name": "Boston25news.com"}, "author": "Debbie Lord, Cox Media Group National Content Desk", "title": "Coronavirus: Are blood clots killing COVID-19 patients? - Boston 25 News", "description": "According to reports from doctors across the country and around the world, some patients infected with the new coronavirus appear to be developing blood clots primarily in their lungs and legs.", "url": "https://www.boston25news.com/news/trending/coronavirus-are-blood-clots-killing-covid-19-patients/UAH5GS4WK5FPJFP7YUHPYT2ZIQ/", "urlToImage": null, "publishedAt": "2020-04-23T19:20:55Z", "content": "Physicians on the front line of coronavirus treatment are seeing a new and alarming symptom among patients infected with the COVID-19 virus.\r\nAccording to reports from doctors across the country and around the world, some patients infected with the new corona… [+4405 chars]"}]}