{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Wgntv.com"}, "author": null, "title": "Melrose Park officer dies from coronavirus complications - WGN TV Chicago", "description": "MELROSE PARK, Ill. — The Melrose Park Police Department has confirmed the death of one of their own. Officer Joseph Cappello died Friday. The department released a short statement that said: Office…", "url": "https://wgntv.com/chicago-news/melrose-park-officer-dies-from-coronavirus-complications/", "urlToImage": null, "publishedAt": "2020-04-24T23:22:19Z", "content": "MELROSE PARK, Ill. The Melrose Park Police Department has confirmed the death of one of their own.\r\nOfficer Joseph Cappello died Friday.\r\nThe department released a short statement that said:\r\nOfficer Cappello was an important part of the Melrose Park Police D… [+1459 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Chris Cuomo's Wife Cristina Adds Clorox to Her Bathwater - Inside Edition", "description": "CNN anchor Chris Cuomo wasn’t the only member of his family to contract COVID-19: his 14-year-old son and his wife, Cristina, also came down with the virus. ...", "url": "https://www.youtube.com/watch?v=0-wxuWxpIVY", "urlToImage": null, "publishedAt": "2020-04-24T23:01:26Z", "content": "CNN anchor Chris Cuomo wasnt the only member of his family to contract COVID-19: his 14-year-old son and his wife, Cristina, also came down with the virus. Now, Cristina is saying that part of the Cuomos Corona Protocol is adding half a cup of Clorox bleach t… [+224 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Ariana Eunjung Cha", "title": "Young and middle-aged people, barely sick with covid-19, are dying from strokes - The Washington Post", "description": "Doctors sound alarm about patients in their 30s and 40s left debilitated or dead by strokes. Some didn’t even know they were infected by coronavirus.", "url": "https://www.washingtonpost.com/health/2020/04/24/strokes-coronavirus-young-patients/", "urlToImage": null, "publishedAt": "2020-04-24T22:36:00Z", "content": "Thomas Oxley wasnt even on call the day he received the page to come into Mount Sinai Beth Israel Hospital in Manhattan. There werent enough doctors to treat all the emergency stroke patients, and he was needed in the operating room.\r\nThe patients chart appea… [+9500 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sarah Jorgensen and Scottie Andrew, CNN", "title": "The 5-month-old daughter of a New York firefighter dies from coronavirus - CNN", "description": "A New York firefighter's infant daughter has died from coronavirus, her family says, making her one of the youngest known victims of the virus.", "url": "https://www.cnn.com/2020/04/24/us/fdny-firefighter-daughter-dies-coronavirus-trnd/index.html", "urlToImage": null, "publishedAt": "2020-04-24T22:35:49Z", "content": null}, {"source": {"id": null, "name": "Myfox8.com"}, "author": "FOX8 Digital Desk", "title": "CDC adds 6 new coronavirus symptoms to list - WGHP FOX 8 Greensboro", "description": "The Centers for Disease Control and Prevention (CDC) on Friday expanded the list of coronavirus symptoms, which may appear anywhere from two days to two weeks after exposure. Here is the updated&nb…", "url": "https://myfox8.com/news/coronavirus/cdc-adds-6-new-coronavirus-symptoms-to-list/", "urlToImage": null, "publishedAt": "2020-04-24T22:20:42Z", "content": "WASHINGTON Melania Trump is sending blankets, caps and other gifts to hospitals in 10 states, including some hit hardest by the new coronavirus outbreak, for use by medical staff and children who are patients.\r\nThe care packages were shipped Thursday to hospi… [+158 chars]"}, {"source": {"id": null, "name": "Newser.com"}, "author": "Bob Cronin", "title": "Lawmakers Back Infecting People for Vaccine Trials - Newser", "description": "FDA hesitates, but bioethicists endorse the idea if done properly", "url": "https://www.newser.com/story/290026/this-vaccine-trial-would-need-volunteers.html", "urlToImage": null, "publishedAt": "2020-04-24T22:20:00Z", "content": "(Newser)\r\nThirty-five House members have expressed support for intentionally infecting a few hundred people with the coronavirus in an effort to develop a vaccine as quickly as possible. The young and healthy volunteers would first be given either the drug be… [+1460 chars]"}, {"source": {"id": null, "name": "Latimes.com"}, "author": "Matt Hamilton, Alex Wigglesworth, John Myers, Melanie Mason", "title": "National Guard helps L.A. nursing homes with coronavirus - Los Angeles Times", "description": "National Guard sent to Califoirnia nursing homes as officials face to slow deadly outbreaks", "url": "https://www.latimes.com/california/story/2020-04-24/national-guard-sent-to-califoirnia-nursing-homes-as-officials-face-to-slow-deadly-outbreaks", "urlToImage": null, "publishedAt": "2020-04-24T22:12:38Z", "content": "Medical teams from the California National Guard have been dispatched to five nursing homes in Los Angeles County, bolstering staff and resources in facilities that are especially hard-hit by coronavirus outbreaks.\r\nIts part of a larger effort by state and lo… [+2855 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus: White House task force addresses national COVID-19 response - KTLA 5", "description": "Update: Federal officials were providing updates on the government's response to COVID-19. #WhiteHouse #coronavirus #COVID19", "url": "https://www.youtube.com/watch?v=18CeqywkFLg", "urlToImage": null, "publishedAt": "2020-04-24T22:05:28Z", "content": null}, {"source": {"id": null, "name": "Theepochtimes.com"}, "author": null, "title": "Italy’s COVID-19 Outbreak Started ‘Much Earlier’ Than Previously Believed, Study Shows - The Epoch Times", "description": "The first COVID-19 infections in Italy date back to at least January, significantly pushing back the date the outbreak began, shedding light on its origin", "url": "https://www.theepochtimes.com/italys-covid-19-outbreak-started-much-earlier-than-previously-believed-study-shows_3325986.html", "urlToImage": null, "publishedAt": "2020-04-24T21:45:55Z", "content": "The first COVID-19 infections in Italy date back to at least January, according to a scientific study presented on Friday, significantly pushing back the date the virus started ravaging the country and shedding new light on the origins of the outbreak in the … [+3646 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Laura Italiano", "title": "France limits sales of nicotine products after fewer smokers catch coronavirus - New York Post ", "description": "Fearing a run on nicotine gum and patches, France has banned the online sale of the products — a move spurred by reports of a lower-than-expected number of smokers among those hospitalized wi…", "url": "https://nypost.com/2020/04/24/france-limits-sales-of-nicotine-products-after-fewer-smokers-catch-coronavirus/", "urlToImage": null, "publishedAt": "2020-04-24T21:45:15Z", "content": "Fearing a run on nicotine gum and patches, France has banned the online sale of the products — a move spurred by reports of a lower-than-expected number of smokers among those hospitalized with the coronavirus.\r\nIn addition to the online ban, French authoriti… [+397 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "What to know about protecting pets from coronavirus, caring for them if you’re sick - The State", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiP2h0dHBzOi8vd3d3LnRoZXN0YXRlLmNvbS9uZXdzL2Nvcm9uYXZpcnVzL2FydGljbGUyNDIyNzM5NTYuaHRtbNIBP2h0dHBzOi8vYW1wLnRoZXN0YXRlLmNvbS9uZXdzL2Nvcm9uYXZpcnVzL2FydGljbGUyNDIyNzM5NTYuaHRtbA?oc=5", "urlToImage": null, "publishedAt": "2020-04-24T21:37:13Z", "content": null}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Tom Tapp", "title": "L.A. County Coronavirus Update: Daily Number of Deaths Drops; Seniors Now A Major Focus - Deadline", "description": "Los Angeles County reported 52 more coronavirus-related deaths on Friday. That’s fewer deaths than the 68 reported on Thursday, and it represents the first decrease in recent days. The new reporting moves the region’s total death toll from the virus to 848. D…", "url": "https://deadline.com/2020/04/l-a-county-coronavirus-death-numbers-update-1202917373/", "urlToImage": null, "publishedAt": "2020-04-24T20:48:53Z", "content": "Los Angeles County reported 52 more coronavirus-related deaths on Friday. That’s fewer deaths than the 68 reported on Thursday, and it represents the first decrease in recent days. The new reporting moves the region’s total death toll from the virus to 848.\r\n… [+1845 chars]"}, {"source": {"id": null, "name": "Abc7news.com"}, "author": null, "title": "Coronavirus outbreak: 10 residents die at Redwood City nursing home - KGO-TV", "description": "\"We will never be the same, but then again, none of us will be,\" said the elderly care facility in a statement.", "url": "https://abc7news.com/redwood-city-nursing-home-coronavirus-outbreak-gordon-manor-deaths/6127477/", "urlToImage": null, "publishedAt": "2020-04-24T20:15:12Z", "content": "SAN FRANCISCO (KGO) -- Ten residents at Gordon Manor assisted living facility in Redwood City have passed away as a result of novel coronavirus.RELATED: I-Team uncovers disturbing details about Hayward nursing facility, site of Bay Area's largest COVID-19 out… [+2924 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "New pandemic model estimates coronavirus outbreak was spreading earlier than U.S. realized - CBS News", "description": "A New York Times analysis of the modeling estimates New York City had 10,000 infections by March 1, two weeks before social distancing guidelines were put in place.", "url": "https://www.cbsnews.com/news/coronavirus-pandemic-model-outbreaks-earlier-cities-new-york/", "urlToImage": null, "publishedAt": "2020-04-24T20:06:45Z", "content": "New information suggests the coronavirus was spreading rapidly in the US much earlier than first thought.  Only 23 coronavirus cases in several major cities had been reported by March 1, but analysis from a Northeastern University pandemic model estimates the… [+2211 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Sedgwick County may have peaked on COVID-19, health officer says - Wichita Eagle", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiPWh0dHBzOi8vd3d3LmthbnNhcy5jb20vbmV3cy9jb3JvbmF2aXJ1cy9hcnRpY2xlMjQyMjY5MDE2Lmh0bWzSAT1odHRwczovL2FtcC5rYW5zYXMuY29tL25ld3MvY29yb25hdmlydXMvYXJ0aWNsZTI0MjI2OTAxNi5odG1s?oc=5", "urlToImage": null, "publishedAt": "2020-04-24T20:04:14Z", "content": null}, {"source": {"id": null, "name": "Buzzfeednews.com"}, "author": "Stephanie M. Lee", "title": "A Stanford Professor’s Wife Recruited People For His Coronavirus Study By Claiming It Would Reveal If They Could “Return To Work Without Fear” - BuzzFeed News", "description": "An email sent to a Silicon Valley middle school’s private listserv tried to recruit families for the antibody study, promising “peace of mind” about their immunity to the coronavirus.", "url": "https://www.buzzfeednews.com/article/stephaniemlee/stanford-coronavirus-study-bhattacharya-email", "urlToImage": null, "publishedAt": "2020-04-24T19:49:58Z", "content": "The journalists at BuzzFeed News are proud to bring you trustworthy and relevant reporting about the coronavirus. To help keep this news free,become a memberand sign up for our newsletter,Outbreak Today.\r\nA Stanford University professors wife invited parents … [+9020 chars]"}, {"source": {"id": null, "name": "Chicagotribune.com"}, "author": "Hannah Herrera Greenspan", "title": "Coronavirus: Best fabrics for homemade masks - Chicago Tribune", "description": "Illinoisans will be required to wear a mask when they can't maintain a 6-foot distance in public. A new study shows which fabric is best for protection.", "url": "https://www.chicagotribune.com/coronavirus/ct-life-study-fabric-coronavirus-0424-tt-20200424-vu7hdrgfojfutm6c4jpy3ajsv4-story.html", "urlToImage": null, "publishedAt": "2020-04-24T19:45:25Z", "content": null}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Madeline Farber", "title": "First known US coronavirus fatality did not show signs of virus, father claims - Fox News", "description": "A California woman whose death in early February is said to be the first known COVID-19 fatality in the U.S. allegedly did not show any signs of the virus before passing away, her father claims.", "url": "https://www.foxnews.com/health/first-known-coronavirus-fatality-us-signs-of-virus", "urlToImage": null, "publishedAt": "2020-04-24T19:12:40Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox. Sign up here.\r\nA California woman whose death in early February is now said to be the first known COVID-19 fatality in the U.S. did not show any signs of the virus before dying, he… [+2047 chars]"}, {"source": {"id": null, "name": "Oregonlive.com"}, "author": "Shane Dixon Kavanaugh | The Oregonian/OregonLive", "title": "Coronavirus in Oregon: 3 new deaths as known cases near 2,200 - OregonLive", "description": "The Oregon Health Authority said two Multnomah County men, ages 80 and 86, and an 89-year-old Linn County man were the latest known patients to succumb to the illness, bringing the statewide death toll to 86.", "url": "https://www.oregonlive.com/coronavirus/2020/04/coronavirus-in-oregon-3-new-deaths-as-known-cases-near-2200.html", "urlToImage": null, "publishedAt": "2020-04-24T19:08:40Z", "content": "The Oregon Health Authority on Friday reported three new deaths from the novel coronavirus as confirmed cases climbed to 2,177.\r\nThe agency said two Multnomah County men, ages 80 and 86, and an 89-year-old Linn County man were the latest known patients to suc… [+3165 chars]"}, {"source": {"id": null, "name": "Dispatch.com"}, "author": "Max Filby", "title": "Coronavirus: Antibody testing coming to Columbus-area hospitals - The Columbus Dispatch", "description": "Testing for COVID-19 antibodies could soon be available throughout Ohio. Experts say the testing could be key to restarting the economy on a large scale.", "url": "https://www.dispatch.com/article/20200424/NEWS/200429239", "urlToImage": null, "publishedAt": "2020-04-24T18:38:49Z", "content": "Testing for COVID-19 antibodies may soon be available throughout Ohio. Experts say it could be key to restarting the economy on a large scale.\r\nCentral Ohio hospitals could start testing for COVID-19 antibodies in patients as soon as next week.\r\nThe testing, … [+4501 chars]"}, {"source": {"id": null, "name": "Nbc16.com"}, "author": "News Staff", "title": "Lane County resident who tested positive for COVID-19 dies; 2nd death to date - KVAL", "description": "EUGENE, Ore. - A second Lane County resident with COVID-19 has died. Lane County Public Health said the man from Eugene/Springfield died Thursday night at the hospital. The man suffered from a pre-existing medical condition, the county said. \"Our thoughts are…", "url": "http://nbc16.com/news/local/lane-county-resident-who-tested-positive-for-covid-19-dies-2nd-death-to-date", "urlToImage": null, "publishedAt": "2020-04-24T18:38:00Z", "content": null}, {"source": {"id": null, "name": "Today.com"}, "author": "Alexander Kacala", "title": "Andy Cohen says he couldn't donate plasma because he is gay - TODAY", "description": "Andy Cohen is speaking out about what he says is a discriminatory practice when it comes to LGBTQ people being able to donate blood and convalescent plasma.", "url": "https://www.today.com/health/andy-cohen-says-he-couldn-t-donate-plasma-because-he-t179881", "urlToImage": null, "publishedAt": "2020-04-24T18:16:37Z", "content": "Andy Cohen is speaking out about what he says is a discriminatory practice happening at the federal level when it comes to LGBTQ people being able to donate blood and convalescent plasma.\r\nThe 51-year-old talk show host tested positive for the coronavirus in … [+3733 chars]"}, {"source": {"id": null, "name": "Chron.com"}, "author": "", "title": "Houston coronavirus updates: What you need to know for April 24 - Chron.com", "description": "Chron.com  is following the latest headlines on the COVID-19 pandemic and its effects on the Houston area.", "url": "https://www.chron.com/coronavirus/article/Houston-coronavirus-updates-What-you-need-to-15223409.php", "urlToImage": null, "publishedAt": "2020-04-24T18:13:00Z", "content": "<ul><li>Mattress Mack announced a morning mask giveaway at Gallery Furniture on Friday, April 24.\r\nMattress Mack announced a morning mask giveaway at Gallery Furniture on Friday, April 24.\r\n Photo: Twitter\r\n</li></ul>\r\nMattress Mack announced a morning mask g… [+2223 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Marty Johnson", "title": "Arizona has worst day of confirmed coronavirus cases yet | TheHill - The Hill", "description": "Arizona experienced its worst day of the coronavirus pandemic on Thursday, reporting 310 new infe...", "url": "https://thehill.com/homenews/state-watch/494527-arizona-has-worst-day-yet-with-coronavirus", "urlToImage": null, "publishedAt": "2020-04-24T18:05:13Z", "content": "Arizona experienced its worst day of the coronavirus pandemic on Thursday, reporting 310 new infections and pushing the state's total confirmed case count to 5,769.\r\nAdditionally, 66 Arizonans have died from the disease in the past three days, the most the st… [+2301 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Tim Herrera", "title": "What Is Convalescent Plasma, and Why Do We Care About It? - The New York Times", "description": "Plasma from people who have recovered from Covid-19 may help others fight the disease.", "url": "https://www.nytimes.com/2020/04/24/smarter-living/coronavirus-convalescent-plasma-antibodies.html", "urlToImage": null, "publishedAt": "2020-04-24T16:30:09Z", "content": "A medical procedure doctors have used to treat novel diseases for a century has emerged as a focal point in the fight against Covid-19: convalescent plasma.\r\nConva-what-now?\r\nConvalescent plasma is the term used for plasma that is removed from the blood of a … [+8375 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Soo Kim", "title": "Sweden Claims It's Prepared For Second Wave Despite Having No Lockdown - Newsweek", "description": "The country's public health agency claims its capital Stockholm, where the majority of the cases have been reported, may have already passed the peak of the outbreak.", "url": "https://www.newsweek.com/coronavirus-second-wave-sweden-lockdown-herd-immunity-covid-19-1500046", "urlToImage": null, "publishedAt": "2020-04-24T16:17:08Z", "content": "The novel coronavirus in Sweden has spread to over 17,500 people and killed more than 2,100, as of Friday, according to the latest figures from Johns Hopkins University. While cases continue to grow, the country has taken the surprising route of not imposing … [+10846 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Kristen Aiken", "title": "Where To Buy Face Masks For Coronavirus, And What To Look For - HuffPost", "description": "How to purchase a face mask that can help you prevent the spread of COVID-19.", "url": "https://www.huffpost.com/entry/where-to-buy-face-masks-for-coronavirus_l_5ea2f833c5b669fd8923b316", "urlToImage": null, "publishedAt": "2020-04-24T16:07:20Z", "content": "Now that the Centers for Disease Control and Prevention has urged all Americans to cover their faces while out in public to prevent the spread of the coronavirus, face masks have been in high demand.\r\nIn light of the medical professions shortage of face masks… [+2704 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Tara Parker-Pope", "title": "What’s a Pulse Oximeter, and Do I Really Need One at Home? - The New York Times", "description": "A tiny fingertip device can give you valuable information about your health during a bout of Covid-19 or any respiratory illness.", "url": "https://www.nytimes.com/2020/04/24/well/live/coronavirus-pulse-oximeter-oxygen.html", "urlToImage": null, "publishedAt": "2020-04-24T16:05:24Z", "content": "After working for 10 days at Bellevue Hospital in New York, Dr. Richard Levitan decided to share what he had learned about Covid-19. Too many patients were showing up at the hospital with perilously low oxygen levels, putting them at risk for severe complicat… [+8004 chars]"}, {"source": {"id": null, "name": "Nejm.org"}, "author": null, "title": "Presymptomatic SARS-CoV-2 Infections and Transmission in a Skilled Nursing Facility - nejm.org", "description": "Original Article from The New England Journal of Medicine — Presymptomatic SARS-CoV-2 Infections and Transmission in a Skilled Nursing Facility", "url": "https://www.nejm.org/doi/full/10.1056/NEJMoa2008457", "urlToImage": null, "publishedAt": "2020-04-24T16:03:34Z", "content": "Twenty-three days after identifying the first resident with SARS-CoV-2 infection, Facility A had a 64% prevalence of Covid-19 among residents, with a case fatality rate of 26% despite early adoption of infection-control measures. In addition, Covid-19 was dia… [+7968 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Coronavirus deaths top 50,000 in US, and ‘worst is yet ahead,’ WHO chief says - Miami Herald", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiQmh0dHBzOi8vd3d3Lm1pYW1paGVyYWxkLmNvbS9uZXdzL2Nvcm9uYXZpcnVzL2FydGljbGUyNDIyMTM5OTYuaHRtbNIBQmh0dHBzOi8vYW1wLm1pYW1paGVyYWxkLmNvbS9uZXdzL2Nvcm9uYXZpcnVzL2FydGljbGUyNDIyMTM5OTYuaHRtbA?oc=5", "urlToImage": null, "publishedAt": "2020-04-24T15:43:14Z", "content": null}, {"source": {"id": null, "name": "Oregonlive.com"}, "author": null, "title": "Vitamins C, D can help prevent coronavirus, Oregon State University researcher says - OregonLive", "description": "Adrian Gombart of OSU’s Linus Pauling Institute, along with his collaborators at universities across the world, said public health officials should issue a clear set of nutritional guidelines to complement the existing advice about washing hands to prevent th…", "url": "https://www.oregonlive.com/coronavirus/2020/04/vitamins-c-d-can-help-prevent-coronavirus-oregon-state-university-researcher-says.html", "urlToImage": null, "publishedAt": "2020-04-24T15:37:02Z", "content": "Supplements containing vitamins C and D, along with other micronutrients, can be a safe, effective and low-cost means to fight off the novel coronavirus and other acute respiratory tract diseases, according to an Oregon State University researcher.\r\nAdrian Go… [+5436 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Elisabeth Buchwald", "title": "‘We don’t eat our countertops,’ yet many Americans are using cleaning products meant for them on their fruits and vegetables, National Poison Control Center official says - MarketWatch", "description": "Poison control centers across the U.S. saw a 20% increase in calls last month compared to 2019.", "url": "https://www.marketwatch.com/story/we-dont-eat-our-countertops-yet-many-americans-are-using-cleaning-products-meant-for-them-on-their-fruits-and-vegetables-says-national-poison-control-center-official-2020-04-24", "urlToImage": null, "publishedAt": "2020-04-24T15:11:26Z", "content": "Shortages of cleaning supplies amid the coronavirus pandemic are leading many Americans to get creative. But that creativity and compulsion to clean and disinfect more may be causing more harm than good.Last month, calls to poison control centers surged by ne… [+4139 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus potential vaccine human trials begin in UK - WION", "description": "Scientists in Britain began clinical trials of a potential COVID-19 vaccine on Thursday (April 23) as other vaccine developers across Europe also stepped up ...", "url": "https://www.youtube.com/watch?v=rA8piD_OfYY", "urlToImage": null, "publishedAt": "2020-04-24T15:05:33Z", "content": null}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Tim Heffernan", "title": "Disinfectant Against Coronavirus: How to Make and Use - The New York Times", "description": "Here’s a guide to working with sprays, wipes and a bleach-based solution to clean surfaces of the pathogen.", "url": "https://www.nytimes.com/article/disinfectant-coronavirus.html", "urlToImage": null, "publishedAt": "2020-04-24T14:21:55Z", "content": "The coronavirus that causes Covid-19 may survive for several days on some surfaces. Estimates of its life span vary, but the virus can clearly hang around long enough to make disinfecting frequently touched surfaces a priority.\r\nNormally, disinfectants, like … [+7147 chars]"}, {"source": {"id": null, "name": "Wavy.com"}, "author": "Adrienne Mayfield", "title": "Patient First offering drive-up COVID-19 testing in Chesapeake and Hampton - WAVY.com", "description": "HAMPTON ROADS, Va. (WAVY) — Patient first is offering coronavirus testing at two locations – in Chesapeake and Hampton. The COVID-19 testing will be done drive-up style. Patients must r…", "url": "https://www.wavy.com/news/health/patient-first-offering-drive-up-covid-19-testing-in-chesapeake-and-hampton/", "urlToImage": null, "publishedAt": "2020-04-24T13:56:00Z", "content": "HAMPTON ROADS, Va. (WAVY) — Patient first is offering coronavirus testing at two locations – in Chesapeake and Hampton.\r\nThe COVID-19 testing will be done drive-up style. Patients must remain in their cars during the testing, and Patient First staff will wear… [+1329 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Timothy Bella", "title": "An ER nurse survived covid-19 at her own hospital. Now she wants to get back to treating coronavirus patients. - Washington Post", "description": "“When I get better, I am going back to my job,” she said. Speaking to reporters on Thursday, she added, “When I get back to work, I’m going to make sure I take care of everyone the same way.”", "url": "https://www.washingtonpost.com/nation/2020/04/24/nurse-hospital-coronavirus-boston/", "urlToImage": null, "publishedAt": "2020-04-24T12:50:00Z", "content": "I told my mother, Im going to die, the 58-year-old recalled to reporters.\r\nSo when Buonopane survived the virus and exited Brigham and Womens on Thursday afternoon, a walk she has made countless times in her 31 years working there, it was nothing short of a c… [+5781 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Coronavirus: distancing and handwashing could lower flu rates – but it's still too early to tell - Yahoo News", "description": null, "url": "https://consent.yahoo.com/collectConsent?sessionId=1_cc-session_be2aad5d-5eb4-4a67-94b4-5fd4f05f44a9&lang=en-GB&inline=false", "urlToImage": null, "publishedAt": "2020-04-24T12:41:00Z", "content": "To give you a better overall experience, we want to provide relevant ads that are more useful to you. For example, when you search for a film, we use your search information and location to show the most relevant cinemas near you. We also use this information… [+258 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alicia Lee, CNN", "title": "She lost 8 friends and family members to Covid-19. But she hasn't lost her will to help others - CNN", "description": "\"I cried and I felt weak,\" Jones told CNN. \"It just became so overwhelming that I became numb.\" But instead of falling into depression, Jones says she decided to focus her energy on helping others.", "url": "https://www.cnn.com/2020/04/24/us/missouri-shana-jones-coronavirus-help-trnd/index.html", "urlToImage": null, "publishedAt": "2020-04-24T11:16:19Z", "content": "Want more inspiring, positive news? Sign up for The Good Stuff, a newsletter for the good in life. It will brighten your inbox every Saturday morning.\r\n (CNN)In the week before and after her birthday on March 25, the phone of 42-year-old Shana Jones rang nons… [+2303 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Robin McKie", "title": "Coronavirus: what have scientists learned about Covid-19 so far? - The Guardian", "description": "Medical researchers have been studying everything we know about Covid-19. What have they learned – and is it enough to halt the pandemic?", "url": "https://www.theguardian.com/world/2020/apr/24/coronavirus-what-have-scientists-learned-about-covid-19-so-far", "urlToImage": null, "publishedAt": "2020-04-24T10:16:00Z", "content": "Coronaviruses have been causing problems for humanity for a long time. Several versions are known to trigger common colds and more recently two types have set off outbreaks of deadly illnesses: severe acute respiratory syndrome (Sars) and Middle East respirat… [+9271 chars]"}, {"source": {"id": null, "name": "Latimes.com"}, "author": "Liz Szabo", "title": "Anti-vaxxers join coronavirus protesters to lift their cause - Los Angeles Times", "description": "Activists skeptical of vaccines are joining with conservatives and other anti-lockdown demonstrators. They contend the coronavirus isn’t dangerous enough to justify stay-at-home orders.", "url": "https://www.latimes.com/california/story/2020-04-24/anti-vaccine-activists-latch-onto-coronavirus-to-bolster-their-movement", "urlToImage": null, "publishedAt": "2020-04-24T09:03:01Z", "content": "While most of the world hungers for a vaccine to put an end to the death and economic destruction wrought by COVID-19, some anti-vaccine groups are joining with anti-lockdown demonstrators to challenge restrictions aimed at protecting public health.\r\nVaccine … [+8577 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Natalie Rahhal Acting Us Health Editor", "title": "Coronavirus patients' EYES could be contagious for WEEKS, study suggests - Daily Mail", "description": "A case study of a 65-year-old woman in Italy found that coronavirus was actively making copies of itself in her eyes before she had a fever - and persisted for weeks, even after fading elsewhere.", "url": "https://www.dailymail.co.uk/health/article-8250463/Coronavirus-patients-EYES-contagious-WEEKS-study-suggests.html", "urlToImage": null, "publishedAt": "2020-04-24T08:55:34Z", "content": "Coronavirus can linger in the eyes for weeks on end, according to a newly-published case report. \r\nResearchers at the National Institute for Infectious Diseases in Italy found that virus persisted in the eyes of one 65-year-old woman for 21 days after she fir… [+5401 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Erika Edwards", "title": "Doctors report uptick in surprising coronavirus complication: dangerous blood clots - NBC News", "description": "Coronavirus patients are developing blood clots at higher rates. Does the virus cause blood to clot, or is it the result of inflammation? Regular anticoagulants aren't working.", "url": "https://www.nbcnews.com/health/health-news/doctors-report-uptick-surprising-coronavirus-complication-dangerous-blood-clots-n1190491", "urlToImage": null, "publishedAt": "2020-04-24T08:33:27Z", "content": "Three weeks ago, critical care pulmonologist Hugh Cassiere encountered something he hadn't seen in 24 years of practicing medicine.\r\nA 45-year-old man arrived at the hospital where Cassiere works, North Shore University Hospital on Long Island, New York, with… [+4346 chars]"}, {"source": {"id": null, "name": "Times-standard.com"}, "author": "Shomik Mukherjee", "title": "Humboldt County model: COVID-19 peak could be in December with current stay-at-home rules - Eureka Times-Standard", "description": "The county’s models forecast that, without a shelter-in-place order, coronavirus patients needing beds would far exceed capacity at local hospitals and intensive care units.", "url": "https://www.times-standard.com/humboldt-county-model-covid-19-peak-could-be-in-december-with-current-stay-at-home-rules", "urlToImage": null, "publishedAt": "2020-04-24T03:33:35Z", "content": "If residents continue to stay at home, Humboldt County would reach a peak in cases of hospitalized coronavirus patients sometime in December, a model developed by the county indicates.\r\nCounty officials said Thursday businesses will be allowed to open back up… [+3718 chars]"}, {"source": {"id": null, "name": "Popculture.com"}, "author": "Daniel S. Levine", "title": "America's First COVID-19 Death Details Revealed - PopCulture.com", "description": "A San Jose, California woman is now believed to be the first U.S. death from the novel coronavirus, according to new autopsy results. Patricia Dowd, 57, died on Feb. 6, more than two weeks before a death in Washington on Feb. 29 was considered the first coron…", "url": "https://popculture.com/trending/news/america-first-covid-19-death-details-revealed/", "urlToImage": null, "publishedAt": "2020-04-24T02:26:00Z", "content": "A San Jose, California woman is now believed to be the first U.S. death from the novel coronavirus, according to new autopsy results. Patricia Dowd, 57, died on Feb. 6, more than two weeks before a death in Washington on Feb. 29 was considered the first coron… [+2872 chars]"}, {"source": {"id": null, "name": "Webmd.com"}, "author": "https://www.facebook.com/dineshRewale", "title": "The Great Invader: How COVID Attacks Every Organ - dineshr", "description": "medRxiv: “COVID-19 Antibody Seroprevalence in Santa Clara County, California.” Joseph Vinetz, MD,  professor, Section of Infectious Diseases, Yale School of Medicine, New Haven, CT. \r Science: How does coronavirus kill? Clinicians trace ferocious rampage thro…", "url": "https://www.webmd.com/lung/news/20200423/the-great-invader-how-covid-attacks-every-organ?src=RSS_PUBLIC", "urlToImage": null, "publishedAt": "2020-04-24T02:25:10Z", "content": "medRxiv: COVID-19 Antibody Seroprevalence in Santa Clara County, California.\r\nJoseph Vinetz, MD,  professor, Section of Infectious Diseases, Yale School of Medicine, New Haven, CT.\r\nScience: How does coronavirus kill? Clinicians trace ferocious rampage throug… [+1053 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Public Health responds to comments made by Accelerated Urgent Care Doctors to reopen Kern County - 23 ABC News | KERO", "description": "Public Health responds to comments made by Accelerated Urgent Care Doctors to reopen Kern County", "url": "https://www.youtube.com/watch?v=OhxAIOhCPHQ", "urlToImage": null, "publishedAt": "2020-04-24T01:04:28Z", "content": null}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "William Wan", "title": "State, local health departments get $631 million to jump-start coronavirus testing, contact tracing - The Washington Post", "description": "The money, while sizable, is just a fraction of what disease experts and health departments say will be needed in coming months.", "url": "https://www.washingtonpost.com/health/2020/04/23/coronavirus-federalfunding-testing/", "urlToImage": null, "publishedAt": "2020-04-24T01:03:31Z", "content": "State and local health officials are also pressing to use this moment to build back up public health capacities that they say have been insufficient for years.\r\nIts so hard to get people and leaders to think about public health. Thats how we have found oursel… [+3832 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Mom Who Died From COVID-19 Has Been Named Victim #1 - Inside Edition", "description": "A 57-year-old California woman who was seemingly healthy when she died of a sudden heart attack in early February is now believed to be the first American to...", "url": "https://www.youtube.com/watch?v=KitEaD4TXPU", "urlToImage": null, "publishedAt": "2020-04-23T23:34:36Z", "content": null}, {"source": {"id": null, "name": "Telegram.com"}, "author": "Telegram & Gazette Staff", "title": "Central Mass. city and town COVID-19 cases - News - telegram.com - Worcester, MA - Worcester Telegram", "description": "Worcester officials announced Thursday afternoon that the city has had 1,542 confirmed COVID-19 cases, an increase of 97 over the numbers announced", "url": "https://www.telegram.com/article/20200423/NEWS/200429661", "urlToImage": null, "publishedAt": "2020-04-23T22:13:00Z", "content": "Worcester officials announced Thursday afternoon that the city has had 1,542 confirmed COVID-19 cases, an increase of 97 over the numbers announced Wednesday.\r\nWorcester County has had 3,798 cases and 155 deaths. The most densely populated counties have had t… [+2787 chars]"}, {"source": {"id": null, "name": "Abc57.com"}, "author": null, "title": "COVID toes: A mysterious new coronavirus symptom - ABC 57 News", "description": "The typical symptoms for the coronavirus include a dry cough, difficulty breathing and a fever, but health officials are now saying that discoloration in the toes may be another symptom that is linked to COVID-19.", "url": "https://www.abc57.com/news/covid-toes-a-new-mysterious-coronavirus-symptom", "urlToImage": null, "publishedAt": "2020-04-23T22:07:00Z", "content": "ST. JOSEPH COUNTY, Ind. -- The typical symptoms for the coronavirus include a dry cough, difficulty breathing and a fever, but health officials are now saying that discoloration in the toes may be another symptom that is linked to COVID-19.\r\nHealth officials … [+1138 chars]"}, {"source": {"id": null, "name": "Theepochtimes.com"}, "author": null, "title": "Most NYC Virus Patients Had Underlying Health Issues, Study Shows - The Epoch Times", "description": "Most patients in New York City hospitalized with the CCP virus suffered from at least one underlying health issue, such as obesity or kidney disease.", "url": "https://www.theepochtimes.com/most-new-york-virus-patients-had-underlying-health-issue-study_3324097.html", "urlToImage": null, "publishedAt": "2020-04-23T21:17:16Z", "content": "Most patients in New York City hospitalized with the CCP virus suffered from one or more underlying health issues, such as obesity or kidney disease, according to a new study.\r\nResearchers analyzed records from 5,700 patients and found more than 56 percent su… [+3603 chars]"}, {"source": {"id": null, "name": "Salon.com"}, "author": "Alex Henderson", "title": "CDC director contradicts Trump's claim he was \"misquoted\" on potential for fall coronavirus outbreak - Salon", "description": "\"I'm accurately quoted in the Washington Post\"", "url": "https://www.salon.com/2020/04/23/cdc-director-contradicts-trumps-claim-he-was-misquoted-on-potential-for-fall-coronavirus-outbreak_partner/", "urlToImage": null, "publishedAt": "2020-04-23T20:56:27Z", "content": "At his nightly White House press conference on Wednesday, April 22, President Donald Trump was hoping that the three health officials he had with him — Dr. Robert Redfield of the Centers for Disease Control and Prevention (CDC), Dr. Anthony Fauci and Dr. Debo… [+2323 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Doha Madani", "title": "Connecticut town reverses course on 'pandemic drones' amid privacy concerns - NBC News", "description": "A Connecticut police force is reversing course on testing a \"pandemic drone,\" which would detect a person with a fever or cough, amid privacy concerns.", "url": "https://www.nbcnews.com/news/us-news/connecticut-town-reverses-course-pandemic-drones-amid-privacy-concerns-n1191051", "urlToImage": null, "publishedAt": "2020-04-23T20:45:28Z", "content": "A Connecticut police force is grounding its plans to test a \"pandemic drone\" that would detect a person with a fever or cough, after privacy concerns were raised.\r\nThe town of Westport has chosen to opt out of the Flatten the Curve Pilot Program from drone ma… [+1591 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Hannah Sparks", "title": "Your fancy French press coffee isn't good for you - New York Post ", "description": "The findings are a boon to coffee snobs everywhere.", "url": "https://nypost.com/2020/04/23/your-fancy-french-press-coffee-isnt-good-for-you/", "urlToImage": null, "publishedAt": "2020-04-23T20:07:32Z", "content": "Say what you will, coffee purists, but the best way to brew is by the humble drip method, cardiologists claim.\r\nBetween 2018 and 2019, the world’s coffee growers produced nearly 1.357 trillion pounds of coffee, and the unfathomable number of cups of joe that … [+4002 chars]"}, {"source": {"id": null, "name": "Gothamist.com"}, "author": "/staff/elizabeth-kim", "title": "Coronavirus Updates: De Blasio Says 2 Million New Yorkers Could Become Food Insecure Due To Pandemic - Gothamist", "description": "\"How do you not fund police and fire and teachers and schools in the midst of this crisis?\"", "url": "http://gothamist.com/news/coronavirus-updates-april-23-unemployment", "urlToImage": null, "publishedAt": "2020-04-23T17:27:39Z", "content": "This is our daily update of breaking COVID-19 news for Wednesday, April 22nd, 2020. Previous daily updatescan be found here, andup-to-date statistics are here.\r\nRead our guide tounderstanding New York on PAUSE, NY's stay-at-home order; a look atpreparing for … [+7013 chars]"}, {"source": {"id": null, "name": "Ktla.com"}, "author": "CNN Wire", "title": "CA seeks review of autopsies from December after earlier COVID-19 deaths discovered - KTLA Los Angeles", "description": "California and Indiana are retracing their coronavirus timelines after discovering that the highly infectious disease spread wider and started killing people earlier than previously reported. Gov. …", "url": "https://ktla.com/news/california/california-seeks-review-of-autopsies-dating-to-december-after-discovery-of-earlier-covid-19-deaths/", "urlToImage": null, "publishedAt": "2020-04-23T16:05:56Z", "content": "California and Indiana are retracing their coronavirus timelines after discovering that the highly infectious disease spread wider and started killing people earlier than previously reported.\r\nGov. Gavin Newsom has asked coroners to review California cases da… [+5654 chars]"}, {"source": {"id": null, "name": "News3lv.com"}, "author": "Matthew Seeman", "title": "Nevada COVID cases reach 4,208; 13 new deaths reported in Clark County - News3LV", "description": "The number of COVID-19 cases reported in Nevada reached 4,208 as of Thursday morning, according to the state's data dashboard. There have been 195 deaths linked to the coronavirus disease reported in Nevada as of Thursday night, per figures from the Departmen…", "url": "http://news3lv.com/news/local/nevada-covid-cases-reach-4208-13-new-deaths-reported-in-clark-county", "urlToImage": null, "publishedAt": "2020-04-23T15:11:00Z", "content": null}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Silvia Aloisi", "title": "Special Report: As virus advances, doctors rethink rush to ventilate - Reuters", "description": "When he was diagnosed with COVID-19, Andre Bergmann knew exactly where he wanted to be treated: the Bethanien hospital lung clinic in Moers, near his home in northwestern Germany.", "url": "https://www.reuters.com/article/us-health-coronavirus-ventilators-specia-idUSKCN2251PE", "urlToImage": null, "publishedAt": "2020-04-23T15:05:27Z", "content": "BERLIN (Reuters) - When he was diagnosed with COVID-19, Andre Bergmann knew exactly where he wanted to be treated: the Bethanien hospital lung clinic in Moers, near his home in northwestern Germany. \r\nThe clinic is known for its reluctance to put patients wit… [+16856 chars]"}, {"source": {"id": null, "name": "Alternet.org"}, "author": "Bob Brigham", "title": "Study out of New York could change everything we thought we knew about fevers and coronavirus - AlterNet", "description": "", "url": "https://www.alternet.org/2020/04/study-out-of-new-york-could-change-everything-we-thought-we-knew-about-fevers-and-coronavirus/", "urlToImage": null, "publishedAt": "2020-04-23T14:54:00Z", "content": "Scientists are continuing to research COVID-19 and some of the findings have upset what we thought we knew about coronavirus.\r\nA new study published in the Journal of the American Medical Association shares what doctors have discovered in New York states larg… [+1353 chars]"}, {"source": {"id": null, "name": "Theguardian.comglobal-development"}, "author": "Kaamil Ahmed", "title": "Pandemic could 'turn back the clock' 20 years on malaria deaths, warns WHO - The Guardian", "description": "Deaths in sub-Saharan African countries could double to more than 700,000 this year if Covid-19 crisis disrupts programmes", "url": "https://amp.theguardian.comglobal-development/2020/apr/23/pandemic-could-turn-back-the-clock-20-years-on-malaria-deaths-warns-who", "urlToImage": null, "publishedAt": "2020-04-23T13:36:46Z", "content": "Deaths from malaria could double across sub-Saharan Africa this year if work to prevent the disease is disrupted by Covid-19, the World Health Organization has warned.\r\nThe UNs global health agency said that if countries failed to maintain delivery of insecti… [+2702 chars]"}, {"source": {"id": null, "name": "Mercurynews.com"}, "author": "Judith Graham, Kaiser Health News", "title": "Seniors with Covid-19 show unusual symptoms, doctors say - The Mercury News", "description": "Older adults with Covid-19, the illness caused by the coronavirus, have several “atypical” symptoms, complicating efforts to ensure they get timely and appropriate treatment, according …", "url": "https://www.mercurynews.com/seniors-with-covid-19-show-unusual-symptoms-doctors-say", "urlToImage": null, "publishedAt": "2020-04-23T12:40:07Z", "content": "Older adults with Covid-19, the illness caused by the coronavirus, have several “atypical” symptoms, complicating efforts to ensure they get timely and appropriate treatment, according to physicians.\r\nCovid-19 is typically signaled by three symptoms: a fever,… [+6687 chars]"}, {"source": {"id": null, "name": "Ktla.com"}, "author": "Los Angeles Times", "title": "Seemingly healthy woman’s sudden death is now first known coronavirus-related fatality in U.S. - KTLA Los Angeles", "description": "A mystery clouded the death of Patricia Dowd in early February. The San Jose woman was a seemingly healthy 57-year-old who exercised routinely, watched her diet and took no medication. She had flu-…", "url": "https://ktla.com/news/california/seemingly-healthy-womans-sudden-death-is-now-first-known-coronavirus-related-fatality-in-u-s/", "urlToImage": null, "publishedAt": "2020-04-23T12:09:26Z", "content": "A mystery clouded the death of Patricia Dowd in early February.\r\nThe San Jose woman was a seemingly healthy 57-year-old who exercised routinely, watched her diet and took no medication. She had flu-like symptoms for a few days, then appeared to recover, a fam… [+527 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Matthew Wright For Dailymail.com Vanessa Chalmers Health Reporter For Mailonline", "title": "Nearly 90 per cent of COVID-19 patients placed on ventilators in NY's largest health system DIED - Daily Mail", "description": "The study, published in the Journal of the American Medical Association on Wednesday, examined the electronic health records of 5,700 patients hospitalized.", "url": "https://www.dailymail.co.uk/news/article-8248023/Nearly-90-cent-COVID-19-patients-placed-ventilators-NYs-largest-health-DIED.html", "urlToImage": null, "publishedAt": "2020-04-23T12:07:07Z", "content": "Nearly 90 per cent of all coronavirus patients placed on ventilators in New York's largest health system died, according to a study. \r\nThe study, published in the Journal of the American Medical Association on Wednesday, examined the electronic health records… [+4384 chars]"}, {"source": {"id": null, "name": "Fox59.com"}, "author": "CNN Wire", "title": "Indiana among states retracing coronavirus timelines after earlier US deaths discovered - Fox 59", "description": "California and Indiana are retracing their coronavirus timelines after discovering that the highly infectious disease started killing people earlier than previously thought. Gov. Gavin Newsom has a…", "url": "https://fox59.com/news/coronavirus/indiana-among-states-retracing-coronavirus-timelines-after-earlier-us-deaths-discovered/", "urlToImage": null, "publishedAt": "2020-04-23T09:54:00Z", "content": "California and Indiana are retracing their coronavirus timelines after discovering that the highly infectious disease started killing people earlier than previously thought.\r\nGov. Gavin Newsom has asked coroners to review California cases dating to December a… [+5865 chars]"}, {"source": {"id": null, "name": "Statnews.com"}, "author": null, "title": "Covid phobia keeping people with heart symptoms away from ERs - STAT", "description": "A survey of nine major hospitals showed the number of severe heart attacks being treated in U.S hospitals had dropped nearly 40%.", "url": "https://www.statnews.com/2020/04/23/coronavirus-phobia-keeping-heart-patients-away-from-er/", "urlToImage": null, "publishedAt": "2020-04-23T08:48:08Z", "content": "Stayc Simpsons blood pressure readings are all over the place. Her heart rate is fluctuating wildly. After struggling with heart failure and coronary artery disease for 15 years, undergoing a double bypass, and living with an implanted pacemaker and defibrill… [+11618 chars]"}, {"source": {"id": null, "name": "Abc7.com"}, "author": "Denise Dador", "title": "Majority of hospitalized COVID-19 patients didn't have fevers, study finds - KABC-TV", "description": "A new study is presenting surprising findings about COVID-19 and which factors play the biggest role in how severe the disease is for some people.", "url": "https://abc7.com/coronavirus-news-update-symptoms/6123325/", "urlToImage": null, "publishedAt": "2020-04-23T07:31:39Z", "content": "A new study is presenting surprising findings about COVID-19 and which factors play the biggest role in how severe the disease is for some people.With New York being the epicenter for the virus in the U.S., researchers from the state's largest health care sys… [+2043 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Doctors trying to understand COVID-19 symptoms left with more questions - ABC News", "description": "Some patients with the coronavirus are seeing its damage in the heart, brain and kidneys, leading researchers to suspect an immune response is leading to pot...", "url": "https://www.youtube.com/watch?v=0Uz0mkSWbfQ", "urlToImage": null, "publishedAt": "2020-04-23T05:16:58Z", "content": null}, {"source": {"id": null, "name": "Kcci.com"}, "author": null, "title": "Nearly all COVID-19 patients put on ventilators in New York's largest health system died, study finds - KCCI Des Moines", "description": "According to the study, 88% of those placed on ventilators died.", "url": "https://www.kcci.com/article/nearly-all-covid-19-patients-put-on-ventilators-in-new-yorks-largest-health-system-died-study-finds/32244563", "urlToImage": null, "publishedAt": "2020-04-23T03:12:00Z", "content": "Nearly all coronavirus patients who needed ventilators in New York's largest health system to help them breathe died, a study found.\r\nOverall, about 20% of COVID-19 patients treated at Northwell Health died, and 88% of those placed on ventilators died, accord… [+2170 chars]"}, {"source": {"id": null, "name": "Nydailynews.com"}, "author": "Lauren Theisen", "title": "Coronavirus can increase stroke risk in young adults: doctors - New York Daily News", "description": "There’s increasing evidence that coronavirus infections can cause serious blood clots.", "url": "https://www.nydailynews.com/coronavirus/ny-doctors-say-coronavirus-can-increase-risk-of-stroke-in-young-adults-20200423-oej3dzulrncondpdrdckiaqrlq-story.html", "urlToImage": null, "publishedAt": "2020-04-23T02:41:00Z", "content": null}, {"source": {"id": null, "name": "Wlwt.com"}, "author": null, "title": "COVID-19 causes sudden strokes in adults younger than 50, doctors say - WLWT Cincinnati", "description": "The new coronavirus appears to be causing sudden strokes in adults in their 30s and 40s who are not otherwise terribly ill, doctors reported.", "url": "https://www.wlwt.com/article/covid-19-causes-sudden-strokes-in-young-adults-doctors-say-1/32244036", "urlToImage": null, "publishedAt": "2020-04-23T02:04:00Z", "content": "Video above: Smokers at greater risk of contracting COVID-19, researchers say\r\nThe new coronavirus appears to be causing sudden strokes in adults in their 30s and 40s who are not otherwise terribly ill, doctors reported Wednesday.\r\nThey said patients may be u… [+2601 chars]"}]}