{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Ryan J. Foley", "title": "Coronavirus sweeps through Iowa firefighter's family - The Associated Press", "description": "IOWA CITY, Iowa (AP) — His mother first fell sick a month ago with an illness she believes she caught at the Iowa egg factory where she works. His younger sister, 22, was next — a new mother...", "url": "https://apnews.com/7b0fbd580b2f45ec880bf71edd17738c", "urlToImage": null, "publishedAt": "2020-04-26T18:34:43Z", "content": "IOWA CITY, Iowa (AP) His mother first fell sick a month ago with an illness she believes she caught at the Iowa egg factory where she works.\r\nHis younger sister, 22, was next a new mother who was soon on a ventilator fighting for her life. Then the coronaviru… [+5576 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Pam Belluck", "title": "32 Days on a Ventilator: One Covid Patient’s Fight to Breathe Again - The New York Times", "description": "Jim Bello, 49 and healthy, fell gravely ill, highlighting agonizing mysteries of the coronavirus. Doctors’ relentless effort to save him was a roller-coaster of devastating and triumphant twists.", "url": "https://www.nytimes.com/2020/04/26/health/coronavirus-patient-ventilator.html", "urlToImage": null, "publishedAt": "2020-04-26T18:18:44Z", "content": "HINGHAM, Mass. Is he going to make it? Kim Bello asked, clutching her phone, alone in her yard.\r\nShe had slipped outside so her three children, playing games in the living room, could be shielded from a wrenching conversation with a doctor treating her husban… [+15430 chars]"}, {"source": {"id": null, "name": "Sun-sentinel.com"}, "author": "Aric Chokey, Mario Ariza", "title": "The coronavirus data that will guide when to reopen Florida - South Florida - South Florida Sun Sentinel", "description": "Experts and officials point to several statistics when considering whether to end Florida's coronavirus shutdown — from hospital capacity to fatality rates to test results. What does the data really tell us about what is doing on?", "url": "https://www.sun-sentinel.com/coronavirus/fl-ne-coronvirus-florida-statistics-explainer-20200426-wezs5f5fx5drzckgsr6oeq6wze-htmlstory.html", "urlToImage": null, "publishedAt": "2020-04-26T18:06:38Z", "content": null}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Peter Aitken", "title": "Coronavirus hits Netherlands farm animals as minks test positive for virus - Fox News", "description": "Animals in the Netherlands tested positive for the coronavirus for the first time.", "url": "https://www.foxnews.com/world/mink-netherlands-coronavirus-farm", "urlToImage": null, "publishedAt": "2020-04-26T17:56:09Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox. Sign up here.\r\nAnimals at two mink farms in the Netherlands have tested positive for coronavirus, according to officials. \r\nDutch Minister of Agriculture Carola Schouten announced … [+1946 chars]"}, {"source": {"id": null, "name": "Keloland.com"}, "author": "Marissa Lute", "title": "Sunday’s COVID-19 update: One new death reported in the state - KELOLAND.com", "description": "PIERRE, S.D. (KELO) — The latest COVID-19 test result numbers as of 11 a.m. Sunday show the state with 11 total deaths in the state.", "url": "https://www.keloland.com/news/healthbeat/coronavirus/sundays-covid-19-update-one-new-death-reported-in-the-state/", "urlToImage": null, "publishedAt": "2020-04-26T16:22:00Z", "content": "PIERRE, S.D. (KELO) — The latest COVID-19 test result numbers as of 11 a.m. Sunday show the state with 11 total deaths in the state.\r\nAccording to data from the South Dakota Department of Health, the male patient was 50-59 years old and from Minnehaha County.… [+690 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Susan Miller", "title": "These are the 6 new possible symptoms of the coronavirus the CDC added to its list - USA TODAY", "description": "Chills, repeated shaking with chills, muscle pain, headache, sore throat and a loss of taste or smell are the new symptoms added to the CDC list.", "url": "https://www.usatoday.com/story/news/health/2020/04/26/coronavirus-symptoms-cdc-adds-six-new-symptoms-covid-19/3029438001/", "urlToImage": null, "publishedAt": "2020-04-26T16:18:45Z", "content": "The secret to fighting COVID-19 could be in recovered patients. Here's how antibodies could lead to a treatment for those fighting coronavirus.\r\nUSA TODAY\r\nChills, repeated shaking with chills, muscle pain, headache, sore throat and a loss of taste or smell.\r… [+2926 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Don’t villainize bats: Researchers bust Covid-19 myths - Times of India", "description": "India News: BENGALURU: Several researchers of various universities and conservation organisations spread across nine countries including India, Germany, UK, Austr.", "url": "https://timesofindia.indiatimes.com/india/dont-villainize-bats-researchers-bust-covid-19-myths/articleshow/75390401.cms", "urlToImage": null, "publishedAt": "2020-04-26T15:30:04Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Andrew O'Reilly", "title": "Top public health expert says U.S. 'not out of the woods' in coronavirus pandemic - Fox News", "description": "Tom Inglesby, director of the Johns Hopkins Center for Health Security, said Sunday that the United States is “near the end of the beginning” of the coronavirus pandemic, but remained skeptical of Vice President Mike Pence’s earlier assertion that the country…", "url": "https://www.foxnews.com/politics/top-public-health-expert-says-u-s-not-out-of-the-woods-in-coronavirus-pandemic", "urlToImage": null, "publishedAt": "2020-04-26T14:52:02Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox. Sign up here.\r\nTom Inglesby, director of the Johns Hopkins Center for Health Security, said Sunday that the United States is “near the end of the beginning” of the coronavirus pand… [+3458 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Tales from the annals of medical quackery - CBS News", "description": "Mo Rocca with a history of quack medicine, charlatans and snake oil salesmen (and beware those so-called \"coronavirus prevention pills\"!)", "url": "https://www.cbsnews.com/news/quack-medicine-fake-cures-charlatans-and-snake-oil-salesmen/", "urlToImage": null, "publishedAt": "2020-04-26T14:42:51Z", "content": "A self-described \"genius entrepreneur\" with a \"coronavirus prevention pill\" arrested by the FBI (\"You take this pill once a day and you cannot contract the virus\").  Televangelist Jim Bakker sued by the state of Missouri to stop promoting \"Silver Solution,\" a… [+5767 chars]"}, {"source": {"id": null, "name": "Mercurynews.com"}, "author": "David DeBolt, Thomas Peele", "title": "Coronavirus: First known victim in U.S. died of “burst” heart, pathologist says - The Mercury News", "description": "“There’s an indication the heart was weakened,” Melinek said. “The immune system was attacking the virus and in attacking the virus it damaged the heart and then the heart basically burst.”…", "url": "https://www.mercurynews.com/coronavirus-first-known-victim-in-u-s-died-of-burst-heart-pathologist-says", "urlToImage": null, "publishedAt": "2020-04-26T13:15:17Z", "content": "A Santa Clara County woman now believed to be the first person in the U.S. killed by the novel coronavirus died of a ruptured heart caused by her body’s struggle to defeat the virus, her autopsy shows.\r\nPatricia Dowd, 57, of San Jose, died at home on Feb. 6 o… [+1995 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Eden David", "title": "A reality check on antibody testing: How do we race forward thoughtfully? - ABC News", "description": "", "url": "https://abcnews.go.com/Health/reality-check-antibody-testing-race-forward-thoughtfully/story?id=70214520", "urlToImage": null, "publishedAt": "2020-04-26T13:03:48Z", "content": "As U.S. government officials begin debating the right steps in easing restrictions due to the novel coronavirus, antibody tests have been touted as the key to returning to normal.\r\nThis particular type of test can detect whether or not a person has developed … [+12523 chars]"}, {"source": {"id": null, "name": "Newsday.com"}, "author": null, "title": "Plasma treatment gives hope to LI COVID-19 patients - Newsday", "description": "", "url": "https://projects.newsday.com/gdpr/", "urlToImage": null, "publishedAt": "2020-04-26T12:55:00Z", "content": "It appears that you are trying to access our website from a location in the European Union, which enforces the General Data Protection Regulation (GDPR). Unfortunately,\r\n because of this regulation we cannot provide access at this time. We appreciate your und… [+10 chars]"}, {"source": {"id": "axios", "name": "Axios"}, "author": "Axios", "title": "96% of 3,300 inmates with coronavirus were asymptomatic, survey shows - Axios", "description": "Asymptomatic patients could be contributing to the spread of the virus at a far higher level than suspected.", "url": "https://www.axios.com/coronavirus-prisons-asymptomatic-8daaaa08-b53e-4368-adb7-88b7d93efece.html", "urlToImage": null, "publishedAt": "2020-04-26T12:11:18Z", "content": "96% of 3,277 inmates in state prison systems in Arkansas, North Carolina, Ohio and Virginia who tested positive for the coronavirus did not show symptoms, Reuters reports.\r\nWhy it matters: The findings suggest that asymptomatic patients could be contributing … [+881 chars]"}, {"source": {"id": null, "name": "Masslive.com"}, "author": "Douglas Hook | dhook@masslive.com", "title": "Baystate Health has been leading the way in treatment for COVID-19 by keeping patients off ventilators - MassLive.com", "description": "“It's not that a ventilator isn’t good,” said Dr. Andrew Artenstein, the Baystate Health chief physician executive and chief academic officer. “Because obviously, if you can't get enough oxygen, any other way the ventilator is lifesaving. The problem with the…", "url": "https://www.masslive.com/coronavirus/2020/04/baystate-health-has-been-leading-the-way-in-treatment-for-covid-19-by-keeping-patients-off-ventilators.html", "urlToImage": null, "publishedAt": "2020-04-26T11:38:06Z", "content": "President and CEO of Baystate Health Dr. Mark A. Keroack reported that the health system has been able to keep more COVID-19 patients off ventilators at higher rates than nearly any other health system in Massachusetts. This has meant a much quicker rate of r… [+5835 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Harmeet Kaur, CNN", "title": "People are buying pulse oximeters to try and detect coronavirus at home. Do you need one? - CNN", "description": "Sales and search interest in the medical devices, which measure the saturation of oxygen in red blood cells, have spiked in recent weeks.", "url": "https://www.cnn.com/2020/04/26/health/pulse-oximeters-coronavirus-wellness-scn-trnd/index.html", "urlToImage": null, "publishedAt": "2020-04-26T11:24:59Z", "content": null}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Yuliya Talmazan, Reuters", "title": "As global death toll tops 200,000, WHO warns there's no evidence of coronavirus immunity - NBC News", "description": "The World Health Organization cautioned Saturday that there is currently no evidence that people who have recovered from COVID-19 are immune to the coronavirus.", "url": "https://www.nbcnews.com/news/world/global-death-toll-tops-200-000-who-warns-there-s-n1192831", "urlToImage": null, "publishedAt": "2020-04-26T11:16:00Z", "content": "There is currently no evidence that people who have recovered from COVID-19 are protected from a second infection, the World Health Organization warned Saturday as the worldwide death toll topped 200,000.\r\nThe health body tweeted that it was continuing to rev… [+3444 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Mental Health Issues Swarm Health Care Workers Fighting COVID-19 | NowThis - NowThis News", "description": "‘This pandemic is going to break us.’ — These doctors are documenting their mental health struggles while fighting on the front lines of COVID-19. » Subscrib...", "url": "https://www.youtube.com/watch?v=UQGQ5HeQ33E", "urlToImage": null, "publishedAt": "2020-04-26T10:59:53Z", "content": null}, {"source": {"id": null, "name": "Heraldtribune.com"}, "author": "Staff Report", "title": "Coronavirus Update: What you need to know Sunday, April 26 - Sarasota Herald-Tribune", "description": "Catch up on today’s latest news about the COVID-19 pandemic.", "url": "https://www.heraldtribune.com/article/20200426/NEWS/200428575", "urlToImage": null, "publishedAt": "2020-04-26T10:46:00Z", "content": "Catch up on today’s latest news about the COVID-19 pandemic.\r\nThis content is being provided for free as a public service to our readers during the coronavirus outbreak. Sign up for our daily or breaking newsletters to stay informed. If local news is importan… [+7327 chars]"}, {"source": {"id": null, "name": "Latimes.com"}, "author": "Nicole Winfield", "title": "Perfect storm: Virus disaster in Italy's Lombardy region is a lesson for the world - Los Angeles Times", "description": "Something went terribly wrong in Lombardy, the hardest-hit region in Europe’s hardest-hit country, and virologists and epidemiologists say it will be studied for years.", "url": "https://www.latimes.com/world-nation/story/2020-04-26/perfect-storm-virus-disaster-in-italys-lombardy-region-is-a-lesson-for-the-world", "urlToImage": null, "publishedAt": "2020-04-26T07:53:00Z", "content": "As Italy prepares to emerge from the Wests first and most extensive coronavirus lockdown, it is increasingly clear that something went terribly wrong in Lombardy, the hardest-hit region in Europes hardest-hit country.\r\nItaly had the bad luck of being the firs… [+13970 chars]"}, {"source": {"id": null, "name": "Adn.com"}, "author": "Morgan Krakow", "title": "What the reopening looks like under plans from Anchorage and the state of Alaska - Anchorage Daily News", "description": "As the state reopens, measures like physical distancing, vigorous hand-washing and wearing cloth face coverings in public become even more critical, health officials say.", "url": "https://www.adn.com/alaska-news/2020/04/25/what-the-reopening-looks-like-under-plans-from-anchorage-and-the-state-of-alaska/", "urlToImage": null, "publishedAt": "2020-04-26T05:22:37Z", "content": "After weeks with businesses shuttered and Alaskans hunkered down, reopening plans were unveiled by state and local officials this week.\r\n The step toward reopening certain economic sectors comes as new daily confirmed case counts have trended downward. The st… [+10613 chars]"}, {"source": {"id": null, "name": "Nbcdfw.com"}, "author": "Chris Blake", "title": "Denton County Reports 20th Coronavirus-Related Death - NBC 5 Dallas-Fort Worth", "description": "A Denton woman who was over 80 years old is the 20th person in the county to die due to the new coronavirus, health officials say.", "url": "https://www.nbcdfw.com/news/coronavirus/denton-county-reports-20th-coronvirus-related-death/2358178/", "urlToImage": null, "publishedAt": "2020-04-26T03:35:00Z", "content": "A Denton woman who was over 80 years old is the 20th person in the county to die due to the new coronavirus, health officials say.\r\nShe was a resident of the Denton Rehabilitation and Nursing Center.\r\n\"As we report the loss of a 20th life to COVID-19 in Dento… [+1507 chars]"}, {"source": {"id": null, "name": "10tv.com"}, "author": "https://www.facebook.com/WBNS10TV/", "title": "Bucyrus police chief says he has COVID-19 - 10TV", "description": "Chief David Koepke shared his diagnosis on Saturday.", "url": "https://www.10tv.com/article/bucyrus-police-chief-says-he-has-covid-19-2020-apr", "urlToImage": null, "publishedAt": "2020-04-26T03:33:01Z", "content": "BUCYRUS, Ohio -- The chief of the Bucyrus Police Department says he has tested positive for COVID-19.\r\nChief David Koepke shared his diagnosis in a post placed Saturday on the police department's Facebook page.\r\nKoepke shared that he started experiencing symp… [+144 chars]"}, {"source": {"id": null, "name": "Cbsaustin.com"}, "author": "Tristan Balagtas", "title": "46 COVID-19 cases in Round Rock nursing home: Officials work to isolate sick - KEYE TV CBS Austin", "description": "ROUND ROCK, Texas -- After the Williamson County and Cities Health District became aware of two positive COVID-19 cases at a Round Rock nursing home, a strike team of nurses and epidemiologists took to the facility and tested every single resident and staff m…", "url": "http://cbsaustin.com/news/local/46-covid-19-cases-in-round-rock-nursing-home-officials-work-to-isolate-sick", "urlToImage": null, "publishedAt": "2020-04-26T03:19:54Z", "content": null}, {"source": {"id": null, "name": "Oregonlive.com"}, "author": "Hillary Borrud | The Oregonian/OregonLive", "title": "Coronavirus tested Gov. Kate Brown’s leadership. So far, Oregonians approve - OregonLive", "description": "Gov. Kate Brown has publicly debated what to do and often come off as indecisive, but she ultimately issued strict, sweeping social distancing policies on pace with or ahead of most other governors. Eight weeks since Oregon’s first presumptive coronavirus cas…", "url": "https://www.oregonlive.com/news/2020/04/coronavirus-tested-gov-kate-browns-leadership-so-far-oregonians-approve.html", "urlToImage": null, "publishedAt": "2020-04-26T03:01:00Z", "content": "On March 12, Gov. Kate Brown held a press conference in Portland to answer questions about the states early coronavirus social distancing order.\r\nConsideration of school closures will be a last resort, the governor said, reading from prepared remarks.\r\nBefore… [+11060 chars]"}, {"source": {"id": null, "name": "Vvdailypress.com"}, "author": "Martin Estacio", "title": "Coronavirus: San Bernardino County cases top 1,700, 82 deaths - VVdailypress.com", "description": "The number of confirmed coronavirus cases in San Bernardino County climbed to over 1,700 Saturday, as two more people have died.According to the", "url": "https://www.vvdailypress.com/article/20200425/NEWS/200429912", "urlToImage": null, "publishedAt": "2020-04-26T02:44:00Z", "content": "The number of confirmed coronavirus cases in San Bernardino County climbed to over 1,700 Saturday, as two more people have died.\r\nAccording to the county’s COVID-19 Dashboard, 1,732 confirmed cases with 82 deaths.\r\nAlso on Saturday, county officials reopened … [+1657 chars]"}, {"source": {"id": null, "name": "Qz.com"}, "author": "Gale Ure", "title": "African scientists must take part in coronavirus vaccine research - Quartz Africa", "description": "To refuse inclusion in global clinical trials would prevent Africa’s researchers from being significant players in the universal fight against the virus.", "url": "https://qz.com/africa/1845883/african-scientists-must-take-part-in-coronavirus-vaccine-research/", "urlToImage": null, "publishedAt": "2020-04-26T02:43:49Z", "content": "The search for a Covid-19 vaccine has sparked international media controversy and negative sentiment around the potential harm of people taking part in clinical trials once the research enters its human testing phase.\r\nA wave of anger was ignited when two top… [+6576 chars]"}, {"source": {"id": null, "name": "Clickondetroit.com"}, "author": "Amber Ainsworth", "title": "Coronavirus in Michigan: Here’s where we stand as of Saturday night - WDIV ClickOnDetroit", "description": "Here's the latest headlines on coronavirus in Michigan.", "url": "https://www.clickondetroit.com/news/michigan/2020/04/26/coronavirus-in-michigan-heres-where-we-stand-as-of-saturday-night/", "urlToImage": null, "publishedAt": "2020-04-26T02:34:59Z", "content": "DETROIT The coronavirus (COVID-19) recovery rate in Michigan rose on Saturday.\r\nHeres what happened Saturday:\r\nThe official COVID-19 recovery rate in Michigan is now 8,342.\r\nOfficials provide an update each Saturday.\r\nFinding new ways to celebrate holy events… [+4065 chars]"}, {"source": {"id": null, "name": "Wchstv.com"}, "author": "STAFF REPORTS", "title": "Charleston officer involved in crash Saturday night - WCHS-TV8", "description": "Two people have been transported to the hospital after a crash involving a Charleston police officer, according to Metro 911 dispatchers. Both the officer and a person from the other vehicle involved were taken to the hospital with minor injuries, according t…", "url": "http://wchstv.com/news/local/charleston-officer-involved-in-crash-saturday-night", "urlToImage": null, "publishedAt": "2020-04-26T02:05:18Z", "content": null}, {"source": {"id": null, "name": "Adn.com"}, "author": "Morgan Krakow", "title": "Resident at long-term care facility in Sitka tests positive for COVID-19 - Anchorage Daily News", "description": "It marks the first positive case of the new coronavirus in Sitka.", "url": "https://www.adn.com/alaska-news/2020/04/25/resident-at-long-term-care-facility-in-sitka-tests-positive-for-covid-19/", "urlToImage": null, "publishedAt": "2020-04-26T01:53:02Z", "content": "We're making coronavirus coverage available without a subscription as a public service. But we depend on reader support to do this work. Please consider joining others in supporting local journalism in Alaska for just $3.23 a week.\r\nThe first person to test p… [+1472 chars]"}, {"source": {"id": null, "name": "Wusa9.com"}, "author": null, "title": "Poison control sees surge of calls for exposure to disinfectants and hand sanitizer - WUSA9.com", "description": "The National Capital Poison Center reported that calls in the DMV for exposures to hand sanitizer and disinfectants have seen a dramatic rise since March 1.", "url": "https://www.wusa9.com/article/news/health/coronavirus/poison-control-call-surge-exposure-to-disinfectants-and-hand-sanitizer/65-2b13dd88-b32b-4fe2-b3d9-7126acb67334", "urlToImage": null, "publishedAt": "2020-04-26T01:34:00Z", "content": "WASHINGTON, D.C., USA The National Capital Poison Center says calls from people being exposed to hand sanitizer and disinfectants have seen a surge since March compared to the same time period last year.\r\nThe report came as bogus home remedies for coronavirus… [+2454 chars]"}, {"source": {"id": null, "name": "Jamaicaobserver.com"}, "author": null, "title": "US records 2,494 more coronavirus deaths in 24 hours: Johns Hopkins - Jamaica Observer", "description": "WASHINGTON, United States (AFP) - The United States recorded 2,494 more coronavirus deaths in the...", "url": "http://www.jamaicaobserver.com/latestnews/US_records_2,494_more_coronavirus_deaths_in_24_hours:_Johns_Hopkins", "urlToImage": null, "publishedAt": "2020-04-26T01:20:01Z", "content": "WASHINGTON, United States (AFP) - The United States recorded 2,494 more coronavirus deaths in the past 24 hours, according to figures reported Saturday night by Johns Hopkins University.\r\nThe country now has an overall death toll of 53,511, with 936,293 confi… [+567 chars]"}, {"source": {"id": null, "name": "Kezi.com"}, "author": null, "title": "Worker who tested positive for coronavirus in Albany food processing plant speaks out - KEZI TV", "description": "One of eight employees from the Albany National Frozen Foods processing plant spoke to KEZI describing the worls place as unsafe and non properly protected.", "url": "https://www.kezi.com/content/news/Its-ridiculous-Worker-tested-positive-for-coronavirus-in-Albany-food-processing-plant-speaks-out-569956301.html", "urlToImage": null, "publishedAt": "2020-04-26T01:02:00Z", "content": "ALBANY, Ore. -- One of eight employees from the Albany National Frozen Foods processing plant spoke to KEZI describing the workplace as unsafe and not properly protected.\r\nOut of fear of retaliation - the employee chose to remain anonymous, but what he shared… [+1636 chars]"}, {"source": {"id": null, "name": "Mercurynews.com"}, "author": "Leonardo Castañeda", "title": "Why researchers are testing 5,700 people for COVID-19 in San Francisco’s Mission District - The Mercury News", "description": "Researchers hope testing everyone in a Latino-heavy census tract will shed light on racial disparities in COVID-19 deaths", "url": "https://www.mercurynews.com/why-researchers-are-testing-5700-people-for-covid-19-in-san-franciscos-mission-district", "urlToImage": null, "publishedAt": "2020-04-25T23:49:30Z", "content": "SAN FRANCISCO Doctors and volunteers fanned out early Saturday morning to pop-up testing centers in the city’s heavily Latino Mission District for an unprecedented effort to test all 5,700 residents in one census tract in hopes the data collected will help ex… [+5371 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Michael Wilson", "title": "March, April, May: City’s Mood Darkens as Crisis Feels Endless - The New York Times", "description": "With no clues about when the pandemic might subside, short-term discomfort is becoming long-term despair: “I feel like I have accepted this, and given up.”", "url": "https://www.nytimes.com/2020/04/25/nyregion/nyc-coronavirus-crisis.html", "urlToImage": null, "publishedAt": "2020-04-25T23:47:18Z", "content": "With no clues about when the pandemic might subside, short-term discomfort is becoming long-term despair: I feel like I have accepted this, and given up.\r\nApril 25, 2020\r\nA walk in the park brings tense flare-ups: Back off, youre too close. Oh really? Then st… [+7411 chars]"}, {"source": {"id": null, "name": "Wwmt.com"}, "author": "Newschannel 3", "title": "Kalamazoo County to hire temporary nurses to assist with COVID-19 response - WWMT-TV", "description": "Kalamazoo County announced Saturday it is hiring registered nurses for the Health and Community Services Department to assist with COVID-19 patients. COVID-19: Find the latest news on the outbreak in West Michigan by visiting the Newschannel 3 coronavirus pag…", "url": "http://wwmt.com/news/local/kalamazoo-county-to-hire-temporary-nurses-to-assist-with-covid-19-response", "urlToImage": null, "publishedAt": "2020-04-25T23:39:00Z", "content": null}, {"source": {"id": null, "name": "Villages-news.com"}, "author": null, "title": "Summerfield men among latest COVID-19 patients in tri-county area - Villages-News", "description": "Two Summerfield residents were identified Saturday as among the latest Floridians to test positive for the Coronavirus.", "url": "https://www.villages-news.com/2020/04/25/summerfield-men-among-latest-covid-19-patients-in-tri-county-area/", "urlToImage": null, "publishedAt": "2020-04-25T23:08:07Z", "content": "Two Summerfield residents were identified Saturday as among the latest Floridians to test positive for the Coronavirus.\r\nThey were identified as a 31-year-old man and a 32-year-old man, both of whom had no recent travel history but had been exposed to others … [+1921 chars]"}, {"source": {"id": null, "name": "Wlns.com"}, "author": null, "title": "No need to wipe down groceries or takeout, experts say, but wash your hands - KRON4", "description": "The US Food and Drug Administration (FDA) is re-emphasizing there’s no real risk of getting the virus that causes Covid-19 that way.", "url": "https://www.wlns.com/top-stories/no-need-to-wipe-down-groceries-or-takeout-experts-say-but-do-wash-your-hands/", "urlToImage": null, "publishedAt": "2020-04-25T22:59:00Z", "content": "The US Food and Drug Administration (FDA) is re-emphasizing there’s no real risk of getting the virus that causes Covid-19 that way.\r\n“We want to assure you there is currently NO evidence of human or animal food or food packaging being associated with transmi… [+1195 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Anita Bennett", "title": "Coronavirus In L.A. County: 48 More Deaths And 607 New Cases Confirmed - Deadline", "description": "Coronavirus continues to claim lives across Los Angeles County. New figures released Saturday show 607 additional cases of COVID-19 and 48 more deaths in the county over the past 24 hours. Two of those deaths were reported by the city of Long Beach, the Los A…", "url": "https://deadline.com/2020/04/coronavirus-in-l-a-county-48-more-deaths-and-607-new-cases-confirmed-1202917903/", "urlToImage": null, "publishedAt": "2020-04-25T22:08:36Z", "content": "Coronavirus continues to claim lives across Los Angeles County. New figures released Saturday show 607 additional cases of COVID-19 and 48 more deaths in the county over the past 24 hours.\r\nTwo of those deaths were reported by the city of Long Beach, the Los … [+1143 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Coronavirus updates: ‘No evidence’ to suggest recovered patients are immune; state passes 13K cases - Tacoma News Tribune", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiRWh0dHBzOi8vd3d3LnRoZW5ld3N0cmlidW5lLmNvbS9uZXdzL2Nvcm9uYXZpcnVzL2FydGljbGUyNDIyNzg1NzYuaHRtbNIBRWh0dHBzOi8vYW1wLnRoZW5ld3N0cmlidW5lLmNvbS9uZXdzL2Nvcm9uYXZpcnVzL2FydGljbGUyNDIyNzg1NzYuaHRtbA?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T21:25:20Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "The Mighty Staff", "title": "Doctors Report People in Their 30s and 40s With COVID-19 Are Having Strokes - Yahoo News", "description": "Doctors in New York City and around the country are now reporting that people in their 30s and 40s with COVID-19, even mild cases, are having and dying from ...", "url": "https://news.yahoo.com/doctors-report-people-30s-40s-205330026.html", "urlToImage": null, "publishedAt": "2020-04-25T20:53:00Z", "content": "Microscopic view of a infectious virus.\r\nDoctors are now reporting cases where the coronavirus (COVID-19) may be causing blood clots and consequently, strokes in a small number of people in their 30s and 40s. These young and middle-aged patients, some who did… [+4222 chars]"}, {"source": {"id": null, "name": "Nbcchicago.com"}, "author": "NBC Chicago", "title": "City of Chicago Launches Mask Donation Drive Amid COVID-19 Pandemic - NBC Chicago", "description": "After the state of Illinois mandated the wearing of facial coverings when out in public during the COVID-19 pandemic, the city of Chicago has launched a mask...", "url": "https://www.nbcchicago.com/news/coronavirus/city-of-chicago-launches-mask-donation-drive-amid-covid-19-pandemic/2261841/", "urlToImage": null, "publishedAt": "2020-04-25T20:36:00Z", "content": "After the state of Illinois mandated the wearing of facial\r\ncoverings when out in public during the COVID-19 pandemic, the city of Chicago\r\nhas launched a mask drive. \r\nThe Chicago Together! Make a Mask, Give a Mask, Wear a Mask program, launched this weekend… [+2325 chars]"}, {"source": {"id": null, "name": "Abc7chicago.com"}, "author": null, "title": "Doctors report 'COVID toes,' discolored skin on some coronavirus patients - WLS-TV", "description": "A growing number of dermatologists treating suspected and confirmed coronavirus-positive patients are reporting patterns and trends of skin conditions.", "url": "https://abc7chicago.com/covid-toes-covid19-coronavirus-symptoms/6128998/", "urlToImage": null, "publishedAt": "2020-04-25T20:12:45Z", "content": "As doctors around the world continue to battle COVID-19, researchers are noticing that the disease appears to attack the entire body, including the toes.A growing number of dermatologists treating suspected and confirmed coronavirus-positive patients are repo… [+1943 chars]"}, {"source": {"id": null, "name": "Qz.com"}, "author": "Lila MacLellan", "title": "DIY coronavirus masks more protective if enhanced with pantyhose - Quartz", "description": "Could a pantyhose-enhanced face mask help spare you from Covid-19?", "url": "https://qz.com/1845741/diy-coronavirus-masks-more-protective-if-enhanced-with-pantyhose/", "urlToImage": null, "publishedAt": "2020-04-25T20:07:27Z", "content": "The homemade masks that millions are wearing in the US and elsewhere have always been a better-than-nothing solution for preventing the spread of the virus that causes Covid-19.\r\nTheyre not recommended to protect the wearer. Only N95 respirators can effective… [+3099 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Christina Maxouris and Jason Hanna, CNN", "title": "US coronavirus: Some states begin to reopen as US closes in on 1 million coronavirus cases - msnNOW", "description": "A few states this weekend are running a tricky experiment: Trying to reopen certain businesses and services amid the coronavirus pandemic, even against the advice of some health experts who say it risks dangerously spiking the number of cases.", "url": "https://www.cnn.com/2020/04/25/health/us-coronavirus-saturday/index.html", "urlToImage": null, "publishedAt": "2020-04-25T20:00:00Z", "content": "(CNN)A few states this weekend are running a tricky experiment: Trying to reopen certain businesses and services amid the coronavirus pandemic, even against the advice of some health experts who say it risks dangerously spiking the number of cases.\r\nIn Georgi… [+9123 chars]"}, {"source": {"id": null, "name": "Wsaz.com"}, "author": "Associated Press", "title": "Virus lockdowns an extra ordeal for special-needs children - WSAZ-TV", "description": "After weeks of lockdown, a 14-year-old French boy with autism took a pickax to the wall of his house with the hope that he could finally go out.", "url": "https://www.wsaz.com/content/news/Virus-lockdowns-an-extra-ordeal-for-special-needs-children-569952121.html", "urlToImage": null, "publishedAt": "2020-04-25T19:57:20Z", "content": "PARIS (AP) -- Coronavirus lockdown is proving a particularly tough ordeal for children with disabilities and their families. \r\nSpecial schools and support programs have been shut down. After weeks of lockdown, a 14-year-old French boy with autism took a picka… [+434 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Sara Dorn", "title": "Cyclist who angered Chris Cuomo is father of Johns Hopkins doctor - New York Post ", "description": "The biker who blasted CNN anchor Chris Cuomo as a “bully” in a roadside dispute in East Hampton is explaining why he cares so much the infected news anchor wasn’t social distancing — because …", "url": "https://nypost.com/2020/04/25/biker-in-social-distancing-spat-with-chris-cuomo-is-dad-of-doctor/", "urlToImage": null, "publishedAt": "2020-04-25T19:32:31Z", "content": "The biker who blasted CNN anchor Chris Cuomo as a bully in a roadside dispute in East Hampton is explaining why he cares so much the infected news anchor wasn’t social distancing because he’s the father of a Baltimore physician.\r\nMy daughter is a doctor at Jo… [+1429 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Kansas exceeds 3,000 cases of COVID-19. Most new cases found in rural counties - Kansas City Star", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiQWh0dHBzOi8vd3d3LmthbnNhc2NpdHkuY29tL25ld3MvY29yb25hdmlydXMvYXJ0aWNsZTI0MjI5MjA1Ni5odG1s0gFBaHR0cHM6Ly9hbXAua2Fuc2FzY2l0eS5jb20vbmV3cy9jb3JvbmF2aXJ1cy9hcnRpY2xlMjQyMjkyMDU2Lmh0bWw?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T18:34:43Z", "content": null}, {"source": {"id": null, "name": "Inverse.com"}, "author": "Abela Mahimbo, David Isaacs, Melissa Kang, Melanie Wong", "title": "Why are some people with Covid-19 asymptomatic? Evidence points to 2 factors - Inverse", "description": "Recent studies suggest as many as 80% or more of those infected are “silent carriers”, showing no or very mild symptoms.", "url": "https://www.inverse.com/science/covid-19-asymptomatic", "urlToImage": null, "publishedAt": "2020-04-25T17:58:15Z", "content": "SARS-CoV-2, the coronavirus which causes COVID-19, has infected almost 2.5 million people around the world and claimed 170,000 lives.\r\nBut some people dont even get symptoms. Recent studies suggest as many as 80 percentor more of those infected are silent car… [+5687 chars]"}, {"source": {"id": null, "name": "Pressdemocrat.com"}, "author": null, "title": "Sonoma County considers loosening stay-at-home order's restrictions on construction, real estate - Santa Rosa Press Democrat", "description": "County Health Officer Dr. Sundari Mase faces a critical decision: How much will she relax the stay-home order that she has already signaled will be renewed before it expires Friday.", "url": "https://www.pressdemocrat.com/news/10920710-181/sonoma-county-considers-changes-to", "urlToImage": null, "publishedAt": "2020-04-25T17:49:22Z", "content": "But the financial toll has been swift and brutal in California, where more than a half-million residents filed unemployment claims just last week, more than any other state. All told, 1 in 6 Californians have lost jobs, according to state figures. \r\nLocal voi… [+3277 chars]"}, {"source": {"id": null, "name": "Kimt.com"}, "author": null, "title": "A 5-part series: What does it take to re-open one of Minnesota's largest cities? - KIMT 3", "description": "KIMT's Jessica Bringe talked to people throughout southeastern Minnesota to see what's next as people and communities fight the coronavirus.", "url": "https://www.kimt.com/content/news/A-5-part-series-What-does-it-take-to-re-open-one-of-Minnesotas-largest-cities-569950771.html", "urlToImage": null, "publishedAt": "2020-04-25T17:05:00Z", "content": "Governor Tim Walz is moving forward with plans to reopen the economy in our region by partnering with other Midwest governors.Walz said, “If I thought we could go back to work tomorrow that’s exactly what we would do.”As governors across the U.S. begin collab… [+3176 chars]"}, {"source": {"id": null, "name": "Ktar.com"}, "author": "", "title": "Arizona coronavirus cases increase to 6,280, death toll reaches 273 - KTAR.com", "description": "With 235 new positive tests for coronavirus reported by the state health department Saturday morning, Arizona has surpassed the 6,200-case mark.", "url": "https://ktar.com/story/3095911/arizona-coronavirus-cases-increase-to-6280-death-toll-reaches-273/", "urlToImage": null, "publishedAt": "2020-04-25T16:14:00Z", "content": "PHOENIX — With 235 new positive tests for coronavirus reported by the state health department Saturday morning, Arizona has surpassed the 6,200-case mark.\r\nThe state now has 6,280 cases with seven new deaths, bringing the death toll to 273.\r\nThere have been 6… [+2916 chars]"}, {"source": {"id": null, "name": "Fox8.com"}, "author": "CNNwire", "title": "5-month-old daughter of a New York firefighter dies from coronavirus - WJW FOX 8 News Cleveland", "description": "A New York firefighter’s infant daughter has died from coronavirus, her family says, making her one of the youngest known victims of the virus.", "url": "https://fox8.com/news/coronavirus/5-month-old-daughter-of-a-new-york-firefighter-dies-from-coronavirus/", "urlToImage": null, "publishedAt": "2020-04-25T16:08:53Z", "content": "(CNN) — A New York firefighter’s infant daughter has died from coronavirus, her family says, making her one of the youngest known victims of the virus.\r\nFive-month-old Jay-Natalie, the daughter of New York City firefighter Jerel La Santa and Board of Educatio… [+2469 chars]"}, {"source": {"id": null, "name": "Cbslocal.com"}, "author": "CBS Pittsburgh", "title": "Allegheny Co. Health Dept.: Coronavirus Cases Increases To 1,198, Death Toll Totals Reach 73 - CBS Pittsburgh", "description": "The Allegheny County Health Department is reporting 21 new cases of Coronavirus, across the county Saturday, bringing the total number of cases to 1,198.", "url": "https://pittsburgh.cbslocal.com/2020/04/25/allegheny-county-coronavirus-cases/", "urlToImage": null, "publishedAt": "2020-04-25T15:15:08Z", "content": "PITTSBURGH (KDKA) — The Allegheny County Health Department is reporting 21 new cases of Coronavirus across the county Saturday, bringing the total number of cases to 1,198.\r\nThat’s 1,167 confirmed cases and 31 probable cases, according to health officials.\r\nO… [+361 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Shona Ghosh", "title": "Trump aides demanded hydroxychloroquine for millions: Vanity Fair - Business Insider - Business Insider", "description": "Hydroxychloroquine, repeatedly touted by President Trump as a potential cure, one drug trial in Brazil had to be abandoned after patients died.", "url": "https://www.businessinsider.com/emails-trump-aides-mass-distribution-hydroxychloroquine-unproven-2020-4", "urlToImage": null, "publishedAt": "2020-04-25T15:09:05Z", "content": "Trump administration officials concocted a plan to distribute millions of doses of the unproven drug hydroxychloroquine to COVID-19 outpatients, according to emails obtained by Vanity Fair.\r\nHydroxychloroquine is an effective anti-malarial drug, but despite b… [+2294 chars]"}, {"source": {"id": null, "name": "Cpr.org"}, "author": "Colorado Public Radio Staff", "title": "Colorado Coronavirus Updates: What You Need To Know This Weekend - Colorado Public Radio", "description": "Our weekend live blog of news and updates on the coronavirus in Colorado.", "url": "https://www.cpr.org/2020/04/25/colorado-coronavirus-updates-closures-testing-cases-and-more-37/", "urlToImage": null, "publishedAt": "2020-04-25T14:31:53Z", "content": "A note about the coronavirus data: CPR News tracks and graphs the \"reported by date\" data provided by the state of Colorado. This data lags by 24 hours or more, is subject to revision and in some instances, cases take time for the state to confirm, so some pr… [+6428 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Anjalee Khemlani", "title": "How hydroxychloroquine toes the line between promise and 'happy talk' in the coronavirus fight - Yahoo Money", "description": "The hydroxychloroquine debate is far from over, as the drug gets qualified support from others deeply involved in the war against the coronavirus.", "url": "https://money.yahoo.com/how-hydroxychloroquine-has-toed-the-line-between-promise-and-happy-talk-in-the-coronavirus-fight-142717049.html", "urlToImage": null, "publishedAt": "2020-04-25T14:27:00Z", "content": "After weeks of polarizing debate over the use of two generic anti-malarial drugs, hydroxychloroquine and chloroquine, the Food and Drug Administration this week warned they were not safe and effective when used on COVID-19 patients.\r\nHowever, the hydroxychlor… [+5052 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "At least three residents, three staffers contract coronavirus at Turlock nursing home - Modesto Bee", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiPWh0dHBzOi8vd3d3Lm1vZGJlZS5jb20vbmV3cy9jb3JvbmF2aXJ1cy9hcnRpY2xlMjQyMjg1NzM2Lmh0bWzSAT1odHRwczovL2FtcC5tb2RiZWUuY29tL25ld3MvY29yb25hdmlydXMvYXJ0aWNsZTI0MjI4NTczNi5odG1s?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T13:29:40Z", "content": null}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "WHO Warns You May Catch Coronavirus More Than Once - Bloomberg", "description": null, "url": "https://www.bloomberg.com/tosv2.html?vid=&uuid=cd167a30-87ee-11ea-be62-69f070f39e5f&url=L25ld3MvYXJ0aWNsZXMvMjAyMC0wNC0yNS9jYXRjaGluZy1jb3ZpZC0xOS1tYXktbm90LXNoaWVsZC1hZ2FpbnN0LW5ldy1pbmZlY3Rpb24td2hvLXNheXM=", "urlToImage": null, "publishedAt": "2020-04-25T13:13:20Z", "content": "To continue, please click the box below to let us know you're not a robot."}, {"source": {"id": null, "name": "Fox17.com"}, "author": "Stacy Case", "title": "New Vanderbilt COVID-19 transmission model shows uncertainty - WZTV", "description": "Tuning into social media for only a moment and it's apparent that everybody has an opinion on what's going to happen when the state of Tennessee opens back up next week. Some are excited while others are worried. When the stores and parking lots start filling…", "url": "http://fox17.com/news/local/tennesseans-researchers-share-concerns-over-reopening-state", "urlToImage": null, "publishedAt": "2020-04-25T13:02:00Z", "content": null}, {"source": {"id": null, "name": "Creativebloq.com"}, "author": "Rosie Hilder", "title": "Where to buy a face mask right now – plus how to make a face mask at home - Creative Bloq", "description": "Wondering where to buy a face mask? These retailers still have stock. Plus how to make your own.", "url": "https://www.creativebloq.com/news/where-to-buy-face-masks", "urlToImage": null, "publishedAt": "2020-04-25T13:01:17Z", "content": "If you want to know where to buy a face mask, you're in the right place. Face masks are selling out quickly around the world, so we've put together this list of online retailers that still have face masks in stock. \r\nBear in mind that the face masks in this a… [+6427 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Britain passes 'terrible' milestone of 20,000 coronavirus deaths - Reuters", "description": "Britain's COVID-19 death toll passed 20,000 on Saturday in what the interior minister called \"a tragic and terrible milestone\" as she urged people to stay at home.", "url": "https://www.reuters.com/article/us-health-coronavirus-britain-idUSKCN2270A2", "urlToImage": null, "publishedAt": "2020-04-25T11:10:32Z", "content": "LONDON (Reuters) - Britain’s COVID-19 death toll passed 20,000 on Saturday in what the interior minister called “a tragic and terrible milestone” as she urged people to stay at home. \r\nThe government is facing growing criticism over its response to the new co… [+3185 chars]"}, {"source": {"id": null, "name": "Weather.com"}, "author": "Deekshith Nevil Pinto", "title": "World Malaria Day: Would Coronavirus Revive or Derail India's Success Story Against Malaria? - The Weather Channel", "description": "The novel coronavirus is restricting the ongoing healthcare services that helped countries to fight several deadly diseases like Malaria.", "url": "https://weather.com/en-IN/india/coronavirus/news/2020-04-25-world-malaria-day-covid-19-revive-derail-india-success-story", "urlToImage": null, "publishedAt": "2020-04-25T07:28:54Z", "content": "On December 4, 2019, the World Health Organisation (WHO) released the World Malaria Report 2019a comprehensive analysis of the global Malaria situation. The report showed that India was one of the only two success stories among 11 countries facing the world's… [+7093 chars]"}, {"source": {"id": null, "name": "Thejakartapost.com"}, "author": "The Jakarta Post", "title": "Success against malaria gives solutions for COVID-19 - The Jakarta Post - Jakarta Post", "description": "Today is World Malaria Day, a day when we remind ourselves of a disease that has killed more people in history than any other.", "url": "https://www.thejakartapost.com/academia/2020/04/25/success-against-malaria-gives-solutions-for-covid-19.html", "urlToImage": null, "publishedAt": "2020-04-25T04:56:00Z", "content": "Today is World Malaria Day, a day when we remind ourselves of a disease that has killed more people in history than any other.\r\nAs the world is focused on bringing the deadly COVID-19 pandemic under control, reflecting on the progress made in the fight agains… [+4107 chars]"}, {"source": {"id": null, "name": "Kidspot.com.au"}, "author": "Vanessa Stubbs", "title": "Nurses in tears as baby wins her coronavirus fight - Kidspot", "description": "Little Erin Bates has become a symbol of hope.", "url": "https://www.kidspot.com.au/news/nurses-in-tears-as-baby-wins-her-coronavirus-fight/news-story/7a317269d080a6ff81536cc368444940", "urlToImage": null, "publishedAt": "2020-04-25T03:07:00Z", "content": "Little Erin Bates has become a symbol of hope.Nurses formed a guard of honour and clapped as six-month-old baby Erin was wheeled out of isolation.\r\nThe baby girl was being treated at Alder Hey Children's Hospital in Liverpool in the UK, where she battled COVI… [+1996 chars]"}, {"source": {"id": null, "name": "Deseret.com"}, "author": "Anne Wallace", "title": "Coronavirus lingers in your eyes, study finds - Deseret News", "description": "A new report finds that coronavirus may stay in the eyes longer than in the mouth or nose", "url": "https://www.deseret.com/u-s-world/2020/4/24/21235202/coronavirus-lingers-in-your-eyes-study-finds-covid-19-report-research-contagious", "urlToImage": null, "publishedAt": "2020-04-25T03:03:02Z", "content": "A report published in the journal of Annals of Internal Medicine earlier this month found that the coronavirus lingered in the eyes of Italys first COVID-19 case days after it had cleared from her nose, throat and mouth, Live Science reports. \r\nAdditionally, … [+938 chars]"}, {"source": {"id": null, "name": "Wvlt.tv"}, "author": "WVLT", "title": "Tennessee's reopening will be a test, researchers say - WVLT.TV", "description": "Researchers with Vanderbilt University continue to study data on COVID-19 in Tennessee.", "url": "https://www.wvlt.tv/content/news/Tennessees-reopening-will-be-a-test-researchers-say--569941811.html", "urlToImage": null, "publishedAt": "2020-04-25T02:35:38Z", "content": "(WVLT/WREG) -- Researchers with Vanderbilt University continue to study data on COVID-19 in Tennessee. \r\nWREG reported that, on Friday during a virtual presentation, they believe Tennessee's reopening will be a test. \r\nAs of now, researchers say the transmiss… [+991 chars]"}, {"source": {"id": null, "name": "Wlos.com"}, "author": "Kimberly King", "title": "Disagreement among Asheville, Henderson County leaders over extended stay home order - WLOS", "description": "Gov. Roy Cooper&rsquo;s extended stay home order coupled with a vague outline of phases for reopening North Carolina&rsquo;s economy is being met with mixed reviews by leaders in democratic-led Buncombe County and Republican-led Henderson County. WLOS. On Fri…", "url": "http://wlos.com/news/local/disagreement-among-asheville-henderson-county-leaders-over-extended-stay-home-order", "urlToImage": null, "publishedAt": "2020-04-25T02:35:25Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Two more long-term care centers in St. Clair County reporting coronavirus outbreaks - Belleville News-Democrat", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiOmh0dHBzOi8vd3d3LmJuZC5jb20vbmV3cy9jb3JvbmF2aXJ1cy9hcnRpY2xlMjQyMjc0OTgxLmh0bWzSATpodHRwczovL2FtcC5ibmQuY29tL25ld3MvY29yb25hdmlydXMvYXJ0aWNsZTI0MjI3NDk4MS5odG1s?oc=5", "urlToImage": null, "publishedAt": "2020-04-24T21:55:31Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "106-year-old woman survives two pandemics: the Spanish Flu and the coronavirus - CBS Evening News", "description": "Ana del Valle is an extraordinary 106-year-old: the Andalusian “super grandmother” has won the battle against two pandemics. She survived the Spanish Flu as ...", "url": "https://www.youtube.com/watch?v=b_h4YGtxXgo", "urlToImage": null, "publishedAt": "2020-04-24T21:51:19Z", "content": "Ana del Valle is an extraordinary 106-year-old: the Andalusian super grandmother has won the battle against two pandemics.She survived the Spanish Flu as a child, and she recovered from the coronavirus last week."}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "What to know about protecting pets from coronavirus, caring for them if you’re sick - The State", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiP2h0dHBzOi8vd3d3LnRoZXN0YXRlLmNvbS9uZXdzL2Nvcm9uYXZpcnVzL2FydGljbGUyNDIyNzM5NTYuaHRtbNIBP2h0dHBzOi8vYW1wLnRoZXN0YXRlLmNvbS9uZXdzL2Nvcm9uYXZpcnVzL2FydGljbGUyNDIyNzM5NTYuaHRtbA?oc=5", "urlToImage": null, "publishedAt": "2020-04-24T21:37:13Z", "content": null}]}