{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": "usa-today", "name": "USA Today"}, "author": "Susan Miller", "title": "These are the 6 new possible symptoms of the coronavirus the CDC added to its list - USA TODAY", "description": "Chills, repeated shaking with chills, muscle pain, headache, sore throat and a loss of taste or smell are the new symptoms added to the CDC list.", "url": "https://www.usatoday.com/story/news/health/2020/04/26/coronavirus-symptoms-cdc-adds-six-new-symptoms-covid-19/3029438001/", "urlToImage": null, "publishedAt": "2020-04-26T16:18:45Z", "content": "The secret to fighting COVID-19 could be in recovered patients. Here's how antibodies could lead to a treatment for those fighting coronavirus.\r\nUSA TODAY\r\nChills, repeated shaking with chills, muscle pain, headache, sore throat and a loss of taste or smell.\r… [+2926 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Andrew O'Reilly", "title": "Top public health expert says U.S. 'not out of the woods' in coronavirus pandemic - Fox News", "description": "Tom Inglesby, director of the Johns Hopkins Center for Health Security, said Sunday that the United States is “near the end of the beginning” of the coronavirus pandemic, but remained skeptical of Vice President Mike Pence’s earlier assertion that the country…", "url": "https://www.foxnews.com/politics/top-public-health-expert-says-u-s-not-out-of-the-woods-in-coronavirus-pandemic", "urlToImage": null, "publishedAt": "2020-04-26T14:52:02Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox. Sign up here.\r\nTom Inglesby, director of the Johns Hopkins Center for Health Security, said Sunday that the United States is “near the end of the beginning” of the coronavirus pand… [+3458 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Madeline Holcombe and Holly Yan, CNN", "title": "More states are easing coronavirus restrictions this week, unnerving experts and some local officials - CNN", "description": "Such reopenings go against health researchers who suggest that no states should reopen their economies before May 1 and many should wait much longer.", "url": "https://www.cnn.com/2020/04/26/health/us-coronavirus-sunday/index.html", "urlToImage": null, "publishedAt": "2020-04-26T14:45:54Z", "content": "(CNN)Several states are reopening from coronavirus shutdowns this week despite the recommendations of health researchers.\r\nColorado, Minnesota and Montana plan to ease social distancing and stay-at-home restrictions. \r\nIowa will allow elective surgeries to re… [+7070 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Michael Schwirtz, Kirsten Luce", "title": "One Rich N.Y. Hospital Got Warren Buffett’s Help. This One Got Duct Tape. - The New York Times", "description": "The inequities of New York City’s health care system are clear at a public hospital in a section of Brooklyn hit hard by the coronavirus pandemic.", "url": "https://www.nytimes.com/2020/04/26/nyregion/coronavirus-new-york-university-hospital.html", "urlToImage": null, "publishedAt": "2020-04-26T14:24:45Z", "content": "It has been hours since the 71-year-old man in Room 3 of the intensive care unit succumbed to Covid-19, the disease caused by the coronavirus. His body has been cleaned, packed in an orange bag and covered in a white sheet, but the overextended transport team… [+11769 chars]"}, {"source": {"id": null, "name": "Mercurynews.com"}, "author": "David DeBolt, Thomas Peele", "title": "Coronavirus: First known victim in U.S. died of “burst” heart, pathologist says - The Mercury News", "description": "“There’s an indication the heart was weakened,” Melinek said. “The immune system was attacking the virus and in attacking the virus it damaged the heart and then the heart basically burst.”…", "url": "https://www.mercurynews.com/coronavirus-first-known-victim-in-u-s-died-of-burst-heart-pathologist-says", "urlToImage": null, "publishedAt": "2020-04-26T13:15:17Z", "content": "A Santa Clara County woman now believed to be the first person in the U.S. killed by the novel coronavirus died of a ruptured heart caused by her body’s struggle to defeat the virus, her autopsy shows.\r\nPatricia Dowd, 57, of San Jose, died at home on Feb. 6 o… [+1995 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Eden David", "title": "A reality check on antibody testing: How do we race forward thoughtfully? - ABC News", "description": "", "url": "https://abcnews.go.com/Health/reality-check-antibody-testing-race-forward-thoughtfully/story?id=70214520", "urlToImage": null, "publishedAt": "2020-04-26T13:03:48Z", "content": "As U.S. government officials begin debating the right steps in easing restrictions due to the novel coronavirus, antibody tests have been touted as the key to returning to normal.\r\nThis particular type of test can detect whether or not a person has developed … [+12523 chars]"}, {"source": {"id": null, "name": "Newsday.com"}, "author": null, "title": "Plasma treatment gives hope to LI COVID-19 patients - Newsday", "description": "", "url": "https://projects.newsday.com/gdpr/", "urlToImage": null, "publishedAt": "2020-04-26T12:55:00Z", "content": "It appears that you are trying to access our website from a location in the European Union, which enforces the General Data Protection Regulation (GDPR). Unfortunately,\r\n because of this regulation we cannot provide access at this time. We appreciate your und… [+10 chars]"}, {"source": {"id": "axios", "name": "Axios"}, "author": "Axios", "title": "96% of 3,300 inmates with coronavirus were asymptomatic, survey shows - Axios", "description": "Asymptomatic patients could be contributing to the spread of the virus at a far higher level than suspected.", "url": "https://www.axios.com/coronavirus-prisons-asymptomatic-8daaaa08-b53e-4368-adb7-88b7d93efece.html", "urlToImage": null, "publishedAt": "2020-04-26T12:11:18Z", "content": "96% of 3,277 inmates in state prison systems in Arkansas, North Carolina, Ohio and Virginia who tested positive for the coronavirus did not show symptoms, Reuters reports.\r\nWhy it matters: The findings suggest that asymptomatic patients could be contributing … [+881 chars]"}, {"source": {"id": null, "name": "Masslive.com"}, "author": "Douglas Hook | dhook@masslive.com", "title": "Baystate Health has been leading the way in treatment for COVID-19 by keeping patients off ventilators - MassLive.com", "description": "“It's not that a ventilator isn’t good,” said Dr. Andrew Artenstein, the Baystate Health chief physician executive and chief academic officer. “Because obviously, if you can't get enough oxygen, any other way the ventilator is lifesaving. The problem with the…", "url": "https://www.masslive.com/coronavirus/2020/04/baystate-health-has-been-leading-the-way-in-treatment-for-covid-19-by-keeping-patients-off-ventilators.html", "urlToImage": null, "publishedAt": "2020-04-26T11:38:06Z", "content": "President and CEO of Baystate Health Dr. Mark A. Keroack reported that the health system has been able to keep more COVID-19 patients off ventilators at higher rates than nearly any other health system in Massachusetts. This has meant a much quicker rate of r… [+5835 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Harmeet Kaur, CNN", "title": "People are buying pulse oximeters to try and detect coronavirus at home. Do you need one? - CNN", "description": "Sales and search interest in the medical devices, which measure the saturation of oxygen in red blood cells, have spiked in recent weeks.", "url": "https://www.cnn.com/2020/04/26/health/pulse-oximeters-coronavirus-wellness-scn-trnd/index.html", "urlToImage": null, "publishedAt": "2020-04-26T11:24:59Z", "content": null}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Yuliya Talmazan, Reuters", "title": "As global death toll tops 200,000, WHO warns there's no evidence of coronavirus immunity - NBC News", "description": "The World Health Organization cautioned Saturday that there is currently no evidence that people who have recovered from COVID-19 are immune to the coronavirus.", "url": "https://www.nbcnews.com/news/world/global-death-toll-tops-200-000-who-warns-there-s-n1192831", "urlToImage": null, "publishedAt": "2020-04-26T11:16:00Z", "content": "There is currently no evidence that people who have recovered from COVID-19 are protected from a second infection, the World Health Organization warned Saturday as the worldwide death toll topped 200,000.\r\nThe health body tweeted that it was continuing to rev… [+3444 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Mental Health Issues Swarm Health Care Workers Fighting COVID-19 | NowThis - NowThis News", "description": "‘This pandemic is going to break us.’ — These doctors are documenting their mental health struggles while fighting on the front lines of COVID-19. » Subscrib...", "url": "https://www.youtube.com/watch?v=UQGQ5HeQ33E", "urlToImage": null, "publishedAt": "2020-04-26T10:59:53Z", "content": null}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Katie Conner", "title": "How long will the coronavirus test take and when will I get my COVID-19 results? - CNET", "description": "The answer is complicated. Here's what we know about COVID-19 testing right now.", "url": "https://www.cnet.com/how-to/how-long-will-the-coronavirus-test-take-and-when-will-i-get-my-covid-19-results/", "urlToImage": null, "publishedAt": "2020-04-26T10:05:54Z", "content": "It may take over a week to get your coronavirus test results back.\r\nPaul Biris/Getty Images\r\nFor the most up-to-date news and information about the coronavirus pandemic, visit the WHO website.\r\nCoronavirus test kits are limited across the country, but the goo… [+4188 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Rima Abdelkader", "title": "Family diaries kept during Spanish flu give Ohio descendants hope during coronavirus pandemic - NBC News", "description": "Family diaries kept during ‘Spanish Flu’ give Ohio family hope during coronavirus pandemic", "url": "https://www.nbcnews.com/news/us-news/family-diaries-kept-during-spanish-flu-give-ohio-descendants-hope-n1191221", "urlToImage": null, "publishedAt": "2020-04-26T08:59:39Z", "content": "The diary entries from a woman in northeastern Ohio about farm work and life during the 1918 flu pandemic and World War I have brought her future generations comfort and hope as the nation grapples with the coronavirus pandemic.\r\nNo school on account of Spani… [+5341 chars]"}, {"source": {"id": null, "name": "Latimes.com"}, "author": "Nicole Winfield", "title": "Perfect storm: Virus disaster in Italy's Lombardy region is a lesson for the world - Los Angeles Times", "description": "Something went terribly wrong in Lombardy, the hardest-hit region in Europe’s hardest-hit country, and virologists and epidemiologists say it will be studied for years.", "url": "https://www.latimes.com/world-nation/story/2020-04-26/perfect-storm-virus-disaster-in-italys-lombardy-region-is-a-lesson-for-the-world", "urlToImage": null, "publishedAt": "2020-04-26T07:53:00Z", "content": "As Italy prepares to emerge from the Wests first and most extensive coronavirus lockdown, it is increasingly clear that something went terribly wrong in Lombardy, the hardest-hit region in Europes hardest-hit country.\r\nItaly had the bad luck of being the firs… [+13970 chars]"}, {"source": {"id": null, "name": "Chron.com"}, "author": "Hearst Television", "title": "National coronavirus updates: Auto workers step up to make medical gear - Chron.com", "description": "The latest:", "url": "https://www.chron.com/news/article/National-coronavirus-updates-US-death-toll-15225716.php", "urlToImage": null, "publishedAt": "2020-04-26T03:46:00Z", "content": "National coronavirus updates: Auto workers step up to make medical gear\r\nThe latest:\r\n<ul><li>There have been more than 939,000 coronavirus cases in the United States, according to the Johns Hopkins University tally.</li><li>The U.S. death toll has surpassed … [+10255 chars]"}, {"source": {"id": null, "name": "10tv.com"}, "author": "https://www.facebook.com/WBNS10TV/", "title": "Bucyrus police chief says he has COVID-19 - 10TV", "description": "Chief David Koepke shared his diagnosis on Saturday.", "url": "https://www.10tv.com/article/bucyrus-police-chief-says-he-has-covid-19-2020-apr", "urlToImage": null, "publishedAt": "2020-04-26T03:33:01Z", "content": "BUCYRUS, Ohio -- The chief of the Bucyrus Police Department says he has tested positive for COVID-19.\r\nChief David Koepke shared his diagnosis in a post placed Saturday on the police department's Facebook page.\r\nKoepke shared that he started experiencing symp… [+144 chars]"}, {"source": {"id": null, "name": "Cbsaustin.com"}, "author": "Tristan Balagtas", "title": "46 COVID-19 cases in Round Rock nursing home: Officials work to isolate sick - KEYE TV CBS Austin", "description": "ROUND ROCK, Texas -- After the Williamson County and Cities Health District became aware of two positive COVID-19 cases at a Round Rock nursing home, a strike team of nurses and epidemiologists took to the facility and tested every single resident and staff m…", "url": "http://cbsaustin.com/news/local/46-covid-19-cases-in-round-rock-nursing-home-officials-work-to-isolate-sick", "urlToImage": null, "publishedAt": "2020-04-26T03:19:54Z", "content": null}, {"source": {"id": null, "name": "Qz.com"}, "author": "Gale Ure", "title": "African scientists must take part in coronavirus vaccine research - Quartz Africa", "description": "To refuse inclusion in global clinical trials would prevent Africa’s researchers from being significant players in the universal fight against the virus.", "url": "https://qz.com/africa/1845883/african-scientists-must-take-part-in-coronavirus-vaccine-research/", "urlToImage": null, "publishedAt": "2020-04-26T02:43:49Z", "content": "The search for a Covid-19 vaccine has sparked international media controversy and negative sentiment around the potential harm of people taking part in clinical trials once the research enters its human testing phase.\r\nA wave of anger was ignited when two top… [+6576 chars]"}, {"source": {"id": null, "name": "Clickondetroit.com"}, "author": "Amber Ainsworth", "title": "Coronavirus in Michigan: Here’s where we stand as of Saturday night - WDIV ClickOnDetroit", "description": "Here's the latest headlines on coronavirus in Michigan.", "url": "https://www.clickondetroit.com/news/michigan/2020/04/26/coronavirus-in-michigan-heres-where-we-stand-as-of-saturday-night/", "urlToImage": null, "publishedAt": "2020-04-26T02:34:59Z", "content": "DETROIT The coronavirus (COVID-19) recovery rate in Michigan rose on Saturday.\r\nHeres what happened Saturday:\r\nThe official COVID-19 recovery rate in Michigan is now 8,342.\r\nOfficials provide an update each Saturday.\r\nFinding new ways to celebrate holy events… [+4065 chars]"}, {"source": {"id": null, "name": "Wchstv.com"}, "author": "STAFF REPORTS", "title": "Charleston officer involved in crash Saturday night - WCHS-TV8", "description": "Two people have been transported to the hospital after a crash involving a Charleston police officer, according to Metro 911 dispatchers. Both the officer and a person from the other vehicle involved were taken to the hospital with minor injuries, according t…", "url": "http://wchstv.com/news/local/charleston-officer-involved-in-crash-saturday-night", "urlToImage": null, "publishedAt": "2020-04-26T02:05:18Z", "content": null}, {"source": {"id": null, "name": "Adn.com"}, "author": "Morgan Krakow", "title": "Resident at long-term care facility in Sitka tests positive for COVID-19 - Anchorage Daily News", "description": "It marks the first positive case of the new coronavirus in Sitka.", "url": "https://www.adn.com/alaska-news/2020/04/25/resident-at-long-term-care-facility-in-sitka-tests-positive-for-covid-19/", "urlToImage": null, "publishedAt": "2020-04-26T01:53:02Z", "content": "We're making coronavirus coverage available without a subscription as a public service. But we depend on reader support to do this work. Please consider joining others in supporting local journalism in Alaska for just $3.23 a week.\r\nThe first person to test p… [+1472 chars]"}, {"source": {"id": null, "name": "Jamaicaobserver.com"}, "author": null, "title": "US records 2,494 more coronavirus deaths in 24 hours: Johns Hopkins - Jamaica Observer", "description": "WASHINGTON, United States (AFP) - The United States recorded 2,494 more coronavirus deaths in the...", "url": "http://www.jamaicaobserver.com/latestnews/US_records_2,494_more_coronavirus_deaths_in_24_hours:_Johns_Hopkins", "urlToImage": null, "publishedAt": "2020-04-26T01:20:01Z", "content": "WASHINGTON, United States (AFP) - The United States recorded 2,494 more coronavirus deaths in the past 24 hours, according to figures reported Saturday night by Johns Hopkins University.\r\nThe country now has an overall death toll of 53,511, with 936,293 confi… [+567 chars]"}, {"source": {"id": null, "name": "Pressdemocrat.com"}, "author": null, "title": "Experts worry 'quarantine fatigue' is starting - Santa Rosa Press Democrat", "description": "For the first time since states began implementing stay-at-home orders in mid-March to limit the spread of the novel coronavirus, Americans are staying home less.", "url": "https://www.pressdemocrat.com/news/10922798-181/experts-worry-quarantine-fatigue-is", "urlToImage": null, "publishedAt": "2020-04-26T01:17:28Z", "content": "\"We're going to have to do this carefully,\" Rutherford said of states beginning to ease restrictions. \"Letting people decide for themselves because they're bored is not a good way to do it. . . . This is not the time to be letting up.\"\r\nExperts have theories … [+3426 chars]"}, {"source": {"id": null, "name": "Kezi.com"}, "author": null, "title": "Worker who tested positive for coronavirus in Albany food processing plant speaks out - KEZI TV", "description": "One of eight employees from the Albany National Frozen Foods processing plant spoke to KEZI describing the worls place as unsafe and non properly protected.", "url": "https://www.kezi.com/content/news/Its-ridiculous-Worker-tested-positive-for-coronavirus-in-Albany-food-processing-plant-speaks-out-569956301.html", "urlToImage": null, "publishedAt": "2020-04-26T01:02:00Z", "content": "ALBANY, Ore. -- One of eight employees from the Albany National Frozen Foods processing plant spoke to KEZI describing the workplace as unsafe and not properly protected.\r\nOut of fear of retaliation - the employee chose to remain anonymous, but what he shared… [+1636 chars]"}, {"source": {"id": null, "name": "Dailywire.com"}, "author": "Amanda Prestigiacomo", "title": "WATCH: E.R. Doctors Urge A Reopening: Lockdown Creating Public Health Crisis, Doctors 'Pressured' To Add COVID To Death Reports, Quarantining Healthy 'Never Seen' Before - The Daily Wire", "description": "During a press conference on Wednesday, California emergency room doctors Dan Erickson and Artin Massihi of Accelerated Urgent Care told reporters that nationwide lockdown policies are not an appropriate reaction to what current data shows about the China-ori…", "url": "https://www.dailywire.com/news/watch-e-r-doctors-urge-a-reopening-lockdown-creating-public-health-crisis-doctors-pressured-to-add-covid-to-death-reports-quarantining-healthy-never-seen-befor", "urlToImage": null, "publishedAt": "2020-04-26T00:58:59Z", "content": "During a press conference on Wednesday, California emergency room doctors Dan Erickson and Artin Massihi of Accelerated Urgent Care told reporters that nationwide lockdown policies are not an appropriate reaction to what current data shows about the China-ori… [+6061 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "Dallas County Reports 4 Additional Deaths, 75 New Cases of the Coronavirus - India Gone Viral", "description": "Dallas County on Saturday reported four additional deaths from the new coronavirus and 75 more cases. Two of the people who died — a man in his 80s and a woman in her 90s — had been residents of long-", "url": "https://indiagoneviral.com/health/2020/04/26/dallas-county-reports-4-additional-deaths-75-new-cases-of-the-coronavirus-fort-worth/42555/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-26T00:03:25Z", "content": "Dallas County on Saturday reported four additional deaths from the new coronavirus and 75 more cases.\r\nTwo of the people who died a man in his 80s and a woman in her 90s had been residents of long-term care facilities in Dallas. The other two cases included a… [+508 chars]"}, {"source": {"id": null, "name": "Mercurynews.com"}, "author": "Leonardo Castañeda", "title": "Why researchers are testing 5,700 people for COVID-19 in San Francisco’s Mission District - The Mercury News", "description": "Researchers hope testing everyone in a Latino-heavy census tract will shed light on racial disparities in COVID-19 deaths", "url": "https://www.mercurynews.com/why-researchers-are-testing-5700-people-for-covid-19-in-san-franciscos-mission-district", "urlToImage": null, "publishedAt": "2020-04-25T23:49:30Z", "content": "SAN FRANCISCO Doctors and volunteers fanned out early Saturday morning to pop-up testing centers in the city’s heavily Latino Mission District for an unprecedented effort to test all 5,700 residents in one census tract in hopes the data collected will help ex… [+5371 chars]"}, {"source": {"id": null, "name": "Wwmt.com"}, "author": "Newschannel 3", "title": "Kalamazoo County to hire temporary nurses to assist with COVID-19 response - WWMT-TV", "description": "Kalamazoo County announced Saturday it is hiring registered nurses for the Health and Community Services Department to assist with COVID-19 patients. COVID-19: Find the latest news on the outbreak in West Michigan by visiting the Newschannel 3 coronavirus pag…", "url": "http://wwmt.com/news/local/kalamazoo-county-to-hire-temporary-nurses-to-assist-with-covid-19-response", "urlToImage": null, "publishedAt": "2020-04-25T23:39:00Z", "content": null}, {"source": {"id": null, "name": "Oregonlive.com"}, "author": "Aimee Green | The Oregonian/OregonLive, Shane Dixon Kavanaugh | The Oregonian", "title": "Coronavirus in Oregon: 1 new death, more than 2,250 known cases - OregonLive", "description": "The number of new positive test results grew by 76.", "url": "https://www.oregonlive.com/coronavirus/2020/04/coronavirus-in-oregon-1-new-death-more-than-2250-known-cases.html", "urlToImage": null, "publishedAt": "2020-04-25T23:28:00Z", "content": "Oregon officials on Saturday reported 1 new death from the novel coronavirus and 76 new cases -- bringing the total number of deaths to 87 and known cases to 2,253.\r\nThe Oregon Health Authority reported that the latest death was a 59-year-old Lane County man … [+2700 chars]"}, {"source": {"id": null, "name": "Villages-news.com"}, "author": null, "title": "Summerfield men among latest COVID-19 patients in tri-county area - Villages-News", "description": "Two Summerfield residents were identified Saturday as among the latest Floridians to test positive for the Coronavirus.", "url": "https://www.villages-news.com/2020/04/25/summerfield-men-among-latest-covid-19-patients-in-tri-county-area/", "urlToImage": null, "publishedAt": "2020-04-25T23:08:07Z", "content": "Two Summerfield residents were identified Saturday as among the latest Floridians to test positive for the Coronavirus.\r\nThey were identified as a 31-year-old man and a 32-year-old man, both of whom had no recent travel history but had been exposed to others … [+1921 chars]"}, {"source": {"id": null, "name": "Wgntv.com"}, "author": null, "title": "Coronavirus Chicago updates for April 25: State tops 40,000 coronavirus cases - WGN TV Chicago", "description": "Information in the COVID-19 pandemic is evolving rapidly, so to help keep WGN viewers informed with the latest updates, follow our live blog for April 25, 2020. These updates will mostly focus on t…", "url": "https://wgntv.com/chicago-news/coronavirus-chicago-updates-for-april-25-joann-fabrics-giving-out-5k-masks/", "urlToImage": null, "publishedAt": "2020-04-25T23:07:08Z", "content": "Information in the COVID-19 pandemic is evolving rapidly, so to help keep WGN viewers informed with the latest updates, follow our live blog for April 25, 2020.\r\nThese updates will mostly focus on the Chicago area, but will include some national and internati… [+1407 chars]"}, {"source": {"id": null, "name": "Wlns.com"}, "author": null, "title": "No need to wipe down groceries or takeout, experts say, but wash your hands - KRON4", "description": "The US Food and Drug Administration (FDA) is re-emphasizing there’s no real risk of getting the virus that causes Covid-19 that way.", "url": "https://www.wlns.com/top-stories/no-need-to-wipe-down-groceries-or-takeout-experts-say-but-do-wash-your-hands/", "urlToImage": null, "publishedAt": "2020-04-25T22:59:00Z", "content": "The US Food and Drug Administration (FDA) is re-emphasizing there’s no real risk of getting the virus that causes Covid-19 that way.\r\n“We want to assure you there is currently NO evidence of human or animal food or food packaging being associated with transmi… [+1195 chars]"}, {"source": {"id": null, "name": "Kesq.com"}, "author": "Rich Tarpening", "title": "Riverside County coronavirus update: 94 new cases and 5 more deaths reported - KESQ", "description": "Riverside County health officials provided the latest update on coronavirus cases, deaths, hospitalizations, and recoveries over the last 24 hours. Cases The total number of cases has jumped from 3,315 to 3,409 showing an increase of 94 cases in the past 24 h…", "url": "https://kesq.com/news/2020/04/25/riverside-county-coronavirus-update-94-new-cases-and-5-more-deaths-reported/", "urlToImage": null, "publishedAt": "2020-04-25T22:57:28Z", "content": "Riverside County health officials provided the latest update on coronavirus cases, deaths, hospitalizations, and recoveries over the last 24 hours.\r\nCases\r\nThe total number of cases has jumped from 3,315 to 3,409 showing an increase of 94 cases in the past 24… [+1746 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Anita Bennett", "title": "Coronavirus In L.A. County: 48 More Deaths And 607 New Cases Confirmed - Deadline", "description": "Coronavirus continues to claim lives across Los Angeles County. New figures released Saturday show 607 additional cases of COVID-19 and 48 more deaths in the county over the past 24 hours. Two of those deaths were reported by the city of Long Beach, the Los A…", "url": "https://deadline.com/2020/04/coronavirus-in-l-a-county-48-more-deaths-and-607-new-cases-confirmed-1202917903/", "urlToImage": null, "publishedAt": "2020-04-25T22:08:36Z", "content": "Coronavirus continues to claim lives across Los Angeles County. New figures released Saturday show 607 additional cases of COVID-19 and 48 more deaths in the county over the past 24 hours.\r\nTwo of those deaths were reported by the city of Long Beach, the Los … [+1143 chars]"}, {"source": {"id": null, "name": "Medscape.com"}, "author": null, "title": "COVID-19 Daily: Stroke in Young Adults, Abbott Test Safety Issues - Medscape", "description": "These are the coronavirus stories you need to know about today.", "url": "https://www.medscape.com/viewarticle/929394", "urlToImage": null, "publishedAt": "2020-04-25T21:55:05Z", "content": "Editor's note: Find the latest COVID-19 news and guidance in Medscape's Coronavirus Resource Center.\r\nHere are the coronavirus stories Medscape's editors around the globe think you need to know about today: \r\nStroke in Young Adults\r\nInvestigators from Mount S… [+5666 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Sara Dorn", "title": "NYC nursing homes ravaged by coronavirus were cited for past hygiene fails - New York Post ", "description": "City nursing homes ravaged by the coronavirus were warned about disturbing patterns of unsanitary behavior long before the deadly outbreak, The Post has found. The state Health Department cited mor…", "url": "https://nypost.com/2020/04/25/coronavirus-stricken-nyc-nursing-homes-have-history-of-infection-control-issues/", "urlToImage": null, "publishedAt": "2020-04-25T21:26:11Z", "content": "City nursing homes ravaged by the coronavirus were warned about disturbing patterns of unsanitary behavior long before the deadly outbreak, The Post has found.\r\nThe state Health Department cited more than a dozen COVID-19-stricken facilities in New York City … [+7789 chars]"}, {"source": {"id": null, "name": "Abc7chicago.com"}, "author": null, "title": "Doctors report 'COVID toes,' discolored skin on some coronavirus patients - WLS-TV", "description": "A growing number of dermatologists treating suspected and confirmed coronavirus-positive patients are reporting patterns and trends of skin conditions.", "url": "https://abc7chicago.com/covid-toes-covid19-coronavirus-symptoms/6128998/", "urlToImage": null, "publishedAt": "2020-04-25T20:12:45Z", "content": "As doctors around the world continue to battle COVID-19, researchers are noticing that the disease appears to attack the entire body, including the toes.A growing number of dermatologists treating suspected and confirmed coronavirus-positive patients are repo… [+1943 chars]"}, {"source": {"id": null, "name": "Wibw.com"}, "author": "Danielle Martin", "title": "Kansas has 3,056 cases of COVID-19, up 279 - WIBW", "description": "The Kansas Department of Health and Environment is reporting 3,056  cases of COVID-19 in the state, up 279 from yesterday.", "url": "https://www.wibw.com/content/news/Kansas-has-3056-cases-of-COVID-19-up-279--569952231.html", "urlToImage": null, "publishedAt": "2020-04-25T20:09:18Z", "content": "TOPEKA, Kan. (WIBW) -- The Kansas Department of Health and Environment is reporting 3,056 cases of COVID-19 in the state, up 279 from yesterday. There have been 117 deaths. At least 474 have been hospitalized due to the virus.\r\nOf the tests given, 22,143 came… [+14 chars]"}, {"source": {"id": null, "name": "Qz.com"}, "author": "Lila MacLellan", "title": "DIY coronavirus masks more protective if enhanced with pantyhose - Quartz", "description": "Could a pantyhose-enhanced face mask help spare you from Covid-19?", "url": "https://qz.com/1845741/diy-coronavirus-masks-more-protective-if-enhanced-with-pantyhose/", "urlToImage": null, "publishedAt": "2020-04-25T20:07:27Z", "content": "The homemade masks that millions are wearing in the US and elsewhere have always been a better-than-nothing solution for preventing the spread of the virus that causes Covid-19.\r\nTheyre not recommended to protect the wearer. Only N95 respirators can effective… [+3099 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Christina Maxouris and Jason Hanna, CNN", "title": "US coronavirus: Some states begin to reopen as US closes in on 1 million coronavirus cases - msnNOW", "description": "A few states this weekend are running a tricky experiment: Trying to reopen certain businesses and services amid the coronavirus pandemic, even against the advice of some health experts who say it risks dangerously spiking the number of cases.", "url": "https://www.cnn.com/2020/04/25/health/us-coronavirus-saturday/index.html", "urlToImage": null, "publishedAt": "2020-04-25T20:00:00Z", "content": "(CNN)A few states this weekend are running a tricky experiment: Trying to reopen certain businesses and services amid the coronavirus pandemic, even against the advice of some health experts who say it risks dangerously spiking the number of cases.\r\nIn Georgi… [+9123 chars]"}, {"source": {"id": null, "name": "Wsaz.com"}, "author": "Associated Press", "title": "Virus lockdowns an extra ordeal for special-needs children - WSAZ-TV", "description": "After weeks of lockdown, a 14-year-old French boy with autism took a pickax to the wall of his house with the hope that he could finally go out.", "url": "https://www.wsaz.com/content/news/Virus-lockdowns-an-extra-ordeal-for-special-needs-children-569952121.html", "urlToImage": null, "publishedAt": "2020-04-25T19:57:20Z", "content": "PARIS (AP) -- Coronavirus lockdown is proving a particularly tough ordeal for children with disabilities and their families. \r\nSpecial schools and support programs have been shut down. After weeks of lockdown, a 14-year-old French boy with autism took a picka… [+434 chars]"}, {"source": {"id": null, "name": "Inverse.com"}, "author": "Abela Mahimbo, David Isaacs, Melissa Kang, Melanie Wong", "title": "Why are some people with Covid-19 asymptomatic? Evidence points to 2 factors - Inverse", "description": "Recent studies suggest as many as 80% or more of those infected are “silent carriers”, showing no or very mild symptoms.", "url": "https://www.inverse.com/science/covid-19-asymptomatic", "urlToImage": null, "publishedAt": "2020-04-25T17:58:15Z", "content": "SARS-CoV-2, the coronavirus which causes COVID-19, has infected almost 2.5 million people around the world and claimed 170,000 lives.\r\nBut some people dont even get symptoms. Recent studies suggest as many as 80 percentor more of those infected are silent car… [+5687 chars]"}, {"source": {"id": null, "name": "Pressdemocrat.com"}, "author": null, "title": "Sonoma County considers loosening stay-at-home order's restrictions on construction, real estate - Santa Rosa Press Democrat", "description": "County Health Officer Dr. Sundari Mase faces a critical decision: How much will she relax the stay-home order that she has already signaled will be renewed before it expires Friday.", "url": "https://www.pressdemocrat.com/news/10920710-181/sonoma-county-considers-changes-to", "urlToImage": null, "publishedAt": "2020-04-25T17:49:22Z", "content": "But the financial toll has been swift and brutal in California, where more than a half-million residents filed unemployment claims just last week, more than any other state. All told, 1 in 6 Californians have lost jobs, according to state figures. \r\nLocal voi… [+3277 chars]"}, {"source": {"id": null, "name": "Ktar.com"}, "author": "", "title": "Live updates: Latest on coronavirus in Arizona, which has 6,280 cases - KTAR.com", "description": "Here's an updated list of Arizona cases by county as reported by the state, along with the latest developments from around the state, country and world.", "url": "https://ktar.com/story/3086822/live-updates-latest-on-coronavirus-in-arizona-for-week-starting-april-20-6526-cases/", "urlToImage": null, "publishedAt": "2020-04-25T17:05:00Z", "content": "This is a continuously updated link with the latest information, news and updates about the coronavirus and its impact in Arizona and beyond for the week starting April 20. (Previous live updates: April 13-April 19)\r\nPHOENIX State officials on Sunday reported… [+10887 chars]"}, {"source": {"id": null, "name": "Dailyvoice.com"}, "author": null, "title": "Hospital: First Critical NJ Patients To Receive COVID-19 Plasma Make 'Remarkable' Recoveries - Rutherford Daily Voice", "description": "The first two New Jersey residents to receive plasma transfusions for critical cases of COVID-19 -- a 63-year-old teacher and a 61-year-old old opera singer – were released from the hospital after making", "url": "https://dailyvoice.com/new-jersey/burlington/news/hospital-first-critical-nj-patients-to-receive-covid-19-plasma-make-remarkable-recoveries/787124/", "urlToImage": null, "publishedAt": "2020-04-25T16:09:00Z", "content": "The first two New Jersey residents to receive plasma transfusions for critical cases of COVID-19 -- a 63-year-old teacher and a 61-year-old old opera singer were released from the hospital after making \"remarkable\" recoveries, Virtua Voorhees Health System an… [+2571 chars]"}, {"source": {"id": null, "name": "Fox8.com"}, "author": "CNNwire", "title": "5-month-old daughter of a New York firefighter dies from coronavirus - WJW FOX 8 News Cleveland", "description": "A New York firefighter’s infant daughter has died from coronavirus, her family says, making her one of the youngest known victims of the virus.", "url": "https://fox8.com/news/coronavirus/5-month-old-daughter-of-a-new-york-firefighter-dies-from-coronavirus/", "urlToImage": null, "publishedAt": "2020-04-25T16:08:53Z", "content": "(CNN) — A New York firefighter’s infant daughter has died from coronavirus, her family says, making her one of the youngest known victims of the virus.\r\nFive-month-old Jay-Natalie, the daughter of New York City firefighter Jerel La Santa and Board of Educatio… [+2469 chars]"}, {"source": {"id": null, "name": "Ky3.com"}, "author": "The Associated Press", "title": "Missouri moving to quickly test workers at packing plants - KY3", "description": "Missouri health officials are hoping that a new testing strategy will help quickly identify people with COVID-19 at food plants throughout the state.", "url": "https://www.ky3.com/content/news/Missouri-moving-to-quickly-test-workers-at-packing-plants-569950061.html", "urlToImage": null, "publishedAt": "2020-04-25T15:52:12Z", "content": "O'FALLON, Mo. (AP) -- Missouri health officials are hoping that a new testing strategy will help quickly identify people infected with the coronavirus at meatpacking and food plants throughout the state.\r\nOutbreaks of COVID-19, the illness caused by the coron… [+2258 chars]"}, {"source": {"id": null, "name": "Denverpost.com"}, "author": "Joe Nguyen", "title": "Coronavirus in Colorado, April 25: A look at the latest updates on COVID-19 - The Denver Post", "description": "With Gov. Jared Polis’ stay-at-home mandate set to shift to “safer at home” on Monday, counties across Colorado are grappling with how much leeway they should give to reopening businesses, while we…", "url": "https://www.denverpost.com/2020/04/25/coronavirus-covid-colorado-april-25-updates/", "urlToImage": null, "publishedAt": "2020-04-25T15:35:00Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "The Associated Press", "title": "What you need to know today about the virus outbreak - Yahoo News", "description": "In the U.S., Georgia, Oklahoma and Alaska have also begun loosening restrictions despite warnings from health officials that it may be too soon.  The role of...", "url": "https://news.yahoo.com/know-today-virus-outbreak-152045652.html", "urlToImage": null, "publishedAt": "2020-04-25T15:20:00Z", "content": "Some governments have begun easing their coronavirus restrictions, with India reopening neighborhood stores that serve many of its 1.3 billion people. In the U.S., Georgia, Oklahoma and Alaska have also begun loosening restrictions despite warnings from healt… [+3689 chars]"}, {"source": {"id": null, "name": "Cbslocal.com"}, "author": "CBS Pittsburgh", "title": "Allegheny Co. Health Dept.: Coronavirus Cases Increases To 1,198, Death Toll Totals Reach 73 - CBS Pittsburgh", "description": "The Allegheny County Health Department is reporting 21 new cases of Coronavirus, across the county Saturday, bringing the total number of cases to 1,198.", "url": "https://pittsburgh.cbslocal.com/2020/04/25/allegheny-county-coronavirus-cases/", "urlToImage": null, "publishedAt": "2020-04-25T15:15:08Z", "content": "PITTSBURGH (KDKA) — The Allegheny County Health Department is reporting 21 new cases of Coronavirus across the county Saturday, bringing the total number of cases to 1,198.\r\nThat’s 1,167 confirmed cases and 31 probable cases, according to health officials.\r\nO… [+361 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Shona Ghosh", "title": "Trump aides demanded hydroxychloroquine for millions: Vanity Fair - Business Insider - Business Insider", "description": "Hydroxychloroquine, repeatedly touted by President Trump as a potential cure, one drug trial in Brazil had to be abandoned after patients died.", "url": "https://www.businessinsider.com/emails-trump-aides-mass-distribution-hydroxychloroquine-unproven-2020-4", "urlToImage": null, "publishedAt": "2020-04-25T15:09:05Z", "content": "Trump administration officials concocted a plan to distribute millions of doses of the unproven drug hydroxychloroquine to COVID-19 outpatients, according to emails obtained by Vanity Fair.\r\nHydroxychloroquine is an effective anti-malarial drug, but despite b… [+2294 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "At least three residents, three staffers contract coronavirus at Turlock nursing home - Modesto Bee", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiPWh0dHBzOi8vd3d3Lm1vZGJlZS5jb20vbmV3cy9jb3JvbmF2aXJ1cy9hcnRpY2xlMjQyMjg1NzM2Lmh0bWzSAT1odHRwczovL2FtcC5tb2RiZWUuY29tL25ld3MvY29yb25hdmlydXMvYXJ0aWNsZTI0MjI4NTczNi5odG1s?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T13:29:40Z", "content": null}, {"source": {"id": null, "name": "Fox17.com"}, "author": "Stacy Case", "title": "New Vanderbilt COVID-19 transmission model shows uncertainty - WZTV", "description": "Tuning into social media for only a moment and it's apparent that everybody has an opinion on what's going to happen when the state of Tennessee opens back up next week. Some are excited while others are worried. When the stores and parking lots start filling…", "url": "http://fox17.com/news/local/tennesseans-researchers-share-concerns-over-reopening-state", "urlToImage": null, "publishedAt": "2020-04-25T13:02:00Z", "content": null}, {"source": {"id": null, "name": "Creativebloq.com"}, "author": "Rosie Hilder", "title": "Where to buy a face mask right now – plus how to make a face mask at home - Creative Bloq", "description": "Wondering where to buy a face mask? These retailers still have stock. Plus how to make your own.", "url": "https://www.creativebloq.com/news/where-to-buy-face-masks", "urlToImage": null, "publishedAt": "2020-04-25T13:01:17Z", "content": "If you want to know where to buy a face mask, you're in the right place. Face masks are selling out quickly around the world, so we've put together this list of online retailers that still have face masks in stock. \r\nBear in mind that the face masks in this a… [+6427 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Britain passes 'terrible' milestone of 20,000 coronavirus deaths - Reuters", "description": "Britain's COVID-19 death toll passed 20,000 on Saturday in what the interior minister called \"a tragic and terrible milestone\" as she urged people to stay at home.", "url": "https://www.reuters.com/article/us-health-coronavirus-britain-idUSKCN2270A2", "urlToImage": null, "publishedAt": "2020-04-25T11:10:32Z", "content": "LONDON (Reuters) - Britain’s COVID-19 death toll passed 20,000 on Saturday in what the interior minister called “a tragic and terrible milestone” as she urged people to stay at home. \r\nThe government is facing growing criticism over its response to the new co… [+3185 chars]"}, {"source": {"id": null, "name": "Kidspot.com.au"}, "author": "Vanessa Stubbs", "title": "Nurses in tears as baby wins her coronavirus fight - Kidspot", "description": "Little Erin Bates has become a symbol of hope.", "url": "https://www.kidspot.com.au/news/nurses-in-tears-as-baby-wins-her-coronavirus-fight/news-story/7a317269d080a6ff81536cc368444940", "urlToImage": null, "publishedAt": "2020-04-25T03:07:00Z", "content": "Little Erin Bates has become a symbol of hope.Nurses formed a guard of honour and clapped as six-month-old baby Erin was wheeled out of isolation.\r\nThe baby girl was being treated at Alder Hey Children's Hospital in Liverpool in the UK, where she battled COVI… [+1996 chars]"}, {"source": {"id": null, "name": "Wlos.com"}, "author": "Kimberly King", "title": "Disagreement among Asheville, Henderson County leaders over extended stay home order - WLOS", "description": "Gov. Roy Cooper&rsquo;s extended stay home order coupled with a vague outline of phases for reopening North Carolina&rsquo;s economy is being met with mixed reviews by leaders in democratic-led Buncombe County and Republican-led Henderson County. WLOS. On Fri…", "url": "http://wlos.com/news/local/disagreement-among-asheville-henderson-county-leaders-over-extended-stay-home-order", "urlToImage": null, "publishedAt": "2020-04-25T02:35:25Z", "content": null}, {"source": {"id": null, "name": "Washingtonexaminer.com"}, "author": "https://www.washingtonexaminer.com/author/anthony-leonardi", "title": "'What the hell are you doing out here?': Bicyclist describes confrontation with quarantine-breaking Chris Cuomo - Washington Examiner", "description": "The bicyclist who encountered CNN primetime host Chris Cuomo described the network host as angry for being found breaking coronavirus quarantine.", "url": "https://www.washingtonexaminer.com/news/what-the-hell-are-you-doing-out-here-bicyclist-describes-confrontation-with-quarantine-breaking-chris-cuomo", "urlToImage": null, "publishedAt": "2020-04-25T02:09:00Z", "content": "The bicyclist who encountered CNN primetime host Chris Cuomo described the network host as angry for being found breaking coronavirus quarantine. \r\nWhile appearing on Tucker Carlson Tonight on Friday, bicyclist David Whelan said Cuomo became visibly angry aft… [+2147 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "12 residents die at Madison County nursing home during coronavirus outbreak - Belleville News-Democrat", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiOmh0dHBzOi8vd3d3LmJuZC5jb20vbmV3cy9jb3JvbmF2aXJ1cy9hcnRpY2xlMjQyMjc3ODY2Lmh0bWzSATpodHRwczovL2FtcC5ibmQuY29tL25ld3MvY29yb25hdmlydXMvYXJ0aWNsZTI0MjI3Nzg2Ni5odG1s?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T01:08:06Z", "content": null}, {"source": {"id": null, "name": "Keprtv.com"}, "author": "Christopher Poulsen", "title": "Police cars make some noise for Pasco boy's birthday - KEPR 19", "description": "PASCO, Wash. -- Coronavirus is changing the way families are celebrating birthdays. A parade of Pasco police made sure 10-year-old Stryker Smith enjoyed his birthday. Sgt. Rodrigo Pruneda says the usual party with friends, cake and candles is out of reach thi…", "url": "http://keprtv.com/news/coronavirus/police-cars-make-some-noise-for-pasco-boys-birthday", "urlToImage": null, "publishedAt": "2020-04-25T01:07:08Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "106-year-old woman survives two pandemics: the Spanish Flu and the coronavirus - CBS Evening News", "description": "Ana del Valle is an extraordinary 106-year-old: the Andalusian “super grandmother” has won the battle against two pandemics. She survived the Spanish Flu as ...", "url": "https://www.youtube.com/watch?v=b_h4YGtxXgo", "urlToImage": null, "publishedAt": "2020-04-24T21:51:19Z", "content": "Ana del Valle is an extraordinary 106-year-old: the Andalusian super grandmother has won the battle against two pandemics.She survived the Spanish Flu as a child, and she recovered from the coronavirus last week."}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "What to know about protecting pets from coronavirus, caring for them if you’re sick - The State", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiP2h0dHBzOi8vd3d3LnRoZXN0YXRlLmNvbS9uZXdzL2Nvcm9uYXZpcnVzL2FydGljbGUyNDIyNzM5NTYuaHRtbNIBP2h0dHBzOi8vYW1wLnRoZXN0YXRlLmNvbS9uZXdzL2Nvcm9uYXZpcnVzL2FydGljbGUyNDIyNzM5NTYuaHRtbA?oc=5", "urlToImage": null, "publishedAt": "2020-04-24T21:37:13Z", "content": null}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Joseph Guzman", "title": "New report: Coronavirus lingers in patient's eyes days after it leaves nose | TheHill - The Hill", "description": "A new report is detailing how the coronavirus can exist in an infected person’s eye fluids at potentially contagious levels.", "url": "https://thehill.com/changing-america/well-being/prevention-cures/494586-coronavirus-found-in-patients-eyes-days-after-it", "urlToImage": null, "publishedAt": "2020-04-24T21:19:55Z", "content": "A recently published report is detailing how Italys first coronavirus patient had detectable traces of the virus in her eyes days after it had cleared from her nose, highlighting how the eyes could play a factor in the spread of COVID-19. \r\nThe patient, a 65-… [+2785 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Cleaning to avoid coronavirus causes spike in KY poison cases. How to avoid problems. - Lexington Herald Leader", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiP2h0dHBzOi8vd3d3LmtlbnR1Y2t5LmNvbS9uZXdzL2Nvcm9uYXZpcnVzL2FydGljbGUyNDIyNzE3NDYuaHRtbNIBR2h0dHBzOi8vYW1wLmtlbnR1Y2t5LmNvbS9uZXdzL2hlYWx0aC1hbmQtbWVkaWNpbmUvYXJ0aWNsZTI0MjI3MTc0Ni5odG1s?oc=5", "urlToImage": null, "publishedAt": "2020-04-24T20:25:18Z", "content": null}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "New pandemic model estimates coronavirus outbreak was spreading earlier than U.S. realized - CBS News", "description": "A New York Times analysis of the modeling estimates New York City had 10,000 infections by March 1, two weeks before social distancing guidelines were put in place.", "url": "https://www.cbsnews.com/news/coronavirus-pandemic-model-outbreaks-earlier-cities-new-york/", "urlToImage": null, "publishedAt": "2020-04-24T20:06:45Z", "content": "New information suggests the coronavirus was spreading rapidly in the US much earlier than first thought.  Only 23 coronavirus cases in several major cities had been reported by March 1, but analysis from a Northeastern University pandemic model estimates the… [+2211 chars]"}, {"source": {"id": null, "name": "Webmd.com"}, "author": "Brenda  Goodman, MA", "title": "Blood Clots Are Another Dangerous COVID-19 Mystery - WebMD", "description": "Around the world, doctors caring for COVID-19 patients have been trying to make sense of the same thing. When they draw blood from COVID patients, it clots in the tubes.", "url": "https://www.webmd.com/lung/news/20200424/blood-clots-are-another-dangerous-covid-19-mystery", "urlToImage": null, "publishedAt": "2020-04-24T18:46:44Z", "content": "He says this theory of infection explains some things that doctors have been trying to puzzle out.\r\nFor example, certain conditions like high blood pressure, diabetes, and heart disease stress the endothelium. Its no surprise, then, that people who have these… [+1776 chars]"}, {"source": {"id": null, "name": "Dallasnews.com"}, "author": "Obed Manuel", "title": "How do I apply for Dallas’ COVID-19 rental, mortgage assistance program? Do I qualify? - The Dallas Morning News", "description": "The City of Dallas this week authorized about $13.7 million for short-term rental and mortgage assistance programs to help Dallas residents who have been...", "url": "https://www.dallasnews.com/news/public-health/2020/04/24/how-do-i-apply-for-dallas-covid-19-rental-mortgage-assistance-program-do-i-qualify/", "urlToImage": null, "publishedAt": "2020-04-24T17:52:25Z", "content": "The City of Dallas this week authorized about $13.7 million for short-term rental and mortgage assistance programs to help Dallas residents who have been laid off or had their incomes impacted by the spread of COVID-19.\r\nSo what does that application process … [+3673 chars]"}, {"source": {"id": "national-geographic", "name": "National Geographic"}, "author": null, "title": "New vaccine for malaria - National Geographic", "description": "Children in Kenya, Malawi, and Ghana are receiving the first-ever vaccine, but it is unlikely to eradicate malaria on its own.", "url": "https://www.nationalgeographic.com/history/2020/04/new-malaria-vaccine-sparks-hope-cheaper-measures-still-useful/", "urlToImage": null, "publishedAt": "2020-04-24T17:44:47Z", "content": null}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Soo Kim", "title": "Sweden Claims It's Prepared For Second Wave Despite Having No Lockdown - Newsweek", "description": "The country's public health agency claims its capital Stockholm, where the majority of the cases have been reported, may have already passed the peak of the outbreak.", "url": "https://www.newsweek.com/coronavirus-second-wave-sweden-lockdown-herd-immunity-covid-19-1500046", "urlToImage": null, "publishedAt": "2020-04-24T16:17:08Z", "content": "The novel coronavirus in Sweden has spread to over 17,500 people and killed more than 2,100, as of Friday, according to the latest figures from Johns Hopkins University. While cases continue to grow, the country has taken the surprising route of not imposing … [+10846 chars]"}]}