{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": "reuters", "name": "Reuters"}, "author": "Kate Kelland", "title": "France's early COVID-19 case may hold clues to pandemic's start - Reuters", "description": "A study by French scientists which suggests a man was infected with COVID-19 as early as Dec. 27, nearly a month before France confirmed its first cases, could be important in assessing when and where the new coronavirus emerged, experts said on Tuesday.", "url": "https://www.reuters.com/article/us-health-coronavirus-france-retests-idUSKBN22H15R", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200505&t=2&i=1517518309&w=1200&r=LYNXMPEG440N6", "publishedAt": "2020-05-05T12:29:55Z", "content": "LONDON (Reuters) - A study by French scientists which suggests a man was infected with COVID-19 as early as Dec. 27, nearly a month before France confirmed its first cases, could be important in assessing when and where the new coronavirus emerged, experts sa… [+2736 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/meg-wagner\">Meg Wagner</a> and Mike Hayes, CNN", "title": "Coronavirus pandemic in the US: Live updates - CNN", "description": "The US coronavirus outbreak has altered daily life in almost every way. Here's the latest updates on US Covid-19 cases, deaths, the government response, unemployment and more.", "url": "https://www.cnn.com/us/live-news/us-coronavirus-update-05-05-20/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200213175739-03-coronavirus-0213-super-tease.jpg", "publishedAt": "2020-05-05T12:22:00Z", "content": "Los Angeles is still 80% short of its goal to provide 15,000 hotel rooms for its homeless population, a month after the county announced the initiative.\r\nOn April 8, Los Angeles County launched Project Roomkey, a partnership between the state, county, and the… [+1699 chars]"}, {"source": {"id": null, "name": "Latimes.com"}, "author": null, "title": "Study reports a mutant, more contagious form of coronavirus - World Best News", "description": "Scientists have recognized a brand new pressure of the coronavirus that has turn into dominant worldwide and seems to be extra contagious than the", "url": "https://www.latimes.com/california/story/2020-05-05/mutant-coronavirus-has-emerged-more-contagious-than-original", "urlToImage": "//403297-1269736-6-raikfcquaxqncofqfm.stackpathdns.com/wp-content/uploads/2020/05/apphoto-virus-outbreak-home-test.JPG", "publishedAt": "2020-05-05T11:34:21Z", "content": "Scientists have recognized a brand new pressure of the coronavirus that has turn into dominant worldwide and seems to be extra contagious than the variations that unfold within the early days of the COVID-19 pandemic, based on a brand new examine led by scien… [+8949 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Gregory Barber", "title": "The FDA Tightens the Rules for Covid-19 Antibody Blood Tests - WIRED", "description": "In a reversal, agency officials raised the bar for validation and accuracy standards, citing concerns about flawed tests and fraudulent marketing.", "url": "https://www.wired.com/story/the-fda-tightens-the-rules-for-covid-19-antibody-blood-tests/", "urlToImage": "https://media.wired.com/photos/5eb061c0404bdac8ebf4a211/191:100/w_1280,c_limit/Sciencee_FDA_1210092000.jpg", "publishedAt": "2020-05-05T11:03:30Z", "content": "The federal government has received plenty of well-deserved flack for slow-rolling the national launch of diagnostic tests for Covid-19. First came the flawed swab-based tests from the Centers for Disease Control and Prevention, followed by a chaotic, lost mo… [+3475 chars]"}, {"source": {"id": null, "name": "Abc7ny.com"}, "author": null, "title": "Coronavirus News: Doctors in NYC flag mysterious illness in children, many had COVID-19 - WABC-TV", "description": "Doctors say 15 children have been hospitalized with symptoms similar to toxic shock syndrome or Kawasaki Disease.", "url": "https://abc7ny.com/coronavirus-nyc-update-corona-virus-cases/6152212/", "urlToImage": "https://cdn.abcotvs.com/dip/images/6152222_050520-wabc-nyc-illness-children-img.jpg?w=1600", "publishedAt": "2020-05-05T10:34:19Z", "content": "NEW YORK (WABC) -- Doctors in New York City are now sounding the alarm on a mysterious illness being seen in children.The syndrome was first reported in Europe and is believed to be linked to COVID-19.\r\nDoctors say 15 children have been hospitalized with symp… [+2480 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Casey Tolan, CNN", "title": "Hand sanitizer is still considered contraband in some prisons around the country - CNN", "description": "When a half-dozen inmates reported in for their prison jobs in Nebraska in late March, they found themselves with a new assignment: turning vats of ethanol into 2,500 gallons of coronavirus-killing hand sanitizer, for a wage of $1.08 an hour.", "url": "https://www.cnn.com/2020/05/05/us/coronavirus-prison-hand-sanitizer-contraband-invs/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200501140649-02-coronavirus-prisons-hand-sanitizer-contraband-super-tease.jpg", "publishedAt": "2020-05-05T10:16:25Z", "content": "(CNN)When a half-dozen inmates reported in for their prison jobs in Nebraska in late March, they found themselves with a new assignment: turning vats of ethanol into 2,500 gallons of coronavirus-killing hand sanitizer, for a wage of $1.08 an hour. \r\nBut while… [+12499 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Allyson Chiu", "title": "More than 50 dead as coronavirus ravages Massachusetts nursing home - Washington Post", "description": "Genesis Healthcare, which operates the Courtyard Nursing Care Center in Medford, Mass., confirmed that 117 other residents and 42 staff members have also tested positive for covid-19.", "url": "https://www.washingtonpost.com/nation/2020/05/05/massachusetts-nursing-home-coronavirus/", "urlToImage": "https://www.washingtonpost.com/resizer/wRA3F6OcnyVfS5bycRhVaJb40RQ=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/XYHSMLVPGNCL5JZA2GJSXWFRTE.png", "publishedAt": "2020-05-05T10:15:00Z", "content": "Beyond the fatalities, 117 residents and 42 staff members have since tested positive, Genesis Healthcare, which operates the nursing home, said in a statement to The Washington Post.\r\nWe care for largely frail, elderly seniors with multiple health conditions … [+4374 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Elizabeth Weise", "title": "To find a coronavirus vaccine, can we ethically infect people with a disease with no cure? - USA TODAY", "description": "To have a vaccine by next summer will require both luck and cutting corners, putting once seemingly academic questions suddenly front and center.", "url": "https://www.usatoday.com/story/news/health/2020/05/05/coronavirus-vaccine-challenge-trial-ethics-covid-19/3061009001/", "urlToImage": "https://www.gannett-cdn.com/presto/2020/05/03/USAT/257b6b69-298e-4119-9c44-1d77a92c8936-AP_Virus_Outbreak_Vaccine_Study.JPG?crop=1888,1062,x0,y0&width=1600&height=800&fit=bounds", "publishedAt": "2020-05-05T10:06:17Z", "content": "About 100 research groups around the world are pursuing vaccines against the coronavirus, with nearly a dozen in early stages of human trials or poised to start. Finding out for sure if any of the vaccines work in the real world comes next. (May 4)\r\nAP Domest… [+9825 chars]"}, {"source": {"id": null, "name": "Thedailybeast.com"}, "author": "Olivia Messer", "title": "Texans Brace for a COVID-19 'Explosion' Just Days After Reopening - The Daily Beast", "description": "Prisons. Meat plants. Nursing homes. And nowhere near enough testing to know how bad the coronavirus problem is.", "url": "https://www.thedailybeast.com/texans-brace-for-a-covid-19-explosion-just-days-after-reopening", "urlToImage": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1687,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1588640540/200504-messer-texas-coronavirus-tease_jr5v2a", "publishedAt": "2020-05-05T08:45:25Z", "content": "The ascent of the novel coronavirus in the Lone Star State has been a gradual one. But as the state reopens its economy, infection counts are surgingand experts warn of a potential flood in the months ahead.\r\nOn March 4, the state health department reported T… [+9783 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jen Rose Smith, CNN", "title": "Getting to the dentist during a pandemic - CNN", "description": "Visiting the dentist is much riskier than usual, which is why the CDC recommends that dentists put off \"elective procedures, surgeries and non-urgent dental visits,\" allowing only emergency visits.", "url": "https://www.cnn.com/2020/05/05/health/getting-to-the-dentist-coronavirus-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200503125118-20200503-getting-to-dentist-super-tease.jpg", "publishedAt": "2020-05-05T08:34:06Z", "content": "Going anywhere during a pandemic is difficult but getting to medical appointments is even more fraught. Whether you need to get to the pediatrician, dentist, vet, internist or hospital, this five-part series from CNN Science and Wellness has you covered.\r\n (C… [+6204 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandee LaMotte, CNN", "title": "5 signs your coronavirus anxiety has turned serious, threatening your mental health, and what to do about it - CNN", "description": "As the coronavirus pandemic drags on, experts fear that some of us may begin to lose our ability to cope with the anxiety and stress. Here are five signs that may be happening and what to do to stop it.", "url": "https://www.cnn.com/2020/05/05/health/anxiety-coronavirus-turns-dark-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200109172847-anxiety-stock-super-tease.jpg", "publishedAt": "2020-05-05T07:55:08Z", "content": "(CNN)Enforced lockdowns. Isolation from friends and loved ones. Loss of job, income, economic stability. \r\nGrief and loss on so many levels -- from missing milestones such as birthdays and graduations to severe illness and death. \r\nDifficult times made worse … [+10905 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Brazil virus outbreak: Amazonas state capital becomes hotspot - Al Jazeera English", "description": "Brazil’s Amazonas state capital Manaus has become the epicentre in a country that already has more than 100,000 confirmed infections and over 7,000 deaths fr...", "url": "https://www.youtube.com/watch?v=9jYY67LVxKg", "urlToImage": "https://i.ytimg.com/vi/9jYY67LVxKg/maxresdefault.jpg", "publishedAt": "2020-05-05T07:09:18Z", "content": "Brazils Amazonas state capital Manaus has become the epicentre in a country that already has more than 100,000 confirmed infections and over 7,000 deaths from the coronavirus. \r\nManaus' hospitals and cemeteries are filling fast and its health system cannot co… [+350 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Key workers to trial NHS tracing app - BBC News", "description": "If the Isle of Wight trial is successful, the app could be ready nationwide within weeks, ministers say.", "url": "https://www.bbc.com/news/uk-52540068", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/2ED0/production/_112148911_hi061086198.jpg", "publishedAt": "2020-05-05T06:35:20Z", "content": "Image copyrightReutersImage caption\r\n Social distancing rules will still be in place during the trial, Health Secretary Matt Hancock said\r\nAn NHS app that aims to track the spread of coronavirus is being rolled out for the first time, as part of a trial on th… [+6294 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Denise Grady", "title": "A Coronavirus Vaccine Project Takes a Page From Gene Therapy - The New York Times", "description": "The technique aims to make a person’s cells churn out proteins that will stimulate the body to fight the coronavirus.", "url": "https://www.nytimes.com/2020/05/04/health/gene-therapy-harvard-coronavirus.html", "urlToImage": "https://static01.nyt.com/images/2020/05/04/science/04virus-genetherapy01/merlin_172185261_12649b52-1ede-40c1-800e-dd49a24c8a41-facebookJumbo.jpg", "publishedAt": "2020-05-05T06:17:18Z", "content": "Researchers at two Harvard-affiliated hospitals are adapting a proven form of gene therapy to develop a coronavirus vaccine, which they expect to test in people later this year, they announced on Monday.\r\nTheir work employs a method already used in gene thera… [+5862 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "Kansas adds 215 COVID-19 cases as cases rise around meatpacking plants, correctional facilities - India Gone Viral", "description": "Kansas adds 215 COVID-19 cases as cases rise around meatpacking plants, correctional facilities Hide Transcript Show Transcript BACK TO YOU IN THE STUDIO. ALL RIGHT, JOHNNY. THANK YOU. WILL CLAY COUNT", "url": "https://indiagoneviral.com/health/2020/05/05/kansas-adds-215-covid-19-cases-as-cases-rise-around-meatpacking-plants-correctional-facilities/51041/india-gone-viral/", "urlToImage": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/dailycasestwitter-kansas-without-a-source-05-04-2020-1588616288.jpg?crop=0.891xw:1.00xh;0.0556xw,0&resize=1200:*", "publishedAt": "2020-05-05T06:06:11Z", "content": "Kansas health officials continue to grapple with outbreaks of COVID-19 leading to surges of cases involving locations like meatpacking plants and prisons.The Kansas Department of Health and Environment reported an increase of 215 confirmed cases of COVID-19 o… [+4338 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "VIDEO: In Discussion of Newsom's Announcement Today, Sheriff and Public Health Officer Say Humboldt Should be Ready to Partially Reopen Friday - India Gone Viral", "description": "Hank Sims / Today @ 5:27 p.m. / COVID-19 and Humboldt VIDEO: In Discussion of Newsom’s Announcement Today, Sheriff and Public Health Officer Say Humboldt Should be Ready to Partially Reopen Friday ###", "url": "https://indiagoneviral.com/health/2020/05/05/video-in-discussion-of-newsoms-announcement-today-sheriff-and-public-health-officer-say-humboldt-should-be-ready-to-partially-reopen-friday/51045/india-gone-viral/", "urlToImage": "https://lostcoastoutpost.com/loco-media/cache/d9/81/d9814226d11ed8de09b6c4b8f24a6016.jpg", "publishedAt": "2020-05-05T06:05:53Z", "content": "###\r\nPREVIOUSLY:\r\n###\r\nThis afternoon, county public information officer Samantha Karges hosted a discussion with Public Health Officer Dr. Teresa Frankovich and Sheriff Billy Honsal on todays announcement by Gov. Gavin Newsom, which paves the way for local j… [+914 chars]"}, {"source": {"id": null, "name": "Pharmaceutical-technology.com"}, "author": "Divya Tirumalaraju", "title": "Researchers identify antibody with activity against SARS-CoV-2 in lab - Pharmaceutical Technology", "description": "Utrecht University, Erasmus Medical Center, Harbour BioMed have identified a fully human monoclonal antibody with activity against SARS-CoV-2.", "url": "https://www.pharmaceutical-technology.com/news/new-sars-cov-2-antibody/", "urlToImage": "https://www.pharmaceutical-technology.com/wp-content/uploads/sites/10/2020/05/corona_0505.jpg", "publishedAt": "2020-05-05T05:46:37Z", "content": "3D print of a SARS-CoV-2 - also known as 2019-nCoV, the virus that causes COVID-19 - virus particle. Credit: NIH.\r\nResearchers at Utrecht University and Erasmus Medical Center in the Netherlands, in alliance with China-based firm Harbour BioMed, have identifi… [+1851 chars]"}, {"source": {"id": null, "name": "Sfchronicle.com"}, "author": "Catherine Ho", "title": "Coronavirus testing in SF’s Mission District reveals spike among workers - San Francisco Chronicle", "description": "<p>Findings of UCSF’s testing in one Mission District neighborhood hint at a grim reality: As local economies begin to reopen, workers who can’t stay home will be at higher risk of falling ill than others.</p>", "url": "https://www.sfchronicle.com/bayarea/article/Coronavirus-testing-in-SF-s-Mission-district-15246512.php", "urlToImage": "https://s.hdnux.com/photos/01/11/62/16/19342263/15/rawImage.jpg", "publishedAt": "2020-05-05T04:41:05Z", "content": "Low-wage workers who are unable to work from home during shelter in place are at higher risk of contracting the coronavirus, according to preliminary results released Monday by UCSF, which conducted thousands of diagnostic tests in San Francisco’s Mission Dis… [+4209 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Calvin Woodward", "title": "Virus-afflicted 2020 looks like 1918 despite science's march - The Associated Press", "description": "WASHINGTON (AP) — Despite a century's progress in science, 2020 is looking a lot like 1918.  In the years between two lethal pandemics, one the misnamed Spanish flu, the other COVID-19, the...", "url": "https://apnews.com/6c45a08d3c2ea96e4edeb7e55a6a107e", "urlToImage": "https://storage.googleapis.com/afs-prod/media/aa93d995f294425eaff8b00d5b232d16/3000.jpeg", "publishedAt": "2020-05-05T04:40:30Z", "content": "WASHINGTON (AP) Despite a centurys progress in science, 2020 is looking a lot like 1918. \r\nIn the years between two lethal pandemics, one the misnamed Spanish flu, the other COVID-19, the world learned about viruses, cured various diseases, made effective vac… [+9799 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "David Aaro", "title": "Even after respiratory symptoms fade, coronavirus victims face danger - Fox News", "description": "Victims of the coronavirus are facing a new danger that may occur even after respiratory symptoms fade and infection from the virus clears.", "url": "https://www.foxnews.com/health/even-after-respiratory-symptoms-fade-coronavirus-victims-face-new-danger", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2020/05/AP20124427129602.jpg", "publishedAt": "2020-05-05T04:34:56Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox. Sign up here.\r\nCoronavirus victims are facing a new danger that may occur even after respiratory symptoms fade and infection from the virus clears.\r\nDoctors are beginning to notice… [+3210 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "Recent study illustrates how social distancing has saved Louisvillians during the pandemic - India Gone Viral", "description": "Recent study illustrates how social distancing has saved Louisvillians during the pandemic Researchers released a new study on Monday showing how social distancing has saved the lives of Louisvillians", "url": "https://indiagoneviral.com/health/2020/05/05/recent-study-illustrates-how-social-distancing-has-saved-louisvillians-during-the-pandemic/50954/india-gone-viral/", "urlToImage": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/biking-1588642874.jpg?crop=0.790xw:0.788xh;0.175xw,0&resize=1200:*", "publishedAt": "2020-05-05T04:04:28Z", "content": "Researchers released a new study on Monday showing how social distancing has saved the lives of Louisvillians.The study, Projecting the COVID-19 Weekly Deaths, Infections, and Hospitalizations for Jefferson County, Kentucky, was completed by the University of… [+2829 chars]"}, {"source": {"id": null, "name": "Cnycentral.com"}, "author": "Tony Black", "title": "More than 100 workers at Oneida farm test positive for coronavirus - CNYcentral.com", "description": "122 workers at Green Empire Farms in the City of Oneida tested positive for COVID-19 over the weekend. 52 of the cases are in Oneida County and County Executive Anthony Picente said they are not residents of the county. &ldquo;These are seasonal employees tha…", "url": "http://cnycentral.com/news/local/more-than-100-workers-at-oneida-farm-test-positive-for-coronavirus", "urlToImage": "http://static-13.sinclairstoryline.com/resources/media/3b2c8595-2e49-4f00-9efb-671f6b25d0ac-large16x9_farmsign.JPG?1588650468420", "publishedAt": "2020-05-05T03:52:07Z", "content": null}, {"source": {"id": null, "name": "Koco.com"}, "author": "Associated Press", "title": "At least 116 Oklahoma meat plant workers positive for coronavirus - KOCO Oklahoma City", "description": "At least 116 employees at an Oklahoma pork processing plant have tested positive for coronavirus, Seaboard Foods spokesman David Eahart said in a statement Monday.", "url": "https://www.koco.com/article/at-least-116-oklahoma-meat-plant-workers-positive-for-virus/32371093", "urlToImage": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/ap-197881902479.png?crop=1.00xw:1.00xh;0,0&resize=1200:*", "publishedAt": "2020-05-05T03:18:08Z", "content": "GUYMON, Okla. —At least 116 employees at an Oklahoma pork processing plant have tested positive for coronavirus, Seaboard Foods spokesman David Eahart said in a statement Monday.\r\nThe plant in Guymon has about 2,700 employees who are advised to stay home if s… [+1035 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Harry Howard For Mailonline", "title": "Scientists identify microbe that stops mosquitoes catching or spreading malaria - Daily Mail", "description": "The malaria-blocking bug, Microsporidia MB, was found by University of Glasgow scientists in the gut and genitals of mosquitoes living on the shores of Lake Victoria in Kenya.", "url": "https://www.dailymail.co.uk/health/article-8286945/Scientists-identify-microbe-stops-mosquitoes-catching-spreading-malaria.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/05/05/02/28008582-0-image-a-40_1588640415937.jpg", "publishedAt": "2020-05-05T02:13:14Z", "content": "Scientists have discovered a bug which lives inside the guts of mosquitoes and protects them from getting malaria.\r\nResearchers said the microbe, which lives in around 5 per cent of mosquitoes on the shores of Lake Victoria in Kenya, could also stop the insec… [+5569 chars]"}, {"source": {"id": null, "name": "Myfox8.com"}, "author": "Olivia Steen", "title": "Hundreds of Tyson Foods employees screened for COVID-19 after Wilkes County outbreak - WGHP FOX 8 Greensboro", "description": "WILKES COUNTY, N.C. — A major coronavirus battle is ramping up in Wilkes County. The Wilkes County Health Department screened 200 employees who work at the Tyson Foods Processing Plant, a pla…", "url": "https://myfox8.com/news/hundreds-of-tyson-foods-employees-screened-for-covid-19-after-wilkes-county-outbreak/", "urlToImage": "https://myfox8.com/wp-content/uploads/sites/17/2020/05/testing.jpeg?w=1280&h=720&crop=1", "publishedAt": "2020-05-05T01:54:59Z", "content": "WILKES COUNTY, N.C. — A major coronavirus battle is ramping up in Wilkes County.\r\nThe Wilkes County Health Department screened 200 employees who work at the Tyson Foods Processing Plant, a place that employs more than a thousand people in Wilkesboro.\r\nThe hea… [+1646 chars]"}, {"source": {"id": null, "name": "Newsinfopark.com"}, "author": "NIP Web Desk Team", "title": "Linn County Public Health identifies COVID-19 outbreak at Cottage Grove, some others seeing improvement - News Info Park", "description": "By KCRG News Staff&nbsp|&nbsp Posted: Mon 4:30 PM, May 04, 2020 &nbsp|&nbsp Updated: Mon 5:57 PM, May 04, 2020 CEDAR RAPIDS, Iowa (KCRG) - Public health officials in Linn County have identified the si", "url": "https://newsinfopark.com/health/2020-05-04/article/linn-county-public-health-identifies-covid-19-outbreak-at-cottage-grove-some-others-seeing-improvement-28829/nip-web-desk-team/", "urlToImage": "https://media.graytvinc.com/images/690*388/heather-meador-briefing-5-4.jpg", "publishedAt": "2020-05-04T23:23:55Z", "content": "CEDAR RAPIDS, Iowa (KCRG) – Public health officials in Linn County have identified the site of an outbreak of the illness caused by the novel coronavirus, the fifth such occurrence in the county since the pandemic began.\r\nHeather Meador, right, from Linn Coun… [+1932 chars]"}, {"source": {"id": null, "name": "Kgw.com"}, "author": null, "title": "How will Oregon's 100000-volunteer contact tracing system work? - KGW.com", "description": "The program, which may be the first of its kind in the U.S., will require volunteers to take their temperature every day for a year and report it to researchers.", "url": "https://www.kgw.com/article/news/health/coronavirus/oregons-100000-volunteer-contact-tracing-system/283-7f657aa6-fac7-40c4-b68d-f1e3f19c728d", "urlToImage": "https://media.kgw.com/assets/KGW/images/555d500a-7fc2-4b15-85b3-0ea58b37c526/555d500a-7fc2-4b15-85b3-0ea58b37c526_1140x641.jpg", "publishedAt": "2020-05-04T22:46:00Z", "content": "PORTLAND, Ore. Public health researchers in Oregon are preparing to launch something weve never seen on this scale.\r\nThey want to gather volunteers in every corner of the state, from every community, especially minority populations, and convince them to take … [+2954 chars]"}, {"source": {"id": null, "name": "Clickondetroit.com"}, "author": "Frank McGeorge, MD, Derick Hutchinson", "title": "Don’t ignore other health issues while trying to stay safe from coronavirus (COVID-19) - WDIV ClickOnDetroit", "description": "Melanoma Monday is an annual event designed to raise awareness of the most deadly form of skin cancer, and while the coronavirus (COVID-19) is clearly top of mind in terms of current health risks, experts say it’s important not to ignore other issues.", "url": "https://www.clickondetroit.com/health/good-health/2020/05/04/dont-ignore-other-health-issues-while-trying-to-stay-safe-from-coronavirus-covid-19/", "urlToImage": "https://www.clickondetroit.com/resizer/IoeXr-3pOyP7bnt7IDFsgscjkI0=/1600x900/smart/filters:format(jpeg):strip_exif(true):strip_icc(true):no_upscale(true):quality(65)/d1vhqlrjc8h82r.cloudfront.net/05-04-2020/t_9f426ffe6852451e833832c97a39455f_name_image.jpg", "publishedAt": "2020-05-04T22:43:20Z", "content": "DETROIT Melanoma Monday is an annual event designed to raise awareness of the most deadly form of skin cancer, and while the coronavirus (COVID-19) is clearly top of mind in terms of current health risks, experts say its important not to ignore other issues.\r… [+2142 chars]"}, {"source": {"id": null, "name": "Nbcdfw.com"}, "author": "Frank Heinz", "title": "Tarrant County Confirms 2 COVID-19 Deaths in Fort Worth, Benbrook Monday, 40 More Cases - NBC 5 Dallas-Fort Worth", "description": "Tarrant County Public Health officials confirm Monday two more deaths of people infected with the COVID-19 virus and an additional 40 positive cases in the…", "url": "https://www.nbcdfw.com/news/coronavirus/tarrant-county-confirms-2-covid-19-deaths-in-fort-worth-benbrook-monday/2363013/", "urlToImage": "https://media.nbcdfw.com/2019/09/tarrant-county-seal.jpg?resize=1200%2C675", "publishedAt": "2020-05-04T22:32:47Z", "content": "Tarrant County Public Health officials confirm Monday two more deaths of people infected with the COVID-19 virus and an additional 40 positive cases in the county.\r\nThe deceased include a man in his 80s from Benbrook and a man in his 60s from Fort Worth. Both… [+680 chars]"}, {"source": {"id": null, "name": "Kgw.com"}, "author": null, "title": "At least 13 workers at Oregon seafood processing plant test positive for COVID-19 - KGW.com", "description": "Bornstein Seafood’s entire workforce is being tested for the virus while its Astoria facilities are shut down.", "url": "https://www.kgw.com/article/news/health/coronavirus/workers-positive-covid-19-astoria-bornstein-seafood-processing-plant/283-0001d0ba-9fa4-443a-9de1-9123784984fb", "urlToImage": "https://media.kgw.com/assets/KGW/images/33380208-3270-47da-b154-765cfb0e8a85/33380208-3270-47da-b154-765cfb0e8a85_1140x641.jpg", "publishedAt": "2020-05-04T22:22:00Z", "content": "ASTORIA, Ore. An Oregon seafood company has closed its facilities in Astoria after at least 13 workers tested positive for COVID-19.\r\nThirty-five Bornstein Seafood employees were tested for COVID-19 on Saturday after showing symptoms of the coronavirus, accor… [+1067 chars]"}, {"source": {"id": null, "name": "Umn.edu"}, "author": null, "title": "COVID-19 deaths deemed likely to climb even as states reopen - CIDRAP", "description": "Leaked White House documents say deaths will climb to 3,000 a day by Jun 1.", "url": "https://www.cidrap.umn.edu/news-perspective/2020/05/covid-19-deaths-deemed-likely-climb-even-states-reopen", "urlToImage": "https://www.cidrap.umn.edu/sites/default/files/public/styles/thumbnail/public/images/news/couple_wearing_masks-elvert_barnes.jpg?itok=qW4UDkQq", "publishedAt": "2020-05-04T22:20:19Z", "content": "Over the weekend and through today, dozens of states reopened parts of their economy, many with extensive social distancing measures in place. But new leaked documents from the White House show that the US daily death toll from COVID-19 will likely climb thro… [+4145 chars]"}, {"source": {"id": null, "name": "Timesofisrael.com"}, "author": null, "title": "Defense minister claims Israel's biological institute developed virus vaccine - The Times of Israel", "description": "Naftali Bennett hails 'amazing achievement'; his office says shadowy defense research facility moving to patent treatment, approaching international companies to mass produce it", "url": "https://www.timesofisrael.com/defense-minister-claims-israels-biological-institute-developed-virus-vaccine/", "urlToImage": "https://static.timesofisrael.com/www/uploads/2020/05/F181106DC80-1024x640.jpg", "publishedAt": "2020-05-04T22:10:16Z", "content": "Defense Minister Naftali Bennett on Monday said he witnessed a “significant breakthrough” by Israel’s defense biological research institute in developing an antibody to COVID-19, as the researchers wrapped up the development phase and moved to patent and mass… [+4257 chars]"}, {"source": {"id": null, "name": "Medscape.com"}, "author": null, "title": "On COVID-19, a Respected Science Watchdog Raises Eyebrows - Medscape", "description": "For his COVID-19 work, the Stanford scientist John Ioannidis is being accused of the same bad science he has criticized.", "url": "https://www.medscape.com/viewarticle/929920", "urlToImage": "https://img.medscape.com/thumbnail_library/flk_200504_john_pa_loannidis_800x450.jpg", "publishedAt": "2020-05-04T21:22:45Z", "content": "Editor's note: Find the latest COVID-19 news and guidance in Medscape's Coronavirus Resource Center.\r\nOver the past two decades, John Ioannidis, a professor of medicine, epidemiology, and population health at Stanford University, has gained a reputation as a … [+17017 chars]"}, {"source": {"id": null, "name": "Glamour.com"}, "author": "Jenny Singer", "title": "Sunscreen Indoors: Why You Should Still Wear It in Quarantine - Glamour", "description": "Should you wear sunscreen indoors? The answer is a resounding yes. But it doesn't have to suck. Here's why.", "url": "https://www.glamour.com/story/should-i-wear-sunscreen-indoors", "urlToImage": "https://media.glamour.com/photos/5eb081e79ac89044e05d9723/16:9/w_1280,c_limit/lede_social.jpg", "publishedAt": "2020-05-04T21:18:47Z", "content": "I actually think I get more sun at home, says Alicia Yoon, founder of Korean beauty brand Peach &amp; Lily. And unless youre spending the entire day at home in a windowless room or behind UV-blocking blackout curtains, she says, your skin is at risk of sun da… [+2672 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Coronavirus cases in SC reach 6,757. Eight more people dead, DHEC says - The State", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiP2h0dHBzOi8vd3d3LnRoZXN0YXRlLmNvbS9uZXdzL2Nvcm9uYXZpcnVzL2FydGljbGUyNDI0ODM5MDEuaHRtbNIBP2h0dHBzOi8vYW1wLnRoZXN0YXRlLmNvbS9uZXdzL2Nvcm9uYXZpcnVzL2FydGljbGUyNDI0ODM5MDEuaHRtbA?oc=5", "urlToImage": null, "publishedAt": "2020-05-04T20:59:35Z", "content": null}, {"source": {"id": null, "name": "Union-bulletin.com"}, "author": "SHEILA HAGAR of the Walla Walla Union-Bulletin", "title": "'COVID parties' hurt everyone | Coronavirus - Walla Walla Union-Bulletin", "description": "People who are intentionally flouting health recommendations by exposing themselves and others to COVID-19 are going to push reopening things here back, Walla Walla County health officials said today.", "url": "https://www.union-bulletin.com/news/health_fitness/coronavirus/covid-parties-hurt-everyone/article_71f95001-a936-5098-8973-65d20b212c31.html", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/union-bulletin.com/content/tncms/assets/v3/editorial/a/54/a541d72b-df80-55ef-9d72-7f62f38d1837/5eb07ae0ebbff.image.png?resize=812%2C522", "publishedAt": "2020-05-04T20:35:57Z", "content": "People who are intentionally flouting health recommendations by exposing themselves and others to COVID-19 are going to push reopening things here back, Walla Walla County health officials said today.\r\nWith todays count, there are now 94 residents, including … [+3623 chars]"}, {"source": {"id": null, "name": "Kmaland.com"}, "author": "Mike Peterson", "title": "Two more Mills County coronavirus cases confirmed | News - KMAland", "description": "(Glenwood) -- The number of coronvirus cases in Mills County continues to grow.", "url": "http://www.kmaland.com/news/two-more-mills-county-coronavirus-cases-confirmed/article_9706dc7a-8e45-11ea-9ad2-87e6bdf99681.html", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/kmaland.com/content/tncms/assets/v3/editorial/9/67/9671c590-7298-11ea-ae97-4be8caae6f4a/5e820bef2c769.image.jpg?resize=945%2C630", "publishedAt": "2020-05-04T20:26:00Z", "content": "(Glenwood) -- The number of coronvirus cases in Mills County continues to grow.\r\nMills County Public Health officials say they were notified Monday of two additional novel coronavirus cases in Mills County.This brings the total number of confirmed positive CO… [+926 chars]"}, {"source": {"id": null, "name": "Timesheraldonline.com"}, "author": "John Glidden", "title": "Almost 100 infected with COVID-19 at Windsor care facility in Vallejo - Vallejo Times-Herald", "description": "Nearly 100 individuals have been infected at the Windsor Vallejo Nursing & Rehabilitation Center with COVID-19, Solano County Public Health Administrator Jayleen Richards confirmed to the Times…", "url": "https://www.timesheraldonline.com/almost-100-infected-with-covid-19-at-windsor-care-facility-in-vallejo", "urlToImage": "https://www.timesheraldonline.com/wp-content/uploads/2020/05/WINDSOR-1.jpg?w=1024&h=710", "publishedAt": "2020-05-04T20:20:28Z", "content": "Nearly 100 individuals have been infected at the Windsor Vallejo Nursing &amp; Rehabilitation Center with COVID-19, Solano County Public Health Administrator Jayleen Richards confirmed to the Times-Herald on Monday.\r\nRichards said 76 residents and 23 health c… [+2001 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Bruce Y. Lee", "title": "Treating coronavirus will cost us billions — and guess who will pay - MarketWatch", "description": "The median cost of a coronavirus hospitalization is $14,366", "url": "https://www.marketwatch.com/story/treating-coronavirus-will-cost-us-billions-and-guess-who-will-pay-2020-05-04", "urlToImage": "https://s.marketwatch.com/public/resources/images/MW-ID206_ny_hos_ZG_20200327061518.jpg", "publishedAt": "2020-05-04T20:13:47Z", "content": "As states push to reopen businesses, arguing their economies are losing too much money under current coronavirus precautions, they cant ignore the other side of the economic equation the one involving human lives and potentially hundreds of billions of dollar… [+6654 chars]"}, {"source": {"id": null, "name": "Abc15.com"}, "author": "https://www.abc15.com/about-us/staff/abc15-com-staff", "title": "Yavapai County reports new 'cluster' of COVID-19 cases at Prescott Valley all-girls school - ABC15 Arizona", "description": "Yavapai County health officials announced Monday that the county now has 128 confirmed COVID-19 cases -- 35 more than since the last time the county reported, and after testing was completed at an area school.", "url": "https://www.abc15.com/news/region-northern-az/prescott/yavapai-county-reports-new-cluster-of-covid-19-cases-at-prescott-valley-all-girls-school", "urlToImage": "https://ewscripps.brightspotcdn.com/dims4/default/dd16a5e/2147483647/strip/true/crop/480x252+0+54/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2Fe5%2Fc8%2Fe06be330431c97b6478890c548b5%2Fcorona-virus-header-480x360.jpg", "publishedAt": "2020-05-04T20:03:00Z", "content": "PRESCOTT VALLEY, AZ Yavapai County health officials announced Monday that the county now has 128 confirmed COVID-19 cases -- 35 more than since the last time the county reported, and after testing was completed at an area school.\r\nFULL COVERAGE: Coronavirus i… [+2436 chars]"}, {"source": {"id": null, "name": "Nbc15.com"}, "author": "Nick Viviani", "title": "Only one new COVID-19 death reported in Wisconsin in the past day - WMTV", "description": "That latest death, which occurred in Racine County, brings the statewide total to 340, new Department of Health Services’ numbers show.", "url": "https://www.nbc15.com/content/news/Only-one-new-COVID-19-death-reported-in-Wisconsin-in-the-past-day-570180241.html", "urlToImage": "https://media.graytvinc.com/images/AP_1203092045802.png", "publishedAt": "2020-05-04T19:15:38Z", "content": "MADISON, Wis. (WMTV) -- Only one new COVID-19 death was reported in Wisconsin over the past day. That latest death, which occurred in Racine County, brings the statewide total to 340, new Department of Health Services numbers show. \r\nAlso, for the first time … [+987 chars]"}, {"source": {"id": null, "name": "Phys.org"}, "author": "Science X staff", "title": "Intensive farming increases risk of epidemics, warn scientists - Phys.org", "description": "Overuse of antibiotics, high animal numbers and low genetic diversity caused by intensive farming techniques increase the likelihood of pathogens becoming a major public health risk, according to new research led by UK scientists.", "url": "https://phys.org/news/2020-05-intensive-farming-epidemics-scientists.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/intensivefar.jpg", "publishedAt": "2020-05-04T19:11:34Z", "content": "Overuse of antibiotics, high animal numbers and low genetic diversity caused by intensive farming techniques increase the likelihood of pathogens becoming a major public health risk, according to new research led by UK scientists.\r\nAn international team of re… [+3589 chars]"}, {"source": {"id": null, "name": "Columbian.com"}, "author": null, "title": "Clark County adds six COVID-19 cases over weekend - The Columbian", "description": "Clark County Public Health confirmed six new COVID-19 cases and no new deaths Monday morning.", "url": "https://www.columbian.com/news/2020/may/04/county-adds-six-covid-19-cases-over-weekend/", "urlToImage": "https://pcdn.columbian.com/wp-content/uploads/2020/02/China_Outbreak_Science_Says_10815.jpg-b165f.jpg", "publishedAt": "2020-05-04T18:51:17Z", "content": "Clark County Public Health confirmed six new COVID-19 cases and no new deaths Monday morning.\r\nSince Public Health does not report new cases on Saturday and Sunday, the six cases are results from over the weekend.\r\nClark County now has 367 confirmed cases and… [+615 chars]"}, {"source": {"id": null, "name": "News-gazette.com"}, "author": "Debra Pressey", "title": "NEW: Monday's coronavirus updates | 32 cases linked to Rantoul Foods outbreak; Park district tennis courts, dog parks to reopen Tuesday - Champaign/Urbana News-Gazette", "description": "There are now 32 confirmed cases among Rantoul Foods employees, local health officials say. The number of total cases in Rantoul also stands at 32, but not all Rantoul Foods", "url": "https://www.news-gazette.com/coronavirus/new-mondays-coronavirus-updates-32-cases-linked-to-rantoul-foods-outbreak-park-district-tennis-courts/article_0f6756c0-8e34-11ea-bdb1-1bcef57d68fb.html", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/news-gazette.com/content/tncms/assets/v3/editorial/0/f6/0f6756c0-8e34-11ea-bdb1-1bcef57d68fb/5eb06bb90d7ef.preview.jpg?resize=829%2C630", "publishedAt": "2020-05-04T18:28:00Z", "content": "Subscribe:Print or online\r\nNews-Gazette covers:How the crisis has played out on A-1\r\nFor 24/7 coverage, follow us on Twitter, Snapchat, Instagram and Facebook.\r\nChampaign County Health District: COVID-19 information\r\nState map: COVID-19 cases by county\r\nHave … [+4932 chars]"}, {"source": {"id": null, "name": "Billboard.com"}, "author": "Anna Chan", "title": "Musicians Who Have Opened Up About Their Mental Health Struggles - Billboard", "description": "", "url": "https://www.billboard.com/articles/news/9367924/musicians-mental-health-struggles", "urlToImage": "https://static.billboard.com/files/2020/05/Mental-Health-Collage-2020-billboard-1548-1588612707-1024x677.jpg", "publishedAt": "2020-05-04T18:06:31Z", "content": "For too long, many people have silently battled mental health issues, putting on a happy face for the rest of the world -- including musicians.\r\nBut things have been changing. In recent years various artists have spoken out in the hopes of destigmatizing ever… [+23547 chars]"}, {"source": {"id": "the-next-web", "name": "The Next Web"}, "author": "Thomas Macaulay", "title": "This stick-on sensor detects coronavirus symptoms by monitoring chest vibrations - The Next Web", "description": "A new wearable that sticks to the throat could detect coronavirus symptoms before you notice them. The stamp-sized device is made of soft silicone material, which is affixed to the base of the throat. It then monitors coughs, breathing, heart rate, and body t…", "url": "https://thenextweb.com/neural/2020/05/04/this-stick-on-sensor-detects-coronavirus-symptoms-by-monitoring-chest-vibrations/", "urlToImage": "https://img-cdn.tnwcdn.com/image/neural?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2020%2F05%2FUntitled-design-24.png&signature=c0eb5967728b66b362f29f50926b1389", "publishedAt": "2020-05-04T18:05:17Z", "content": "A new wearable that sticks to the throat could detect coronavirus symptoms before you notice them.\r\nThe stamp-sized device is made of soft silicone material, which is affixed to the base of the throat. It then monitors coughs, breathing, heart rate, and body … [+2100 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "Germany’s actual Covid-19 cases could be TEN TIMES higher than officially confirmed number – study - RT", "description": "The number of Covid-19 infections across Germany could be 10 times higher than official numbers show, researchers have concluded after conducting a study in one of the country’s hardest-hit towns.", "url": "https://www.rt.com/news/487733-germany-covid19-ten-times-cases/", "urlToImage": "https://cdni.rt.com/files/2020.05/article/5eb0370585f5402b887e7bac.jpg", "publishedAt": "2020-05-04T17:45:05Z", "content": "Researchers from the University of Bonn say that while the official count is around 160,000 cases nationwide, in reality about 1.8 million people in the country could be infected – with many people being asymptomatic and others having symptoms so mild that th… [+1696 chars]"}, {"source": {"id": null, "name": "Theactivetimes.com"}, "author": null, "title": "How to wash your clothes if you've been exposed to coronavirus - msnNOW", "description": "If you think you’ve been exposed to the virus or you’re living with someone who has it, these are the must-take steps for washing your clothes.", "url": "https://www.theactivetimes.com/home/wash-clothes-coronavirus-laundry", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/BB13Aj2a.img?h=630&w=1200&m=6&q=60&o=t&l=f&f=jpg&x=823&y=614", "publishedAt": "2020-05-04T17:45:00Z", "content": "Due to the coronavirus, which has spread rapidly through multiple countries around the world including the United States, people not considered essential workers have been self-quarantining and social distancing. But, if you think youve been exposed to the vi… [+3158 chars]"}, {"source": {"id": null, "name": "Kwtx.com"}, "author": "Staff", "title": "Nearly 900 COVID-19 deaths reported in Texas; area toll holds steady - KWTX", "description": "Nearly 900 people have died of the new coronavirus in Texas, according to figures released Monday.", "url": "https://www.kwtx.com/content/news/Nearly-900-COVID-19-deaths-reported-in-Texas-area-toll-holds-steady-570177541.html", "urlToImage": "https://media.graytvinc.com/images/covid+testing.jpg", "publishedAt": "2020-05-04T17:30:52Z", "content": "(KWTX) More than 32,300 COVID-19 cases have been confirmed in Texas and 884 people diagnosed with the virus have died, according to figures released Monday.\r\nThe new coronavirus has claimed 14 lives in Central Texas including three in Bell County, two in Cory… [+4295 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Mysterious ‘happy hypoxics’: What doctors know about the latest coronavirus condition - Miami Herald", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiQmh0dHBzOi8vd3d3Lm1pYW1paGVyYWxkLmNvbS9uZXdzL2Nvcm9uYXZpcnVzL2FydGljbGUyNDI0ODE5NTEuaHRtbNIBQmh0dHBzOi8vYW1wLm1pYW1paGVyYWxkLmNvbS9uZXdzL2Nvcm9uYXZpcnVzL2FydGljbGUyNDI0ODE5NTEuaHRtbA?oc=5", "urlToImage": null, "publishedAt": "2020-05-04T16:10:49Z", "content": null}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Scientists Create Antibody That Defeats Coronavirus in Lab - Bloomberg", "description": null, "url": "https://www.bloomberg.com/tosv2.html?vid=&uuid=a6d489f0-8ed0-11ea-8a6f-d7402c6a67be&url=L25ld3MvYXJ0aWNsZXMvMjAyMC0wNS0wNC9zY2llbnRpc3RzLWNyZWF0ZS1hbnRpYm9keS10aGF0LWRlZmVhdHMtY29yb25hdmlydXMtaW4tbGFi", "urlToImage": null, "publishedAt": "2020-05-04T16:03:50Z", "content": "To continue, please click the box below to let us know you're not a robot."}, {"source": {"id": null, "name": "Kdvr.com"}, "author": "Nexstar", "title": "Virtual town halls on unemployment in Colorado will be held Monday, here’s what you need to know - FOX 31 Denver", "description": "COLORADO SPRINGS (KXRM) –  On Monday, May 4, the Colorado Department of Labor and Employment (CDLE) will hold two unemployment virtual town halls to provide updates and information on Colorado’s un…", "url": "https://kdvr.com/news/coronavirus/virtual-town-halls-on-unemployment-in-colorado-will-be-held-monday-heres-what-you-need-to-know/", "urlToImage": "https://kdvr.com/wp-content/uploads/sites/11/2020/05/640x360_50918b00-qcbok-2_27863809_ver1.0.jpg?w=640&h=360&crop=1&resize=1280,720", "publishedAt": "2020-05-04T14:12:06Z", "content": "ATLANTA (AP) As girls, Nadia Williams and her sister spent countless hours imagining their weddings. Now 30, Williams helped her younger sibling plan her big day, but when it came on Friday, she couldn't be at her side as maid of honor. Instead, she put on a … [+542 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Brian Cooley", "title": "Coronavirus sensor you stick at the top of your chest can track symptoms - CNET", "description": "The device senses the nature, duration and time of coughs, checking for the onset and progression of COVID-19.", "url": "https://www.cnet.com/health/new-sensor-you-stick-on-your-chest-can-detect-covid-19/", "urlToImage": "https://cnet4.cbsistatic.com/img/ZDRiW1zrlJHj6PtOzSoxlnNiQR0=/2020/05/02/b92ddae0-7e20-43db-928b-4782498a8600/vlcsnap-2020-05-01-18h06m46s606.png", "publishedAt": "2020-05-04T14:03:53Z", "content": "Northwestern University\r\nFor the most up-to-date news and information about the coronavirus pandemic, visit the WHO website.\r\nIt looks like a Band-Aid, but it's a flexible wireless sensor that sits where your throat and chest meet, picking up coughing and bre… [+3956 chars]"}, {"source": {"id": null, "name": "Clickondetroit.com"}, "author": "Derick Hutchinson", "title": "Oakland County opens new coronavirus (COVID-19) drive-thru testing site in Novi - WDIV ClickOnDetroit", "description": "Oakland County officials are set to open a new coronavirus (COVID-19) drive-thru testing site in Novi.", "url": "https://www.clickondetroit.com/news/local/2020/05/04/oakland-county-opens-new-coronavirus-covid-19-drive-thru-testing-site-in-novi/", "urlToImage": "https://www.clickondetroit.com/resizer/UaeDJ9CcQ6-933klxUiK1pxHUX8=/1280x720/smart/filters:format(jpeg):strip_exif(true):strip_icc(true):no_upscale(true):quality(65)/arc-anglerfish-arc2-prod-gmg.s3.amazonaws.com/public/QLPG76PWB5HSPMR7K2FUISYOIA.png", "publishedAt": "2020-05-04T13:43:48Z", "content": "NOVI, Mich. Oakland County officials are set to open a new coronavirus (COVID-19) drive-thru testing site in Novi.\r\nStarting May 8, Honor Community Health will offer testing from 9 a.m. to 5 p.m. Fridays at the Novi Civic Center at 45175 west 10 Mile Road, of… [+1285 chars]"}, {"source": {"id": null, "name": "Latimes.com"}, "author": "Julia Wick", "title": "Essential California: Orange County vs. Gov. Newsom - Los Angeles Times", "description": "Surfers ignored barriers and protesters confronted police on Orange County beaches over the weekend.", "url": "https://www.latimes.com/california/newsletter/2020-05-04/newsom-orange-county-beaches-newsletter-essential-california", "urlToImage": "https://ca-times.brightspotcdn.com/dims4/default/821c17e/2147483647/strip/true/crop/4800x2520+0+334/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F48%2Fd9%2Fc51f3b264bf0a83512d8d268d85c%2Fla-photos-1staff-534559-beach-activity-huntington018-ls.jpg", "publishedAt": "2020-05-04T12:30:00Z", "content": "Good morning, and welcome to the Essential California newsletter\r\n. Its Monday, May 4, and heres a quick look at the week ahead:\r\nThe stories shaping California\r\nGet up to speed with our Essential California newsletter, sent six days a week.\r\nYou may occasion… [+7217 chars]"}, {"source": {"id": null, "name": "Nih.gov"}, "author": null, "title": "Study to determine incidence of novel coronavirus infection in U.S. children begins - National Institutes of Health", "description": "NIH-funded study also will ascertain percentage of infected children who develop COVID-19.", "url": "https://www.nih.gov/news-events/news-releases/study-determine-incidence-novel-coronavirus-infection-us-children-begins", "urlToImage": "https://www.nih.gov/sites/default/files/news-events/news-releases/2020/20200504-covid.jpg", "publishedAt": "2020-05-04T12:29:58Z", "content": null}, {"source": {"id": null, "name": "Click2houston.com"}, "author": "Haley Hernandez", "title": "Why dentists can charge you more for new safety standards - KPRC Click2Houston", "description": "Dental offices can reopen for non-emergency patients again but don’t expect the appointment or prices to be the same.", "url": "https://www.click2houston.com/health/2020/05/04/why-dentists-can-charge-you-more-for-new-safety-standards/", "urlToImage": "https://www.click2houston.com/resizer/UlmglzVkNIUKwTjypro2cMWi6R4=/1600x900/smart/filters:format(jpeg):strip_exif(true):strip_icc(true):no_upscale(true):quality(65)/d1vhqlrjc8h82r.cloudfront.net/05-04-2020/t_ac93c9fdc497456e9d9b5922a6120768_name_image.jpg", "publishedAt": "2020-05-04T12:04:42Z", "content": "HOUSTON Dental offices can reopen for non-emergency patients again but dont expect the appointment or prices to be the same.\r\nYou might be asked to wait in your car before your appointment or have your temperature taken and the appointment will probably take … [+2106 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Catriona Harvey-Jenner", "title": "Doctors think certain rashes could be linked to coronavirus - Yahoo Lifestyle", "description": "There are five rashes that have been associated with the virus.", "url": "https://www.yahoo.com/lifestyle/doctors-think-certain-rashes-could-114800819.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/_u9pDlBeuNf6oxdm.sZIGw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD02NDMuMg--/https://s.yimg.com/uu/api/res/1.2/8TSxEAcVrNNp5EM_9K1Csg--~B/aD03MjM7dz0xNDQwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/cosmo_633/3fc741b21947f78a3f46487bb7a02032", "publishedAt": "2020-05-04T11:48:00Z", "content": "Photo credit: the_burtons - Getty Images\r\nFrom Cosmopolitan\r\nBy now, we're pretty hot on what the key coronavirus symptoms are. If you've got a persistent cough and/or a fever, as well as shortness of breath, government advice is to isolate along with your wh… [+4001 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "CORONAVIRUS: Doctors Are Seeing A Condition Called COVID Toe - What It It? - KPIX CBS SF Bay Area", "description": "Doctors Are Seeing A Condition Called COVID Toe - What It It?", "url": "https://www.youtube.com/watch?v=rc_r9u22v4g", "urlToImage": "https://i.ytimg.com/vi/rc_r9u22v4g/maxresdefault.jpg", "publishedAt": "2020-05-04T11:40:37Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Coronavirus live updates: Here’s what to know in South Carolina on May 4 - The State", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiP2h0dHBzOi8vd3d3LnRoZXN0YXRlLmNvbS9uZXdzL2Nvcm9uYXZpcnVzL2FydGljbGUyNDI0NzM5MDEuaHRtbNIBP2h0dHBzOi8vYW1wLnRoZXN0YXRlLmNvbS9uZXdzL2Nvcm9uYXZpcnVzL2FydGljbGUyNDI0NzM5MDEuaHRtbA?oc=5", "urlToImage": null, "publishedAt": "2020-05-04T11:38:44Z", "content": null}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Julianna Tatelbaum", "title": "Pharma giants granted coronavirus approvals but doubts remain on manufacturing a global vaccine - CNBC", "description": "Experts warn that vaccine timelines look ambitious and argue more thought is needed on manufacturing.", "url": "https://www.cnbc.com/2020/05/04/coronavirus-drug-approvals-but-doubts-remain-on-manufacturing-vaccine.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/105352818-1532545560549gettyimages-137327466.jpeg?v=1588577492", "publishedAt": "2020-05-04T11:26:35Z", "content": "There were several major developments over the last week with the medical community marking progress in all three critical areas: testing, treatments and vaccines.\r\nExperts have welcomed positive data on potential treatments and progress on testing, but warn … [+5470 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: A hunt for the 'missing link' host species - BBC News", "description": "The identity of the \"intermediate host\" animal that first passed the coronavirus to a human may never be found, say scientists.", "url": "https://www.bbc.co.uk/news/science-environment-52529830", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/09A8/production/_111827420_hi059295836.jpg", "publishedAt": "2020-05-04T11:11:59Z", "content": "Image copyrightReutersImage caption\r\n A number of early cases in the pandemic were linked to the Wuhan Seafood Market\r\nIt was a matter of \"when not if\" an animal passed the coronavirus from wild bats to humans, scientists say. \r\nBut it remains unclear whether… [+6602 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Coronavirus: what risks do people with kidney disease face? - Yahoo News", "description": null, "url": "https://consent.yahoo.com/collectConsent?sessionId=1_cc-session_daab6d66-a544-4048-bda8-7c72a2f49501&lang=en-GB&inline=false", "urlToImage": null, "publishedAt": "2020-05-04T11:04:00Z", "content": "Yahoo is part of Verizon Media. Click 'I agree' to allow Verizon Media and our partners to use cookies and similar technologies to access your device and use your data (including location) to understand your interests, and provide and measure personalised ads… [+344 chars]"}, {"source": {"id": null, "name": "Khou.com"}, "author": "KHOU 11 Staff", "title": "Coronavirus updates: China hid virus' severity to hoard supplies, Homeland Security report says - KHOU.com", "description": "Here are the latest headlines on COVID-19 in Houston, nationally and around the world.", "url": "https://www.khou.com/article/news/health/coronavirus/coronavirus-updates-for-houston-texas-may-4/285-cde4c869-4ae7-45d0-bf50-d7dc89f3320c", "urlToImage": "https://media.khou.com/assets/WUSA/images/756b124c-add4-4477-95e0-1ec1db31c684/756b124c-add4-4477-95e0-1ec1db31c684_1140x641.jpg", "publishedAt": "2020-05-04T10:57:00Z", "content": "HOUSTON We are continuing to track the latest headlines and updates regarding the global coronavirus (COVID-19) pandemic. \r\nU.S. officials believe China covered up the extent of the coronavirus outbreak. Get the latest updates and top headlines in our live bl… [+13042 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Bruce Haring", "title": "Los Angeles County Coronavirus Deaths, Cases Continue To Climb, Representing Half Of California’s Total - Deadline", "description": "The Los Angeles County Department of Health has confirmed 21 new deaths related to COVID-19 and 781 new cases of the disease in the county. Overall, there are now 25,662 total cases across all areas of LA County and a total of 1,229 deaths. For this weekend a…", "url": "https://deadline.com/2020/05/los-angeles-county-coronavirus-deaths-cases-1202924639/", "urlToImage": "https://pmcdeadline2.files.wordpress.com/2020/04/los-angeles-coronavirus-2.jpg?w=1024", "publishedAt": "2020-05-03T22:05:13Z", "content": null}, {"source": {"id": null, "name": "Kgw.com"}, "author": null, "title": "No new COVID-19 deaths reported in Oregon - KGW.com", "description": "The Oregon Health Authority announced 45 new cases on Sunday, bringing the total of known positive cases to 2,680. The state's death toll remains at 109.", "url": "https://www.kgw.com/article/news/health/coronavirus/no-new-covid-19-deaths-reported-in-oregon-may-3-2020/283-b3070aff-b785-4f54-a4b0-a8c83230b948", "urlToImage": "https://media.kgw.com/assets/KGW/images/4a431f6d-fc12-4e2f-adfc-061836e16b3b/4a431f6d-fc12-4e2f-adfc-061836e16b3b_1140x641.png", "publishedAt": "2020-05-03T18:53:00Z", "content": "PORTLAND, Ore. On Sunday, the Oregon Health Authority reported no new deaths due to COVID-19.\r\nSince March 29, this is only the second day that Oregon health officials have reported no deaths from COVID-19. The last time the OHA reported no new deaths was Apr… [+800 chars]"}, {"source": {"id": null, "name": "Hotair.com"}, "author": null, "title": "There's a more accurate way to compare coronavirus deaths to the flu - Hot Air", "description": null, "url": "https://hotair.com/headlines/archives/2020/05/theres-accurate-way-compare-coronavirus-deaths-flu/", "urlToImage": "https://hotair.com/wp/wp-content/themes/hotair-desktop/images/social/hotair-default.png", "publishedAt": "2020-05-03T18:00:00Z", "content": "To get a more accurate comparison, one must start with the number of directly confirmed flu deaths, which the CDC tracks on an annual basis. In the past seven flu seasons, going back to 2013, that tally fluctuated between 3,448 and 15,620 deaths.\r\nNote that t… [+701 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Roni Caryn Rabin", "title": "What is ‘covid toe’? Maybe a strange sign of coronavirus infection - Chicago Tribune", "description": "The lesions are emerging as yet another telltale symptom of infection with the new coronavirus. The most prominent signs are a dry cough and shortness of breath, but the virus has been linked to a string of unusual and diverse effects, like mental confusion a…", "url": "https://www.nytimes.com/2020/05/01/health/coronavirus-covid-toe.html", "urlToImage": "https://www.chicagotribune.com/resizer/3_RofsUrxHRd06EClN-wyx6JOhM=/1200x0/top/arc-anglerfish-arc2-prod-tronc.s3.amazonaws.com/public/QD2HXD6LN5DHJFMXQGGCV6LEZQ.jpg", "publishedAt": "2020-05-03T17:46:00Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Mecklenburg coronavirus cases top 1,700. Western NC county reports 1st case. - Charlotte Observer", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiSGh0dHBzOi8vd3d3LmNoYXJsb3R0ZW9ic2VydmVyLmNvbS9uZXdzL2Nvcm9uYXZpcnVzL2FydGljbGUyNDI0Njg2OTEuaHRtbNIBSGh0dHBzOi8vYW1wLmNoYXJsb3R0ZW9ic2VydmVyLmNvbS9uZXdzL2Nvcm9uYXZpcnVzL2FydGljbGUyNDI0Njg2OTEuaHRtbA?oc=5", "urlToImage": null, "publishedAt": "2020-05-03T15:48:48Z", "content": null}, {"source": {"id": null, "name": "Kimt.com"}, "author": null, "title": "Another wave of coronavirus will likely hit the US in the fall. Here's why and what we can do to stop it - KIMT 3", "description": "The coronavirus pandemic may have slowed down in many parts of the country because of social distancing efforts but don't plan your parties, vacations or tri...", "url": "https://www.kimt.com/content/news/570155771.html", "urlToImage": "https://s3.amazonaws.com/cnn-newsource-image-renditions-prod/MED_CV_2ND_WAVE_FALL/hypatia-h_a3acd84ac4bcc7b7998e0e7b3e6d03b0-h_177fcd6562b98b34268e22d22ba747d3_preview.JPG", "publishedAt": "2020-05-03T12:22:00Z", "content": "The coronavirus pandemic may have slowed down in many parts of the country because of social distancing efforts but don't plan your parties, vacations or trips to the office just yet. Experts say the virus won't be a thing of the past any time soon.\r\nA second… [+6898 chars]"}]}