{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "March, April, May: City’s Mood Darkens as Crisis Feels Endless - India Gone Viral", "description": "With no clues about when the pandemic might subside, short-term discomfort is becoming long-term despair: “I feel like I have accepted this, and given up.”April 25, 2020ImageNew York City’s sidewalks,", "url": "https://indiagoneviral.com/health/2020/04/25/march-april-may-citys-mood-darkens-as-crisis-feels-endless/42269/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-25T16:08:44Z", "content": "With no clues about when the pandemic might subside, short-term discomfort is becoming long-term despair: I feel like I have accepted this, and given up.\r\nApril 25, 2020\r\nImage\r\nNew York Citys sidewalks, like this one in the Williamsburg section of Brooklyn, … [+6728 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Sandra G. Boodman", "title": "She fell more than 30 times. For three years, doctors couldn’t explain why. - The Washington Post", "description": "A bevy of specialists tried to help but seemed stymied by her symptoms — and their narrow focus.", "url": "https://www.washingtonpost.com/health/medical-mysteries/she-fell-more-than-30-times-for-three-years-doctors-couldnt-explain-why/2020/04/24/685c2eaa-62f5-11ea-acca-80c22bbee96f_story.html", "urlToImage": null, "publishedAt": "2020-04-25T15:11:19Z", "content": "The 10 doctors she consulted between 2016 and 2019 four orthopedists, three neurologists, a rheumatologist, a podiatrist and her internist reached disparate conclusions. One suggested she was clumsy. Others suspected her problem was primarily orthopedic or co… [+8899 chars]"}, {"source": {"id": null, "name": "Nxstrib.com"}, "author": null, "title": "5-month-old daughter of New York firefighter dies from coronavirus - WHNT News 19", "description": "(CNN) — A New York firefighter’s infant daughter has died from coronavirus, her family says, making her one of the youngest known victims of the virus. Five-month-old Jay-Natalie, …", "url": "https://nxstrib.com/nmw/news/coronavirus/5-month-old-daughter-of-new-york-firefighter-dies-from-coronavirus/", "urlToImage": null, "publishedAt": "2020-04-25T14:38:00Z", "content": "(CNN) — A New York firefighter’s infant daughter has died from coronavirus, her family says, making her one of the youngest known victims of the virus.\r\nFive-month-old Jay-Natalie, the daughter of New York City firefighter Jerel La Santa and Board of Educatio… [+2484 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Christina Maxouris, CNN", "title": "Coronavirus has killed nearly 52,000 people in the US, over a quarter of the world's deaths - CNN", "description": "Less than three months since the first known coronavirus death in the US, the country's reported fatalities make up more than a quarter of the world's known Covid-19 death toll.", "url": "https://www.cnn.com/2020/04/25/health/us-coronavirus-saturday/index.html", "urlToImage": null, "publishedAt": "2020-04-25T14:35:35Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Senegal's $1 COVID-19 test kit and the race for a vaccine | Counting the Cost - Al Jazeera English", "description": "What should take 10-15 years, the global scientific community hopes to cram into months. The World Health Organization (WHO) says there are 70 vaccines in th...", "url": "https://www.youtube.com/watch?v=tqKBNQzEROc", "urlToImage": null, "publishedAt": "2020-04-25T14:28:39Z", "content": null}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Tal Axelrod", "title": "CDC adds six more symptoms for coronavirus | TheHill - The Hill", "description": "The Centers for Disease Control and Prevention (CDC) added six new symptoms for the coronavirus to its website as officials still grapple with gauging the illness’s scope.", "url": "https://thehill.com/policy/healthcare/494640-cdc-adds-six-more-symptoms-for-coronavirus", "urlToImage": null, "publishedAt": "2020-04-25T14:25:21Z", "content": "The Centers for Disease Control and Prevention (CDC) added six new symptoms for the coronavirus to its website as officials grapple with gauging the illness's scope.\r\nThe new symptoms for the disease are chills, repeated shaking with chills, muscle pain, head… [+623 chars]"}, {"source": {"id": null, "name": "Dailywire.com"}, "author": "Amanda Prestigiacomo", "title": "Florida Antibody Testing Suggests Coronavirus Death Rate Far Lower Than Reported - The Daily Wire", "description": "University of Miami researchers’ antibody testing out of Miami-Dade County in Florida showed that about 6% of the population has had the China-originated novel coronavirus, COVID-19, extrapolating to an estimated 165,000 infections countywide, about 16 times …", "url": "https://www.dailywire.com/news/florida-antibody-testing-suggests-coronavirus-death-rate-far-lower-than-reported", "urlToImage": null, "publishedAt": "2020-04-25T14:08:00Z", "content": "University of Miami researchers antibody testing out of Miami-Dade County in Florida showed that about 6% of the population has had the China-originated novel coronavirus, COVID-19, extrapolating to an estimated 165,000 infections countywide, about 16 times h… [+3340 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Ashok Sharma", "title": "India reopens stores, speeding easing of virus lockdowns - The Associated Press", "description": "NEW DELHI (AP) — A tentative easing around the world of coronavirus lockdowns gathered pace Saturday with the reopening in India of neighborhood stores that many of the country's 1.3 billion...", "url": "https://apnews.com/ab559914e5e1e44b50bf4670fb2cf0c3", "urlToImage": null, "publishedAt": "2020-04-25T14:07:25Z", "content": "NEW DELHI (AP) A tentative easing around the world of coronavirus lockdowns gathered pace Saturday with the reopening in India of neighborhood stores that many of the countrys 1.3 billion people rely on for everything from cold drinks to mobile phone data car… [+6972 chars]"}, {"source": {"id": null, "name": "Abc7ny.com"}, "author": null, "title": "'COVID toes' may be new symptom of coronavirus, doctors say - WABC-TV", "description": "Doctors say there may be a new symptom of coronavirus they are calling \"Covid Toes.\"", "url": "https://abc7ny.com/covid-toes-covid19-coronavirus-symptoms/6128998/", "urlToImage": null, "publishedAt": "2020-04-25T13:59:05Z", "content": null}, {"source": {"id": null, "name": "Ktiv.com"}, "author": "Keith W. Bliven", "title": "109 New COVID-19 Cases Reported in Woodbury County - KTIV", "description": "That brings the total of positive cases that have been detected in the county to 396.", "url": "https://ktiv.com/2020/04/25/109-new-covid-19-cases-reported-in-woodbury-county/", "urlToImage": null, "publishedAt": "2020-04-25T13:56:59Z", "content": "SIOUX CITY (KTIV) -- On Saturday theSiouxland District Health Department reported an additional 109 confirmed positive cases of COVID-19.\r\nSOURCE: SIOUXLAND DISTRICT HEALTH DEPARTMENT\r\nThat brings the total of positive cases that have been detected in the cou… [+259 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Immunity passports ‘could increase virus spread’ - BBC News", "description": "No evidence people who develop antibodies after recovering are protected against a second infection.", "url": "https://www.bbc.com/news/world-52425825", "urlToImage": null, "publishedAt": "2020-04-25T13:40:47Z", "content": "Image copyrightReutersImage caption\r\n Testing for antibodies is becoming more widespread\r\nGovernments should not issue so-called \"immunity passports\" or \"risk-free certificates\" as a way of easing lockdowns, the World Health Organization (WHO) says.\r\nIt said … [+4744 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Turlock nursing home says three residents, three staffers contracted coronavirus - Modesto Bee", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiPWh0dHBzOi8vd3d3Lm1vZGJlZS5jb20vbmV3cy9jb3JvbmF2aXJ1cy9hcnRpY2xlMjQyMjg1NzM2Lmh0bWzSAT1odHRwczovL2FtcC5tb2RiZWUuY29tL25ld3MvY29yb25hdmlydXMvYXJ0aWNsZTI0MjI4NTczNi5odG1s?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T13:29:40Z", "content": null}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Doctors experiment with unproven stem cell therapy on COVID-19 patients - CBS News", "description": "\"What we saw in the very first patient was that within four hours of getting the cells, a lot of her parameters started to get better,\" Dr. Keren Osman told CBS News' Adriana Diaz.", "url": "https://www.cbsnews.com/news/coronavirus-patients-doctors-experiment-stem-cell-therapy-covid-19-mount-sinai/", "urlToImage": null, "publishedAt": "2020-04-25T12:41:50Z", "content": "Doctors are hoping stem cell therapy could be a weapon in the fight against coronavirus. On Friday, regenerative medicine company Mesoblast announced a 300-person trial to determine whether stem cell treatments will work in COVID-19 patients suffering from se… [+2063 chars]"}, {"source": {"id": null, "name": "Npr.org"}, "author": "", "title": "As States Open Up, Health Experts Seek To Understand Coronavirus's Early Silent Spread - NPR", "description": "Medical examiners are now screening for possible coronavirus connections in late January. Emerging evidence suggests it spread far earlier and more widely than initially believed.", "url": "https://www.npr.org/2020/04/25/844098976/as-states-open-up-health-experts-seek-to-understand-coronaviruss-early-silent-sp", "urlToImage": null, "publishedAt": "2020-04-25T11:26:41Z", "content": "Beachgoers at Port Hueneme Beach, California, on Thursday. Ventura County beaches and parks are scheduled to reopen this week with some restrictions.\r\nMark J. Terrill/AP\r\nAs health officials across the country try to slow the coronavirus pandemic, a growing b… [+6477 chars]"}, {"source": {"id": null, "name": "Npr.org"}, "author": "", "title": "Some States Shouldn't Ease Social Distancing Until At Least June, Modelers Say : Shots - Health News - NPR", "description": "Some states are moving forward, but many would be wise to wait, according to experts at the University of Washington. Here's their estimate for each state's safe date to open.", "url": "https://www.npr.org/sections/health-shots/2020/04/25/844088634/when-is-it-safe-to-ease-social-distancing-heres-what-one-model-says-for-each-sta", "urlToImage": null, "publishedAt": "2020-04-25T11:03:06Z", "content": "South Carolina has permitted retail stores to reopen to customers. It's one of a handful of states easing up on some social distancing restrictions.\r\nDustin Chambers/Bloomberg via Getty Images\r\nAcross the U.S. state leaders are now grappling with the challeng… [+4740 chars]"}, {"source": {"id": null, "name": "Timesofisrael.com"}, "author": null, "title": "WWII veteran dies from coronavirus 100 years after his twin died of Spanish Flu - The Times of Israel", "description": "Grandson of Philip Kahn says he would often warn that history repeats itself, 'knew the irony of what was going on' after he began coughing", "url": "https://www.timesofisrael.com/wwii-veteran-dies-from-coronavirus-100-years-after-his-twin-died-of-spanish-flu/", "urlToImage": null, "publishedAt": "2020-04-25T10:58:18Z", "content": "A US military veteran of World War II has died from the coronavirus, over a century after his twin brother died in the Spanish Flu pandemic.\r\nPhilip Kahn, 100, died at his home in Long Island last week, with his doctor saying tests showed he had contracted CO… [+2225 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Dale Smith", "title": "Coronavirus antibody testing a big deal? What to know about the promising serology tests - CNET", "description": "Tests that detect whether you've recovered from COVID-19 might help doctors and government officials navigate the pandemic. Here's what you should know.", "url": "https://www.cnet.com/how-to/coronavirus-antibody-testing-a-big-deal-what-to-know-about-the-promising-serology-tests/", "urlToImage": null, "publishedAt": "2020-04-25T10:10:29Z", "content": "Antibody testing looks for evidence that a person has been infected with the coronavirus SARS-CoV-2, but not the virus itself.\r\nJames Martin/CNET\r\nFor the most up-to-date news and information about the coronavirus pandemic, visit the WHO website.\r\nAs some are… [+7629 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Katie Conner", "title": "20 places you can buy a face mask or cloth covering online - CNET", "description": "Here's where to find a variety of face masks and cloth coverings online in many designs, patterns and colors.", "url": "https://www.cnet.com/how-to/20-places-you-can-buy-a-face-mask-or-cloth-covering-online/", "urlToImage": null, "publishedAt": "2020-04-25T10:10:20Z", "content": "For the most up-to-date news and information about the coronavirus pandemic, visit the WHO website.\r\nTo help prevent the spread of coronavirus while in public, face masks and cloth coverings have increasingly become part of our daily attire. The Centers for D… [+6703 chars]"}, {"source": {"id": null, "name": "Kcra.com"}, "author": null, "title": "Q&A: How convalescent plasma can help COVID-19 patients - KCRA Sacramento", "description": "The race continues to develop treatments for patients battling COVID-19. One of them is called convalescent plasma therapy, which involves taking plasma from donors who have recovered from the virus and giving it to those who are critically ill.", "url": "https://www.kcra.com/article/qanda-how-convalescent-plasma-can-help-covid-19-patients/32274421", "urlToImage": null, "publishedAt": "2020-04-25T08:17:28Z", "content": "The race continues to develop treatments for patients battling COVID-19. \r\nOne of them is called convalescent plasma therapy. It involves taking plasma from donors who have recovered from the novel coronavirus and giving it to those who are critically ill. \r\n… [+2921 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "UW to lead national study of drug promoted by President Trump to fight coronavirus - India Gone Viral", "description": "Researchers at the University of Washington on Friday announced a major new study of the malaria drug President Donald Trump has praised as a possible, low-cost cure for COVID-19.The clinical trial is", "url": "https://indiagoneviral.com/health/2020/04/25/uw-to-lead-national-study-of-drug-promoted-by-president-trump-to-fight-coronavirus/42019/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-25T08:08:14Z", "content": "Researchers at the University of Washington on Friday announced a major new study of the malaria drug President Donald Trump has praised as a possible, low-cost cure for COVID-19.\r\nThe clinical trial is one of dozens around the world aimed at providing defini… [+4531 chars]"}, {"source": {"id": null, "name": "Latimes.com"}, "author": "Amina Khan", "title": "Coronavirus and disinfectant: Why you shouldn't ingest it - Los Angeles Times", "description": "If President Trump has persuaded you to use a disinfectant like bleach or Lysol to protect yourself against the coronavirus, scientists have some advice: Don't.", "url": "https://www.latimes.com/science/story/2020-04-24/coronavirus-disinfectant-bleach-why-ingesting-it-is-dangerous", "urlToImage": null, "publishedAt": "2020-04-25T05:20:30Z", "content": "At a White House briefing Thursday, President Trump speculated about whether doctors might try to put disinfectants in the human body to combat the coronavirus, perhaps by an injection.\r\nScientists had an emphatic response to that idea: Absolutely not.\r\nThe i… [+4261 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rosa Flores, Sara Weisfeldt and Arman Azad, CNN", "title": "2 studies show many people who tested positive for Covid-19 displayed no symptoms - CNN", "description": "Two coronavirus studies released Friday -- one involving almost 2,000 people from Florida and the other from a Washington state nursing home -- came to the same conclusion: Many of the people who tested positive for the virus didn't know it they had it becaus…", "url": "https://www.cnn.com/2020/04/24/us/2-asymptomatic-coronavirus-studies/index.html", "urlToImage": null, "publishedAt": "2020-04-25T04:54:54Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "COVID-19 cluster found at Wichita car dealership - Wichita Eagle", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiPWh0dHBzOi8vd3d3LmthbnNhcy5jb20vbmV3cy9jb3JvbmF2aXJ1cy9hcnRpY2xlMjQyMjg2ODQxLmh0bWzSAT1odHRwczovL2FtcC5rYW5zYXMuY29tL25ld3MvY29yb25hdmlydXMvYXJ0aWNsZTI0MjI4Njg0MS5odG1s?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T03:41:04Z", "content": null}, {"source": {"id": null, "name": "Wkrn.com"}, "author": "CB Cotton", "title": "Vanderbilt releases new projections about COVID-19 spread after economic re-open - WKRN News 2", "description": "Researchers at Vanderbilt University Medical Center have released a new study with projections on what could happen if COVID-19 continues to spread, once the economy re-opens.", "url": "https://www.wkrn.com/community/health/coronavirus/vanderbilt-releases-new-projections-about-covid-19-spread-after-economic-re-open/", "urlToImage": null, "publishedAt": "2020-04-25T03:36:00Z", "content": "NASHVILLE, Tenn. (WKRN) Researchers at Vanderbilt University Medical Center have released a new study with projections on what could happen if COVID-19 continues to spread, once the economy re-opens.\r\n“What they [Friday’s projections] demonstrate today is wha… [+2313 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Don’t drink hand sanitizer: Poison center calls up 20% during pandemic, CDC says - Miami Herald", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiQmh0dHBzOi8vd3d3Lm1pYW1paGVyYWxkLmNvbS9uZXdzL2Nvcm9uYXZpcnVzL2FydGljbGUyNDIyODQ5OTYuaHRtbNIBQmh0dHBzOi8vYW1wLm1pYW1paGVyYWxkLmNvbS9uZXdzL2Nvcm9uYXZpcnVzL2FydGljbGUyNDIyODQ5OTYuaHRtbA?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T02:23:45Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dr. Sanjay Gupta, CNN Chief Medical Correspondent", "title": "He signed up for a coronavirus vaccine trial using a method that's never been used in humans. Here's why. - CNN", "description": "Sean Doyle signed up for a trial for a coronavirus vaccines that uses new technology to try and reach a vaccine quicker. Experts debate whether these vaccines will work and make it through safety tests or change how we make vaccines forever.", "url": "https://www.cnn.com/2020/04/24/health/coronavirus-vaccine-speed-sanjay-gupta/index.html", "urlToImage": null, "publishedAt": "2020-04-25T02:03:57Z", "content": "(CNN)Despite all his medical knowledge, 31-year-old medical student and Ph. D. candidate Sean Doyle couldn't know for certain all the risks of the injection he had just received in his right shoulder at Emory University Hospital. Yes, of course he was told of… [+11348 chars]"}, {"source": {"id": null, "name": "Kutv.com"}, "author": "Kelly Vaughen", "title": "Drive-in movie theater cancels Friday opening due to county public health order - KUTV 2News", "description": "The Redwood Drive-In Theater in West Valley City had plans to reopen Friday night but was ordered to remain closed by the Salt Lake County Health Department. The health department told the drive-in that opening tonight would be in violation of the county&rsqu…", "url": "http://kutv.com/news/local/drive-in-movie-theater-cancels-friday-opening-due-to-county-public-health-order", "urlToImage": null, "publishedAt": "2020-04-25T01:40:46Z", "content": null}, {"source": {"id": null, "name": "Abc7chicago.com"}, "author": null, "title": "Illinois coronavirus: Stunning new numbers for COVID-19 cases in IL nursing homes - WLS-TV", "description": "New data from the Illinois Department of Public Health shows COVID-19 cases grew exponentially since last week.  Coronavirus cases are now in more counties and more facilities.", "url": "https://abc7chicago.com/coronavirus-illinois-coronavrus-nursing-home-update/6128158/", "urlToImage": null, "publishedAt": "2020-04-25T01:37:54Z", "content": "CHICAGO (WLS) -- New data from the Illinois Department of Public Health shows COVID-19 cases grew exponentially since last week. Coronavirus cases are now in more counties and more facilities.\"All of these sort of group communal settings are opportunities for… [+1874 chars]"}, {"source": {"id": null, "name": "Kron4.com"}, "author": "Tristi Rodriguez", "title": "Solano County extends stay-at-home order until May 17 - KRON4", "description": "Solano County Public Health officials announced Friday its shelter at home order will be extended through May 17.", "url": "https://www.kron4.com/news/bay-area/solano-county-extends-stay-at-home-order-until-may-17/", "urlToImage": null, "publishedAt": "2020-04-25T01:30:00Z", "content": "SOLANO COUNTY, Calif. (KRON) — Solano County Public Health officials announced Friday its shelter at home order will be extended through May 17. \r\nThe order directs residents to stay at home except to get food, care for a relative or friend, get necessary hea… [+371 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Charles Creitz", "title": "CNN's Chris Cuomo was 'like a boiling pot' in Easter clash over breaking quarantine, cyclist says - Fox News", "description": "CNN's Chris Cuomo resembled \"a boiling pot\" when he was confronted for not self-quarantining with the coronavirus earlier this month, a Long Island, N.Y., bicyclist told Fox News Friday night.", "url": "https://www.foxnews.com/media/cnns-chris-cuomo-was-like-a-boiling-pot-in-confrontation-over-breaking-quarantine-cyclist-says", "urlToImage": null, "publishedAt": "2020-04-25T01:21:45Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox. Sign up here.\r\nCNN's Chris Cuomo resembled \"a boiling pot\" when he was confronted for not self-quarantining with the coronavirus earlier this month, a Long Island, N.Y., bicyclist … [+2783 chars]"}, {"source": {"id": null, "name": "Azcentral.com"}, "author": "Katie Surma", "title": "Sonora Quest Laboratories launch COVID-19 antibody testing in Arizona - AZCentral", "description": "Sonora Quest expects to perform 1,000 to 3,000 tests a day initially with a one day to four day turnaround time.", "url": "https://www.azcentral.com/story/news/local/arizona-health/2020/04/24/covid-19-antibody-tests-available-through-sonora-quest-laboratories/3023952001/", "urlToImage": null, "publishedAt": "2020-04-25T01:07:37Z", "content": "Sonora Quest Laboratories is now antibody testing for COVID-19 in Arizona and individuals can get a test with a physician's prescription.\r\nAntibody testing, also called serology testing, can indicate whether an individual has been exposed to COVID-19 and deve… [+2854 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Nick Givas", "title": "National Guard sent to California nursing homes to stop coronavirus spread - Fox News", "description": "California National Guard medical teams were sent to several nursing homes in Los Angeles County earlier this week, to help stem the tide of the novel coronavirus outbreak.", "url": "https://www.foxnews.com/us/national-guard-california-nursing-homes-coronavirus", "urlToImage": null, "publishedAt": "2020-04-25T00:19:23Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox. Sign up here.\r\nCalifornia National Guard medical teams were sent to several nursing homes in Los Angeles County earlier this week to help stem the tide of the novel coronavirus out… [+1422 chars]"}, {"source": {"id": null, "name": "Abc12.com"}, "author": "ABC12 News Team", "title": "New state data shows spread of coronavirus in Michigan nursing homes - ABC 12 News", "description": "The data shows 275 cases in Mid-Michigan facilities and more than 2,200 statewide.", "url": "https://www.abc12.com/content/news/New-state-data-shows-spread-of-coronavirus-in-Michigan-nursing-homes-569938671.html", "urlToImage": null, "publishedAt": "2020-04-25T00:13:27Z", "content": "LANSING (WJRT) (4/24/2020) - The Michigan Department of Health and Human Services began reporting the number of coronavirus cases in nursing homes and long-term care facilities on Friday.\r\nThe data shows 275 cases in Mid-Michigan facilities and more than 2,20… [+1407 chars]"}, {"source": {"id": null, "name": "Oregonlive.com"}, "author": "Shane Dixon Kavanaugh | The Oregonian/OregonLive", "title": "Oregon’s strict social distancing averted 70,000 coronavirus infections, new analysis suggests - OregonLive", "description": "“Our collective efforts are working,” said Dr. Dean Sidelinger, the state’s epidemiologist.", "url": "https://www.oregonlive.com/coronavirus/2020/04/oregons-strict-social-distancing-averted-70000-coronavirus-infections-new-analysis-shows.html", "urlToImage": null, "publishedAt": "2020-04-24T23:56:00Z", "content": "Oregons aggressive steps to slow the spread of the novel coronavirus may have averted more than 70,000 infections, including almost 1,500 hospitalizations, according to a new analysis released Friday by state health officials.\r\nThe projections, provided by th… [+3044 chars]"}, {"source": {"id": null, "name": "Wwmt.com"}, "author": "Andrew Feather   |   Newschannel 3", "title": "COVID-19 hospitalizations trending down statewide, trending up in West Michigan - WWMT-TV", "description": "The average number of people hospitalized with COVID-19 in Michigan decreased by more than 15% over the past week. The seven-day average of hospitalizations in the state shows the average number of hospitalized patients dropped from more than 3,800 to just ov…", "url": "http://wwmt.com/news/coronavirus/covid-19-hospitalizations-trending-down-statewide-trending-up-in-west-michigan", "urlToImage": null, "publishedAt": "2020-04-24T22:52:00Z", "content": null}, {"source": {"id": null, "name": "Fox17.com"}, "author": "SkyWatch 17 Chief Meteorologist Katy Morgan", "title": "CODE RED: Severe storms with damaging wind possible Saturday - WZTV", "description": "FOX 17 News is in a Code Red Weather Alert for the chance of severe storms Saturday afternoon, mainly east of I-65. Chief Meteorologist Katy Morgan expects a low pressure system to move across Middle Tennessee this weekend. Damaging wind will be the primary t…", "url": "http://fox17.com/news/local/code-red-severe-storms-with-damaging-wind-possible-saturday", "urlToImage": null, "publishedAt": "2020-04-24T22:42:00Z", "content": null}, {"source": {"id": null, "name": "Medscape.com"}, "author": null, "title": "COVID-19 Daily: Doctor Support Hotline, New Mortality Data - Medscape", "description": "These are the coronavirus stories you need to know about today.", "url": "https://www.medscape.com/viewarticle/929383", "urlToImage": null, "publishedAt": "2020-04-24T22:32:41Z", "content": "Editor's note: Find the latest COVID-19 news and guidance in Medscape's Coronavirus Resource Center.\r\nHere are the coronavirus stories Medscape's editors around the globe think you need to know about today: \r\nDoctor Support Hotline\r\nIn late March, a Philadelp… [+5308 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Ariana Eunjung Cha, The Washington Post", "title": "Healthy people in their 30s and 40s, barely sick with COVID-19, are dying from strokes - SFGate", "description": "Thomas Oxley wasn't even on call the day he received the page to come into Mount Sinai Beth Israel Hospital in Manhattan. There weren't enough doctors to treat all the emergency stroke patients, and he was needed in the operating room. \n The patient's chart a…", "url": "https://www.washingtonpost.com/health/2020/04/24/strokes-coronavirus-young-patients/", "urlToImage": null, "publishedAt": "2020-04-24T21:55:00Z", "content": "A lab technician at Amphia Hospital performs a test for samples taken from patients suspected of having COVID-19, the illness caused by the novel coronavirus.\r\nA lab technician at Amphia Hospital performs a test for samples taken from patients suspected of ha… [+9665 chars]"}, {"source": {"id": null, "name": "Newser.com"}, "author": "Newser Editors", "title": "Under Attack, Woman Maneuvers Fox Into Pot - Newser", "description": "Animal charged gardener when she tried to scare it away", "url": "https://www.newser.com/story/290041/fox-attacking-gardener-finds-itself-in-a-pot.html", "urlToImage": null, "publishedAt": "2020-04-24T21:55:00Z", "content": "(Newser)\r\nA fox that was attacking a Maine woman quickly found its goose was cooked when she wrestled into a pot meant for scalding chickens. Eliza Ruth Watson, 37, of Gray, tried to scare the fox away while she was gardening Thursday, the AP reports. Instead… [+691 chars]"}, {"source": {"id": null, "name": "Abc6onyourside.com"}, "author": "Stephen Loiaconi", "title": "Biden benefits from staying out of spotlight amid coronavirus outbreak, experts say - ABC6OnYourSide.com", "description": "Former Vice President Joe Biden is building a lead over President Donald Trump in key swing states, new polls suggest, as voters question Trump&rsquo;s response to the coronavirus outbreak and pay relatively little attention to anything Biden is doing at all.…", "url": "http://abc6onyourside.com/news/nation-world/biden-benefits-from-staying-out-of-spotlight-amid-coronavirus-outbreak-experts-say", "urlToImage": null, "publishedAt": "2020-04-24T21:37:00Z", "content": null}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Lateshia Beachum", "title": "Researchers found coronavirus in a patient’s eyes — days after it left her nose - The Washington Post", "description": "A new medical report shows contagious particles of coronavirus can be found in the eyes.", "url": "https://www.washingtonpost.com/health/2020/04/24/researchers-found-coronavirus-patients-eyes-days-after-it-left-her-nose/", "urlToImage": null, "publishedAt": "2020-04-24T20:49:43Z", "content": "The report demonstrates that the novel coronavirus can exist in an infected persons eye fluids at probable contagious levels, increasing the need for people to be cognizant about their hand hygiene and to keep their hands away from their face, experts say.\r\nT… [+3742 chars]"}, {"source": {"id": null, "name": "Al.com"}, "author": "Amy Yurkanin | ayurkanin@al.com", "title": "Alabama poison expert on disinfectant: ‘We should not make the cure worse than the disease.’ - AL.com", "description": "Less than 24 hours after President Donald Trump made comments about using disinfectants to kill coronavirus inside the body, an expert from Alabama warned residents not to consume them", "url": "https://www.al.com/news/2020/04/alabama-poison-expert-on-disinfectant-we-should-not-make-the-cure-worse-than-the-disease.html", "urlToImage": null, "publishedAt": "2020-04-24T20:19:00Z", "content": "Less than one day after President Donald Trump touted disinfectants ability to kill coronavirus, a poisoning expert in Alabama warned residents not to consume bleach and other cleaning products.\r\nBleach and disinfectants are not for human consumption, said An… [+2567 chars]"}, {"source": {"id": null, "name": "Abc7news.com"}, "author": null, "title": "Coronavirus outbreak: 10 residents die at Redwood City nursing home - KGO-TV", "description": "\"We will never be the same, but then again, none of us will be,\" said the elderly care facility in a statement.", "url": "https://abc7news.com/redwood-city-nursing-home-coronavirus-outbreak-gordon-manor-deaths/6127477/", "urlToImage": null, "publishedAt": "2020-04-24T20:15:12Z", "content": "SAN FRANCISCO (KGO) -- Ten residents at Gordon Manor assisted living facility in Redwood City have passed away as a result of novel coronavirus.RELATED: I-Team uncovers disturbing details about Hayward nursing facility, site of Bay Area's largest COVID-19 out… [+2924 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Miami-Dade has tens of thousands of missed coronavirus infections, UM survey finds - Miami Herald", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiQmh0dHBzOi8vd3d3Lm1pYW1paGVyYWxkLmNvbS9uZXdzL2Nvcm9uYXZpcnVzL2FydGljbGUyNDIyNjA0MDYuaHRtbNIBQmh0dHBzOi8vYW1wLm1pYW1paGVyYWxkLmNvbS9uZXdzL2Nvcm9uYXZpcnVzL2FydGljbGUyNDIyNjA0MDYuaHRtbA?oc=5", "urlToImage": null, "publishedAt": "2020-04-24T19:58:39Z", "content": null}, {"source": {"id": null, "name": "Meredithlmg.com"}, "author": "Maggie Fox, CNN", "title": "Covid-19 causes sudden strokes in young adults, doctors say - KMOV.com", "description": "The new coronavirus appears to be causing sudden strokes in adults in their 30s and 40s who are not otherwise terribly ill, doctors reported Wednesday.", "url": "https://www.news.meredithlmg.com/covid-19-causes-sudden-strokes-in-young-adults-doctors-say/article_ecef8006-862f-11ea-9389-2b1d6b612f29.html", "urlToImage": null, "publishedAt": "2020-04-24T19:40:00Z", "content": "(CNN) -- The new coronavirus appears to be causing sudden strokes in adults in their 30s and 40s who are not otherwise terribly ill, doctors reported Wednesday.\r\nThey said patients may be unwilling to call 911 because they have heard hospitals are overwhelmed… [+2624 chars]"}, {"source": {"id": null, "name": "Dallasnews.com"}, "author": "Tom Steele", "title": "Dallas County officials report 71 new coronavirus cases, 5 more deaths - The Dallas Morning News", "description": "For the fifth straight day, fewer than 100 new cases of COVID-19 were reported among Dallas County residents. Friday’s announcement of 71 additional...", "url": "https://www.dallasnews.com/news/public-health/2020/04/24/dallas-county-officials-report-71-new-coronavirus-cases-5-more-deaths/", "urlToImage": null, "publishedAt": "2020-04-24T19:33:30Z", "content": "Updated at 8:40 p.m.: Revised to include latest data from Ellis County.\r\nFor the fifth straight day, fewer than 100 new cases of COVID-19 were reported among Dallas County residents.\r\nFridays announcement of 71 additional positive coronavirus tests brought th… [+4974 chars]"}, {"source": {"id": "national-geographic", "name": "National Geographic"}, "author": null, "title": "What you need to know about your cats and coronavirus - National Geographic", "description": "Cases of cats acquiring coronavirus are rare—and there is no evidence the disease could spread from pets to humans.", "url": "https://www.nationalgeographic.com/animals/2020/04/how-to-protect-your-pets-coronavirus/", "urlToImage": null, "publishedAt": "2020-04-24T18:38:44Z", "content": null}, {"source": {"id": null, "name": "Wlos.com"}, "author": "WLOS STAFF", "title": "MISSING: Asheville police need help locating juvenile last seen in early March - WLOS", "description": "The Asheville Police Department (APD) is requesting assistance to locate a missing juvenile, Joshua Hardin. Officials say Hardin was last seen on the morning of March 4 in the area of Dogwood Court in East Asheville. Hardin, 16, is described as a black male, …", "url": "http://wlos.com/news/local/missing-asheville-police-need-help-locating-juvenile-last-seen-in-early-march", "urlToImage": null, "publishedAt": "2020-04-24T18:12:00Z", "content": null}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Beth Mole", "title": "Experts demolish studies suggesting COVID-19 is no worse than flu - Ars Technica", "description": "Authors of widely publicized antibody studies “owe us all an apology,” one expert says.", "url": "https://arstechnica.com/science/2020/04/experts-demolish-studies-suggesting-covid-19-is-no-worse-than-flu/", "urlToImage": null, "publishedAt": "2020-04-24T17:33:00Z", "content": "Enlarge/ A COVID-19 blood test is administered outside of Delmont Medical Care on April 22, 2020 in Franklin Square, New York. The test identifies antibodies to the coronavirus. \r\n135 with 85 posters participating\r\nFrustrated statisticians and epidemiologists… [+9053 chars]"}, {"source": {"id": null, "name": "Oann.com"}, "author": null, "title": "World leaders launch plan to speed COVID-19 drugs, vaccine; US stays away - One America News Network", "description": "Breaking News, Latest News and Current News from OANN.com. Breaking news and video. Latest Current News: U.S., World, Entertainment, Health, Business, Technology, Politics, Sports.", "url": "https://www.oann.com/world-leaders-due-to-launch-covid-19-drugs-vaccine-plan-who/", "urlToImage": null, "publishedAt": "2020-04-24T16:13:52Z", "content": "April 24, 2020\r\nBy Stephanie Nebehay and Michael Shields\r\nGENEVA/ZURICH (Reuters) – World leaders pledged on Friday to accelerate work on tests, drugs and vaccines against COVID-19 and to share them around the globe, but the United States did not take part in… [+4703 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Tara Parker-Pope", "title": "What’s a Pulse Oximeter, and Do I Really Need One at Home? - The New York Times", "description": "A tiny fingertip device can give you valuable information about your health during a bout of Covid-19 or any respiratory illness.", "url": "https://www.nytimes.com/2020/04/24/well/live/coronavirus-pulse-oximeter-oxygen.html", "urlToImage": null, "publishedAt": "2020-04-24T16:05:24Z", "content": "After working for 10 days at Bellevue Hospital in New York, Dr. Richard Levitan decided to share what he had learned about Covid-19. Too many patients were showing up at the hospital with perilously low oxygen levels, putting them at risk for severe complicat… [+8004 chars]"}, {"source": {"id": null, "name": "Nejm.org"}, "author": null, "title": "Presymptomatic SARS-CoV-2 Infections and Transmission in a Skilled Nursing Facility - nejm.org", "description": "Original Article from The New England Journal of Medicine — Presymptomatic SARS-CoV-2 Infections and Transmission in a Skilled Nursing Facility", "url": "https://www.nejm.org/doi/full/10.1056/NEJMoa2008457", "urlToImage": null, "publishedAt": "2020-04-24T16:03:34Z", "content": "Twenty-three days after identifying the first resident with SARS-CoV-2 infection, Facility A had a 64% prevalence of Covid-19 among residents, with a case fatality rate of 26% despite early adoption of infection-control measures. In addition, Covid-19 was dia… [+7968 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Elisabeth Buchwald", "title": "‘We don’t eat our countertops,’ yet many Americans are using cleaning products meant for them on their fruits and vegetables, National Poison Control Center official says - MarketWatch", "description": "Poison control centers across the U.S. saw a 20% increase in calls last month compared to 2019.", "url": "https://www.marketwatch.com/story/we-dont-eat-our-countertops-yet-many-americans-are-using-cleaning-products-meant-for-them-on-their-fruits-and-vegetables-says-national-poison-control-center-official-2020-04-24", "urlToImage": null, "publishedAt": "2020-04-24T15:11:26Z", "content": "Shortages of cleaning supplies amid the coronavirus pandemic are leading many Americans to get creative. But that creativity and compulsion to clean and disinfect more may be causing more harm than good.Last month, calls to poison control centers surged by ne… [+4139 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "David Nikel", "title": "Sweden Health Chief Admits ‘It’s Not Over’ As Coronavirus Cases Leap - Forbes", "description": "Following an additional 131 deaths reported in the last 24 hours, Sweden’s COVID-19 death toll now stands at 2,152.", "url": "https://www.forbes.com/sites/davidnikel/2020/04/24/sweden-health-chief-admits-its-not-over-as-coronavirus-cases-leap/", "urlToImage": null, "publishedAt": "2020-04-24T15:09:59Z", "content": "Sweden's state epidemiologist Anders Tegnell has said the number of COVID-19 deaths in Sweden have ... [+] been higher than expected.\r\nAFP via Getty Images\r\nSwedens state epidemiologist Anders Tegnell has announced a record daily high of coronavirus cases for… [+3119 chars]"}, {"source": {"id": null, "name": "Cbslocal.com"}, "author": "CBS Boston", "title": "Northeastern University Model Shows COVID-19 Spread In Boston In February - CBS Boston", "description": "Models from Northeastern University show Boston may have been 2,300 people infected with coronavirus by March 1.", "url": "https://boston.cbslocal.com/2020/04/24/coronavirus-model-northeastern-university-boston-spread-february/", "urlToImage": null, "publishedAt": "2020-04-24T14:40:28Z", "content": "BOSTON (CBS) — Models from Northeastern University show coronavirus may have been spreading in the United States earlier than the government thought.\r\n“In the United States, the most internationally connected places are the ones that started the epidemic firs… [+1041 chars]"}, {"source": {"id": null, "name": "Wchstv.com"}, "author": "JEFF MORRIS, ANNA MOORE", "title": "Another COVID-19 death reported in W.Va.; state death toll at 32 - WCHS-TV8", "description": "UPDATED, 5:05 p. m. 4/24/20. West Virginia topped the 1,000-mark Friday afternoon for an overall total of positive COVID-19 cases. The state Department of Health and Human Resources reported that the state had a total of 1,010 positive virus cases as of 5 p. …", "url": "http://wchstv.com/news/local/another-covid-19-death-reported-in-wva-state-death-toll-at-32", "urlToImage": null, "publishedAt": "2020-04-24T14:07:00Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Coronavirus: distancing and handwashing could lower flu rates – but it's still too early to tell - Yahoo News", "description": null, "url": "https://consent.yahoo.com/collectConsent?sessionId=1_cc-session_73501d8c-83f0-43cb-81e4-2c32500c4bfd&lang=en-GB&inline=false", "urlToImage": null, "publishedAt": "2020-04-24T12:41:00Z", "content": "To give you a better overall experience, we want to provide relevant ads that are more useful to you. For example, when you search for a film, we use your search information and location to show the most relevant cinemas near you. We also use this information… [+258 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "U.K. begins human trials for coronavirus vaccine - CBS This Morning", "description": "The U.K. has begun the first human trials of a coronavirus vaccine as several countries race to find a way to fight the illness, which has killed over 191,00...", "url": "https://www.youtube.com/watch?v=yLh1RtGBU4c", "urlToImage": null, "publishedAt": "2020-04-24T11:43:20Z", "content": "The U.K. has begun the first human trials of a coronavirus vaccine as several countries race to find a way to fight the illness, which has killed over 191,000 people worldwide. Imtiaz Tyab takes a look at the highly anticipated study."}, {"source": {"id": null, "name": "Bostonglobe.com"}, "author": null, "title": "You’re not the only one having vivid dreams in quarantine - The Boston Globe", "description": "Googling “weird dreams in quarantine” yields 5,800,000 results. So what’s happening? We asked a Harvard Medical School dream expert.", "url": "https://www.bostonglobe.com/2020/04/24/lifestyle/youre-not-only-one-having-vivid-dreams-quarantine/", "urlToImage": null, "publishedAt": "2020-04-24T11:23:00Z", "content": "Bob Dylan, wearing a Celtics uniform, came up with a possible COVID-19 cure in a Boston coffee shop. Abraham Lincoln (who is much shorter in real life) was sewing face masks. I was there, too. OK, I might have dreamed this. But Im not the only one having weir… [+3023 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "GERALD IMRAY Associated Press", "title": "Fight against malaria could be set back 20 years, WHO warns - ABC News", "description": "", "url": "https://abcnews.go.com/International/wireStory/fight-malaria-set-back-20-years-warns-70325248", "urlToImage": null, "publishedAt": "2020-04-24T09:44:52Z", "content": "CAPE TOWN, South Africa -- \r\nOne of the hard lessons the World Health Organization learned during the Ebola outbreak in West Africa was this: Other diseases can be forgotten and take a deadlier toll.\r\nThe WHO is now warning that the battle against malaria in … [+2842 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Erika Edwards", "title": "Doctors report uptick in surprising coronavirus complication: dangerous blood clots - NBC News", "description": "Coronavirus patients are developing blood clots at higher rates. Does the virus cause blood to clot, or is it the result of inflammation? Regular anticoagulants aren't working.", "url": "https://www.nbcnews.com/health/health-news/doctors-report-uptick-surprising-coronavirus-complication-dangerous-blood-clots-n1190491", "urlToImage": null, "publishedAt": "2020-04-24T08:33:27Z", "content": "Three weeks ago, critical care pulmonologist Hugh Cassiere encountered something he hadn't seen in 24 years of practicing medicine.\r\nA 45-year-old man arrived at the hospital where Cassiere works, North Shore University Hospital on Long Island, New York, with… [+4346 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Public Health responds to comments made by Accelerated Urgent Care Doctors to reopen Kern County - 23 ABC News | KERO", "description": "Public Health responds to comments made by Accelerated Urgent Care Doctors to reopen Kern County", "url": "https://www.youtube.com/watch?v=OhxAIOhCPHQ", "urlToImage": null, "publishedAt": "2020-04-24T01:04:28Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Mom Who Died From COVID-19 Has Been Named Victim #1 - Inside Edition", "description": "A 57-year-old California woman who was seemingly healthy when she died of a sudden heart attack in early February is now believed to be the first American to...", "url": "https://www.youtube.com/watch?v=KitEaD4TXPU", "urlToImage": null, "publishedAt": "2020-04-23T23:34:36Z", "content": "A 57-year-old California woman who was seemingly healthy when she died of a sudden heart attack in early February is now believed to be the first American to have died of the coronavirus. Patricia Dowds daughter found her dead on Feb. 6 at their home. Dowd's … [+234 chars]"}, {"source": {"id": null, "name": "Zmescience.com"}, "author": "Tibi Puiu", "title": "Coronavirus may not be an STD: Semen from COVID-19 positive men doesn’t contain the virus - ZME Science", "description": "The coronavirus spreads through direct contact between people so it's better forgoing sex entirely if you have concerns a partner might be infected.", "url": "https://www.zmescience.com/medicine/coronavirus-may-not-be-an-std-semen-from-covid-19-positive-men-doesnt-contain-the-virus/", "urlToImage": null, "publishedAt": "2020-04-23T21:02:48Z", "content": "It’s very unlikely that the coronavirus spreads solely through sexual contact, according to a new study that found no trace of the virus that causes COVID-19 in the semen or testes of positive patients. \r\nCredit: Pixabay.\r\nResearchers at the University of Uta… [+3585 chars]"}, {"source": {"id": null, "name": "Salon.com"}, "author": "Alex Henderson", "title": "CDC director contradicts Trump's claim he was \"misquoted\" on potential for fall coronavirus outbreak - Salon", "description": "\"I'm accurately quoted in the Washington Post\"", "url": "https://www.salon.com/2020/04/23/cdc-director-contradicts-trumps-claim-he-was-misquoted-on-potential-for-fall-coronavirus-outbreak_partner/", "urlToImage": null, "publishedAt": "2020-04-23T20:56:27Z", "content": "At his nightly White House press conference on Wednesday, April 22, President Donald Trump was hoping that the three health officials he had with him — Dr. Robert Redfield of the Centers for Disease Control and Prevention (CDC), Dr. Anthony Fauci and Dr. Debo… [+2323 chars]"}, {"source": {"id": null, "name": "Iflscience.com"}, "author": "Madison Dapcevich", "title": "Researchers Identify Top Underlying Conditions Associated With Extreme Covid-19 Cases - IFLScience", "description": "In an analysis of thousands of Covid-19 patients admitted to dozens of hospitals in the New York metropolitan area, a team of researchers has determined th", "url": "https://www.iflscience.com/health-and-medicine/researchers-identify-top-underlying-conditions-associated-with-extreme-covid-19-cases/", "urlToImage": null, "publishedAt": "2020-04-23T20:17:00Z", "content": "In an analysis of thousands of Covid-19 patients admitted to dozens of hospitals in the New York metropolitan area, a team of researchers has determined that those with preexisting hypertension, obesity, and diabetes are more likely to have severe cases of th… [+3059 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Roni Caryn Rabin", "title": "Nearly All Patients Hospitalized With Covid-19 Had Chronic Health Issues, Study Finds - The New York Times", "description": "Only 6 percent of patients at one New York area health system had no chronic conditions. Hypertension, obesity and diabetes were common.", "url": "https://www.nytimes.com/2020/04/23/health/coronavirus-patients-risk.html", "urlToImage": null, "publishedAt": "2020-04-23T19:39:48Z", "content": "A new study of thousands of hospitalized coronavirus patients in the New York City area, the epicenter of the outbreak in the United States, has found that nearly all of them had at least one major chronic health condition, and most 88 percent had at least tw… [+5691 chars]"}, {"source": {"id": null, "name": "Komonews.com"}, "author": "Denise Whitaker", "title": "New COVID-19 side effect in people under 50 - KOMO News", "description": "Doctors in New York say a growing number of their coronavirus patients in their 30s and 40s are suffering sudden strokes. This new side effect comes from the staff at Mt Sinai Health, after seeing blood clot in unusual ways in these younger patients who were …", "url": "http://komonews.com/news/local/new-covid-19-side-effect-in-people-under-50", "urlToImage": null, "publishedAt": "2020-04-23T18:09:00Z", "content": null}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "David Moye", "title": "Purplish Lesions On Feet Could Be Sign Of Virus, Say Dermatologists - HuffPost", "description": "Doctors say \"COVID toes\" could be a way to track the coronavirus in otherwise asymptomatic patients.", "url": "https://www.huffpost.com/entry/foot-lesions-coronavirus-symptom_n_5ea1c3d3c5b6a4fee73a1dc9", "urlToImage": null, "publishedAt": "2020-04-23T18:02:00Z", "content": "Dermatologists say looking at a person’s feet may be a handy way of seeing if someone has the coronavirus.\r\nIt seems that many otherwise asymptomatic people are reporting the presence of painful purplish lesions on their toes.\r\nThe so-called “COVID toes” are … [+2847 chars]"}, {"source": {"id": null, "name": "Boston.com"}, "author": "washington-post", "title": "A mysterious blood-clotting complication is killing coronavirus patients - Boston.com", "description": "Increasingly, doctors are reporting bizarre, unsettling cases that don't seem to follow any of the textbooks they've trained on.", "url": "https://www.boston.com/news/coronavirus/2020/04/23/blood-clotting-coronavirus", "urlToImage": null, "publishedAt": "2020-04-23T17:05:44Z", "content": "Craig Coopersmith was up early that morning as usual and typed his daily inquiry into his phone. Good morning, Team Covid, he wrote, asking for updates from the ICU team leaders working across 10 hospitals in the Emory University health system in Atlanta.\r\nOn… [+9734 chars]"}]}