{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": "politico", "name": "Politico"}, "author": "DEBRA KAHN", "title": "First recorded Covid death in US was from massive heart attack, autopsy says - POLITICO", "description": "County officials announced the death earlier this week.", "url": "https://www.politico.com/states/california/story/2020/04/25/first-recorded-covid-death-in-us-was-from-massive-heart-attack-autopsy-says-9422714", "urlToImage": null, "publishedAt": "2020-04-26T00:41:11Z", "content": "An illustration of the coronavirus. | CDC via AP\r\nSAN FRANCISCO A Santa Clara County woman who is the earliest recorded death from Covid-19 in the United States died of a massive heart attack, according to an autopsy conducted by the county's medical examiner… [+1192 chars]"}, {"source": {"id": null, "name": "Kcra.com"}, "author": "Marlei Martinez", "title": "18 residents, 5 employees test positive for COVID-19 at Folsom assisted living center - KCRA Sacramento", "description": "Twenty-three people have tested positive for COVID-19 at an assisted living center in Folsom, according to an email sent to residents’ families Saturday.", "url": "https://www.kcra.com/article/18-residents-5-employees-test-positive-covid-19-folsom-assisted-living-facility/32277393", "urlToImage": null, "publishedAt": "2020-04-26T00:34:59Z", "content": "FOLSOM, Calif. —Twenty-three people have tested positive for COVID-19 at an assisted living center in Folsom, according to an email sent to residents families Saturday.\r\nOakmont of Folsom, an assisted living and memory care center, reported that 18 residents … [+2832 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "Dallas County Reports 4 Additional Deaths, 75 New Cases of the Coronavirus - India Gone Viral", "description": "Dallas County on Saturday reported four additional deaths from the new coronavirus and 75 more cases. Two of the people who died — a man in his 80s and a woman in her 90s — had been residents of long-", "url": "https://indiagoneviral.com/health/2020/04/26/dallas-county-reports-4-additional-deaths-75-new-cases-of-the-coronavirus-fort-worth/42555/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-26T00:03:25Z", "content": "Dallas County on Saturday reported four additional deaths from the new coronavirus and 75 more cases.\r\nTwo of the people who died a man in his 80s and a woman in her 90s had been residents of long-term care facilities in Dallas. The other two cases included a… [+508 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "Ninety-six percent of inmates in four state prisons who tested positive for coronavirus were asymptomatic: report | TheHill - India Gone Viral", "description": "An overwhelmingly majority of inmates from four states' prison systems that tested positive for COVID-19 have been asymptomatic, according to Reuters.Between Arkansas, North Carolina, Ohio and Virgini", "url": "https://indiagoneviral.com/health/2020/04/26/ninety-six-percent-of-inmates-in-four-state-prisons-who-tested-positive-for-coronavirus-were-asymptomatic-report-thehill/42560/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-26T00:02:54Z", "content": "An overwhelmingly majority of inmates from four states’ prison systems that tested positive for COVID-19 have been asymptomatic, according to Reuters.\r\nBetween Arkansas, North Carolina, Ohio and Virginia, 3,277 inmates tested positive for the virus. Of that n… [+1892 chars]"}, {"source": {"id": null, "name": "Oregonlive.com"}, "author": "Aimee Green | The Oregonian/OregonLive, Shane Dixon Kavanaugh | The Oregonian", "title": "Coronavirus in Oregon: 1 new death, more than 2,250 known cases - OregonLive", "description": "The number of new positive test results grew by 76.", "url": "https://www.oregonlive.com/coronavirus/2020/04/coronavirus-in-oregon-1-new-death-more-than-2250-known-cases.html", "urlToImage": null, "publishedAt": "2020-04-25T23:28:00Z", "content": "Oregon officials on Saturday reported 1 new death from the novel coronavirus and 76 new cases -- bringing the total number of deaths to 87 and known cases to 2,253.\r\nThe Oregon Health Authority reported that the latest death was a 59-year-old Lane County man … [+2700 chars]"}, {"source": {"id": null, "name": "Ktuu.com"}, "author": "KTUU News", "title": "UPDATE: State reports no new cases of COVID-19 Saturday - KTUU.com", "description": "The Alaska Department of Health and Social Services reported no new cases of COVID-19 in the previous 24-hour reporting period, but Southeast Alaska Regional Health Consortium reported the first case of COVID-19 in Sitka Saturday afternoon.", "url": "https://www.ktuu.com/content/news/No-new-cases-of-COVID-19-reported-in-Alaska-Saturday-569952441.html", "urlToImage": null, "publishedAt": "2020-04-25T23:15:00Z", "content": "ANCHORAGE, Alaska (KTUU) Update: 3:09 p.m.Southeast Alaska Regional Health Consortium in Sitka has confirmed one new case of COVID-19 in Sitka Saturday, the first case reported in the Sitka community.\r\nThat case, first reported Saturday afternoon after the of… [+2794 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Annie Grayer, CNN", "title": "Students in New York file class-action lawsuits against 3 universities, claiming that schools have failed to adequately refund fees - CNN", "description": "Class-action lawsuits have been filed against three New York universities by students who argue the schools have failed to adequately refund or reimburse students for tuition and other fees they paid to have in-person, on-campus classes and other activities.", "url": "https://www.cnn.com/2020/04/25/us/student-class-action-lawsuits-coronavirus/index.html", "urlToImage": null, "publishedAt": "2020-04-25T22:05:53Z", "content": "(CNN)Class-action lawsuits have been filed against three New York universities by students who argue the schools have failed to adequately refund or reimburse students for tuition and other fees they paid to have in-person, on-campus classes and other activit… [+5359 chars]"}, {"source": {"id": null, "name": "Latimes.com"}, "author": "Alex Wigglesworth", "title": "Coronavirus: L.A. reports 48 new deaths and 600 new cases - Los Angeles Times", "description": "Los Angeles County on Saturday reported 48 new deaths and 607 additional cases from COVID-19.", "url": "https://www.latimes.com/california/story/2020-04-25/l-a-county-reports-48-new-covid-19-deaths-and-600-plus-additional-cases", "urlToImage": null, "publishedAt": "2020-04-25T21:51:38Z", "content": "Los Angeles County reported 48 new deaths and 607 additional cases of COVID-19 on Saturday. Long Beach, which has its own health department, reported 26 new cases, bringing the county total to 895 deaths and more than 19,100 cases.\r\nThis past week in L.A. Cou… [+1412 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "When will the Fresno region reopen from coronavirus? Here’s how it could happen - Fresno Bee", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiOmh0dHBzOi8vd3d3LmZyZXNub2JlZS5jb20vbmV3cy9sb2NhbC9hcnRpY2xlMjQyMjY4ODI2Lmh0bWzSATpodHRwczovL2FtcC5mcmVzbm9iZWUuY29tL25ld3MvbG9jYWwvYXJ0aWNsZTI0MjI2ODgyNi5odG1s?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T21:51:12Z", "content": null}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Robert Gearty", "title": "Long Island man, 100, dies from coronavirus, a century after Spanish flu took his twin brother - Fox News", "description": "The coronavirus has killed a 100-year-old Long Island man who went through life remembering the twin brother he lost to the 1918-19 Spanish Flu pandemic when they were weeks-old infants.", "url": "https://www.foxnews.com/us/long-island-man-dies-coronavirus-century-after-spanish-flu-took-twin-brother", "urlToImage": null, "publishedAt": "2020-04-25T21:45:20Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox. Sign up here.\r\nThe coronavirus has killed a 100-year-old Long Island man who went through life remembering the twin brother he lost to the 1918-19 Spanish Flu pandemic when they we… [+2460 chars]"}, {"source": {"id": null, "name": "Wmur.com"}, "author": "Sarah Murphy", "title": "7 new deaths related to COVID-19 reported in NH; most deaths announced in a single day - WMUR Manchester", "description": "6 deaths tied to institutions with outbreaks", "url": "https://www.wmur.com/article/7-new-deaths-related-to-covid-19-reported-most-deaths-announced-in-a-single-day/32277313", "urlToImage": null, "publishedAt": "2020-04-25T21:33:16Z", "content": "CONCORD, N.H. —Seven more people in New Hampshire have died from complications of COVID-19, health officials said Saturday. This is the most deaths announced in a single day related to the coronavirus. Six of the deaths were of residents at institutions with … [+1463 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Gina Kolata", "title": "Amid the Coronavirus Crisis, Heart and Stroke Patients Go Missing - The New York Times", "description": "Emergency physicians are seeing declines in the number of patients arriving with cardiac problems. Some say they were afraid to go to the hospital.", "url": "https://www.nytimes.com/2020/04/25/health/coronavirus-heart-stroke.html", "urlToImage": null, "publishedAt": "2020-04-25T21:26:25Z", "content": "Bishnu Virachan was a bicycle deliveryman for a grocery store in Queens. With New York City locked down, he was busier than ever.\r\nBut in early April, as he was watching television, he felt a pain in my heart. It frightened him, but he did not go to the emerg… [+6192 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Audrey McNamara", "title": "CDC adds six new possible coronavirus symptoms - CBS News", "description": "The agency has updated its list to include: chills, repeated shaking with chills, muscle pain, headache, sore throat and new loss of taste or smell.", "url": "https://www.cbsnews.com/news/cdc-adds-six-new-possible-coronavirus-symptoms-2020-04-25/", "urlToImage": null, "publishedAt": "2020-04-25T21:21:29Z", "content": "The Centers for Disease Control and Prevention has added six new symptoms to its list of possible signs of the coronavirus. Previously, the CDC only noted fever, cough and shortness of breath as symptoms.\r\nThe agency has updated its list to include: chills, r… [+2199 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "The Mighty Staff", "title": "Doctors Report People in Their 30s and 40s With COVID-19 Are Having Strokes - Yahoo News", "description": "Doctors in New York City and around the country are now reporting that people in their 30s and 40s with COVID-19, even mild cases, are having and dying from ...", "url": "https://news.yahoo.com/doctors-report-people-30s-40s-205330026.html", "urlToImage": null, "publishedAt": "2020-04-25T20:53:00Z", "content": "Microscopic view of a infectious virus.\r\nDoctors are now reporting cases where the coronavirus (COVID-19) may be causing blood clots and consequently, strokes in a small number of people in their 30s and 40s. These young and middle-aged patients, some who did… [+4222 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Alexander Martin", "title": "Coronavirus: World Health Organisation warns against 'immunity passports' - Sky News", "description": "Scientific studies show most people who recovered from infection have antibodies to the coronavirus, but not all may be immune.", "url": "https://news.sky.com/story/coronavirus-world-health-organisation-warns-against-immunity-passports-11978682", "urlToImage": null, "publishedAt": "2020-04-25T20:18:07Z", "content": null}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "Coronavirus survivors detail despair, recovery: 'You're a miracle' - India Gone Viral", "description": "They are survivors of severe cases of the coronavirus, most of them had been hospitalized, some of them hooked up to ventilators for several days and none of them ever wanting to experience the misery", "url": "https://indiagoneviral.com/health/2020/04/26/coronavirus-survivors-detail-despair-recovery-youre-a-miracle/42418/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-25T20:07:54Z", "content": "They are survivors of severe cases of the coronavirus, most of them had been hospitalized, some of them hooked up to ventilators for several days and none of them ever wanting to experience the misery, uncertainty and loneliness of the illness ever again.\r\n“I… [+4611 chars]"}, {"source": {"id": null, "name": "Qz.com"}, "author": "Lila MacLellan", "title": "DIY coronavirus masks more protective if enhanced with pantyhose - Quartz", "description": "Could a pantyhose-enhanced face mask help spare you from Covid-19?", "url": "https://qz.com/1845741/diy-coronavirus-masks-more-protective-if-enhanced-with-pantyhose/", "urlToImage": null, "publishedAt": "2020-04-25T20:07:27Z", "content": "The homemade masks that millions are wearing in the US and elsewhere have always been a better-than-nothing solution for preventing the spread of the virus that causes Covid-19.\r\nTheyre not recommended to protect the wearer. Only N95 respirators can effective… [+2831 chars]"}, {"source": {"id": null, "name": "Missionlocal.org"}, "author": "Lydia Chávez", "title": "Mission residents gather for free COVID-19 testing — a scene that will likely become more common - Mission Local", "description": "Long lines formed at least two of the four Mission District test sites this morning, but the tests proceeded calmly, if somewhat slowly, as the city", "url": "https://missionlocal.org/2020/04/mission-residents-gather-for-free-covid-19-testing-a-scene-that-will-likely-become-more-common/", "urlToImage": null, "publishedAt": "2020-04-25T20:03:45Z", "content": "Long lines formed at least two of the four Mission District test sites this morning, but the tests proceeded calmly, if somewhat slowly, as the city embarks on the first of what promises to be many testing campaigns a key to reopening the city. \r\nThe four-day… [+4145 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Julie Steenhuysen", "title": "Special Report: Countries, companies risk billions in race for coronavirus vaccine - Reuters", "description": "In the race to develop a vaccine to end the COVID-19 pandemic, governments, charities and Big Pharma firms are sinking billions of dollars into bets with extraordinarily low odds of success.", "url": "https://www.reuters.com/article/us-health-coronavirus-vaccine-specialrep-idUSKCN2270U1", "urlToImage": null, "publishedAt": "2020-04-25T19:51:02Z", "content": "(Reuters) - In the race to develop a vaccine to end the COVID-19 pandemic, governments, charities and Big Pharma firms are sinking billions of dollars into bets with extraordinarily low odds of success. \r\nThey’re fast-tracking the testing and regulatory revie… [+16271 chars]"}, {"source": {"id": null, "name": "Sfgate.com"}, "author": "Hearst Television", "title": "National coronavirus updates: Worldwide coronavirus death toll passes 200000 - SF Gate", "description": "The latest:", "url": "https://www.sfgate.com/news/article/National-coronavirus-updates-US-death-toll-15225716.php", "urlToImage": null, "publishedAt": "2020-04-25T19:33:52Z", "content": "National coronavirus updates: Auto workers step up to make medical gear\r\nThe latest:\r\n<ul><li>There have been more than 933,000 coronavirus cases in the United States, according to the Johns Hopkins University tally.</li><li>The U.S. death toll has surpassed … [+10255 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Sara Dorn", "title": "Cyclist who angered Chris Cuomo is father of Johns Hopkins doctor - New York Post ", "description": "The biker who blasted CNN anchor Chris Cuomo as a “bully” in a roadside dispute in East Hampton is explaining why he cares so much the infected news anchor wasn’t social distancing — because …", "url": "https://nypost.com/2020/04/25/biker-in-social-distancing-spat-with-chris-cuomo-is-dad-of-doctor/", "urlToImage": null, "publishedAt": "2020-04-25T19:32:31Z", "content": "The biker who blasted CNN anchor Chris Cuomo as a bully in a roadside dispute in East Hampton is explaining why he cares so much the infected news anchor wasn’t social distancing because he’s the father of a Baltimore physician.\r\nMy daughter is a doctor at Jo… [+1429 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "William Mansell, Ella Torres, Christina Carrega", "title": "Coronavirus live updates: Over 200,000 now dead from COVID-19 - ABC News", "description": "", "url": "https://abcnews.go.com/US/coronavirus-live-updates-135-inmates-test-positive-covid/story?id=70343518", "urlToImage": null, "publishedAt": "2020-04-25T18:30:50Z", "content": "A pandemic of the novel coronavirus has now killed over 200,000 people worldwide.\r\nMore than 2.8 million people across the globe have been diagnosed with COVID-19, the disease caused by the new respiratory virus, according to data compiled by the Center for S… [+15631 chars]"}, {"source": {"id": null, "name": "Inverse.com"}, "author": "Abela Mahimbo, David Isaacs, Melissa Kang, Melanie Wong", "title": "Why are some people with Covid-19 asymptomatic? Evidence points to 2 factors - Inverse", "description": "Recent studies suggest as many as 80% or more of those infected are “silent carriers”, showing no or very mild symptoms.", "url": "https://www.inverse.com/science/covid-19-asymptomatic", "urlToImage": null, "publishedAt": "2020-04-25T17:58:15Z", "content": "SARS-CoV-2, the coronavirus which causes COVID-19, has infected almost 2.5 million people around the world and claimed 170,000 lives.\r\nBut some people dont even get symptoms. Recent studies suggest as many as 80 percentor more of those infected are silent car… [+5687 chars]"}, {"source": {"id": null, "name": "Wwnytv.com"}, "author": "", "title": "St. Lawrence County: nine new cases of COVID-19 - WWNY", "description": "In a statement Saturday, county health officials emphasized the county \"is still seeing an increase in cases, and want to stress that we have not reached our peak.\"", "url": "https://www.wwnytv.com/2020/04/25/st-lawrence-county-nine-new-cases-covid-/", "urlToImage": null, "publishedAt": "2020-04-25T17:54:00Z", "content": "CANTON, N.Y. (WWNY) - St. Lawrence County reported nine new cases of COVID-19 Saturday afternoon, bringing the countys total to 171.\r\nIn a statement Saturday, county health officials emphasized the county \"is still seeing an increase in cases, and want to str… [+657 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Sylvie Corbet", "title": "Virus lockdowns an extra ordeal for special-needs children - The Associated Press", "description": "PARIS (AP) — Weeks into France's strict coronavirus lockdown, Mohammed, a 14-year-old with autism, took a pickax and started hitting the wall of his family's house. His explanation: “Too...", "url": "https://apnews.com/f4ae1dafd842d2d1fe2135f9b696618a", "urlToImage": null, "publishedAt": "2020-04-25T17:45:35Z", "content": "PARIS (AP) Weeks into Frances strict coronavirus lockdown, Mohammed, a 14-year-old with autism, took a pickax and started hitting the wall of his familys house.\r\nHis explanation: Too long at home, too hard to wait.\r\nThe disruptions in daily life caused by the… [+5966 chars]"}, {"source": {"id": null, "name": "Startribune.com"}, "author": "Christopher Snowbeck", "title": "Minnesota deaths up 23, to 244, in COVID-19 pandemic - Minneapolis Star Tribune", "description": "There were big one-day increases in Kandiyohi County, where an outbreak has emerged among poultry plant workers, and Nobles County, where an outbreak is linked to JBS workers,", "url": "https://www.startribune.com/minnesota-deaths-up-23-to-244-in-covid-19-pandemic/569950232/", "urlToImage": null, "publishedAt": "2020-04-25T16:52:30Z", "content": "Twenty-three more people have died from COVID-19 in Minnesota, state health officials reported Saturday, as the number of confirmed cases continued to mount with expanded coronavirus testing across the state.\r\nThe statewide toll is now 244 deaths, according t… [+5178 chars]"}, {"source": {"id": null, "name": "Spectrumnews1.com"}, "author": "Amber Smith, Spectrum News Staff", "title": "Poisonings on Rise as Families Fight Coronavirus - Spectrum News 1", "description": "Huge increases are happening across the country", "url": "https://spectrumnews1.com/ky/lexington/news/2020/04/25/kentuckians-poisoning-themselves-fighting-covid-19", "urlToImage": null, "publishedAt": "2020-04-25T16:49:00Z", "content": "LOUISVILLE, Ky.  A new report from the Centers for Disease Control and Prevention says calls to poison control centers across the country received more than 45,000 calls tied to cleaners and disinfectants in the first three months of the year. That is a 20% j… [+1851 chars]"}, {"source": {"id": null, "name": "Ktar.com"}, "author": "", "title": "Arizona coronavirus cases increase to 6,280, death toll reaches 273 - KTAR.com", "description": "With 235 new positive tests for coronavirus reported by the state health department Saturday morning, Arizona has surpassed the 6,200-case mark.", "url": "https://ktar.com/story/3095911/arizona-coronavirus-cases-increase-to-6280-death-toll-reaches-273/", "urlToImage": null, "publishedAt": "2020-04-25T16:14:00Z", "content": "PHOENIX — With 235 new positive tests for coronavirus reported by the state health department Saturday morning, Arizona has surpassed the 6,200-case mark.\r\nThe state now has 6,280 cases with seven new deaths, bringing the death toll to 273.\r\nThere have been 6… [+2916 chars]"}, {"source": {"id": null, "name": "Dailyvoice.com"}, "author": null, "title": "Hospital: First Critical NJ Patients To Receive COVID-19 Plasma Make 'Remarkable' Recoveries - Daily Voice", "description": "The first two New Jersey residents to receive plasma transfusions for critical cases of COVID-19 -- a 63-year-old teacher and a 61-year-old old opera singer – were released from the hospital after making", "url": "https://dailyvoice.com/new-jersey/burlington/news/hospital-first-critical-nj-patients-to-receive-covid-19-plasma-make-remarkable-recoveries/787124/", "urlToImage": null, "publishedAt": "2020-04-25T16:09:00Z", "content": "The first two New Jersey residents to receive plasma transfusions for critical cases of COVID-19 -- a 63-year-old teacher and a 61-year-old old opera singer were released from the hospital after making \"remarkable\" recoveries, Virtua Voorhees Health System an… [+2571 chars]"}, {"source": {"id": null, "name": "Fox8.com"}, "author": "CNNwire", "title": "5-month-old daughter of a New York firefighter dies from coronavirus - WJW FOX 8 News Cleveland", "description": "A New York firefighter’s infant daughter has died from coronavirus, her family says, making her one of the youngest known victims of the virus.", "url": "https://fox8.com/news/coronavirus/5-month-old-daughter-of-a-new-york-firefighter-dies-from-coronavirus/", "urlToImage": null, "publishedAt": "2020-04-25T16:08:53Z", "content": "(CNN) — A New York firefighter’s infant daughter has died from coronavirus, her family says, making her one of the youngest known victims of the virus.\r\nFive-month-old Jay-Natalie, the daughter of New York City firefighter Jerel La Santa and Board of Educatio… [+2469 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Janelle Griffith", "title": "Detroit health care worker dies after being denied coronavirus test 4 times, daughter says - NBC News", "description": "A Detroit health care worker died April 17 of COVID-19, after being denied a coronavirus test four times by her hospital employer, her daughter said.", "url": "https://www.nbcnews.com/news/us-news/detroit-health-care-worker-dies-after-being-denied-coronavirus-test-n1192076", "urlToImage": null, "publishedAt": "2020-04-25T15:39:23Z", "content": "Deborah Gatewood had two years to go before she could retire from a Detroit hospital.\r\nBut Gatewood, a phlebotomist for three decades, will never celebrate that milestone.\r\nShe died April 17 from symptoms related to the coronavirus.\r\nHer daughter said that pr… [+3067 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Coronavirus daily news updates, April 25: What to know today about COVID-19 in the Seattle area, Washington state and the nation - Seattle Times", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMirwFodHRwczovL3d3dy5zZWF0dGxldGltZXMuY29tL3NlYXR0bGUtbmV3cy9oZWFsdGgvY29yb25hdmlydXMtZGFpbHktbmV3cy11cGRhdGVzLWFwcmlsLTI1LXdoYXQtdG8ta25vdy10b2RheS1hYm91dC1jb3ZpZC0xOS1pbi10aGUtc2VhdHRsZS1hcmVhLXdhc2hpbmd0b24tc3RhdGUtYW5kLXRoZS1uYXRpb24v0gG1AWh0dHBzOi8vd3d3LnNlYXR0bGV0aW1lcy5jb20vc2VhdHRsZS1uZXdzL2hlYWx0aC9jb3JvbmF2aXJ1cy1kYWlseS1uZXdzLXVwZGF0ZXMtYXByaWwtMjUtd2hhdC10by1rbm93LXRvZGF5LWFib3V0LWNvdmlkLTE5LWluLXRoZS1zZWF0dGxlLWFyZWEtd2FzaGluZ3Rvbi1zdGF0ZS1hbmQtdGhlLW5hdGlvbi8_YW1wPTE?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T15:21:00Z", "content": null}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Sandra G. Boodman", "title": "She fell more than 30 times. For three years, doctors couldn’t explain why. - The Washington Post", "description": "A bevy of specialists tried to help but seemed stymied by her symptoms — and their narrow focus.", "url": "https://www.washingtonpost.com/health/medical-mysteries/she-fell-more-than-30-times-for-three-years-doctors-couldnt-explain-why/2020/04/24/685c2eaa-62f5-11ea-acca-80c22bbee96f_story.html", "urlToImage": null, "publishedAt": "2020-04-25T15:11:19Z", "content": "The 10 doctors she consulted between 2016 and 2019 four orthopedists, three neurologists, a rheumatologist, a podiatrist and her internist reached disparate conclusions. One suggested she was clumsy. Others suspected her problem was primarily orthopedic or co… [+8899 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Shona Ghosh", "title": "Trump aides demanded hydroxychloroquine for millions: Vanity Fair - Business Insider - Business Insider", "description": "Hydroxychloroquine, repeatedly touted by President Trump as a potential cure, one drug trial in Brazil had to be abandoned after patients died.", "url": "https://www.businessinsider.com/emails-trump-aides-mass-distribution-hydroxychloroquine-unproven-2020-4", "urlToImage": null, "publishedAt": "2020-04-25T15:09:05Z", "content": "Trump administration officials concocted a plan to distribute millions of doses of the unproven drug hydroxychloroquine to COVID-19 outpatients, according to emails obtained by Vanity Fair.\r\nHydroxychloroquine is an effective anti-malarial drug, but despite b… [+2294 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Producer recorded talk between kids about Covid-19 - CNN", "description": "A CNN producer heard her daughter speaking with a friend, talking about coronavirus, and decided to film it. Child psychiatrist Dr. Wanjiku F.M. Njoroge explains how to talk to your children when tough questions on race and Covid-19 come up.", "url": "https://www.cnn.com/videos/health/2020/04/25/producer-daughter-video-chat-coronavirus-covid-19-sesame-street-town-hall-sot-vpx.cnn", "urlToImage": null, "publishedAt": "2020-04-25T14:48:32Z", "content": "Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds."}, {"source": {"id": null, "name": "Al.com"}, "author": "Leada Gore | lgore@al.com", "title": "194 new coronavirus cases in Alabama: Lt. Gov. claims ’15 days of downward trajectory’ - AL.com", "description": "The latest update on coronavirus cases in Alabama.", "url": "https://www.al.com/news/2020/04/194-new-coronavirus-cases-in-alabama-lt-gov-cites-15-days-of-downward-trajectory.html", "urlToImage": null, "publishedAt": "2020-04-25T14:28:18Z", "content": "The number of coronavirus cases in Alabama grew by 194 overnight.\r\nAccording to the April 25 9 a.m. data from the Alabama Department of Public Health, there are 6,026 coronavirus cases in Alabama with 209 deaths. The greatest number of deaths are in Mobile (4… [+1370 chars]"}, {"source": {"id": null, "name": "Wchstv.com"}, "author": "SHANNON STOWERS", "title": "W.Va. adds 10 positive COVID-19 cases Saturday morning - WCHS-TV8", "description": "West Virginia added 10 positive coronavirus cases to its total Saturday morning, health officials confirmed. The state's total now stands at 1,020, according to the West Virginia Department of Health and Human Resources. No new deaths were reported as of 10 a…", "url": "http://wchstv.com/news/local/wva-adds-10-more-positive-covid-19-cases-saturday-morning", "urlToImage": null, "publishedAt": "2020-04-25T14:14:00Z", "content": null}, {"source": {"id": null, "name": "Ktiv.com"}, "author": "Keith W. Bliven", "title": "109 New COVID-19 Cases Reported in Woodbury County - KTIV", "description": "That brings the total of positive cases that have been detected in the county to 396.", "url": "https://ktiv.com/2020/04/25/109-new-covid-19-cases-reported-in-woodbury-county/", "urlToImage": null, "publishedAt": "2020-04-25T13:56:59Z", "content": "SIOUX CITY (KTIV) -- On Saturday theSiouxland District Health Department reported an additional 109 confirmed positive cases of COVID-19.\r\nSOURCE: SIOUXLAND DISTRICT HEALTH DEPARTMENT\r\nThat brings the total of positive cases that have been detected in the cou… [+259 chars]"}, {"source": {"id": null, "name": "Globalnews.ca"}, "author": "Staff", "title": "WHO says ‘no evidence’ that recovered COVID-19 patients cannot be re-infected - Global News", "description": "The World Health Organization (WHO) said on Saturday that there was currently \"no evidence\" that people who have recovered from COVID-19 and have antibodies are protected from a second coronavirus infection.", "url": "http://globalnews.ca/news/6867902/coronavirus-who-patients-reinfected/", "urlToImage": null, "publishedAt": "2020-04-25T13:43:33Z", "content": "The World Health Organization (WHO) said on Saturday that there was currently “no evidence” that people who have recovered from COVID-19 and have antibodies are protected from a second coronavirus infection.\r\nIn a scientific brief, the United Nations agency w… [+1913 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Turlock nursing home says three residents, three staffers contracted coronavirus - Modesto Bee", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiPWh0dHBzOi8vd3d3Lm1vZGJlZS5jb20vbmV3cy9jb3JvbmF2aXJ1cy9hcnRpY2xlMjQyMjg1NzM2Lmh0bWzSAT1odHRwczovL2FtcC5tb2RiZWUuY29tL25ld3MvY29yb25hdmlydXMvYXJ0aWNsZTI0MjI4NTczNi5odG1s?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T13:29:40Z", "content": null}, {"source": {"id": null, "name": "Timesofisrael.com"}, "author": null, "title": "WHO says no evidence recovered COVID-19 patients are immune to reinfection - The Times of Israel", "description": "UN health agency warns against notion of 'immunity passports,' saying they could risk further transmission of the coronavirus", "url": "https://www.timesofisrael.com/who-says-no-evidence-recovered-covid-19-patients-immune-to-reinfection/", "urlToImage": null, "publishedAt": "2020-04-25T12:54:26Z", "content": "The World Health Organization on Saturday said there is currently no evidence that people who have recovered from COVID-19 and have antibodies are protected against a second infection, cautioning against the idea of immunity passports.\r\nThe concept of immunit… [+4204 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "'It's Nothing I've Ever Seen Before': Health Care Workers Share Their COVID-19 Stories - NBC New York", "description": "What is it like to be a worker at a hospital treating COVID-19 patients? Greg Cergol reports.", "url": "https://www.youtube.com/watch?v=2xPm5FVxo3U", "urlToImage": null, "publishedAt": "2020-04-25T12:15:10Z", "content": "Sign in to report inappropriate content.\r\nSign in"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandee LaMotte, CNN", "title": "Stressed pets: Reducing their anxiety now and when you go back to work - CNN", "description": "Not all of our pets are thrilled we're home 24/7: Here's how to recognize signs of stressed pets, help them, and prepare our pets for when we return to work.", "url": "https://www.cnn.com/2020/04/25/health/stressed-pets-coronavirus-wellness/index.html", "urlToImage": null, "publishedAt": "2020-04-25T11:45:49Z", "content": null}, {"source": {"id": "the-irish-times", "name": "The Irish Times"}, "author": "The Irish Times", "title": "Coronavirus: No evidence that recovered patients are immune, says WHO - The Irish Times", "description": "Health agency warns governments against issuing ‘immunity passports’", "url": "https://www.irishtimes.com/news/world/coronavirus-no-evidence-that-recovered-patients-are-immune-says-who-1.4238216", "urlToImage": null, "publishedAt": "2020-04-25T11:30:48Z", "content": "The World Health Organisation (WHO) said on Saturday that there was currently no evidence that people who have recovered from coronavirus and have antibodies are protected from a second coronavirus infection.\r\nIn a scientific brief, the United Nations agency … [+1685 chars]"}, {"source": {"id": null, "name": "Tribuneindia.com"}, "author": "Tribune India", "title": "Can you catch Covid-19 twice? WHO answers to it - The Tribune India", "description": "", "url": "https://www.tribuneindia.com/news/health/can-you-catch-covid-19-twice-who-answers-to-it-76173", "urlToImage": null, "publishedAt": "2020-04-25T11:26:13Z", "content": "Geneva, April 25\r\nThe World Health Organisation (WHO) said on Saturday that there was currently \"no evidence\" that people who have recovered from COVID-19 and have antibodies are protected from a second coronavirus infection.\r\nIn a scientific brief, the Unite… [+1678 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Dale Smith", "title": "Coronavirus antibody testing a big deal? What to know about the promising serology tests - CNET", "description": "Tests that detect whether you've recovered from COVID-19 might help doctors and government officials navigate the pandemic. Here's what you should know.", "url": "https://www.cnet.com/how-to/coronavirus-antibody-testing-a-big-deal-what-to-know-about-the-promising-serology-tests/", "urlToImage": null, "publishedAt": "2020-04-25T10:10:29Z", "content": "Antibody testing looks for evidence that a person has been infected with the coronavirus SARS-CoV-2, but not the virus itself.\r\nJames Martin/CNET\r\nFor the most up-to-date news and information about the coronavirus pandemic, visit the WHO website.\r\nAs some are… [+7629 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Michael Wilson", "title": "March, April, May: City’s Mood Darkens as Crisis Feels Endless - The New York Times", "description": "With no clues about when the pandemic might subside, short-term discomfort is becoming long-term despair: “I feel like I have accepted this, and given up.”", "url": "https://www.nytimes.com/2020/04/25/nyregion/nyc-coronavirus-crisis.html", "urlToImage": null, "publishedAt": "2020-04-25T09:43:43Z", "content": "With no clues about when the pandemic might subside, short-term discomfort is becoming long-term despair: I feel like I have accepted this, and given up.\r\nApril 25, 2020\r\nA walk in the park brings tense flare-ups: Back off, youre too close. Oh really? Then st… [+7411 chars]"}, {"source": {"id": null, "name": "Bostonglobe.com"}, "author": null, "title": "WHO says you could catch coronavirus more than once - The Boston Globe", "description": "“There is currently no evidence that people who have recovered from COVID-19 and have antibodies are protected from a second infection,” the United Nations agency said in an April 24 statement.", "url": "https://www.bostonglobe.com/2020/04/25/nation/who-says-you-could-catch-coronavirus-more-than-once/", "urlToImage": null, "publishedAt": "2020-04-25T09:35:16Z", "content": "Catching Covid-19 once may not protect you from getting it again, according to the World Health Organization, a finding that could jeopardize efforts to allow people to return to work after recovering from the virus.\r\nThere is currently no evidence that peopl… [+2099 chars]"}, {"source": {"id": null, "name": "Thejakartapost.com"}, "author": "The Jakarta Post", "title": "Success against malaria gives solutions for COVID-19 - The Jakarta Post - Jakarta Post", "description": "Today is World Malaria Day, a day when we remind ourselves of a disease that has killed more people in history than any other.", "url": "https://www.thejakartapost.com/academia/2020/04/25/success-against-malaria-gives-solutions-for-covid-19.html", "urlToImage": null, "publishedAt": "2020-04-25T04:56:00Z", "content": "Today is World Malaria Day, a day when we remind ourselves of a disease that has killed more people in history than any other.\r\nAs the world is focused on bringing the deadly COVID-19 pandemic under control, reflecting on the progress made in the fight agains… [+4107 chars]"}, {"source": {"id": null, "name": "Wkrn.com"}, "author": "CB Cotton", "title": "Vanderbilt releases new projections about COVID-19 spread after economic re-open - WKRN News 2", "description": "Researchers at Vanderbilt University Medical Center have released a new study with projections on what could happen if COVID-19 continues to spread, once the economy re-opens.", "url": "https://www.wkrn.com/community/health/coronavirus/vanderbilt-releases-new-projections-about-covid-19-spread-after-economic-re-open/", "urlToImage": null, "publishedAt": "2020-04-25T03:36:00Z", "content": "NASHVILLE, Tenn. (WKRN) Researchers at Vanderbilt University Medical Center have released a new study with projections on what could happen if COVID-19 continues to spread, once the economy re-opens.\r\n“What they [Friday’s projections] demonstrate today is wha… [+2313 chars]"}, {"source": {"id": null, "name": "Wtvbam.com"}, "author": "Jim Measel", "title": "MDOC reports 10th Lakeland prisoner death, 642 prisoners test positive - WTVB News", "description": "Friday's 971 tests have been conducted on Lakeland prisoners by the MDOC", "url": "https://wtvbam.com/news/articles/2020/apr/25/mdoc-reports-10th-lakeland-prisoner-death-642-prisoners-test-positive/1011009/", "urlToImage": null, "publishedAt": "2020-04-25T02:49:17Z", "content": "COLDWATER, MI (WTVB) - Expanded testing of the inmate population at the Lakeland Correctional Facility in Coldwater continues as the Michigan Department of Corrections reported a tenth prisoner at the prison has died from COVID-19.\r\nThe MDOC reported on Frida… [+581 chars]"}, {"source": {"id": null, "name": "Fox17.com"}, "author": "WZTV Staff", "title": "Mt. Juliet Police looking for suspect who ran away from officer - WZTV", "description": "UPDATE:The Mt. Juliet Police Department has taken the suspect accused of running from an officer into custody. K9 Majlo tracked the suspect's scent to his location. Officers say the suspect is a 25-year-old man with multiple felony warrants out of Nashville, …", "url": "http://fox17.com/news/local/mt-juliet-police-looking-for-suspect-who-ran-away-from-officer", "urlToImage": null, "publishedAt": "2020-04-25T02:48:27Z", "content": null}, {"source": {"id": null, "name": "Wlos.com"}, "author": "Kimberly King", "title": "Disagreement among Asheville, Henderson County leaders over extended stay home order - WLOS", "description": "Gov. Roy Cooper&rsquo;s extended stay home order coupled with a vague outline of phases for reopening North Carolina&rsquo;s economy is being met with mixed reviews by leaders in democratic-led Buncombe County and Republican-led Henderson County. WLOS. On Fri…", "url": "http://wlos.com/news/local/disagreement-among-asheville-henderson-county-leaders-over-extended-stay-home-order", "urlToImage": null, "publishedAt": "2020-04-25T02:35:25Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "12 residents die at Madison County nursing home during coronavirus outbreak - Belleville News-Democrat", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiOmh0dHBzOi8vd3d3LmJuZC5jb20vbmV3cy9jb3JvbmF2aXJ1cy9hcnRpY2xlMjQyMjc3ODY2Lmh0bWzSATpodHRwczovL2FtcC5ibmQuY29tL25ld3MvY29yb25hdmlydXMvYXJ0aWNsZTI0MjI3Nzg2Ni5odG1s?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T01:08:06Z", "content": null}, {"source": {"id": null, "name": "Kfyrtv.com"}, "author": "Valley News Live", "title": "Doosan Bobcat tells employees at Gwinner plant to stay home due to possible COVID-19 case - KFYR-TV", "description": "Doosan Bobcat says it has asked employees to not report to work on Friday after a presumptive positive case of COVID-19.", "url": "https://www.kfyrtv.com/content/news/Doosan-Bobcat-tells-employees-at-Gwinner-plant-to-stay-home-due-to-possible-COVID-19-case-569938901.html", "urlToImage": null, "publishedAt": "2020-04-25T00:14:00Z", "content": "GWINNER, N.D. (Valley News Live) - Doosan Bobcat says it has asked employees to not report to work on Friday after a presumptive positive case of COVID-19.\r\nAccording to a statement, an employee at the Gwinner plant self-disclosed of possibly having the infec… [+611 chars]"}, {"source": {"id": null, "name": "Inquirer.com"}, "author": "Ariana Eunjung Cha, Washington Post", "title": "Healthy people in their 30s and 40s, barely sick with COVID-19, are dying from strokes - The Philadelphia Inquirer", "description": "Thomas Oxley wasn't even on call the day he received the page to come into Mount Sinai Beth Israel Hospital in Manhattan. There weren't enough doctors to treat all the emergency stroke patients, and he was needed in the operating room.", "url": "https://www.inquirer.com/health/coronavirus/coronavirus-stroke-young-people-20200424.html", "urlToImage": null, "publishedAt": "2020-04-24T22:49:29Z", "content": "Thomas Oxley wasn't even on call the day he received the page to come into Mount Sinai Beth Israel Hospital in Manhattan. There weren't enough doctors to treat all the emergency stroke patients, and he was needed in the operating room.\r\nThe patient's chart ap… [+8996 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "What to know about protecting pets from coronavirus, caring for them if you’re sick - The State", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiP2h0dHBzOi8vd3d3LnRoZXN0YXRlLmNvbS9uZXdzL2Nvcm9uYXZpcnVzL2FydGljbGUyNDIyNzM5NTYuaHRtbNIBP2h0dHBzOi8vYW1wLnRoZXN0YXRlLmNvbS9uZXdzL2Nvcm9uYXZpcnVzL2FydGljbGUyNDIyNzM5NTYuaHRtbA?oc=5", "urlToImage": null, "publishedAt": "2020-04-24T21:37:13Z", "content": null}, {"source": {"id": null, "name": "Abc6onyourside.com"}, "author": "Stephen Loiaconi", "title": "Biden benefits from staying out of spotlight amid coronavirus outbreak, experts say - ABC6OnYourSide.com", "description": "Former Vice President Joe Biden is building a lead over President Donald Trump in key swing states, new polls suggest, as voters question Trump&rsquo;s response to the coronavirus outbreak and pay relatively little attention to anything Biden is doing at all.…", "url": "http://abc6onyourside.com/news/nation-world/biden-benefits-from-staying-out-of-spotlight-amid-coronavirus-outbreak-experts-say", "urlToImage": null, "publishedAt": "2020-04-24T21:37:00Z", "content": null}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Joseph Guzman", "title": "New report: Coronavirus lingers in patient's eyes days after it leaves nose | TheHill - The Hill", "description": "A new report is detailing how the coronavirus can exist in an infected person’s eye fluids at potentially contagious levels.", "url": "https://thehill.com/changing-america/well-being/prevention-cures/494586-coronavirus-found-in-patients-eyes-days-after-it", "urlToImage": null, "publishedAt": "2020-04-24T21:19:55Z", "content": "A recently published report is detailing how Italys first coronavirus patient had detectable traces of the virus in her eyes days after it had cleared from her nose, highlighting how the eyes could play a factor in the spread of COVID-19. \r\nThe patient, a 65-… [+2785 chars]"}, {"source": {"id": null, "name": "Cbsaustin.com"}, "author": "Samantha Rojas", "title": "24 new COVID-19 cases reported in Williamson County, recoveries climb to 124 - KEYE TV CBS Austin", "description": "The Williamson County and Cities Health District announced 24 new positive COVID-19 cases on Friday, bringing the total to 206. So far, 124 people have recovered from coronavirus in WilCo. This is the second day in a row where WilCo. has reported a big jump i…", "url": "http://cbsaustin.com/news/local/24-new-covid-19-cases-reported-in-williamson-county-recoveries-climb-to-124", "urlToImage": null, "publishedAt": "2020-04-24T17:49:00Z", "content": null}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Beth Mole", "title": "Experts demolish studies suggesting COVID-19 is no worse than flu - Ars Technica", "description": "Authors of widely publicized antibody studies “owe us all an apology,” one expert says.", "url": "https://arstechnica.com/science/2020/04/experts-demolish-studies-suggesting-covid-19-is-no-worse-than-flu/", "urlToImage": null, "publishedAt": "2020-04-24T17:33:00Z", "content": "Enlarge/ A COVID-19 blood test is administered outside of Delmont Medical Care on April 22, 2020 in Franklin Square, New York. The test identifies antibodies to the coronavirus. \r\n135 with 85 posters participating\r\nFrustrated statisticians and epidemiologists… [+9053 chars]"}, {"source": {"id": null, "name": "Dailycommercial.com"}, "author": "Frank  Jolley", "title": "Lake man latest to die from COVID-19 - Daily Commercial", "description": "A Lake County man is latest area resident to die from the COVID-19 coronavirus. His death was reported Thursday evening in the Florida Department of", "url": "https://www.dailycommercial.com/article/20200424/NEWS/200428911", "urlToImage": null, "publishedAt": "2020-04-24T17:21:00Z", "content": "A Lake County man is latest area resident to die from the COVID-19 coronavirus. His death was reported Thursday evening in the Florida Department of Health’s late update, bringing the local death count from the coronavirus to 21. State officials have not rele… [+3907 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Tim Herrera", "title": "What Is Convalescent Plasma, and Why Do We Care About It? - The New York Times", "description": "Plasma from people who have recovered from Covid-19 may help others fight the disease.", "url": "https://www.nytimes.com/2020/04/24/smarter-living/coronavirus-convalescent-plasma-antibodies.html", "urlToImage": null, "publishedAt": "2020-04-24T16:30:09Z", "content": "A medical procedure doctors have used to treat novel diseases for a century has emerged as a focal point in the fight against Covid-19: convalescent plasma.\r\nConva-what-now?\r\nConvalescent plasma is the term used for plasma that is removed from the blood of a … [+8375 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Elisabeth Buchwald", "title": "‘We don’t eat our countertops,’ yet many Americans are using cleaning products meant for them on their fruits and vegetables, National Poison Control Center official says - MarketWatch", "description": "Poison control centers across the U.S. saw a 20% increase in calls last month compared to 2019.", "url": "https://www.marketwatch.com/story/we-dont-eat-our-countertops-yet-many-americans-are-using-cleaning-products-meant-for-them-on-their-fruits-and-vegetables-says-national-poison-control-center-official-2020-04-24", "urlToImage": null, "publishedAt": "2020-04-24T15:11:26Z", "content": "Shortages of cleaning supplies amid the coronavirus pandemic are leading many Americans to get creative. But that creativity and compulsion to clean and disinfect more may be causing more harm than good.Last month, calls to poison control centers surged by ne… [+4139 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "David Nikel", "title": "Sweden Health Chief Admits ‘It’s Not Over’ As Coronavirus Cases Leap - Forbes", "description": "Following an additional 131 deaths reported in the last 24 hours, Sweden’s COVID-19 death toll now stands at 2,152.", "url": "https://www.forbes.com/sites/davidnikel/2020/04/24/sweden-health-chief-admits-its-not-over-as-coronavirus-cases-leap/", "urlToImage": null, "publishedAt": "2020-04-24T15:09:59Z", "content": "Sweden's state epidemiologist Anders Tegnell has said the number of COVID-19 deaths in Sweden have ... [+] been higher than expected.\r\nAFP via Getty Images\r\nSwedens state epidemiologist Anders Tegnell has announced a record daily high of coronavirus cases for… [+3119 chars]"}, {"source": {"id": null, "name": "Pjmedia.com"}, "author": null, "title": "The Mystery of Patricia Dowd: First COVID-19 Death? - PJ Media", "description": "Was Patricia Dowd the first COVID-19 death in the United States?", "url": "https://pjmedia.com/news-and-politics/the-mystery-of-patricia-dowd-first-covid-19-death/", "urlToImage": null, "publishedAt": "2020-04-24T13:36:50Z", "content": "There's a story a few days ago that Patricia Dowd, a woman in Santa Clara County, Calif., who died on February 6, died of COVID-19, making hers the first COVID-19 death in the U.S.Keep your eye on the ball here. Here's the headline:\r\n County of Santa Clara Id… [+3714 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Harmony Otete Omeife, Lecturer, University of Central Lancashire", "title": "Coronavirus: distancing and handwashing could lower flu rates – but it's still too early to tell - Yahoo News", "description": "Early evidence from Japan suggests protective measures against COVID-19 may also be protecting us against influenza.", "url": "https://uk.news.yahoo.com/coronavirus-distancing-handwashing-could-lower-124101776.html", "urlToImage": null, "publishedAt": "2020-04-24T12:41:00Z", "content": "In order to slow the spread of COVID-19, many countries around the world have implemented protective strategies. These include quarantine and social distancing, school closures, and closing restaurants and other public places. Governments have also advised pe… [+5599 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Gerald Imray", "title": "Fight against malaria could be set back 20 years, WHO warns - The Associated Press", "description": "CAPE TOWN, South Africa (AP) — One of the hard lessons the World Health Organization learned during the Ebola outbreak in West Africa was this: Other diseases can be forgotten and take a deadlier...", "url": "https://apnews.com/f56bd3aa90391e091c3a39d4fcc6f515", "urlToImage": null, "publishedAt": "2020-04-24T12:06:45Z", "content": "CAPE TOWN, South Africa (AP) One of the hard lessons the World Health Organization learned during the Ebola outbreak in West Africa was this: Other diseases can be forgotten and take a deadlier toll.\r\nThe WHO is now warning that the battle against malaria in … [+2837 chars]"}, {"source": {"id": null, "name": "Nbc-2.com"}, "author": null, "title": "Fact Check: Are 'COVID toes' a new symptom? - NBC2 News", "description": "", "url": "https://www.nbc-2.com/story/42045361/fact-check-are-covid-toes-a-new-symptom", "urlToImage": null, "publishedAt": "2020-04-24T10:18:00Z", "content": "Another is that it's a reaction to increased inflammation in your body.\r\nJust how common is it? That's unclear too.\r\nNBC2 asked health care systems in Lee, Collier, Charlotte and Hendry counties about this. Only Lee Health and Naples Community Hospital respon… [+156 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Erika Edwards", "title": "Doctors report uptick in surprising coronavirus complication: dangerous blood clots - NBC News", "description": "Coronavirus patients are developing blood clots at higher rates. Does the virus cause blood to clot, or is it the result of inflammation? Regular anticoagulants aren't working.", "url": "https://www.nbcnews.com/health/health-news/doctors-report-uptick-surprising-coronavirus-complication-dangerous-blood-clots-n1190491", "urlToImage": null, "publishedAt": "2020-04-24T08:33:27Z", "content": "Three weeks ago, critical care pulmonologist Hugh Cassiere encountered something he hadn't seen in 24 years of practicing medicine.\r\nA 45-year-old man arrived at the hospital where Cassiere works, North Shore University Hospital on Long Island, New York, with… [+4346 chars]"}]}