{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Sfgate.com"}, "author": "Eric Ting, Matthew Tom", "title": "Wife's email may have tainted Stanford coronavirus antibody study - SF Gate", "description": "The wife of a Stanford professor solicited parents via email in Los Altos to join her husband's coronavirus antibody study, falsely claiming that the tests were \"FDA approved\" and would tell participants whether they were immune, potentially comprising the st…", "url": "https://www.sfgate.com/bayarea/article/Wife-s-email-may-have-tainted-Stanford-15225414.php", "urlToImage": null, "publishedAt": "2020-04-25T04:36:54Z", "content": "An employee holds up an antibody test cartridge of the ichroma COVID-19 Ab testing kit used in diagnosing the coronavirus for a photograph on a production line of the Boditech Med Inc. in Chuncheon, South Korea, Friday, April 17, 2020. Boditech Med recently s… [+7163 chars]"}, {"source": {"id": null, "name": "Cbslocal.com"}, "author": "CBS San Francisco", "title": "Coronavirus Update: San Jose's Patricia Dowd Identified As 1st US Death - CBS San Francisco", "description": "Santa Clara County's first death from COVID-19 - as well as the first U.S. death - was identified as 57-year-old Patricia Dowd, a senior manager for a Silicon Valley semiconductor firm, according to the county coroner's office.", "url": "https://sanfrancisco.cbslocal.com/2020/04/23/coronavirus-san-jose-santa-clara-county-patricia-dowd-1st-us-covid19-death/", "urlToImage": null, "publishedAt": "2020-04-25T03:49:51Z", "content": "SAN JOSE (CBS SF) — Santa Clara County’s first death from COVID-19 – as well as the first U.S. death – was identified as 57-year-old Patricia Dowd, a senior manager for a Silicon Valley semiconductor firm, according to the county coroner’s office.\r\nThe Los An… [+1845 chars]"}, {"source": {"id": null, "name": "Latimes.com"}, "author": "Matt Hamilton, Alex Wigglesworth, John Myers, Melanie Mason", "title": "National Guard helps L.A. nursing homes with coronavirus - Los Angeles Times", "description": "National Guard sent to Califoirnia nursing homes as officials face to slow deadly outbreaks", "url": "https://www.latimes.com/california/story/2020-04-24/national-guard-sent-to-califoirnia-nursing-homes-as-officials-face-to-slow-deadly-outbreaks", "urlToImage": null, "publishedAt": "2020-04-25T02:32:28Z", "content": "For weeks, public health officials have struggled to slow the deadly spread of coronavirus through nursing homes. \r\nAt one facility in Tulare County, 15 have now died. The death toll has reached 18 at a Yucaipa nursing home, 14 at a Pasadena facility and 17 a… [+6993 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Cyclist berated by CNN's Cuomo speaks out on 'Tucker Carlson Tonight' - Fox News", "description": "Long Island resident David Whelan says he was verbally attacked by Chris Cuomo when he challenged the CNN anchor for breaking coronavirus quarantine. #FoxNew...", "url": "https://www.youtube.com/watch?v=P-rKGk8AhA0", "urlToImage": null, "publishedAt": "2020-04-25T01:45:08Z", "content": "Long Island resident David Whelan says he was verbally attacked by Chris Cuomo when he challenged the CNN anchor for breaking coronavirus quarantine. #FoxNews#Tucker\r\nFOX News operates the FOX News Channel (FNC), FOX Business Network (FBN), FOX News Radio, FO… [+1667 chars]"}, {"source": {"id": null, "name": "Kutv.com"}, "author": "Kelly Vaughen", "title": "Drive-in movie theater cancels Friday opening due to county public health order - KUTV 2News", "description": "The Redwood Drive-In Theater in West Valley City had plans to reopen Friday night but was ordered to remain closed by the Salt Lake County Health Department. The health department told the drive-in that opening tonight would be in violation of the county&rsqu…", "url": "http://kutv.com/news/local/drive-in-movie-theater-cancels-friday-opening-due-to-county-public-health-order", "urlToImage": null, "publishedAt": "2020-04-25T01:40:46Z", "content": null}, {"source": {"id": null, "name": "Wkyt.com"}, "author": "Grace Finerman", "title": "Lexington dentist: Monday is too soon to reopen - WKYT", "description": "Monday non-emergency healthcare will get the go-ahead to continue after weeks of only seeing emergency patients. One dentist warns... not so fast.", "url": "https://www.wkyt.com/content/news/dentist-story-569938741.html", "urlToImage": null, "publishedAt": "2020-04-25T01:12:51Z", "content": "LEXINGTON, Ky. (WKYT) - Monday will be a big day in Kentucky. The day non-emergency healthcare will get the go-ahead to continue after weeks of only seeing emergency patients. \r\nOne dentist warns not so fast. \r\n\"I don't think it's realistic, and I think I can… [+1080 chars]"}, {"source": {"id": null, "name": "Azcentral.com"}, "author": "Katie Surma", "title": "Sonora Quest Laboratories launch COVID-19 antibody testing in Arizona - AZCentral", "description": "Sonora Quest expects to perform 1,000 to 3,000 tests a day initially with a one day to four day turnaround time.", "url": "https://www.azcentral.com/story/news/local/arizona-health/2020/04/24/covid-19-antibody-tests-available-through-sonora-quest-laboratories/3023952001/", "urlToImage": null, "publishedAt": "2020-04-25T01:07:37Z", "content": "Sonora Quest Laboratories is now antibody testing for COVID-19 in Arizona and individuals can get a test with a physician's prescription.\r\nAntibody testing, also called serology testing, can indicate whether an individual has been exposed to COVID-19 and deve… [+2854 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rosa Flores, Sara Weisfeldt and Arman Azad, CNN", "title": "2 studies show many people who tested positive for Covid-19 displayed no symptoms - CNN", "description": "Two coronavirus studies released Friday -- one involving almost 2,000 people from Florida and the other from a Washington state nursing home -- came to the same conclusion: Many of the people who tested positive for the virus didn't know it they had it becaus…", "url": "https://www.cnn.com/2020/04/24/us/2-asymptomatic-coronavirus-studies/index.html", "urlToImage": null, "publishedAt": "2020-04-25T00:54:57Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Mysteries remain about coronavirus - ABC News", "description": "Dr. Simone Wiles, an infectious disease physician, joins us to discuss how scientists race to learn more about this deadly virus. ABC News Live Prime, Weekda...", "url": "https://www.youtube.com/watch?v=fLNwkogfNfs", "urlToImage": null, "publishedAt": "2020-04-25T00:46:03Z", "content": "Dr. Simone Wiles, an infectious disease physician, joins us to discuss how scientists race to learn more about this deadly virus.\r\nABC News Live Prime, Weekdays at 7EST &amp; 9EST WATCH the ABC News Live Stream Here: https://www.youtube.com/watch?v=w_Ma8...\r\n… [+234 chars]"}, {"source": {"id": null, "name": "Wfmynews2.com"}, "author": null, "title": "CDC adds 6 new symptoms to coronavirus list - WFMYNews2.com", "description": "The CDC adds chills, repeated shaking with chills, muscle pain, headache, sore throat and new loss of taste or smell as official symptoms of COVID-19", "url": "https://www.wfmynews2.com/article/news/health/coronavirus/new-coronavirus-symptoms/83-48c3591e-b162-4da2-938b-d8cf3681d80d", "urlToImage": null, "publishedAt": "2020-04-25T00:13:00Z", "content": "The Center for Disease Control has updated its list of symptoms people experience when they get sick from the coronavirus.\r\nThe new list includes six new symptoms. For more than a month, the only official symptoms of coronavirus were fever, cough and shortnes… [+1067 chars]"}, {"source": {"id": null, "name": "Oregonlive.com"}, "author": "Shane Dixon Kavanaugh | The Oregonian/OregonLive", "title": "Oregon’s strict social distancing averted 70,000 coronavirus infections, new analysis suggests - OregonLive", "description": "“Our collective efforts are working,” said Dr. Dean Sidelinger, the state’s epidemiologist.", "url": "https://www.oregonlive.com/coronavirus/2020/04/oregons-strict-social-distancing-averted-70000-coronavirus-infections-new-analysis-shows.html", "urlToImage": null, "publishedAt": "2020-04-24T23:56:00Z", "content": "Oregons aggressive steps to slow the spread of the novel coronavirus may have averted more than 70,000 infections, including almost 1,500 hospitalizations, according to a new analysis released Friday by state health officials.\r\nThe projections, provided by th… [+3044 chars]"}, {"source": {"id": null, "name": "Wjhl.com"}, "author": null, "title": "Three employees test positive for COVID-19 at Ivy Hall Nursing Home in Elizabethton - WJHL-TV News Channel 11", "description": "ELIZABETHTON, Tenn. (WJHL) – Three employees of the Ivy Hall Nursing Home in Elizabethton have tested positive for COVID-19, according to a spokesperson for the nursing home. All three employ…", "url": "https://www.wjhl.com/local-coronavirus-coverage/three-employees-test-positive-for-covid-19-at-ivy-hall-nursing-home-in-elizabethton/", "urlToImage": null, "publishedAt": "2020-04-24T23:39:00Z", "content": "ELIZABETHTON, Tenn. (WJHL) – Three employees of the Ivy Hall Nursing Home in Elizabethton have tested positive for COVID-19, according to a spokesperson for the nursing home.\r\nAll three employees have self-quarantined at home according to the nursing home. \r\n… [+461 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Today, The U.S. Passed 50000 Deaths Due To COVID-19 | MTP Daily | MSNBC - MSNBC", "description": "Today, the U.S. passed 50,000 deaths due to COVID-19. Chuck Todd says, \"At this rate, in just a few days, more Americans will have died from Coronavirus over...", "url": "https://www.youtube.com/watch?v=1B5UdkzxcbE", "urlToImage": null, "publishedAt": "2020-04-24T23:32:05Z", "content": "Today, the U.S. passed 50,000 deaths due to COVID-19. Chuck Todd says, \"At this rate, in just a few days, more Americans will have died from Coronavirus over a span of roughly 9 weeks than died in the Vietnam War over a span of 12-years.\" Aired on 4/24/2020.»… [+770 chars]"}, {"source": {"id": null, "name": "Geekwire.com"}, "author": "https://www.facebook.com/alan.boyle", "title": "UW Medicine to conduct clinical trial for hydroxychloroquine with COVID patients - GeekWire", "description": "Researchers are looking for people who have tested positive for COVID-19 to participate in a clinical trial aimed at finding out whether hydroxychloroquine can keep them out of the hospital.", "url": "https://www.geekwire.com/2020/uw-medicine-conduct-clinical-trial-hydroxychloroquine-covid-19-patients/", "urlToImage": null, "publishedAt": "2020-04-24T23:25:13Z", "content": "The University of Washington is seeking out COVID-19 patients to participate in a study focusing on hydroxychloroquine and a hydroxychloroquine-azithromycin combinagtion. (CatherineL-Prod Photo via Bigstock)\r\nThe University of Washington School of Medicine is… [+3741 chars]"}, {"source": {"id": null, "name": "News4jax.com"}, "author": "Kelly Wiley", "title": "31 coronavirus cases reported in outbreak at Clay County elder-care facility - WJXT News4JAX ", "description": "A Clay County long-term care facility has disclosed an outbreak of novel coronavirus impacting over 30 residents and staff, a week after refusing to acknowledge the extent of its infections.", "url": "https://www.news4jax.com/news/local/2020/04/24/31-coronavirus-cases-reported-in-outbreak-at-clay-county-elder-care-facility/", "urlToImage": null, "publishedAt": "2020-04-24T22:48:18Z", "content": "ORANGE PARK, Fla. A Clay County long-term care facility has disclosed an outbreak of novel coronavirus impacting over 30 residents and staff, a week after refusing to acknowledge the extent of its infections.\r\nThere are at least 31 confirmed cases of COVID-19… [+6513 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Ariana Eunjung Cha", "title": "Young and middle-aged people, barely sick with covid-19, are dying from strokes - The Washington Post", "description": "Doctors sound alarm about patients in their 30s and 40s left debilitated or dead by strokes. Some didn’t even know they were infected by coronavirus.", "url": "https://www.washingtonpost.com/health/2020/04/24/strokes-coronavirus-young-patients/", "urlToImage": null, "publishedAt": "2020-04-24T22:36:00Z", "content": "Thomas Oxley wasnt even on call the day he received the page to come into Mount Sinai Beth Israel Hospital in Manhattan. There werent enough doctors to treat all the emergency stroke patients, and he was needed in the operating room.\r\nThe patients chart appea… [+9500 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sarah Jorgensen and Scottie Andrew, CNN", "title": "The 5-month-old daughter of a New York firefighter dies from coronavirus - CNN", "description": "A New York firefighter's infant daughter has died from coronavirus, her family says, making her one of the youngest known victims of the virus.", "url": "https://www.cnn.com/2020/04/24/us/fdny-firefighter-daughter-dies-coronavirus-trnd/index.html", "urlToImage": null, "publishedAt": "2020-04-24T22:35:49Z", "content": null}, {"source": {"id": null, "name": "Newser.com"}, "author": "Bob Cronin", "title": "Lawmakers Back Infecting People for Vaccine Trials - Newser", "description": "FDA hesitates, but bioethicists endorse the idea if done properly", "url": "https://www.newser.com/story/290026/this-vaccine-trial-would-need-volunteers.html", "urlToImage": null, "publishedAt": "2020-04-24T22:20:00Z", "content": "(Newser)\r\nThirty-five House members have expressed support for intentionally infecting a few hundred people with the coronavirus in an effort to develop a vaccine as quickly as possible. The young and healthy volunteers would first be given either the drug be… [+1460 chars]"}, {"source": {"id": null, "name": "Komonews.com"}, "author": "KOMO News Staff", "title": "Virus death toll rises to 723 in Wash.; King Co. sees downward trend - KOMO News", "description": "The novel coronavirus claimed at least 13 more lives in Washington state in the past day, pushing the statewide death toll to 724, according to reports from individual counties. King County and Pierce County each reported three new deaths, Clark County tallie…", "url": "http://komonews.com/news/coronavirus/virus-death-toll-rises-to-723-in-wash-king-co-sees-downward-trend", "urlToImage": null, "publishedAt": "2020-04-24T22:19:00Z", "content": null}, {"source": {"id": null, "name": "Nola.com"}, "author": "CARLIE KOLLATH WELLS | Staff writer", "title": "When should I wear a facemask? Here's what health experts say about coronavirus guidelines - NOLA.com", "description": "Do you need to wear one when you are doing for a run?", "url": "https://www.nola.com/news/coronavirus/article_c0291e22-8631-11ea-a77a-2fbbb7d2e025.html", "urlToImage": null, "publishedAt": "2020-04-24T21:45:00Z", "content": "Wearing a face mask or a face covering is the going to be the new normal during the coronavirus pandemic, experts say. But do you have to wear them all the time? \r\nIt's voluntary to wear one, but local and federal health officials strongly recommend covering … [+2890 chars]"}, {"source": {"id": null, "name": "Abc7chicago.com"}, "author": "Liz Nagy", "title": "Melrose Park coronavirus: Officer Joseph Cappello dies from COVID-19 - WLS-TV", "description": "Melrose Park police announced one of their officers died from complications from COVID-19 Friday, the department's first coronavirus death.", "url": "https://abc7chicago.com/coronavirus-illinois-melrose-park-police-department/6127691/", "urlToImage": null, "publishedAt": "2020-04-24T21:38:07Z", "content": "MELROSE PARK, Ill. (WLS) -- Melrose Park police announced one of their officers has died from complications from COVID-19, the department's first coronavirus death.Joseph Cappello, 55, died Friday, the Melrose Park Police Department spokesman said.\r\nRELATED: … [+2144 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "What to know about protecting pets from coronavirus, caring for them if you’re sick - The State", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiP2h0dHBzOi8vd3d3LnRoZXN0YXRlLmNvbS9uZXdzL2Nvcm9uYXZpcnVzL2FydGljbGUyNDIyNzM5NTYuaHRtbNIBP2h0dHBzOi8vYW1wLnRoZXN0YXRlLmNvbS9uZXdzL2Nvcm9uYXZpcnVzL2FydGljbGUyNDIyNzM5NTYuaHRtbA?oc=5", "urlToImage": null, "publishedAt": "2020-04-24T21:37:13Z", "content": null}, {"source": {"id": null, "name": "Abc6onyourside.com"}, "author": "Stephen Loiaconi", "title": "Biden benefits from staying out of spotlight amid coronavirus outbreak, experts say - ABC6OnYourSide.com", "description": "Former Vice President Joe Biden is building a lead over President Donald Trump in key swing states, new polls suggest, as voters question Trump&rsquo;s response to the coronavirus outbreak and pay relatively little attention to anything Biden is doing at all.…", "url": "http://abc6onyourside.com/news/nation-world/biden-benefits-from-staying-out-of-spotlight-amid-coronavirus-outbreak-experts-say", "urlToImage": null, "publishedAt": "2020-04-24T21:37:00Z", "content": null}, {"source": {"id": null, "name": "Dailyvoice.com"}, "author": null, "title": "COVID-19: Here's Latest Update On Number Of Orange County Deaths, Cases - Daily Voice", "description": "The number of confirmed cases and fatalities tied to novel coronavirus (COVID-19) in Orange County continues to be on the rise.As of Thursday, April 23, there have now been 7,770 COVID-19 cases throughout the county, with 339 new cases r...", "url": "https://dailyvoice.com/new-york/southorange/news/covid-19-heres-latest-update-on-number-of-orange-county-deaths-cases/787095/", "urlToImage": null, "publishedAt": "2020-04-24T20:56:28Z", "content": "The number of confirmed cases and fatalities tied to novel coronavirus (COVID-19) in Orange County continues to be on the rise.\r\nAs of Thursday, April 23, there have now been 7,770 COVID-19 cases throughout the county, with 339 new cases recorded, according t… [+1033 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Tom Tapp", "title": "L.A. County Coronavirus Update: Daily Number of Deaths Drops; Seniors Now A Major Focus - Deadline", "description": "Los Angeles County reported 52 more coronavirus-related deaths on Friday. That’s fewer deaths than the 68 reported on Thursday, and it represents the first decrease in recent days. The new reporting moves the region’s total death toll from the virus to 848. D…", "url": "https://deadline.com/2020/04/l-a-county-coronavirus-death-numbers-update-1202917373/", "urlToImage": null, "publishedAt": "2020-04-24T20:48:53Z", "content": "Los Angeles County reported 52 more coronavirus-related deaths on Friday. That’s fewer deaths than the 68 reported on Thursday, and it represents the first decrease in recent days. The new reporting moves the region’s total death toll from the virus to 848.\r\n… [+1845 chars]"}, {"source": {"id": null, "name": "Abc7news.com"}, "author": null, "title": "Coronavirus outbreak: 10 residents die at Redwood City nursing home - KGO-TV", "description": "\"We will never be the same, but then again, none of us will be,\" said the elderly care facility in a statement.", "url": "https://abc7news.com/redwood-city-nursing-home-coronavirus-outbreak-gordon-manor-deaths/6127477/", "urlToImage": null, "publishedAt": "2020-04-24T20:15:12Z", "content": "SAN FRANCISCO (KGO) -- Ten residents at Gordon Manor assisted living facility in Redwood City have passed away as a result of novel coronavirus.RELATED: I-Team uncovers disturbing details about Hayward nursing facility, site of Bay Area's largest COVID-19 out… [+2924 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "New pandemic model estimates coronavirus outbreak was spreading earlier than U.S. realized - CBS News", "description": "A New York Times analysis of the modeling estimates New York City had 10,000 infections by March 1, two weeks before social distancing guidelines were put in place.", "url": "https://www.cbsnews.com/news/coronavirus-pandemic-model-outbreaks-earlier-cities-new-york/", "urlToImage": null, "publishedAt": "2020-04-24T20:06:45Z", "content": "New information suggests the coronavirus was spreading rapidly in the US much earlier than first thought.  Only 23 coronavirus cases in several major cities had been reported by March 1, but analysis from a Northeastern University pandemic model estimates the… [+2211 chars]"}, {"source": {"id": null, "name": "Dallasnews.com"}, "author": "Tom Steele", "title": "Dallas County officials report 71 new coronavirus cases, 5 more deaths - The Dallas Morning News", "description": "For the fifth straight day, fewer than 100 new cases of COVID-19 were reported among Dallas County residents. Friday’s announcement of 71 additional...", "url": "https://www.dallasnews.com/news/public-health/2020/04/24/dallas-county-officials-report-71-new-coronavirus-cases-5-more-deaths/", "urlToImage": null, "publishedAt": "2020-04-24T19:33:30Z", "content": "Updated at 8:40 p.m.: Revised to include latest data from Ellis County.\r\nFor the fifth straight day, fewer than 100 new cases of COVID-19 were reported among Dallas County residents.\r\nFridays announcement of 71 additional positive coronavirus tests brought th… [+4974 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Should You Drink Bleach or Lysol to Cure Coronavirus? - Inside Edition", "description": "Just to be clear: it is never, ever, OK to inject disinfectants, bleach, or cleaning products. Likewise with ingesting such products. The musings of Presiden...", "url": "https://www.youtube.com/watch?v=CU9YrrwTVMU", "urlToImage": null, "publishedAt": "2020-04-24T19:30:11Z", "content": "Just to be clear: it is never, ever, OK to inject disinfectants, bleach, or cleaning products. Likewise with ingesting such products. The musings of President Trump about using such things to combat coronavirus had barely left his lips Thursday evening when s… [+135 chars]"}, {"source": {"id": null, "name": "Columbian.com"}, "author": null, "title": "Clark County COVID-19 deaths at 19, with 327 confirmed cases - The Columbian", "description": "Clark County Public Health confirmed two new COVID-19 deaths and six new cases on Friday morning.", "url": "https://www.columbian.com/news/2020/apr/24/clark-county-covid-19-deaths-at-19-with-327-confirmed-cases/", "urlToImage": null, "publishedAt": "2020-04-24T18:40:53Z", "content": "Clark County Public Health confirmed two new COVID-19 deaths and six new cases on Friday morning.\r\nThe death toll is now 19, with 327 total confirmed cases in the county. More than 3,300 people in Clark County have been tested for the disease. \r\nAccording to … [+1082 chars]"}, {"source": {"id": null, "name": "Dispatch.com"}, "author": "Max Filby", "title": "Coronavirus: Antibody testing coming to Columbus-area hospitals - The Columbus Dispatch", "description": "Testing for COVID-19 antibodies could soon be available throughout Ohio. Experts say the testing could be key to restarting the economy on a large scale.", "url": "https://www.dispatch.com/article/20200424/NEWS/200429239", "urlToImage": null, "publishedAt": "2020-04-24T18:38:49Z", "content": "Testing for COVID-19 antibodies may soon be available throughout Ohio. Experts say it could be key to restarting the economy on a large scale.\r\nCentral Ohio hospitals could start testing for COVID-19 antibodies in patients as soon as next week.\r\nThe testing, … [+4501 chars]"}, {"source": {"id": null, "name": "Chron.com"}, "author": "", "title": "Houston coronavirus updates: What you need to know for April 24 - Chron.com", "description": "Chron.com  is following the latest headlines on the COVID-19 pandemic and its effects on the Houston area.", "url": "https://www.chron.com/coronavirus/article/Houston-coronavirus-updates-What-you-need-to-15223409.php", "urlToImage": null, "publishedAt": "2020-04-24T18:13:00Z", "content": "<ul><li>Mattress Mack announced a morning mask giveaway at Gallery Furniture on Friday, April 24.\r\nMattress Mack announced a morning mask giveaway at Gallery Furniture on Friday, April 24.\r\n Photo: Twitter\r\n</li></ul>\r\nMattress Mack announced a morning mask g… [+2223 chars]"}, {"source": {"id": null, "name": "Wlos.com"}, "author": "WLOS STAFF", "title": "MISSING: Asheville police need help locating juvenile last seen in early March - WLOS", "description": "The Asheville Police Department (APD) is requesting assistance to locate a missing juvenile, Joshua Hardin. Officials say Hardin was last seen on the morning of March 4 in the area of Dogwood Court in East Asheville. Hardin, 16, is described as a black male, …", "url": "http://wlos.com/news/local/missing-asheville-police-need-help-locating-juvenile-last-seen-in-early-march", "urlToImage": null, "publishedAt": "2020-04-24T18:12:00Z", "content": null}, {"source": {"id": null, "name": "Cbsaustin.com"}, "author": "Samantha Rojas", "title": "24 new COVID-19 cases reported in Williamson County, recoveries climb to 124 - KEYE TV CBS Austin", "description": "The Williamson County and Cities Health District announced 24 new positive COVID-19 cases on Friday, bringing the total to 206. So far, 124 people have recovered from coronavirus in WilCo. This is the second day in a row where WilCo. has reported a big jump i…", "url": "http://cbsaustin.com/news/local/24-new-covid-19-cases-reported-in-williamson-county-recoveries-climb-to-124", "urlToImage": null, "publishedAt": "2020-04-24T17:49:00Z", "content": null}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Imtiaz Tyab", "title": "Large-scale human trial of potential coronavirus vaccine kicks off at Oxford - CBS News", "description": "Britain's government is putting more than $50 million toward the race for a coronavirus vaccine, and says \"promising projects are making rapid progress.\"", "url": "https://www.cbsnews.com/news/coronavirus-vaccine-covid-19-human-clinical-trial-oxford-england/", "urlToImage": null, "publishedAt": "2020-04-24T17:27:47Z", "content": "London — In the global scramble for a COVID-19 vaccine, a select number of human trials are now under way, but it's scientists from England's University of Oxford who appear most confident that they're onto a cure. Professor Sarah Gilbert heads the Oxford tea… [+3417 chars]"}, {"source": {"id": null, "name": "Tmz.com"}, "author": "TMZ Staff", "title": "Andy Cohen Says He Can't Give Plasma Because He's Gay, Calls for Change - TMZ", "description": "Andy Cohen's blasting FDA guidelines that are keeping him from donating his plasma because he's gay.", "url": "https://www.tmz.com/2020/04/24/andy-cohen-calls-for-change-donate-plasma-denied-gay-man-covid-19/", "urlToImage": null, "publishedAt": "2020-04-24T17:23:38Z", "content": "Andy Cohen's blasting FDA guidelines that are keeping him from donating his plasma -- which could potentially aid in the battle against COVID-19 -- calling them \"antiquated and discriminatory\" against gay people.\r\nThe 'Watch What Happens Live' host closed his… [+1080 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Trump directed experts to see if UV light can kill coronavirus. Here are the facts - Miami Herald", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiQmh0dHBzOi8vd3d3Lm1pYW1paGVyYWxkLmNvbS9uZXdzL2Nvcm9uYXZpcnVzL2FydGljbGUyNDIyNjI0NzEuaHRtbNIBQmh0dHBzOi8vYW1wLm1pYW1paGVyYWxkLmNvbS9uZXdzL2Nvcm9uYXZpcnVzL2FydGljbGUyNDIyNjI0NzEuaHRtbA?oc=5", "urlToImage": null, "publishedAt": "2020-04-24T16:38:20Z", "content": null}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Tim Herrera", "title": "What Is Convalescent Plasma, and Why Do We Care About It? - The New York Times", "description": "Plasma from people who have recovered from Covid-19 may help others fight the disease.", "url": "https://www.nytimes.com/2020/04/24/smarter-living/coronavirus-convalescent-plasma-antibodies.html", "urlToImage": null, "publishedAt": "2020-04-24T16:30:09Z", "content": "A medical procedure doctors have used to treat novel diseases for a century has emerged as a focal point in the fight against Covid-19: convalescent plasma.\r\nConva-what-now?\r\nConvalescent plasma is the term used for plasma that is removed from the blood of a … [+8375 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Soo Kim", "title": "Sweden Claims It's Prepared For Second Wave Despite Having No Lockdown - Newsweek", "description": "The country's public health agency claims its capital Stockholm, where the majority of the cases have been reported, may have already passed the peak of the outbreak.", "url": "https://www.newsweek.com/coronavirus-second-wave-sweden-lockdown-herd-immunity-covid-19-1500046", "urlToImage": null, "publishedAt": "2020-04-24T16:17:08Z", "content": "The novel coronavirus in Sweden has spread to over 17,500 people and killed more than 2,100, as of Friday, according to the latest figures from Johns Hopkins University. While cases continue to grow, the country has taken the surprising route of not imposing … [+10846 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Tara Parker-Pope", "title": "What’s a Pulse Oximeter, and Do I Really Need One at Home? - The New York Times", "description": "A tiny fingertip device can give you valuable information about your health during a bout of Covid-19 or any respiratory illness.", "url": "https://www.nytimes.com/2020/04/24/well/live/coronavirus-pulse-oximeter-oxygen.html", "urlToImage": null, "publishedAt": "2020-04-24T16:05:24Z", "content": "After working for 10 days at Bellevue Hospital in New York, Dr. Richard Levitan decided to share what he had learned about Covid-19. Too many patients were showing up at the hospital with perilously low oxygen levels, putting them at risk for severe complicat… [+8004 chars]"}, {"source": {"id": null, "name": "Nejm.org"}, "author": null, "title": "Presymptomatic SARS-CoV-2 Infections and Transmission in a Skilled Nursing Facility - nejm.org", "description": "Original Article from The New England Journal of Medicine — Presymptomatic SARS-CoV-2 Infections and Transmission in a Skilled Nursing Facility", "url": "https://www.nejm.org/doi/full/10.1056/NEJMoa2008457", "urlToImage": null, "publishedAt": "2020-04-24T16:03:34Z", "content": "Twenty-three days after identifying the first resident with SARS-CoV-2 infection, Facility A had a 64% prevalence of Covid-19 among residents, with a case fatality rate of 26% despite early adoption of infection-control measures. In addition, Covid-19 was dia… [+7968 chars]"}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Elisabeth Buchwald", "title": "‘We don’t eat our countertops,’ yet many Americans are using cleaning products meant for them on their fruits and vegetables, National Poison Control Center official says - MarketWatch", "description": "Poison control centers across the U.S. saw a 20% increase in calls last month compared to 2019.", "url": "https://www.marketwatch.com/story/we-dont-eat-our-countertops-yet-many-americans-are-using-cleaning-products-meant-for-them-on-their-fruits-and-vegetables-says-national-poison-control-center-official-2020-04-24", "urlToImage": null, "publishedAt": "2020-04-24T15:11:26Z", "content": "Shortages of cleaning supplies amid the coronavirus pandemic are leading many Americans to get creative. But that creativity and compulsion to clean and disinfect more may be causing more harm than good.Last month, calls to poison control centers surged by ne… [+4139 chars]"}, {"source": {"id": null, "name": "Wchstv.com"}, "author": "JEFF MORRIS, ANNA MOORE", "title": "Another COVID-19 death reported in W.Va.; state death toll at 32 - WCHS-TV8", "description": "UPDATED, 5:05 p. m. 4/24/20. West Virginia topped the 1,000-mark Friday afternoon for an overall total of positive COVID-19 cases. The state Department of Health and Human Resources reported that the state had a total of 1,010 positive virus cases as of 5 p. …", "url": "http://wchstv.com/news/local/another-covid-19-death-reported-in-wva-state-death-toll-at-32", "urlToImage": null, "publishedAt": "2020-04-24T14:07:00Z", "content": null}, {"source": {"id": null, "name": "Meredithlmg.com"}, "author": "Maggie Fox, CNN", "title": "Covid-19 causes sudden strokes in young adults, doctors say - KMOV.com", "description": "The new coronavirus appears to be causing sudden strokes in adults in their 30s and 40s who are not otherwise terribly ill, doctors reported Wednesday.", "url": "https://www.news.meredithlmg.com/covid-19-causes-sudden-strokes-in-young-adults-doctors-say/article_ecef8006-862f-11ea-9389-2b1d6b612f29.html", "urlToImage": null, "publishedAt": "2020-04-24T13:31:00Z", "content": "(CNN) -- The new coronavirus appears to be causing sudden strokes in adults in their 30s and 40s who are not otherwise terribly ill, doctors reported Wednesday.\r\nThey said patients may be unwilling to call 911 because they have heard hospitals are overwhelmed… [+2624 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Adam Forrest", "title": "Coronavirus: Eyes could be contagious for weeks, study finds - The Independent", "description": "Eye fluid could may be ‘not only a site of virus entry but also a source of contagion,’ Italian study concludes", "url": "https://www.independent.co.uk/news/health/coronavirus-eyes-contagious-infection-conjunctivitis-italy-wuhan-a9482186.html", "urlToImage": null, "publishedAt": "2020-04-24T12:45:34Z", "content": "The coronavirus can linger in patients eyes for several weeks and could act as a way of spreading the Covid-19 disease, according new study from Italy.\r\nScientists at Italys National Institute for Infectious Diseases hospital in Rome studied the symptoms of a… [+1675 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alicia Lee, CNN", "title": "She lost 8 friends and family members to Covid-19. But she hasn't lost her will to help others - CNN", "description": "\"I cried and I felt weak,\" Jones told CNN. \"It just became so overwhelming that I became numb.\" But instead of falling into depression, Jones says she decided to focus her energy on helping others.", "url": "https://www.cnn.com/2020/04/24/us/missouri-shana-jones-coronavirus-help-trnd/index.html", "urlToImage": null, "publishedAt": "2020-04-24T11:16:19Z", "content": "Want more inspiring, positive news? Sign up for The Good Stuff, a newsletter for the good in life. It will brighten your inbox every Saturday morning.\r\n (CNN)In the week before and after her birthday on March 25, the phone of 42-year-old Shana Jones rang nons… [+2303 chars]"}, {"source": {"id": null, "name": "Livescience.com"}, "author": "Laura Geggel", "title": "SARS-CoV-2 may be exploiting our immune system's 'first responder' cells - Livescience.com", "description": "", "url": "https://www.livescience.com/coronavirus-immune-interferon-response.html", "urlToImage": null, "publishedAt": "2020-04-24T11:00:00Z", "content": "The new coronavirus\r\n, known as SARS-CoV-2, may be using part of the human body's own immune response against us, a new study suggests.\r\nThe novel coronavirus is known to use a keyhole called the ACE2 receptor to \"unlock\" a cell and get inside, where it repli… [+6132 chars]"}, {"source": {"id": null, "name": "Latimes.com"}, "author": "Liz Szabo", "title": "Anti-vaxxers join coronavirus protesters to lift their cause - Los Angeles Times", "description": "Activists skeptical of vaccines are joining with conservatives and other anti-lockdown demonstrators. They contend the coronavirus isn’t dangerous enough to justify stay-at-home orders.", "url": "https://www.latimes.com/california/story/2020-04-24/anti-vaccine-activists-latch-onto-coronavirus-to-bolster-their-movement", "urlToImage": null, "publishedAt": "2020-04-24T09:03:01Z", "content": "While most of the world hungers for a vaccine to put an end to the death and economic destruction wrought by COVID-19, some anti-vaccine groups are joining with anti-lockdown demonstrators to challenge restrictions aimed at protecting public health.\r\nVaccine … [+8577 chars]"}, {"source": {"id": null, "name": "Khn.org"}, "author": "Judith Graham", "title": "Seniors With COVID-19 Show Unusual Symptoms, Doctors Say - Kaiser Health News", "description": "Older bodies respond to infection in different ways. Seniors may sleep more or stop eating. They may be confused or dizzy. They might simply collapse.", "url": "https://khn.org/news/seniors-with-covid-19-show-unusual-symptoms-doctors-say/", "urlToImage": null, "publishedAt": "2020-04-24T09:00:00Z", "content": "Older adults with COVID-19, the illness caused by the coronavirus, have several “atypical” symptoms, complicating efforts to ensure they get timely and appropriate treatment, according to physicians.\r\nCOVID-19 is typically signaled by three symptoms: a fever,… [+6450 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Erika Edwards", "title": "Doctors report uptick in surprising coronavirus complication: dangerous blood clots - NBC News", "description": "Coronavirus patients are developing blood clots at higher rates. Does the virus cause blood to clot, or is it the result of inflammation? Regular anticoagulants aren't working.", "url": "https://www.nbcnews.com/health/health-news/doctors-report-uptick-surprising-coronavirus-complication-dangerous-blood-clots-n1190491", "urlToImage": null, "publishedAt": "2020-04-24T08:33:27Z", "content": "Three weeks ago, critical care pulmonologist Hugh Cassiere encountered something he hadn't seen in 24 years of practicing medicine.\r\nA 45-year-old man arrived at the hospital where Cassiere works, North Shore University Hospital on Long Island, New York, with… [+4346 chars]"}, {"source": {"id": null, "name": "Webmd.com"}, "author": "https://www.facebook.com/dineshRewale", "title": "The Great Invader: How COVID Attacks Every Organ - dineshr", "description": "medRxiv: “COVID-19 Antibody Seroprevalence in Santa Clara County, California.” Joseph Vinetz, MD,  professor, Section of Infectious Diseases, Yale School of Medicine, New Haven, CT. \r Science: How does coronavirus kill? Clinicians trace ferocious rampage thro…", "url": "https://www.webmd.com/lung/news/20200423/the-great-invader-how-covid-attacks-every-organ?src=RSS_PUBLIC", "urlToImage": null, "publishedAt": "2020-04-24T02:25:10Z", "content": "medRxiv: COVID-19 Antibody Seroprevalence in Santa Clara County, California.\r\nJoseph Vinetz, MD,  professor, Section of Infectious Diseases, Yale School of Medicine, New Haven, CT.\r\nScience: How does coronavirus kill? Clinicians trace ferocious rampage throug… [+1053 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Public Health responds to comments made by Accelerated Urgent Care Doctors to reopen Kern County - 23 ABC News | KERO", "description": "Public Health responds to comments made by Accelerated Urgent Care Doctors to reopen Kern County", "url": "https://www.youtube.com/watch?v=OhxAIOhCPHQ", "urlToImage": null, "publishedAt": "2020-04-24T01:04:28Z", "content": null}, {"source": {"id": null, "name": "Dailysignal.com"}, "author": "James Enstrom", "title": "Flawed Models Are Why COVID-19 Policies Must Consider Total Mortality - Daily Signal", "description": "Policymakers need to scrutinize their epidemiological models. In response to the coronavirus pandemic, the federal government has been heavily influenced by the Institute of Health...", "url": "https://www.dailysignal.com/2020/04/23/flawed-models-show-why-covid-19-policies-must-consider-total-mortality/", "urlToImage": null, "publishedAt": "2020-04-24T00:24:08Z", "content": "Policymakers need to scrutinize their\r\nepidemiological models. \r\nIn response to the coronavirus pandemic, the federal government has been heavily influenced by the Institute of Health Metrics and Evaluation’s computer model, which has projected from 60,000 to… [+5401 chars]"}, {"source": {"id": null, "name": "Abc57.com"}, "author": null, "title": "COVID toes: A mysterious new coronavirus symptom - ABC 57 News", "description": "The typical symptoms for the coronavirus include a dry cough, difficulty breathing and a fever, but health officials are now saying that discoloration in the toes may be another symptom that is linked to COVID-19.", "url": "https://www.abc57.com/news/covid-toes-a-new-mysterious-coronavirus-symptom", "urlToImage": null, "publishedAt": "2020-04-23T22:07:00Z", "content": "ST. JOSEPH COUNTY, Ind. -- The typical symptoms for the coronavirus include a dry cough, difficulty breathing and a fever, but health officials are now saying that discoloration in the toes may be another symptom that is linked to COVID-19.\r\nHealth officials … [+1138 chars]"}, {"source": {"id": null, "name": "Theepochtimes.com"}, "author": null, "title": "Most NYC Virus Patients Had Underlying Health Issues, Study Shows - The Epoch Times", "description": "Most patients in New York City hospitalized with the CCP virus suffered from at least one underlying health issue, such as obesity or kidney disease.", "url": "https://www.theepochtimes.com/most-new-york-virus-patients-had-underlying-health-issue-study_3324097.html", "urlToImage": null, "publishedAt": "2020-04-23T21:17:16Z", "content": "Most patients in New York City hospitalized with the CCP virus suffered from one or more underlying health issues, such as obesity or kidney disease, according to a new study.\r\nResearchers analyzed records from 5,700 patients and found more than 56 percent su… [+3603 chars]"}, {"source": {"id": null, "name": "Wdel.com"}, "author": "DJ McAneny", "title": "New Castle County says wastewater analysis shows 15X's more COVID-19 cases than confirmed tests - WDEL 1150AM", "description": "\"At a time when unemployment is skyrocketing, we're trying to figure out how to make basic ends meet,\" said New Castle County Executive Matt Meyer. \"So one of the things", "url": "https://www.wdel.com/news/new-castle-county-says-wastewater-analysis-shows-15xs-more-covid-19-cases-than-confirmed-tests/article_2570afb0-85a7-11ea-912f-13319352641f.html", "urlToImage": null, "publishedAt": "2020-04-23T21:12:00Z", "content": "\"At a time when unemployment is skyrocketing, we're trying to figure out how to make basic ends meet,\" said New Castle County Executive Matt Meyer. \"So one of the things we're doing is looking everywhere we can possibly look to get more information about this… [+3829 chars]"}, {"source": {"id": null, "name": "Salon.com"}, "author": "Alex Henderson", "title": "CDC director contradicts Trump's claim he was \"misquoted\" on potential for fall coronavirus outbreak - Salon", "description": "\"I'm accurately quoted in the Washington Post\"", "url": "https://www.salon.com/2020/04/23/cdc-director-contradicts-trumps-claim-he-was-misquoted-on-potential-for-fall-coronavirus-outbreak_partner/", "urlToImage": null, "publishedAt": "2020-04-23T20:56:27Z", "content": "At his nightly White House press conference on Wednesday, April 22, President Donald Trump was hoping that the three health officials he had with him — Dr. Robert Redfield of the Centers for Disease Control and Prevention (CDC), Dr. Anthony Fauci and Dr. Debo… [+2323 chars]"}, {"source": {"id": null, "name": "Iflscience.com"}, "author": "Madison Dapcevich", "title": "Researchers Identify Top Underlying Conditions Associated With Extreme Covid-19 Cases - IFLScience", "description": "In an analysis of thousands of Covid-19 patients admitted to dozens of hospitals in the New York metropolitan area, a team of researchers has determined th", "url": "https://www.iflscience.com/health-and-medicine/researchers-identify-top-underlying-conditions-associated-with-extreme-covid-19-cases/", "urlToImage": null, "publishedAt": "2020-04-23T20:17:00Z", "content": "In an analysis of thousands of Covid-19 patients admitted to dozens of hospitals in the New York metropolitan area, a team of researchers has determined that those with preexisting hypertension, obesity, and diabetes are more likely to have severe cases of th… [+3059 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "When will we get a coronavirus vaccine? | WIRED Explains - WIRED UK", "description": "We need a coronavirus vaccine to beat the pandemic, but that's a problem. Why? Because making a Covid-19 vaccine that works (and is safe) will take a long ti...", "url": "https://www.youtube.com/watch?v=2Z-KC_mb_8w", "urlToImage": null, "publishedAt": "2020-04-23T19:41:37Z", "content": null}, {"source": {"id": null, "name": "Hotair.com"}, "author": null, "title": "Study: Nearly all COVID patients on ventilators died in large NY health system - Hot Air", "description": null, "url": "https://hotair.com/headlines/archives/2020/04/study-nearly-covid-patients-ventilators-died-large-ny-health-system/", "urlToImage": null, "publishedAt": "2020-04-23T19:40:00Z", "content": "Overall, about 20% of Covid-19 patients treated at Northwell Health died, and 88% of those placed on ventilators died, according to the study. A ventilator is a device that forces air into the lungs of patients who cannot breathe on their own because of sever… [+149 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Roni Caryn Rabin", "title": "Nearly All Patients Hospitalized With Covid-19 Had Chronic Health Issues, Study Finds - The New York Times", "description": "Only 6 percent of patients at one New York area health system had no chronic conditions. Hypertension, obesity and diabetes were common.", "url": "https://www.nytimes.com/2020/04/23/health/coronavirus-patients-risk.html", "urlToImage": null, "publishedAt": "2020-04-23T19:39:48Z", "content": "A new study of thousands of hospitalized coronavirus patients in the New York City area, the epicenter of the outbreak in the United States, has found that nearly all of them had at least one major chronic health condition, and most 88 percent had at least tw… [+5691 chars]"}, {"source": {"id": null, "name": "Mlive.com"}, "author": "Mikhayla Dunaj | mdunaj@mlive.com", "title": "Jackson County suffers two more COVID-19 deaths, 11 new cases - MLive.com", "description": "There are now 295 cases in Jackson County, health officials report.", "url": "https://www.mlive.com/news/jackson/2020/04/jackson-county-suffers-two-more-covid-19-deaths-11-new-cases.html", "urlToImage": null, "publishedAt": "2020-04-23T19:27:34Z", "content": "JACKSON, MI Two new Jackson County deaths caused by the novel coronavirus were reported, Thursday, health officials said.\r\nEleven new positive COVID-19 cases, also reported on April 23. brings the county to 295 confirmed cases, according to Jackson County Hea… [+2695 chars]"}, {"source": {"id": null, "name": "Ktla.com"}, "author": "CNN Wire", "title": "CA seeks review of autopsies from December after earlier COVID-19 deaths discovered - KTLA Los Angeles", "description": "California and Indiana are retracing their coronavirus timelines after discovering that the highly infectious disease spread wider and started killing people earlier than previously reported. Gov. …", "url": "https://ktla.com/news/california/california-seeks-review-of-autopsies-dating-to-december-after-discovery-of-earlier-covid-19-deaths/", "urlToImage": null, "publishedAt": "2020-04-23T16:05:56Z", "content": "California and Indiana are retracing their coronavirus timelines after discovering that the highly infectious disease spread wider and started killing people earlier than previously reported.\r\nGov. Gavin Newsom has asked coroners to review California cases da… [+5654 chars]"}, {"source": {"id": null, "name": "Alternet.org"}, "author": "Bob Brigham", "title": "Study out of New York could change everything we thought we knew about fevers and coronavirus - AlterNet", "description": "", "url": "https://www.alternet.org/2020/04/study-out-of-new-york-could-change-everything-we-thought-we-knew-about-fevers-and-coronavirus/", "urlToImage": null, "publishedAt": "2020-04-23T14:54:00Z", "content": "Scientists are continuing to research COVID-19 and some of the findings have upset what we thought we knew about coronavirus.\r\nA new study published in the Journal of the American Medical Association shares what doctors have discovered in New York states larg… [+1353 chars]"}, {"source": {"id": null, "name": "Who.int"}, "author": "World Health Organization: WHO", "title": "WHO urges countries to move quickly to save lives from malaria in sub-Saharan Africa - World Health Organization", "description": "<p>Severe disruptions to insecticide-treated net campaigns and in access to antimalarial medicines could lead to a doubling in the number of malaria deaths in sub-Saharan Africa this year compared to 2018, according to a <a href=\"/publications-detail/the-pote…", "url": "https://www.who.int/news-room/detail/23-04-2020-who-urges-countries-to-move-quickly-to-save-lives-from-malaria-in-sub-saharan-africa", "urlToImage": null, "publishedAt": "2020-04-23T14:21:27Z", "content": "Severe disruptions to insecticide-treated net campaigns and in access to antimalarial medicines could lead to a doubling in the number of malaria deaths in sub-Saharan Africa this year compared to 2018, according to a new modelling analysis released by\r\n WHO … [+3458 chars]"}, {"source": {"id": null, "name": "Foxbusiness.com"}, "author": "Reuters", "title": "Doctors rethink ventilators in coronavirus fight - Fox Business", "description": "While doctors initially packed intensive care units with intubated patients, now many are exploring other options.", "url": "https://www.foxbusiness.com/technology/coronavirus-patients-ventilators", "urlToImage": null, "publishedAt": "2020-04-23T13:40:48Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox. Sign up here.\r\nBERLIN (Reuters) - When he was diagnosed with COVID-19, Andre Bergmann knew exactly where he wanted to be treated: the Bethanien hospital lung clinic in Moers, near … [+16787 chars]"}, {"source": {"id": null, "name": "Silive.com"}, "author": "Maura Grunlund | mauragrunlund@siadvance.com", "title": "Report: Coronavirus may cause sudden strokes in younger adults - SILive.com", "description": "The strokes, mostly among people with no pre-existing conditions, might result from blood clots fueled by COVID-19.", "url": "https://www.silive.com/coronavirus/2020/04/report-coronavirus-may-cause-sudden-strokes-in-younger-adults.html", "urlToImage": null, "publishedAt": "2020-04-23T13:20:35Z", "content": "STATEN ISLAND, N.Y. -- The coronavirus could be responsible for strokes in adults in their 30s and 40s, according to alarming media reports.\r\nThe strokes, mostly among people with no pre-existing conditions, might result from blood clots fueled by COVID-19, a… [+651 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Matthew Wright For Dailymail.com Vanessa Chalmers Health Reporter For Mailonline", "title": "Nearly 90 per cent of COVID-19 patients placed on ventilators in NY's largest health system DIED - Daily Mail", "description": "The study, published in the Journal of the American Medical Association on Wednesday, examined the electronic health records of 5,700 patients hospitalized.", "url": "https://www.dailymail.co.uk/news/article-8248023/Nearly-90-cent-COVID-19-patients-placed-ventilators-NYs-largest-health-DIED.html", "urlToImage": null, "publishedAt": "2020-04-23T12:07:07Z", "content": "Nearly 90 per cent of all coronavirus patients placed on ventilators in New York's largest health system died, according to a study. \r\nThe study, published in the Journal of the American Medical Association on Wednesday, examined the electronic health records… [+4384 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "David Aaro", "title": "Blood clotting seen as additional threat for coronavirus patients: report - Fox News", "description": "Doctors are beginning to notice that blood clots could be another troubling complication for patients who are hospitalized with coronavirus.", "url": "https://www.foxnews.com/health/blood-clotting-seen-possible-threat-coronavirus-patients", "urlToImage": null, "publishedAt": "2020-04-23T08:48:35Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox. Sign up here. \r\nDoctors are beginning to notice that blood clots could be another troubling complication for patients who are hospitalized with coronavirus.\r\nThe clots present the … [+2762 chars]"}, {"source": {"id": null, "name": "Abc7.com"}, "author": "Denise Dador", "title": "Majority of hospitalized COVID-19 patients didn't have fevers, study finds - KABC-TV", "description": "A new study is presenting surprising findings about COVID-19 and which factors play the biggest role in how severe the disease is for some people.", "url": "https://abc7.com/coronavirus-news-update-symptoms/6123325/", "urlToImage": null, "publishedAt": "2020-04-23T07:31:39Z", "content": "A new study is presenting surprising findings about COVID-19 and which factors play the biggest role in how severe the disease is for some people.With New York being the epicenter for the virus in the U.S., researchers from the state's largest health care sys… [+2043 chars]"}]}