{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": "cnbc", "name": "CNBC"}, "author": "Saheli Roy Choudhury", "title": "Coronavirus live updates: Global death toll tops 251,000; Indonesia's growth was weaker than expected - CNBC", "description": "Indonesia's economy grew 2.97% year over year in the first quarter — the weakest growth rate since the first three months of 2001, reported Reuters, citing data by the country's statistics bureau.", "url": "https://www.cnbc.com/2020/05/05/coronavirus-latest-updates-asia-europe.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106495216-1587239885987gettyimages-1209226849.jpeg?v=1588660671", "publishedAt": "2020-05-05T06:17:51Z", "content": "This is CNBC's live blog covering all the latest news on the coronavirus outbreak. This blog will be updated throughout the day as the news breaks.\r\n<ul><li>Global cases: More than 3.5 million</li><li>Global deaths: More than 251,000</li><li>Most cases report… [+8527 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "Kansas adds 215 COVID-19 cases as cases rise around meatpacking plants, correctional facilities - India Gone Viral", "description": "Kansas adds 215 COVID-19 cases as cases rise around meatpacking plants, correctional facilities Hide Transcript Show Transcript BACK TO YOU IN THE STUDIO. ALL RIGHT, JOHNNY. THANK YOU. WILL CLAY COUNT", "url": "https://indiagoneviral.com/health/2020/05/05/kansas-adds-215-covid-19-cases-as-cases-rise-around-meatpacking-plants-correctional-facilities/51041/india-gone-viral/", "urlToImage": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/dailycasestwitter-kansas-without-a-source-05-04-2020-1588616288.jpg?crop=0.891xw:1.00xh;0.0556xw,0&resize=1200:*", "publishedAt": "2020-05-05T06:06:11Z", "content": "Kansas health officials continue to grapple with outbreaks of COVID-19 leading to surges of cases involving locations like meatpacking plants and prisons.The Kansas Department of Health and Environment reported an increase of 215 confirmed cases of COVID-19 o… [+4338 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "Herpes virus infects billions of people worldwide. Why isn't there a vaccine yet? - India Gone Viral", "description": "Billions of people around the world are living with herpes infections, prompting the World Health Organization to call for a vaccine against the incurable virus.About half a billion people ages 15 to", "url": "https://indiagoneviral.com/health/2020/05/05/herpes-virus-infects-billions-of-people-worldwide-why-isnt-there-a-vaccine-yet/50961/india-gone-viral/", "urlToImage": "https://media2.s-nbcnews.com/j/newscms/2020_19/3335896/200504-herpes-virus-cs-103p_721d491352f16ce109a7c5d931753248.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-05-05T06:06:07Z", "content": "Billions of people around the world are living with herpes infections, prompting the World Health Organization to call for a vaccine against the incurable virus.\r\nAbout half a billion people ages 15 to 49 have genital herpes infections, which are mostly cause… [+2867 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "VIDEO: In Discussion of Newsom's Announcement Today, Sheriff and Public Health Officer Say Humboldt Should be Ready to Partially Reopen Friday - India Gone Viral", "description": "Hank Sims / Today @ 5:27 p.m. / COVID-19 and Humboldt VIDEO: In Discussion of Newsom’s Announcement Today, Sheriff and Public Health Officer Say Humboldt Should be Ready to Partially Reopen Friday ###", "url": "https://indiagoneviral.com/health/2020/05/05/video-in-discussion-of-newsoms-announcement-today-sheriff-and-public-health-officer-say-humboldt-should-be-ready-to-partially-reopen-friday/51045/india-gone-viral/", "urlToImage": "https://lostcoastoutpost.com/loco-media/cache/d9/81/d9814226d11ed8de09b6c4b8f24a6016.jpg", "publishedAt": "2020-05-05T06:05:53Z", "content": "###\r\nPREVIOUSLY:\r\n###\r\nThis afternoon, county public information officer Samantha Karges hosted a discussion with Public Health Officer Dr. Teresa Frankovich and Sheriff Billy Honsal on todays announcement by Gov. Gavin Newsom, which paves the way for local j… [+914 chars]"}, {"source": {"id": null, "name": "Sfchronicle.com"}, "author": "Catherine Ho", "title": "Coronavirus testing in SF’s Mission District reveals spike among workers - San Francisco Chronicle", "description": "<p>Findings of UCSF’s testing in one Mission District neighborhood hint at a grim reality: As local economies begin to reopen, workers who can’t stay home will be at higher risk of falling ill than others.</p>", "url": "https://www.sfchronicle.com/bayarea/article/Coronavirus-testing-in-SF-s-Mission-district-15246512.php", "urlToImage": "https://s.hdnux.com/photos/01/11/62/16/19342263/15/rawImage.jpg", "publishedAt": "2020-05-05T04:41:05Z", "content": "Low-wage workers who are unable to work from home during shelter in place are at higher risk of contracting the coronavirus, according to preliminary results released Monday by UCSF, which conducted thousands of diagnostic tests in San Francisco’s Mission Dis… [+4209 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Calvin Woodward", "title": "Virus-afflicted 2020 looks like 1918 despite science's march - The Associated Press", "description": "WASHINGTON (AP) — Despite a century's progress in science, 2020 is looking a lot like 1918.  In the years between two lethal pandemics, one the misnamed Spanish flu, the other COVID-19, the...", "url": "https://apnews.com/6c45a08d3c2ea96e4edeb7e55a6a107e", "urlToImage": "https://storage.googleapis.com/afs-prod/media/aa93d995f294425eaff8b00d5b232d16/3000.jpeg", "publishedAt": "2020-05-05T04:40:30Z", "content": "WASHINGTON (AP) Despite a centurys progress in science, 2020 is looking a lot like 1918. \r\nIn the years between two lethal pandemics, one the misnamed Spanish flu, the other COVID-19, the world learned about viruses, cured various diseases, made effective vac… [+9799 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "David Aaro", "title": "Even after respiratory symptoms fade, coronavirus victims face danger - Fox News", "description": "Victims of the coronavirus are facing a new danger that may occur even after respiratory symptoms fade and infection from the virus clears.", "url": "https://www.foxnews.com/health/even-after-respiratory-symptoms-fade-coronavirus-victims-face-new-danger", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2020/05/AP20124427129602.jpg", "publishedAt": "2020-05-05T04:34:56Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox. Sign up here.\r\nCoronavirus victims are facing a new danger that may occur even after respiratory symptoms fade and infection from the virus clears.\r\nDoctors are beginning to notice… [+3210 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Joseph Goldstein", "title": "15 Children Are Hospitalized With Mysterious Illness Possibly Tied to Covid-19 - The New York Times", "description": "The health authorities in New York City issued an alert saying that the children had a syndrome that doctors do not yet fully understand.", "url": "https://www.nytimes.com/2020/05/05/nyregion/children-Kawasaki-syndrome-coronavirus.html", "urlToImage": "https://static01.nyt.com/images/2020/05/04/nyregion/04nyvirus-children2/04nyvirus-children2-facebookJumbo.jpg", "publishedAt": "2020-05-05T04:30:09Z", "content": "Fifteen children, many of whom had the coronavirus, have recently been hospitalized in New York City with a mysterious syndrome that doctors do not yet fully understand but that has also been reported in several European countries, health officials announced … [+4341 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "Recent study illustrates how social distancing has saved Louisvillians during the pandemic - India Gone Viral", "description": "Recent study illustrates how social distancing has saved Louisvillians during the pandemic Researchers released a new study on Monday showing how social distancing has saved the lives of Louisvillians", "url": "https://indiagoneviral.com/health/2020/05/05/recent-study-illustrates-how-social-distancing-has-saved-louisvillians-during-the-pandemic/50954/india-gone-viral/", "urlToImage": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/biking-1588642874.jpg?crop=0.790xw:0.788xh;0.175xw,0&resize=1200:*", "publishedAt": "2020-05-05T04:04:28Z", "content": "Researchers released a new study on Monday showing how social distancing has saved the lives of Louisvillians.The study, Projecting the COVID-19 Weekly Deaths, Infections, and Hospitalizations for Jefferson County, Kentucky, was completed by the University of… [+2829 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "Two reports show COVID-19 transmission has slowed, while most people still susceptible - India Gone Viral", "description": "Summary Two new reports provide further confirmation that social distancing measures have reduced transmission of COVID-19 in King County. Story The number of COVID-19 infections in King County has be", "url": "https://indiagoneviral.com/health/2020/05/05/two-reports-show-covid-19-transmission-has-slowed-while-most-people-still-susceptible/50960/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-05-05T04:03:35Z", "content": "Story\r\nThe number of COVID-19 infections in King County has been on the decline since the end of March, according to two recent reports that are consistent with data from Public Health Seattle &amp; King County.\r\nThe reports were completed by Bellevue-based I… [+4533 chars]"}, {"source": {"id": null, "name": "Koco.com"}, "author": "Associated Press", "title": "At least 116 Oklahoma meat plant workers positive for coronavirus - KOCO Oklahoma City", "description": "At least 116 employees at an Oklahoma pork processing plant have tested positive for coronavirus, Seaboard Foods spokesman David Eahart said in a statement Monday.", "url": "https://www.koco.com/article/at-least-116-oklahoma-meat-plant-workers-positive-for-virus/32371093", "urlToImage": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/ap-197881902479.png?crop=1.00xw:1.00xh;0,0&resize=1200:*", "publishedAt": "2020-05-05T03:18:08Z", "content": "GUYMON, Okla. —At least 116 employees at an Oklahoma pork processing plant have tested positive for coronavirus, Seaboard Foods spokesman David Eahart said in a statement Monday.\r\nThe plant in Guymon has about 2,700 employees who are advised to stay home if s… [+1035 chars]"}, {"source": {"id": null, "name": "Komonews.com"}, "author": "Keith Eldridge, KOMO News reporter", "title": "Dentists, medical professionals ask when their businesses can resume after COVID-19 - KOMO News", "description": "Frustration is mounting in the medical and dental professions as they try to get clear guidance from the governor's office on when they can fully reopen under a phased reopening plan announced Friday. Some in those businesses are targeting May 18, the date wh…", "url": "http://komonews.com/news/coronavirus/dentists-medical-professionals-ask-when-their-businesses-can-resume-after-covid-19", "urlToImage": "http://static-31.sinclairstoryline.com/resources/media/8af36d99-913f-48ce-919b-284cc1c74b5f-large16x9_thumb_42618.png?1588644409081", "publishedAt": "2020-05-05T02:11:02Z", "content": null}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Jenn Leser", "title": "Second wave of coronavirus is \"very likely,\" doctor warns - CBS News", "description": "Public health officials have warned a second wave of coronavirus is likely this fall.", "url": "https://www.cbsnews.com/news/coronavirus-second-wave-very-likely-doctor-says/", "urlToImage": "https://cbsnews3.cbsistatic.com/hub/i/r/2020/05/01/529d38bd-77c5-47aa-aad8-b43a5f6901bd/thumbnail/1200x630/da85621552d1ab90de3873c125a1294e/gettyimages-1211277802.jpg", "publishedAt": "2020-05-05T01:37:28Z", "content": "As states begin to reopen and social distancing rules are relaxed, public health officials are warning about a possible second wave of coronavirus cases later this year. Dr. Shoshana Ungerleider, an internal medicine physician at Sutter Health in San Francisc… [+1109 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Reid Wilson", "title": "French hospital discovers it treated coronavirus patient in December - msnNOW", "description": "French scientists have identified the earliest-known case of COVID-19 in the nation: a patient...", "url": "https://thehill.com/policy/international/europe/496075-french-hospital-discovers-it-treated-coronavirus-patient-in", "urlToImage": "https://thehill.com/sites/default/files/france_coronavirus_1204647160getty.jpg", "publishedAt": "2020-05-05T00:41:00Z", "content": "The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 fax\r\nThe contents of this site are ©2020 Capitol Hill Publishing Corp., a subsidiary of News Communications, Inc."}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "Yavapai County reports new 'cluster' of COVID-19 cases at Prescott Valley all-girls school - India Gone Viral", "description": "PRESCOTT VALLEY, AZ — Yavapai County health officials announced Monday that the county now has 128 confirmed COVID-19 cases -- 35 more than since the last time the county reported, and after testing w", "url": "https://indiagoneviral.com/health/2020/05/05/yavapai-county-reports-new-cluster-of-covid-19-cases-at-prescott-valley-all-girls-school/50792/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-05-05T00:10:08Z", "content": "PRESCOTT VALLEY, AZ Yavapai County health officials announced Monday that the county now has 128 confirmed COVID-19 cases — 35 more than since the last time the county reported, and after testing was completed at an area school.\r\nFULL COVERAGE: Coronavirus in… [+2433 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Reuters", "title": "Israel Isolates Coronavirus Antibody in 'Significant Breakthrough': Minister - The New York Times", "description": "Israel has isolated a key coronavirus antibody at its main biological research laboratory, the Israeli defence minister said on Monday, calling the step a \"significant breakthrough\" toward a possible treatment for the COVID-19 pandemic.", "url": "https://www.nytimes.com/reuters/2020/05/04/world/middleeast/04reuters-health-coronavirus-israel-treatment.html", "urlToImage": "https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png", "publishedAt": "2020-05-04T23:49:00Z", "content": "JERUSALEM Israel has isolated a key coronavirus antibody at its main biological research laboratory, the Israeli defence minister said on Monday, calling the step a \"significant breakthrough\" toward a possible treatment for the COVID-19 pandemic.\r\nThe \"monocl… [+1633 chars]"}, {"source": {"id": null, "name": "News8000.com"}, "author": null, "title": "La Crosse, Vernon counties report new COVID-19 cases - News8000.com - WKBT", "description": "(FDA illustration)LA CROSSE, Wis. (WKBT) — La Crosse and Vernon counties reported new lab-confirmed cases of COVID-19 today. La Crosse County’s case is a male in his 50s who was in contact with a previous case, according to a news release from the county heal…", "url": "https://www.news8000.com/la-crosse-vernon-counties-report-new-covid-19-cases/", "urlToImage": "https://wpcdn.us-east-1.vip.tn-cloud.net/www.news8000.com/content/uploads/2020/05/Coronavirus-FDA.jpg", "publishedAt": "2020-05-04T23:11:00Z", "content": "Posted: May 4, 2020 5:11 PM\r\n(FDA illustration)\r\nLA CROSSE, Wis. (WKBT) La Crosse and Vernon counties reported new lab-confirmed cases of COVID-19 today.La Crosse Countys case is a male in his 50s who was in contact with a previous case, according to a news r… [+1202 chars]"}, {"source": {"id": null, "name": "Kgw.com"}, "author": null, "title": "How will Oregon's 100000-volunteer contact tracing system work? - KGW.com", "description": "The program, which may be the first of its kind in the U.S., will require volunteers to take their temperature every day for a year and report it to researchers.", "url": "https://www.kgw.com/article/news/health/coronavirus/oregons-100000-volunteer-contact-tracing-system/283-7f657aa6-fac7-40c4-b68d-f1e3f19c728d", "urlToImage": "https://media.kgw.com/assets/KGW/images/555d500a-7fc2-4b15-85b3-0ea58b37c526/555d500a-7fc2-4b15-85b3-0ea58b37c526_1140x641.jpg", "publishedAt": "2020-05-04T22:46:00Z", "content": "PORTLAND, Ore. Public health researchers in Oregon are preparing to launch something weve never seen on this scale.\r\nThey want to gather volunteers in every corner of the state, from every community, especially minority populations, and convince them to take … [+2954 chars]"}, {"source": {"id": null, "name": "Clickondetroit.com"}, "author": "Frank McGeorge, MD, Derick Hutchinson", "title": "Don’t ignore other health issues while trying to stay safe from coronavirus (COVID-19) - WDIV ClickOnDetroit", "description": "Melanoma Monday is an annual event designed to raise awareness of the most deadly form of skin cancer, and while the coronavirus (COVID-19) is clearly top of mind in terms of current health risks, experts say it’s important not to ignore other issues.", "url": "https://www.clickondetroit.com/health/good-health/2020/05/04/dont-ignore-other-health-issues-while-trying-to-stay-safe-from-coronavirus-covid-19/", "urlToImage": "https://www.clickondetroit.com/resizer/IoeXr-3pOyP7bnt7IDFsgscjkI0=/1600x900/smart/filters:format(jpeg):strip_exif(true):strip_icc(true):no_upscale(true):quality(65)/d1vhqlrjc8h82r.cloudfront.net/05-04-2020/t_9f426ffe6852451e833832c97a39455f_name_image.jpg", "publishedAt": "2020-05-04T22:43:20Z", "content": "DETROIT Melanoma Monday is an annual event designed to raise awareness of the most deadly form of skin cancer, and while the coronavirus (COVID-19) is clearly top of mind in terms of current health risks, experts say its important not to ignore other issues.\r… [+2142 chars]"}, {"source": {"id": null, "name": "Ktiv.com"}, "author": "Dean Welte", "title": "Two Sioux City hospitals treating 83 COVID-19 patients - KTIV", "description": "In the statement, the hospitals said they are committed to protecting the privacy of the patients and cannot provide specific details regarding any individual patient in their care.", "url": "https://ktiv.com/2020/05/04/two-sioux-city-hospitals-treating-83-covid-19-patients/", "urlToImage": "https://quincy-network.s3.ca-central-1.amazonaws.com/wp-content/uploads/sites/4/2020/03/Health-Care-860x484.jpg", "publishedAt": "2020-05-04T22:42:03Z", "content": "SIOUX CITY (KTIV) -- Two Sioux City hospitals say they are providing care to over 80 COVID-19 patients. \r\nIn a joint statement, MercyOne Siouxland Medical Center and UnityPoint Health St.-Luke's said they are treating 83 COVID-19 patients in their facilities.… [+445 chars]"}, {"source": {"id": null, "name": "Kcrg.com"}, "author": "KCRG News Staff", "title": "Linn County Sheriff's Office deputy alleges discrimination in lawsuit - KCRG", "description": "A deputy with the Linn County Sheriff's Office is alleging that it and the county were in violation of the Iowa Civil Rights Act and the Family Medical Leave Act after he used leave around the time of the birth of his child, according to court filings.", "url": "https://www.kcrg.com/content/news/Linn-County-Sheriffs-Office-deputy-alleges-discrimination-in-lawsuit-570187831.html", "urlToImage": "https://media.graytvinc.com/images/linn-county-sheriff.jpg", "publishedAt": "2020-05-04T22:39:37Z", "content": "CEDAR RAPIDS, Iowa (KCRG) - A deputy with the Linn County Sheriff's Office is alleging that it and the county were in violation of the Iowa Civil Rights Act and the Family Medical Leave Act after he used leave around the time of the birth of his child, accord… [+3071 chars]"}, {"source": {"id": null, "name": "News-journal.com"}, "author": "From staff reports", "title": "Mayor: Longview has second death related to COVID-19 - Longview News-Journal", "description": "Longview Mayor Andy Mack said the city has seen its second COVID-19-related death Monday.", "url": "https://www.news-journal.com/news/coronavirus/mayor-longview-has-second-death-related-to-covid-19/article_23fcc778-8e57-11ea-8cf7-ab9816322cd1.html", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/news-journal.com/content/tncms/assets/v3/editorial/0/a9/0a9e7db2-6abc-11ea-9686-3b90da8a757e/5e74db7cc8c45.image.jpg?resize=800%2C400", "publishedAt": "2020-05-04T22:35:00Z", "content": "Longview Mayor Andy Mack said the city has seen its second COVID-19-related death Monday.\r\nMack said in a statement that he did not have details about this person, and asked residents to all show kindness and compassion in your comments.\r\nMack has been updati… [+666 chars]"}, {"source": {"id": null, "name": "Nbcdfw.com"}, "author": "Frank Heinz", "title": "Tarrant County Confirms 2 COVID-19 Deaths in Fort Worth, Benbrook Monday, 40 More Cases - NBC 5 Dallas-Fort Worth", "description": "Tarrant County Public Health officials confirm Monday two more deaths of people infected with the COVID-19 virus and an additional 40 positive cases in the…", "url": "https://www.nbcdfw.com/news/coronavirus/tarrant-county-confirms-2-covid-19-deaths-in-fort-worth-benbrook-monday/2363013/", "urlToImage": "https://media.nbcdfw.com/2019/09/tarrant-county-seal.jpg?resize=1200%2C675", "publishedAt": "2020-05-04T22:32:47Z", "content": "Tarrant County Public Health officials confirm Monday two more deaths of people infected with the COVID-19 virus and an additional 40 positive cases in the county.\r\nThe deceased include a man in his 80s from Benbrook and a man in his 60s from Fort Worth. Both… [+680 chars]"}, {"source": {"id": null, "name": "Sltrib.com"}, "author": "https://www.facebook.com/saltlaketribune", "title": "After testing push, San Juan County has the second highest coronavirus case rate in Utah - Salt Lake Tribune", "description": "Editor’s note: The Salt Lake Tribune is providing free access to critical stories about the coronavirus. Sign up for<a href=\"https://sltrib.formstack.com/forms/topstories\"> our Top Stories newsletter</a>, sent to your inbox every weekday morning. To support j…", "url": "https://www.sltrib.com/news/2020/05/04/after-testing-push-san/", "urlToImage": "https://www.sltrib.com/resizer/yPhuytH_eHvHCLWBlbYy9Ni8gj4=/1200x630/filters:quality(85)/arc-anglerfish-arc2-prod-sltrib.s3.amazonaws.com/public/65YRAORHDZEKTMWBYEZVAUBWEQ.JPG", "publishedAt": "2020-05-04T22:30:26Z", "content": "Editors note:The Salt Lake Tribune is providing free access to critical stories about the coronavirus. Sign up for our Top Stories newsletter, sent to your inbox every weekday morning. To support journalism like this, please donate or become a subscriber.\r\n F… [+4809 chars]"}, {"source": {"id": null, "name": "Kgw.com"}, "author": null, "title": "At least 13 workers at Oregon seafood processing plant test positive for COVID-19 - KGW.com", "description": "Bornstein Seafood’s entire workforce is being tested for the virus while its Astoria facilities are shut down.", "url": "https://www.kgw.com/article/news/health/coronavirus/workers-positive-covid-19-astoria-bornstein-seafood-processing-plant/283-0001d0ba-9fa4-443a-9de1-9123784984fb", "urlToImage": "https://media.kgw.com/assets/KGW/images/33380208-3270-47da-b154-765cfb0e8a85/33380208-3270-47da-b154-765cfb0e8a85_1140x641.jpg", "publishedAt": "2020-05-04T22:22:00Z", "content": "ASTORIA, Ore. An Oregon seafood company has closed its facilities in Astoria after at least 13 workers tested positive for COVID-19.\r\nThirty-five Bornstein Seafood employees were tested for COVID-19 on Saturday after showing symptoms of the coronavirus, accor… [+1067 chars]"}, {"source": {"id": null, "name": "Fox5ny.com"}, "author": "Linda Schmidt", "title": "'COVID toes' are emblematic of how much is still unknown about the disease - FOX 5 NY", "description": "The majority of people reporting so-called COVID toes never thought they were exposed to the coronavirus.", "url": "https://www.fox5ny.com/news/covid-toes-are-emblematic-of-how-much-is-still-unknown-about-the-disease", "urlToImage": "https://images.foxtv.com/static.fox5ny.com/www.fox5ny.com/content/uploads/2020/05/724/407/7C79EA8643654AA2BF62C75F00014B54.jpg?ve=1&tl=1", "publishedAt": "2020-05-04T22:21:03Z", "content": "NEW YORK - Dr. Lindy Fox, a dermatologist, said her practice is seeing \"many, many patients\" with toes and fingers turning purple and pink, a symptom now being linked to COVID-19.\r\n\"Almost too many to count,\" she said. \"Dermatologists are being inundated with… [+1917 chars]"}, {"source": {"id": null, "name": "Sciencedaily.com"}, "author": null, "title": "Antibody blocks infection by the SARS-CoV-2 in cells, scientists discover - Science Daily", "description": "Researchers report that they have identified a fully human monoclonal antibody that prevents the SARS-CoV-2 (COVID-19) virus from infecting cultured cells. The discovery is an initial step towards developing a fully human antibody to treat or prevent the resp…", "url": "https://www.sciencedaily.com/releases/2020/05/200504074722.htm", "urlToImage": null, "publishedAt": "2020-05-04T21:57:00Z", "content": "Researchers at Utrecht University, Erasmus Medical Center and Harbour BioMed (HBM) today reported that they have identified a fully human monoclonal antibody that prevents the SARS-CoV-2 (COVID-19) virus from infecting cultured cells. The discovery, published… [+2886 chars]"}, {"source": {"id": null, "name": "Ktiv.com"}, "author": "Michaela Feldmann", "title": "Tyson plant in Dakota City delays reopening - KTIV", "description": "The initial production paused was done so a \"deep cleaning\" could be done for the entire plant.", "url": "https://ktiv.com/2020/05/04/tyson-plant-in-dakota-city-delays-reopening/", "urlToImage": "https://quincy-network.s3.ca-central-1.amazonaws.com/wp-content/uploads/sites/4/2020/04/tyson-foods-logo-1.jpg", "publishedAt": "2020-05-04T21:45:46Z", "content": "DAKOTA CITY, Neb. (KTIV) -- Production will not begin Tuesday, as scheduled, for the Tyson Foods plant in Dakota City, Nebraska. That's according to officials with Tyson. \r\nLast Wednesday Tyson Fresh Meats, the beef and pork subsidiary of Tyson Foods, announc… [+729 chars]"}, {"source": {"id": null, "name": "Snopes.com"}, "author": "David Mikkelson", "title": "A Majority of Vaccine Skeptics Plan to Refuse a COVID-19 Vaccine, A Study Suggests - Snopes.com", "description": "If most of these individuals forego receiving a COVID-19 vaccine, they could potentially jeopardize the recovery process.", "url": "https://www.snopes.com/news/2020/05/04/a-majority-of-vaccine-skeptics-plan-to-refuse-a-covid-19-vaccine-a-study-suggests/", "urlToImage": "https://www.snopes.com/tachyon/2018/01/flu_shot_fb.jpg", "publishedAt": "2020-05-04T21:30:50Z", "content": "This article is republished here with permission from The Conversation. This content is shared here because the topic may interest Snopes readers; it does not, however, represent the work of Snopes fact-checkers or editors.\r\nThe availability of a vaccine for … [+6653 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "More nursing home COVID-19 deaths, new facility with virus. Tulare, Fresno County cases grow - Fresno Bee", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiQGh0dHBzOi8vd3d3LmZyZXNub2JlZS5jb20vbmV3cy9jb3JvbmF2aXJ1cy9hcnRpY2xlMjQyNDg3MjIxLmh0bWzSAUBodHRwczovL2FtcC5mcmVzbm9iZWUuY29tL25ld3MvY29yb25hdmlydXMvYXJ0aWNsZTI0MjQ4NzIyMS5odG1s?oc=5", "urlToImage": null, "publishedAt": "2020-05-04T21:23:18Z", "content": null}, {"source": {"id": null, "name": "Annals.org"}, "author": null, "title": "L-Thyroxine for Subclinical Hypothyroidism and Hypothyroid Symptoms - Annals of Internal Medicine", "description": null, "url": "https://annals.org/aim/article-abstract/2765669/l-thyroxine-therapy-older-adults-subclinical-hypothyroidism-hypothyroid-symptoms-secondary", "urlToImage": null, "publishedAt": "2020-05-04T21:12:28Z", "content": "Inselspital, Bern University Hospital, and Institute of Primary Health Care (BIHAM), University of Bern, Bern, Switzerland (M.D., M.F., S.B., N.R.)\r\nRobertson Centre for Biostatistics, Institute of Health and Wellbeing, University of Glasgow, Glasgow, Scotlan… [+6500 chars]"}, {"source": {"id": null, "name": "Www.rfi.fr"}, "author": "RFI", "title": "France’s first Covid-19 case 'dates back to December', flu retest shows - RFI English", "description": "A doctor in the Paris region says one of his patients who was diagnosed with pneumonia in December was, in fact, infected with Covid-19. The report, which is due to be published in detail this week, would make it the first known case of the disease in France …", "url": "http://www.rfi.fr/en/france/20200504-france-first-covid-19-case-dates-back-to-december-flu-retest-shows-pneumonia", "urlToImage": "http://s.rfi.fr/media/display/a2c992de-8d4e-11ea-b8c8-005056a964fe/w:1240/p:16x9/2020-05-02t193912z_676228514_rc2jgg9cjgc5_rtrmadp_3_health-coronavirus-france_0.jpg", "publishedAt": "2020-05-04T21:01:32Z", "content": "A doctor in the Paris region says one of his patients who was diagnosed with pneumonia in December was, in fact, infected with Covid-19. The report, which is due to be published in detail this week, would make it the first known case of the disease in France … [+2953 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Coronavirus cases in SC reach 6,757. Eight more people dead, DHEC says - The State", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiP2h0dHBzOi8vd3d3LnRoZXN0YXRlLmNvbS9uZXdzL2Nvcm9uYXZpcnVzL2FydGljbGUyNDI0ODM5MDEuaHRtbNIBP2h0dHBzOi8vYW1wLnRoZXN0YXRlLmNvbS9uZXdzL2Nvcm9uYXZpcnVzL2FydGljbGUyNDI0ODM5MDEuaHRtbA?oc=5", "urlToImage": null, "publishedAt": "2020-05-04T20:59:35Z", "content": null}, {"source": {"id": null, "name": "Kmaland.com"}, "author": "Mike Peterson", "title": "Two more Mills County coronavirus cases confirmed | News - KMAland", "description": "(Glenwood) -- The number of coronvirus cases in Mills County continues to grow.", "url": "http://www.kmaland.com/news/two-more-mills-county-coronavirus-cases-confirmed/article_9706dc7a-8e45-11ea-9ad2-87e6bdf99681.html", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/kmaland.com/content/tncms/assets/v3/editorial/9/67/9671c590-7298-11ea-ae97-4be8caae6f4a/5e820bef2c769.image.jpg?resize=945%2C630", "publishedAt": "2020-05-04T20:26:00Z", "content": "(Glenwood) -- The number of coronvirus cases in Mills County continues to grow.\r\nMills County Public Health officials say they were notified Monday of two additional novel coronavirus cases in Mills County.This brings the total number of confirmed positive CO… [+926 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "", "title": "UK will begin testing its COVID-19 tracking app this week - Engadget", "description": "The UK will begin testing its COVID-19 tracking app in a pilot on the Isle of Wight this week.", "url": "https://www.engadget.com/uk-covid-19-contact-tracing-pilot-200130686.html", "urlToImage": "https://o.aolcdn.com/images/dims?resize=1200%2C630&crop=1200%2C630%2C0%2C0&quality=80&image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-images%2F2020-05%2F9e671bb0-8e40-11ea-86fd-2404da12d9d7&client=amp-blogside-v2&signature=6b62051eb0f48b0b93c613472f9d4ac99cb354a3", "publishedAt": "2020-05-04T20:24:12Z", "content": "As previously reported, the UK will break from the Apple-Google “decentralized” approach. Instead, the NHS’s technology group NHSX chose a centralized model, in which a list of contacts made via Bluetooth signals will be stored on users’ devices as anonymous … [+1062 chars]"}, {"source": {"id": null, "name": "Timesheraldonline.com"}, "author": "John Glidden", "title": "Almost 100 infected with COVID-19 at Windsor care facility in Vallejo - Vallejo Times-Herald", "description": "Nearly 100 individuals have been infected at the Windsor Vallejo Nursing & Rehabilitation Center with COVID-19, Solano County Public Health Administrator Jayleen Richards confirmed to the Times…", "url": "https://www.timesheraldonline.com/almost-100-infected-with-covid-19-at-windsor-care-facility-in-vallejo", "urlToImage": "https://www.timesheraldonline.com/wp-content/uploads/2020/05/WINDSOR-1.jpg?w=1024&h=710", "publishedAt": "2020-05-04T20:20:28Z", "content": "Nearly 100 individuals have been infected at the Windsor Vallejo Nursing &amp; Rehabilitation Center with COVID-19, Solano County Public Health Administrator Jayleen Richards confirmed to the Times-Herald on Monday.\r\nRichards said 76 residents and 23 health c… [+2001 chars]"}, {"source": {"id": null, "name": "Sheboyganpress.com"}, "author": "AnnMarie Hilton", "title": "Sheboygan County coronavirus update includes two cases at an assisted living facility - Sheboygan Press", "description": "Sheboygan county currently has 10 active cases, 44 recovered and two deaths.", "url": "https://www.sheboyganpress.com/story/news/2020/05/04/coronavirus-sheboygan-assisted-living-facility-has-two-cases/2968929001/", "urlToImage": "https://www.gannett-cdn.com/presto/2020/03/21/PSHE/767ec8fd-5045-48c0-a2c7-f12bf92813a3-SHE_032120_Stay_Calm_Wash_Hands_gck-002.JPG?crop=2174,1223,x0,y1509&width=1600&height=800&fit=bounds", "publishedAt": "2020-05-04T20:19:21Z", "content": "SHEBOYGAN - Sheboygan County has two coronavirus cases tied to an assisted living facility, the county's public health division announced Monday.\r\nOverall, the county's total confirmed COVID-19 cases increased to 56, with 10 active cases, 44 recovered and two… [+2810 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Reuters", "title": "After retesting samples, French hospital discovers COVID-19 case from December - Yahoo News", "description": "A French hospital which has retested old samples from pneumonia patients discovered that it treated a man who had COVID-19 as early as Dec. 27, nearly a mont...", "url": "https://news.yahoo.com/retesting-samples-french-hospital-discovers-153353216.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png", "publishedAt": "2020-05-04T20:04:26Z", "content": "PARIS, May 4 (Reuters) - A French hospital which has retested old samples from pneumonia patients discovered that it treated a man who had COVID-19 as early as Dec. 27, nearly a month before the French government confirmed its first cases.\r\nYves Cohen, head o… [+2073 chars]"}, {"source": {"id": null, "name": "Columbian.com"}, "author": null, "title": "Clark County adds six COVID-19 cases over weekend - The Columbian", "description": "Clark County Public Health confirmed six new COVID-19 cases and no new deaths Monday morning.", "url": "https://www.columbian.com/news/2020/may/04/county-adds-six-covid-19-cases-over-weekend/", "urlToImage": "https://pcdn.columbian.com/wp-content/uploads/2020/02/China_Outbreak_Science_Says_10815.jpg-b165f.jpg", "publishedAt": "2020-05-04T18:51:17Z", "content": "Clark County Public Health confirmed six new COVID-19 cases and no new deaths Monday morning.\r\nSince Public Health does not report new cases on Saturday and Sunday, the six cases are results from over the weekend.\r\nClark County now has 367 confirmed cases and… [+615 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Coronavirus live updates: Here’s what to know in North Carolina on May 4 - Raleigh News & Observer", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiQ2h0dHBzOi8vd3d3Lm5ld3NvYnNlcnZlci5jb20vbmV3cy9jb3JvbmF2aXJ1cy9hcnRpY2xlMjQyNDc0MjIxLmh0bWzSAUNodHRwczovL2FtcC5uZXdzb2JzZXJ2ZXIuY29tL25ld3MvY29yb25hdmlydXMvYXJ0aWNsZTI0MjQ3NDIyMS5odG1s?oc=5", "urlToImage": null, "publishedAt": "2020-05-04T18:43:02Z", "content": null}, {"source": {"id": null, "name": "Bgr.com"}, "author": "Chris Smith", "title": "Doctors discovered a bizarre new coronavirus complication that no one can explain - BGR", "description": "Doctors treating novel coronavirus patients in the UK have noticed a condition they call “happy hypoxia” in severe COVID-19 cases. Blood oxygen levels can drop to dangerous levels, but patients are still conscious and responsive when they shouldn’t be. The do…", "url": "https://bgr.com/2020/05/04/coronavirus-symptoms-happy-hypoxia-caused-by-low-blood-oxygen-levels/", "urlToImage": "https://boygeniusreport.files.wordpress.com/2020/04/webp.net-resizeimage-1-6.jpg?quality=98&strip=all", "publishedAt": "2020-05-04T18:42:07Z", "content": "<ul><li>Doctors treating novel coronavirus patients in the UK have noticed a condition they call “happy hypoxia” in severe COVID-19 cases.</li><li>Blood oxygen levels can drop to dangerous levels, but patients are still conscious and responsive when they shou… [+4095 chars]"}, {"source": {"id": null, "name": "Rapidcityjournal.com"}, "author": "Journal staff", "title": "Officials report 37 new coronavirus cases in the state - Rapid City Journal", "description": "South Dakota reported 37 new cases of coronavirus Monday as the total number of active cases in the state climbed to 817.", "url": "https://rapidcityjournal.com/news/local/officials-report-37-new-coronavirus-cases-in-the-state/article_02ceb29f-269f-5f2c-a0e9-06d659c8a304.html", "urlToImage": "https://bloximages.chicago2.vip.townnews.com/rapidcityjournal.com/content/tncms/assets/v3/editorial/4/07/4072c797-928e-5d86-8310-e375026b7b70/5eb043bee79bf.image.jpg?crop=960%2C540%2C0%2C210&resize=960%2C540&order=crop%2Cresize", "publishedAt": "2020-05-04T18:35:32Z", "content": "South Dakota reported 37 new cases of coronavirus Monday as the total number of active cases in the state climbed to 817. \r\nThere have been 2,668 total positive tests for the virus in the state and 1,830 of those patients have recovered. The number of people … [+1400 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Live from WHO Headquarters - COVID-19 daily press briefing 04 May 2020 - World Health Organization (WHO)", "description": "Originally broadcast live on 04 May 2020, the daily press briefing on coronavirus COVID-19, direct from WHO Headquarters, Geneva Switzerland with Dr Tedros W...", "url": "https://www.youtube.com/watch?v=LFCn0Gp_9aQ", "urlToImage": "https://i.ytimg.com/vi/LFCn0Gp_9aQ/maxresdefault.jpg", "publishedAt": "2020-05-04T18:01:32Z", "content": "Originally broadcast live on 04 May 2020, the daily press briefing on coronavirus COVID-19, direct from WHO Headquarters, Geneva Switzerland with Dr Tedros WHO Director-General, Dr Micheal Ryan, Executive Director of the Health Emergencies Programme, and Dr M… [+76 chars]"}, {"source": {"id": null, "name": "Theactivetimes.com"}, "author": null, "title": "How to wash your clothes if you've been exposed to coronavirus - msnNOW", "description": "If you think you’ve been exposed to the virus or you’re living with someone who has it, these are the must-take steps for washing your clothes.", "url": "https://www.theactivetimes.com/home/wash-clothes-coronavirus-laundry", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/BB13Aj2a.img?h=630&w=1200&m=6&q=60&o=t&l=f&f=jpg&x=823&y=614", "publishedAt": "2020-05-04T17:45:00Z", "content": "Due to the coronavirus, which has spread rapidly through multiple countries around the world including the United States, people not considered essential workers have been self-quarantining and social distancing. But, if you think youve been exposed to the vi… [+3158 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus outbreak: WHO says €7.4 billion pledged for COVID-19 vaccine, treatments | FULL - Global News", "description": "World Health Organization (WHO) officials provided an update on the global response to the COVID-19 pandemic on Monday. Dr. Tedros Adhanom Ghebreyesus, direc...", "url": "https://www.youtube.com/watch?v=CKELyIGOgaQ", "urlToImage": "https://i.ytimg.com/vi/CKELyIGOgaQ/maxresdefault.jpg", "publishedAt": "2020-05-04T17:27:40Z", "content": "World Health Organization (WHO) officials provided an update on the global response to the COVID-19 pandemic on Monday.\r\nDr. Tedros Adhanom Ghebreyesus, director-general of the WHO, on Monday said that earlier in the day, 7.4 billion was pledged by 40 countri… [+1026 chars]"}, {"source": {"id": null, "name": "Wibw.com"}, "author": "WIBW", "title": "Shawnee Co. reporting 2nd highest number of COVID-19 cases in a single week - WIBW", "description": "The Shawnee County Health Department says last week they had seen the second highest number of confirmed positive COVID-19 cases in a single week since the beginning of the pandemic.", "url": "https://www.wibw.com/content/news/Shawnee-Co-reporting-2nd-highest-number-of-COVID-19-cases-in-a-single-week--570176911.html", "urlToImage": "https://media.graytvinc.com/images/MGN_1280x720_00406C00-SSDNH1.jpg", "publishedAt": "2020-05-04T17:07:06Z", "content": "TOPEKA, Kan. (WIBW) --- The Shawnee County Health Department says last week they had seen the second highest number of confirmed positive COVID-19 cases in a single week since the beginning of the pandemic.\r\nBetween April 26th to May 2nd, the county has seen … [+1230 chars]"}, {"source": {"id": null, "name": "Staradvertiser.com"}, "author": "Associated Press", "title": "U.S. to rein in flood of coronavirus blood tests after lax oversight - Honolulu Star-Advertiser", "description": "WASHINGTON >> U.S. regulators today pulled back a decision that allowed scores of coronavirus blood tests to hit the market without first providing proof that they worked.", "url": "https://www.staradvertiser.com/2020/05/04/breaking-news/u-s-to-rein-in-flood-of-coronavirus-blood-tests-after-lax-oversight/", "urlToImage": "https://www.staradvertiser.com/wp-content/uploads/2020/05/web1_9942085-db740db0dbdd44c8a01edd096841a799.jpg", "publishedAt": "2020-05-04T16:41:45Z", "content": "WASHINGTON &gt;&gt; U.S. regulators today pulled back a decision that allowed scores of coronavirus blood tests to hit the market without first providing proof that they worked.\r\nThe Food and Drug Administration said it took the action because some sellers ha… [+3903 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Amélie BAUBEAU", "title": "As lockdowns lift, 'second wave' concerns grow - Yahoo News", "description": "As several nations begin relaxing their lockdowns following an initial peak in COVID-19 cases, attention is turning to how they can avoid a \"second wave...", "url": "https://news.yahoo.com/lockdowns-lift-second-wave-concerns-grow-141821853.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/akgHLAfbN1R5jZImDvdgRA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTA-/https://s.yimg.com/uu/api/res/1.2/iNEm6bDaQO0pspnBv_XCeg--~B/aD01MTA7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/c8285cd83c7e60ee553815a20b31a43c3cfd3af6.jpg", "publishedAt": "2020-05-04T14:18:00Z", "content": "Paris (AFP) - As several nations begin relaxing their lockdowns following an initial peak in COVID-19 cases, attention is turning to how they can avoid a \"second wave\" of infections as social distancing is eased.\r\nItaly and Spain -- two of the hardest hit cou… [+4069 chars]"}, {"source": {"id": null, "name": "Boston.com"}, "author": "nyt-syndication", "title": "Sneeze guards? Partitions? The business world mulls post-pandemic office spaces - Boston.com", "description": "Some companies have begun mentioning a return to one of history’s more derided office-design concepts: the cubicle.", "url": "https://www.boston.com/news/coronavirus/2020/05/04/post-pandemic-coronavirus-offices", "urlToImage": "https://www.boston.com/wp-content/uploads/2020/04/f930c8fe-51fd-471d-bdaf-f07ee55c68a9-850x478.jpg", "publishedAt": "2020-05-04T14:12:17Z", "content": "SAN FRANCISCO The modern corporate office is renowned for open, collaborative workspaces, in-house coffee bars and standing desks with room for two giant computer monitors.\r\nSoon, there may be a new must-have perk: the sneeze guard.\r\nThis Plexiglas barrier th… [+8215 chars]"}, {"source": {"id": null, "name": "Kdvr.com"}, "author": "Nexstar", "title": "Virtual town halls on unemployment in Colorado will be held Monday, here’s what you need to know - FOX 31 Denver", "description": "COLORADO SPRINGS (KXRM) –  On Monday, May 4, the Colorado Department of Labor and Employment (CDLE) will hold two unemployment virtual town halls to provide updates and information on Colorado’s un…", "url": "https://kdvr.com/news/coronavirus/virtual-town-halls-on-unemployment-in-colorado-will-be-held-monday-heres-what-you-need-to-know/", "urlToImage": "https://kdvr.com/wp-content/uploads/sites/11/2020/05/640x360_50918b00-qcbok-2_27863809_ver1.0.jpg?w=640&h=360&crop=1&resize=1280,720", "publishedAt": "2020-05-04T14:12:06Z", "content": "COLORADO SPRINGS (KXRM)  On Monday, May 4, the Colorado Department of Labor and Employment (CDLE) will hold two unemployment virtual town halls to provide updates and information on Colorados unemployment insurance program.\r\nThe town halls will start at 9:10 … [+498 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Brian Cooley", "title": "Coronavirus sensor you stick at the top of your chest can track symptoms - CNET", "description": "The device senses the nature, duration and time of coughs, checking for the onset and progression of COVID-19.", "url": "https://www.cnet.com/health/new-sensor-you-stick-on-your-chest-can-detect-covid-19/", "urlToImage": "https://cnet4.cbsistatic.com/img/ZDRiW1zrlJHj6PtOzSoxlnNiQR0=/2020/05/02/b92ddae0-7e20-43db-928b-4782498a8600/vlcsnap-2020-05-01-18h06m46s606.png", "publishedAt": "2020-05-04T14:03:53Z", "content": "Northwestern University\r\nFor the most up-to-date news and information about the coronavirus pandemic, visit the WHO website.\r\nIt looks like a Band-Aid, but it's a flexible wireless sensor that sits where your throat and chest meet, picking up coughing and bre… [+3956 chars]"}, {"source": {"id": null, "name": "Clickondetroit.com"}, "author": "Derick Hutchinson", "title": "Oakland County opens new coronavirus (COVID-19) drive-thru testing site in Novi - WDIV ClickOnDetroit", "description": "Oakland County officials are set to open a new coronavirus (COVID-19) drive-thru testing site in Novi.", "url": "https://www.clickondetroit.com/news/local/2020/05/04/oakland-county-opens-new-coronavirus-covid-19-drive-thru-testing-site-in-novi/", "urlToImage": "https://www.clickondetroit.com/resizer/UaeDJ9CcQ6-933klxUiK1pxHUX8=/1280x720/smart/filters:format(jpeg):strip_exif(true):strip_icc(true):no_upscale(true):quality(65)/arc-anglerfish-arc2-prod-gmg.s3.amazonaws.com/public/QLPG76PWB5HSPMR7K2FUISYOIA.png", "publishedAt": "2020-05-04T13:43:48Z", "content": "NOVI, Mich. Oakland County officials are set to open a new coronavirus (COVID-19) drive-thru testing site in Novi.\r\nStarting May 8, Honor Community Health will offer testing from 9 a.m. to 5 p.m. Fridays at the Novi Civic Center at 45175 west 10 Mile Road, of… [+1285 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "U.N. calls for COVID vaccine, treatment available for all - Reuters", "description": "United Nations leaders called on Monday for a global effort to develop and distribute to all at affordable prices vaccines, treatments and testing kits against COVID-19.", "url": "https://www.reuters.com/article/us-health-coronavirus-eu-virus-un-idUSKBN22G1MZ", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200504&t=2&i=1517402692&w=1200&r=LYNXMPEG4315G", "publishedAt": "2020-05-04T13:43:24Z", "content": "BRUSSELS (Reuters) - United Nations leaders called on Monday for a global effort to develop and distribute to all at affordable prices vaccines, treatments and testing kits against COVID-19. \r\n“These new tools will help us to fully control the pandemic and mu… [+643 chars]"}, {"source": {"id": null, "name": "Tribunecontentagency.com"}, "author": "April Dembosky KQED (TNS)", "title": "Fear of coronavirus propels some smokers to quit - Herald-Mail Media", "description": "In 40 years of smoking, Katie Kennedy has tried four times to quit but always went back to cigarettes. Today, she is summoning a new mental image when a craving", "url": "http://tribunecontentagency.com", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/heraldmailmedia.com/content/tncms/custom/image/56aca64e-484b-11e6-a4b7-e75338b21bee.png", "publishedAt": "2020-05-04T12:36:00Z", "content": "In 40 years of smoking, Katie Kennedy has tried four times to quit but always went back to cigarettes. Today, she is summoning a new mental image when a craving comes on: rows of COVID-19 patients hooked to ventilators.\r\nKennedys dad also smoked. He was on a … [+8119 chars]"}, {"source": {"id": null, "name": "Latimes.com"}, "author": "Julia Wick", "title": "Essential California: Orange County vs. Gov. Newsom - Los Angeles Times", "description": "Surfers ignored barriers and protesters confronted police on Orange County beaches over the weekend.", "url": "https://www.latimes.com/california/newsletter/2020-05-04/newsom-orange-county-beaches-newsletter-essential-california", "urlToImage": "https://ca-times.brightspotcdn.com/dims4/default/821c17e/2147483647/strip/true/crop/4800x2520+0+334/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F48%2Fd9%2Fc51f3b264bf0a83512d8d268d85c%2Fla-photos-1staff-534559-beach-activity-huntington018-ls.jpg", "publishedAt": "2020-05-04T12:30:00Z", "content": "Good morning, and welcome to the Essential California newsletter\r\n. Its Monday, May 4, and heres a quick look at the week ahead:\r\nThe stories shaping California\r\nGet up to speed with our Essential California newsletter, sent six days a week.\r\nYou may occasion… [+7217 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "German study suggests infections are 10 times the number of confirmed cases - Reuters", "description": "More than 10 times as many people in Germany have likely been infected with the coronavirus than the number of confirmed cases, researchers from the University of Bonn have concluded from a field trial in one of the worst hit towns.", "url": "https://www.reuters.com/article/us-health-coronavirus-germany-estimates-idUSKBN22G1BW", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-05-04T11:53:57Z", "content": "FRANKFURT (Reuters) - More than 10 times as many people in Germany have likely been infected with the coronavirus than the number of confirmed cases, researchers from the University of Bonn have concluded from a field trial in one of the worst hit towns. \r\nTh… [+1424 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Malaria 'completely stopped' by microbe - BBC News", "description": "Scientists say the microbe - found in the wild near Lake Victoria - has enormous potential.", "url": "https://www.bbc.co.uk/news/health-52530828", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/BE00/production/_112104684_gettyimages-944691950-1.jpg", "publishedAt": "2020-05-04T11:31:00Z", "content": "Image copyrightGetty ImagesImage caption\r\n Malaria is spread by the bite of infected mosquitoes\r\nScientists have discovered a microbe that completely protects mosquitoes from being infected with malaria. \r\nThe team in Kenya and the UK say the finding has \"eno… [+3785 chars]"}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Julianna Tatelbaum", "title": "Pharma giants granted coronavirus approvals but doubts remain on manufacturing a global vaccine - CNBC", "description": "Experts warn that vaccine timelines look ambitious and argue more thought is needed on manufacturing.", "url": "https://www.cnbc.com/2020/05/04/coronavirus-drug-approvals-but-doubts-remain-on-manufacturing-vaccine.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/105352818-1532545560549gettyimages-137327466.jpeg?v=1588577492", "publishedAt": "2020-05-04T11:26:35Z", "content": "There were several major developments over the last week with the medical community marking progress in all three critical areas: testing, treatments and vaccines.\r\nExperts have welcomed positive data on potential treatments and progress on testing, but warn … [+5470 chars]"}, {"source": {"id": null, "name": "Khou.com"}, "author": "KHOU 11 Staff", "title": "Coronavirus updates: China hid virus' severity to hoard supplies, Homeland Security report says - KHOU.com", "description": "Here are the latest headlines on COVID-19 in Houston, nationally and around the world.", "url": "https://www.khou.com/article/news/health/coronavirus/coronavirus-updates-for-houston-texas-may-4/285-cde4c869-4ae7-45d0-bf50-d7dc89f3320c", "urlToImage": "https://media.khou.com/assets/WUSA/images/756b124c-add4-4477-95e0-1ec1db31c684/756b124c-add4-4477-95e0-1ec1db31c684_1140x641.jpg", "publishedAt": "2020-05-04T10:57:00Z", "content": "HOUSTON We are continuing to track the latest headlines and updates regarding the global coronavirus (COVID-19) pandemic. \r\nU.S. officials believe China covered up the extent of the coronavirus outbreak. Get the latest updates and top headlines in our live bl… [+13042 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Alexandra Thompson", "title": "Coronavirus: Why are obese people more at risk? - Yahoo Sports", "description": "Just under a third (29%) of UK adults were classified as obese in 2019.", "url": "https://www.yahoo.com/lifestyle/coronavirus-covid19-obesity-weight-bmi-093312439.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/H19q.Qn5W3Z4qxU48MMY.A--~B/aD00NjA3O3c9NjkxMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2020-05/3f8f2ca0-8bc4-11ea-bafc-1625a8555bcf", "publishedAt": "2020-05-04T09:33:00Z", "content": "Obesity has been highlighted as one of the biggest risk factors for complications amid the coronavirus outbreak.\r\nIn the largest study in Europe so far, data from more than 16,000 patients across 166 UK hospitals revealed carrying a dangerous amount of weight… [+6748 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Carolyn Y. Johnson", "title": "Inside the extraordinary race to invent a coronavirus vaccine - The Washington Post", "description": "Companies are launching vaccine trials at an unprecedented pace, but some are worried about the trade-offs between speed and safety.", "url": "https://www.washingtonpost.com/science/2020/05/02/coronavirus-vaccine/", "urlToImage": "https://www.washingtonpost.com/resizer/FB33jJj_l1_YcZFXiBf4EJIqibw=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/BEVCJBMPHFHAPD33WDQXVIUJFA.jpeg", "publishedAt": "2020-05-04T04:44:30Z", "content": "Scientists at the National Institutes of Health in Bethesda, Md., will study blood from Haydon and others for signs that the vaccine triggered an immune response to a pathogen they have never encountered. It would be the first, preliminary signal that the vac… [+12380 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Bruce Haring", "title": "Los Angeles County Coronavirus Deaths, Cases Continue To Climb, Representing Half Of California’s Total - Deadline", "description": "The Los Angeles County Department of Health has confirmed 21 new deaths related to COVID-19 and 781 new cases of the disease in the county. Overall, there are now 25,662 total cases across all areas of LA County and a total of 1,229 deaths. For this weekend a…", "url": "https://deadline.com/2020/05/los-angeles-county-coronavirus-deaths-cases-1202924639/", "urlToImage": "https://pmcdeadline2.files.wordpress.com/2020/04/los-angeles-coronavirus-2.jpg?w=1024", "publishedAt": "2020-05-03T22:05:13Z", "content": null}, {"source": {"id": null, "name": "Newschannel10.com"}, "author": "", "title": "Amarillo area COVID-19 cases reach 1097 as of Sunday, May 3rd - KFDA", "description": "The City of Amarillo has released the daily report detailing cases in Potter and Randall counties.", "url": "https://www.newschannel10.com/2020/05/03/amarillo-area-covid-cases-reach-sunday-may-rd/", "urlToImage": "https://www.newschannel10.com/resizer/e5x7sS_AyrBooDvghhVLMV1uISE=/1200x0/arc-anglerfish-arc2-prod-raycom.s3.amazonaws.com/public/22C4KZCKUZGUDHGR5LXBHSNSKI.jpg", "publishedAt": "2020-05-03T20:40:00Z", "content": "AMARILLO, Texas (KFDA) - There are now 1097 confirmed cases of COVID-19 in the Amarillo area.\r\nThe City of Amarillo released the daily report detailing cases in Potter and Randall counties.\r\nTodays report shows a total of 1097 cases, with 818 in Potter County… [+1029 chars]"}, {"source": {"id": null, "name": "Tvnz.co.nz"}, "author": null, "title": "'Irresponsible, dangerous and untrue' - Mental Health Foundation slams suicide rate increase rumours - 1News", "description": "Incorrect figures have been published online, and the consequences could be serious.", "url": "https://www.tvnz.co.nz/one-news/new-zealand/irresponsible-dangerous-and-untrue-mental-health-foundation-slams-suicide-rate-increase-rumours", "urlToImage": "https://news-image-prod-imgix.tech.tvnz.co.nz/content/dam/images/news/2020/05/04/mental-health-foundation-slams-false-suicide-rate-rumour-as-dang.hashed.3f065f85.desktop.story.share.jpg", "publishedAt": "2020-05-03T19:54:25Z", "content": "The Mental Health Foundation has dismissed rumours spread online that New Zealand's suicide rate has increased during the Covid-19 pandemic, calling them \"irresponsible, dangerous and untrue\".\r\nYour playlist will load after this ad\r\nCEO Shaun Robinson says su… [+1143 chars]"}, {"source": {"id": null, "name": "Oregonlive.com"}, "author": "Brad Schmidt | The Oregonian/OregonLive", "title": "No new coronavirus deaths, 45 more infections, Oregon officials report - OregonLive", "description": "Nearly 62,000 Oregonians have now been tested.", "url": "https://www.oregonlive.com/coronavirus/2020/05/no-new-coronavirus-deaths-45-more-infections-oregon-officials-report.html", "urlToImage": "https://www.oregonlive.com/resizer/-MEVMKlnj7eYkOBUvYMI2HN113g=/1280x0/smart/arc-anglerfish-arc2-prod-advancelocal.s3.amazonaws.com/public/LY2ZT2UQPBCE7DKY55QMMTXXLE.JPG", "publishedAt": "2020-05-03T19:08:08Z", "content": "The Oregon Health Authority on Sunday did not report any new coronavirus deaths and disclosed 45 additional infections, raising the statewide total to 2,680.\r\nThe new number of people infected are from the following counties: Clackamas (1), Coos (4), Hood Riv… [+1870 chars]"}, {"source": {"id": null, "name": "Hotair.com"}, "author": null, "title": "There's a more accurate way to compare coronavirus deaths to the flu - Hot Air", "description": null, "url": "https://hotair.com/headlines/archives/2020/05/theres-accurate-way-compare-coronavirus-deaths-flu/", "urlToImage": "https://hotair.com/wp/wp-content/themes/hotair-desktop/images/social/hotair-default.png", "publishedAt": "2020-05-03T18:00:00Z", "content": "To get a more accurate comparison, one must start with the number of directly confirmed flu deaths, which the CDC tracks on an annual basis. In the past seven flu seasons, going back to 2013, that tally fluctuated between 3,448 and 15,620 deaths.\r\nNote that t… [+701 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Mecklenburg coronavirus cases top 1,700. Western NC county reports 1st case. - Charlotte Observer", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiSGh0dHBzOi8vd3d3LmNoYXJsb3R0ZW9ic2VydmVyLmNvbS9uZXdzL2Nvcm9uYXZpcnVzL2FydGljbGUyNDI0Njg2OTEuaHRtbNIBSGh0dHBzOi8vYW1wLmNoYXJsb3R0ZW9ic2VydmVyLmNvbS9uZXdzL2Nvcm9uYXZpcnVzL2FydGljbGUyNDI0Njg2OTEuaHRtbA?oc=5", "urlToImage": null, "publishedAt": "2020-05-03T15:48:48Z", "content": null}, {"source": {"id": null, "name": "Southbendtribune.com"}, "author": "Margaret Fosmoe South Bend Tribune", "title": "More than a century ago, the Spanish flu struck the South Bend area hard - South Bend Tribune", "description": "Like now, social distancing played a role in stemming the flu's progress in 1918.", "url": "https://www.southbendtribune.com/news/local/history/more-than-a-century-ago-the-spanish-flu-struck-the-south-bend-area-hard/article_45b5f690-7acb-11ea-8577-83354529231a.html", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/southbendtribune.com/content/tncms/assets/v3/editorial/7/80/7802b5bf-94a4-5881-8b4f-42825fb848f5/5bae831bc4d71.image.jpg?resize=815%2C630", "publishedAt": "2020-05-03T10:34:38Z", "content": "The term social distancing didnt exist in 1918.\r\nBut the concept did, although in a more limited form than with todays stay-at-home orders in response to the novel coronavirus.\r\nThen, as now, a global pandemic the Spanish influenza required drastic steps to s… [+8378 chars]"}, {"source": {"id": null, "name": "Realclearpolitics.com"}, "author": null, "title": "What We've Learned About COVID-19 in Prisons - RealClearPolitics", "description": "Confirmation bias is common in policy arguments, and debates about COVID-19\u0092s impact on American corrections systems are no exception. Many criminal justice reform advocates think that any inmate...", "url": "https://www.realclearpolitics.com/articles/2020/05/03/what_weve_learned_about_covid-19_in_prisons.html", "urlToImage": "https://assets.realclear.com/images/50/508905_5_.jpg", "publishedAt": "2020-05-03T10:25:34Z", "content": "Confirmation bias is common in policy arguments, and debates about COVID-19’s impact on American corrections systems are no exception. Many criminal justice reform advocates think that any inmate vulnerable to COVID-19 — regardless of sentenced offense or pro… [+5318 chars]"}, {"source": {"id": null, "name": "Startribune.com"}, "author": "Glenn Howatt", "title": "COVID-19 cases could surge in fall, last 2 years, University of Minnesota report says - Minneapolis Star Tribune", "description": "The pandemic could last up to two years, according to University of Minnesota epidemiologist Michael Osterholm and a team of researchers.", "url": "https://www.startribune.com/covid-19-cases-could-surge-in-fall-last-2-years-u-report-predicts/570130602/", "urlToImage": "https://stmedia.stimg.co/ows_158837554473001.jpg?h=630&w=1200&fit=crop&bg=999&crop=faces", "publishedAt": "2020-05-03T07:00:00Z", "content": "The growing COVID-19 pandemic could last up to two years, with a potential second wave in the fall, according to nationally renowned University of Minnesota epidemiologist Michael Osterholm and a team of researchers.\r\nThe exact path the disease will take is u… [+5795 chars]"}]}