{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": "cbs-news", "name": "CBS News"}, "author": "CBS News", "title": "Coronavirus hits Iowa firefighter's family with deadly consequence - CBS News", "description": "\"All it takes is one person to be irresponsible to affect a family that doesn't deserve it,\" Omar Martinez said of the devastating toll COVID-19 can have.", "url": "https://www.cbsnews.com/news/coronavirus-hits-firefighter-family-deadly-consequence-omar-martinez-iowa-city/", "urlToImage": null, "publishedAt": "2020-04-27T00:55:22Z", "content": "His mother first fell sick a month ago with an illness she believes she caught at the Iowa egg factory where she works.\r\nHis younger sister, 22, was next — a new mother who was soon on a ventilator fighting for her life. Then the coronavirus came for his fath… [+6216 chars]"}, {"source": {"id": null, "name": "Theblaze.com"}, "author": "Paul Sacca", "title": "Frontline doctors who administered 5,000 coronavirus tests want to reopen, say COVID-19 similar to flu - TheBlaze", "description": "Not all health care officials agree with the doctors.", "url": "https://www.theblaze.com/news/doctor-dan-erickson-coronavirus-reopen", "urlToImage": null, "publishedAt": "2020-04-26T23:56:39Z", "content": "Two doctors, who have administered more than 5,000 coronavirus tests, say that coronavirus is similar to the seasonal flu, the quarantine is not helping with building coronavirus immunity, and they are confident that reopening is safe. \r\nThe two frontline phy… [+4680 chars]"}, {"source": {"id": null, "name": "Npr.org"}, "author": "H.J. Mai", "title": "Stockholm Expected To Reach Herd Immunity In May, Swedish Ambassador Says - NPR", "description": "Sweden has employed a controversial coronavirus response strategy. The country is pursuing \"herd immunity,\" which happens when enough people become immune to a disease after recovering from it.", "url": "https://www.npr.org/2020/04/26/845211085/stockholm-expected-to-reach-herd-immunity-in-may-swedish-ambassador-says", "urlToImage": null, "publishedAt": "2020-04-26T23:44:46Z", "content": "People enjoy high temperatures on April 22 in Stockholm. Sweden has not imposed the extraordinary lockdown measures seen across Europe.\r\nAnders Wiklund/TT News Agency/AFP via Getty Images\r\nSweden's ambassador to the U.S. believes the country's controversial s… [+4498 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "New study says coronavirus detected on tiny particles of air pollution - CBS Evening News", "description": "As the debate rages worldwide about when to send people back to work, a new report says COVID-19 could be even more contagious than previously believed. It's...", "url": "https://www.youtube.com/watch?v=zqrSXTl1Nns", "urlToImage": null, "publishedAt": "2020-04-26T22:41:28Z", "content": null}, {"source": {"id": null, "name": "Kesq.com"}, "author": "KESQ News Team", "title": "La Quinta records first coronavirus death, 150+ more coronavirus cases confirmed across county - KESQ", "description": "Riverside County health officials released new data Sunday afternoon, showing the changes in case numbers for Covid-19, or coronavirus.", "url": "https://kesq.com/news/coronavirus/2020/04/26/150-more-coronavirus-cases-confirmed-as-hospitalizations-drop-slightly-recoveries-rise-in-riverside-county/", "urlToImage": null, "publishedAt": "2020-04-26T22:41:15Z", "content": "Riverside County health officials released new data Sunday afternoon, showing the changes in case numbers for Covid-19, or coronavirus. \r\nThe mapping program used by the county indicated a newly recorded death in La Quinta. This is the first death recorded fo… [+4663 chars]"}, {"source": {"id": null, "name": "Latimes.com"}, "author": "Alex Wigglesworth", "title": "L.A. County reports 18 new coronavirus deaths, says poor people are three times more likely to die - Los Angeles Times", "description": "Los Angeles County public health officials on Sunday reported 18 additional COVID-19 deaths and 440 new cases of the coronavirus and said that people in lower-income communities are three times more likely to die of COVID-19.", "url": "https://www.latimes.com/california/story/2020-04-26/l-a-county-reports-18-new-coronavirus-deaths-says-poor-people-are-three-times-more-likely-to-die", "urlToImage": null, "publishedAt": "2020-04-26T22:38:39Z", "content": "Los Angeles County public health officials on Sunday reported 18 additional COVID-19 deaths and 440 new cases of the coronavirus. Long Beach, which has its own health department, reported two new deaths and 10 additional cases, bringing the countys total to 9… [+3105 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": null, "title": "Can Antibody Tests Help End the Coronavirus Pandemic? - msnNOW", "description": "Antibody tests, which show who has been infected, are often inaccurate, recent research suggests, and it is not clear whether a positive result actually signals immunity to the coronavirus.", "url": "https://www.nytimes.com/2020/04/26/health/can-antibody-tests-help-end-the-coronavirus-pandemic.html", "urlToImage": null, "publishedAt": "2020-04-26T22:30:00Z", "content": "Video by Reuters\r\nA survey of New Yorkers last week found that one in five city residents carried antibodies to the new coronavirus and in that, Gov. Andrew M. Cuomo saw good news. \r\nIf so many had been infected and survived, he reasoned, the virus may be far… [+16887 chars]"}, {"source": {"id": null, "name": "Pennlive.com"}, "author": "Megan Lavey-Heaton | mheaton@pennlive.com", "title": "Mapping 6,813 resident cases in Pa. nursing and personal care homes: April 26 county-by-county details - PennLive", "description": "As of 12 p.m. April 26, 2020, there are 6,813 COVID-19 cases among residents in 431 nursing and personal care homes. At least 952 people have died from the virus.", "url": "https://www.pennlive.com/coronavirus/2020/04/mapping-6813-resident-cases-in-pa-nursing-and-personal-care-homes-april-26-county-by-county-details.html", "urlToImage": null, "publishedAt": "2020-04-26T22:18:31Z", "content": "As of 12 p.m. April 26, 2020, there are 6,813 COVID-19 cases among residents in 431 nursing and personal care homes. At least 952 people have died from the virus.\r\nAccording to Health Secretary Dr. Rachel Levine, nursing and personal care homes are required t… [+6898 chars]"}, {"source": {"id": null, "name": "Adn.com"}, "author": "Tess Williams", "title": "Goose Creek inmate tests positive for COVID-19; new cases confirmed in North Pole and Sitka - Anchorage Daily News", "description": "It’s the first confirmed case of COVID-19 in an inmate at Goose Creek Correctional Center in the Mat-Su. There have been 341 confirmed COVID-19 cases in Alaska, including two cases announced Sunday.", "url": "https://www.adn.com/alaska-news/2020/04/26/inmate-at-wasilla-correctional-center-tests-positive-for-covid-19/", "urlToImage": null, "publishedAt": "2020-04-26T22:09:26Z", "content": "An inmate at the Goose Creek Correctional Center tested positive for COVID-19 Saturday night, officials from the Department of Corrections said.\r\n This is the first confirmed case of COVID-19 in an inmate, although there are other inmates still awaiting test … [+2289 chars]"}, {"source": {"id": null, "name": "Oregonlive.com"}, "author": "Lizzy Acker | The Oregonian/OregonLive", "title": "Coronavirus in Oregon: 4 new deaths reported as total known cases reaches 2,311 - oregonlive.com", "description": "The Oregon Health Authority reported 58 new cases of COVID-19 Sunday, bringing the total known case count to 2,311.", "url": "https://www.oregonlive.com/coronavirus/2020/04/coronavirus-in-oregon-4-new-deaths-reported-as-total-known-cases-reaches-2311.html", "urlToImage": null, "publishedAt": "2020-04-26T21:36:00Z", "content": "The Oregon Health Authority reported 58 new cases of COVID-19 Sunday, bringing the total known case count to 2,311.\r\nOfficials also reported four new deaths attributed to the virus in the state, bring the total number of deaths to 91.\r\nTwo of the deaths were … [+1994 chars]"}, {"source": {"id": null, "name": "Ketv.com"}, "author": "KETV Staff Report", "title": "Nebraska Department of Corrections employee tests positive for COVID-19 - KETV Omaha", "description": "This is the second staff member to test positive, says Director Scott Frakes", "url": "https://www.ketv.com/article/nebraska-department-of-corrections-employee-tests-positive-for-covid-19/32281174", "urlToImage": null, "publishedAt": "2020-04-26T21:09:12Z", "content": "LINCOLN, Neb. —Nebraska Department of Corrections confirms a second employee tested positive for COVID-19.\r\nThe staff member works at the Diagnostic and Evaluation Center and has been in isolation at home for five days, said Corrections Director Scott Frakes.… [+516 chars]"}, {"source": {"id": null, "name": "Wral.com"}, "author": null, "title": "U.S. states build stockpiles of malaria drug touted by Trump - WRAL.com", "description": "State and local governments across the United States have obtained about 30 million doses of a malaria drug touted by President Trump to treat patients with the coronavirus, despite warnings from doctors that more research is needed.", "url": "https://www.wral.com/coronavirus/u-s-states-build-stockpiles-of-malaria-drug-touted-by-trump/19070496/", "urlToImage": null, "publishedAt": "2020-04-26T20:49:00Z", "content": "By BRADY McCOMBS and LINDSAY WHITEHURST, Associated Press\r\nSALT LAKE CITY — State and local governments across the United States have obtained about 30 million doses of a malaria drug touted by President Trump to treat patients with the coronavirus, despite w… [+7841 chars]"}, {"source": {"id": null, "name": "Wlfi.com"}, "author": null, "title": "Cluster of COVID-19 cases confirmed at Crawfordsville long-term care facility - wlfi.com", "description": "Fourteen residents tested positive for the virus. These new cases have not yet been registered with the Indiana State Department of Health.", "url": "https://www.wlfi.com/content/news/Cluster-of-COVID-19-cases-confirmed-at-Crawfordsville-long-term-care-facility-569963561.html", "urlToImage": null, "publishedAt": "2020-04-26T20:40:00Z", "content": "CRAWFORDSVILLE - The Montgomery County Health Department announced on Sunday that they have found an isolated cluster of COVID-19 cases at the Ben Hur Health and Rehabilitation center.\r\nThey said they were notified late on Saturday. Fourteen residents tested … [+1756 chars]"}, {"source": {"id": null, "name": "1011now.com"}, "author": "News Channel Nebraska", "title": "Madison Tyson plant outbreak up to 58 cases - 1011now", "description": "The coronavirus outbreak at a northeast Nebraska packing plant has grown to 58 cases.", "url": "https://www.1011now.com/content/news/Madison-Tyson-plant-outbreak-up-to-58-cases-569963541.html", "urlToImage": null, "publishedAt": "2020-04-26T20:34:40Z", "content": "MADISON, Neb. - The coronavirus outbreak at a northeast Nebraska packing plant has grown to 58 cases.\r\nThe Elkhorn Logan Valley Public Health Department announced Sunday morning that the outbreak at the Tyson pork plant in Madison sits at 58 confirmed cases, … [+472 chars]"}, {"source": {"id": null, "name": "Fox8.com"}, "author": "CNNwire", "title": "People are buying pulse oximeters to try and detect coronavirus at home. Do you need one? - WJW FOX 8 News Cleveland", "description": "Many patients with severe cases of Covid-19 have been shown to have extremely low levels of oxygen in the blood. Others who have tested positive find themselves experiencing shortness of breath.", "url": "https://fox8.com/news/coronavirus/people-are-buying-pulse-oximeters-to-try-and-detect-coronavirus-at-home-do-you-need-one/", "urlToImage": null, "publishedAt": "2020-04-26T19:46:44Z", "content": "(CNN) — Many patients with severe cases of Covid-19 have been shown to have extremely low levels of oxygen in the blood. Others who have tested positive find themselves experiencing shortness of breath.\r\nPerhaps that’s why people are so interested lately in p… [+5552 chars]"}, {"source": {"id": null, "name": "Abc3340.com"}, "author": "NICOLE WINFIELD Associated Press", "title": "Many failures combined to unleash death on Italy's Lombardy region - Alabama's News Leader", "description": "ROME (AP) &mdash; As Italy prepares to emerge from the West&rsquo;s first and most extensive coronavirus lockdown, it is increasingly clear that something went terribly wrong in Lombardy, the hardest-hit region in Europe&rsquo;s hardest-hit country. Italy had…", "url": "http://abc3340.com/news/nation-world/many-failures-combined-to-unleash-death-on-italys-lombardy", "urlToImage": null, "publishedAt": "2020-04-26T19:40:00Z", "content": null}, {"source": {"id": null, "name": "Wtnh.com"}, "author": "Teresa Pellicano", "title": "CDC releases six new possible symptoms of coronavirus - WTNH.com", "description": "The Center for Disease Control and Prevention is out with six new symptoms associated with COVID-19 Sunday. This is in addition to their original three.", "url": "https://www.wtnh.com/news/health/coronavirus/cdc-out-with-six-new-possible-symptoms-of-coronavirus/", "urlToImage": null, "publishedAt": "2020-04-26T19:38:00Z", "content": "(WTNH) — The Center for Disease Control and Prevention is out with six new symptoms associated with COVID-19 Sunday. This is in addition to their original three.\r\nABC News reported Sunday, the CDC has updated their list of “possible symptoms of the novel coro… [+745 chars]"}, {"source": {"id": null, "name": "Fox10phoenix.com"}, "author": "Associated Press", "title": "Pace of Arizona deaths in outbreak slows after recent surge - FOX 10 News Phoenix", "description": "The pace of additional deaths in Arizona’s coronavirus outbreak has slowed following a recent surge.", "url": "https://www.fox10phoenix.com/news/pace-of-arizona-deaths-in-outbreak-slows-after-recent-surge1", "urlToImage": null, "publishedAt": "2020-04-26T19:32:27Z", "content": "PHOENIX (AP) - The pace of additional deaths in Arizona’s coronavirus outbreak has slowed following a recent surge.\r\nThe Department of Health Services’ tally of deaths statewide rose by seven to 273 as of Saturday, following an increase of 17 deaths reported … [+1211 chars]"}, {"source": {"id": null, "name": "Realclearpolitics.com"}, "author": null, "title": "Infectious Disease Researcher Dr. Osterholm: We're Still In The Coronavirus Foothills, We \"Have Mountains To Go Yet\" - RealClearPolitics", "description": "Dr. Michael Osterholm, the director of the Center for Infectious Disease Research and Policy at the University of Minnesota, outlines flaws in the government's response to the coronavirus pandemic.\r\n\r\n\"We are in the very earliest days of this situation right …", "url": "https://www.realclearpolitics.com/video/2020/04/26/infectious_disease_researcher_were_missing_the_mark_in_a_big_way_right_now_on_testing.html", "urlToImage": null, "publishedAt": "2020-04-26T19:18:45Z", "content": "Dr. Michael Osterholm, the director of the Center for Infectious Disease Research and Policy at the University of Minnesota, outlines flaws in the government's response to the coronavirus pandemic.\r\n\"We are in the very earliest days of this situation right no… [+1768 chars]"}, {"source": {"id": null, "name": "Wbay.com"}, "author": "WBAY", "title": "Manitowoc Co. reports first COVID-19 related death, state cases increase by 224 - WBAY", "description": "Health officials in Manitowoc County say they have confirmed their first death due to COVID-19.", "url": "https://www.wbay.com/content/news/Manitowoc-Co-reports-first-COVID-19-related-death-569962651.html", "urlToImage": null, "publishedAt": "2020-04-26T18:58:25Z", "content": "MANITOWOC, Wis. (WBAY) -- On Sunday, the Department of Health Services says 224 new cases of COVID-19 were confirmed in Wisconsin, bringing the states total to 5,911. On Saturday, the DHS had confirmed an increase of 331 cases. \r\nThe increase comes along as t… [+7368 chars]"}, {"source": {"id": null, "name": "Wfaa.com"}, "author": "Tasha Tsiaperas (WFAA)", "title": "Live COVID-19 updates: Dallas resident found dead in his home is latest coronavirus casualty - WFAA.com", "description": "There have been more than 3,000 cases of the coronavirus in Dallas County since health officials started reporting testing results.", "url": "https://www.wfaa.com/article/news/health/coronavirus/coronavirus-updates-dallas-fort-worth-april-26/287-ec25a9ec-4d65-4586-806e-43a1e5412f89", "urlToImage": null, "publishedAt": "2020-04-26T18:54:00Z", "content": "Garland health officials reported two deaths and 23 additional positive cases of COVID-19 Sunday afternoon.\r\nThere have been 323 confirmed cases in Garland residents and 10 deaths.\r\nA total of 24,631 cases of COVID-19 have been reported in Texas. Of those, 64… [+5451 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Pam Belluck", "title": "32 Days on a Ventilator: One Covid Patient’s Fight to Breathe Again - The New York Times", "description": "Jim Bello, 49 and healthy, fell gravely ill, highlighting agonizing mysteries of the coronavirus. Doctors’ relentless effort to save him was a roller-coaster of devastating and triumphant twists.", "url": "https://www.nytimes.com/2020/04/26/health/coronavirus-patient-ventilator.html", "urlToImage": null, "publishedAt": "2020-04-26T18:18:44Z", "content": "HINGHAM, Mass. Is he going to make it? Kim Bello asked, clutching her phone, alone in her yard.\r\nShe had slipped outside so her three children, playing games in the living room, could be shielded from a wrenching conversation with a doctor treating her husban… [+15430 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Sarah Toy", "title": "Your Pets Probably Won’t Get the New Coronavirus - The Wall Street Journal", "description": "Veterinary experts say there is little evidence that owners pose a risk to their cats and dogs", "url": "https://www.wsj.com/articles/your-pets-probably-wont-get-the-new-coronavirus-11587924000", "urlToImage": null, "publishedAt": "2020-04-26T18:07:04Z", "content": "Two cats recently became the first pets in the U.S. to test positive for the new coronavirus. But veterinary experts say such cases appear to be extremely rare, and there is little evidence that owners pose a risk to their pets.\r\nIn New York state, two feline… [+277 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "First known coronavirus victim in U.S. died of ‘burst’ heart, pathologist says - Sacramento Bee", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiPWh0dHBzOi8vd3d3LnNhY2JlZS5jb20vbmV3cy9jb3JvbmF2aXJ1cy9hcnRpY2xlMjQyMzA0NTM2Lmh0bWzSAT1odHRwczovL2FtcC5zYWNiZWUuY29tL25ld3MvY29yb25hdmlydXMvYXJ0aWNsZTI0MjMwNDUzNi5odG1s?oc=5", "urlToImage": null, "publishedAt": "2020-04-26T18:00:14Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Ellen Manning", "title": "Coronavirus vaccine trial participant says 'I'm fine' after waking up to fake article on her own death - Yahoo News", "description": "Microbiologist Elisa Granato and the government both rebuffed a fake article that claimed she had died after being injected as part of UK human trials for a ...", "url": "https://uk.news.yahoo.com/coronavirus-microbiologist-vaccine-fake-death-175705217.html", "urlToImage": null, "publishedAt": "2020-04-26T17:57:00Z", "content": "Elisa Granato, one of the first people to be injected as part of UK human trials for a coronavirus vaccine, said she is \"doing fine\" after a fake article about her death was circulated on social media. (Picture: PA)\r\nA microbiologist who was one of the first … [+2425 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Peter Aitken", "title": "Coronavirus hits Netherlands farm animals as minks test positive for virus - Fox News", "description": "Animals in the Netherlands tested positive for the coronavirus for the first time.", "url": "https://www.foxnews.com/world/mink-netherlands-coronavirus-farm", "urlToImage": null, "publishedAt": "2020-04-26T17:54:55Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox. Sign up here.\r\nAnimals at two mink farms in the Netherlands have tested positive for coronavirus, according to officials. \r\nDutch Minister of Agriculture Carola Schouten announced … [+1946 chars]"}, {"source": {"id": "crypto-coins-news", "name": "Crypto Coins News"}, "author": null, "title": "WHO Coronavirus Warning Could Wreck Stock Market Risk Rally - CCN.com", "description": "The World Health Organization's warning about coronavirus reinfection could send the stock market's baffling risk on rally cratering.", "url": "https://www.ccn.com/who-coronavirus-warning-could-wreck-stock-market-risk-rally/", "urlToImage": null, "publishedAt": "2020-04-26T17:30:00Z", "content": "<ul><li>The WHO recently warned re-infection by coronavirus is possible.</li><li>The CDC remains confident a second wave will hit later this year.</li><li>The exuberant stock market rally could suddenly unravel.</li></ul>The World Health Organization warned F… [+4457 chars]"}, {"source": {"id": null, "name": "Kvue.com"}, "author": "KVUE Staff", "title": "Coronavirus updates in Central Texas: Two Travis County parks close to high visitors - KVUE.com", "description": "Here are the latest COVID-19 updates, closures and postponements in Central Texas for Sunday, April 26.", "url": "https://www.kvue.com/article/news/health/coronavirus/coronavirus-austin-covid-19-central-texas-updates/269-44f69ae4-090c-4119-87e6-3cda0a86d7a2", "urlToImage": null, "publishedAt": "2020-04-26T17:25:00Z", "content": "AUSTIN, Texas KVUE is keeping you updated with the latest coronavirus, also known as COVID-19, news in the Austin area.\r\nScroll down for the top headlines and latest updates in KVUE's April 26 live blog.\r\nTop Headlines:\r\nUpdates:\r\n3:30 p.m. Williamson County … [+1401 chars]"}, {"source": {"id": null, "name": "Rapidcityjournal.com"}, "author": "Journal staff", "title": "One new death, 65 new coronavirus cases reported Sunday in South Dakota - Rapid City Journal", "description": "South Dakota is reporting one additional death in the state Sunday morning. From statistics reported by the state, the new death appears to be a person between 50 and 59", "url": "https://rapidcityjournal.com/news/local/one-new-death-65-new-coronavirus-cases-reported-sunday-in-south-dakota/article_ac2a59f6-00bf-5987-acaa-547392b94896.html", "urlToImage": null, "publishedAt": "2020-04-26T16:47:02Z", "content": "South Dakota is reporting one additional death in the state Sunday morning. From statistics reported by the state, the new death appears to be a person between 50 and 59 years old from Minnehaha County. This was the eleventh death from COVID-19 illnesses in S… [+1096 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Rima Abdelkader", "title": "Family diaries kept during Spanish flu give Ohio descendants hope during coronavirus pandemic - NBC News", "description": "Family diaries kept during ‘Spanish Flu’ give Ohio family hope during coronavirus pandemic", "url": "https://www.nbcnews.com/news/us-news/family-diaries-kept-during-spanish-flu-give-ohio-descendants-hope-n1191221", "urlToImage": null, "publishedAt": "2020-04-26T16:45:32Z", "content": "The diary entries from a woman in southwestern Ohio about farm work and life during the 1918 flu pandemic and World War I have brought her future generations comfort and hope as the nation grapples with the coronavirus pandemic.\r\nNo school on account of Spani… [+5341 chars]"}, {"source": {"id": null, "name": "Nola.com"}, "author": "Staff report", "title": "Coronavirus in Louisiana: 7 new deaths, 45 new cases in Orleans; see latest data - NOLA.com", "description": "New confirmed coronavirus infections in Louisiana ticked upward again on Sunday and 26 additional deaths were added to the pandemic's statewide toll, according to a Sunday report from the Louisiana", "url": "https://www.nola.com/news/coronavirus/article_540ceb88-87c6-11ea-bcd4-d3f7e4298a61.html", "urlToImage": null, "publishedAt": "2020-04-26T16:42:00Z", "content": "New confirmed coronavirus infections in Louisiana ticked upward again on Sunday and 26 additional deaths were added to the pandemic's statewide toll, according to a Sunday report from the Louisiana Department of Health.\r\nBut Sunday's updated data continued to… [+2776 chars]"}, {"source": {"id": null, "name": "6abc.com"}, "author": null, "title": "No COVID-19 here: Life in areas with 0 confirmed coronavirus cases - 6abc.com", "description": "Some people are fleeing coronavirus-stricken areas to parts of the country with zero confirmed cases.", "url": "https://6abc.com/coronavirus-cases-us-places-with-no-wyoming/6130731/", "urlToImage": null, "publishedAt": "2020-04-26T15:51:37Z", "content": "WHEATLAND, Wyoming -- The coronavirus pandemic has hit small businesses particularly hard, with owners struggling to make ends meet as social distancing regulations force most to change the way they operate.Yet Dan Brecht, owner Wandering Hermit Books, says h… [+1646 chars]"}, {"source": {"id": null, "name": "Al.com"}, "author": "Leada Gore | lgore@al.com", "title": "187 new coronavirus cases in Alabama; 40 percent of growth from 2 counties - AL.com", "description": "The latest update on coronavirus cases in Alabama.", "url": "https://www.al.com/news/2020/04/187-new-coronavirus-cases-in-alabama-40-percent-of-growth-from-2-counties.html", "urlToImage": null, "publishedAt": "2020-04-26T15:29:04Z", "content": "Alabama added 187 new coronavirus cases in the last day, with 40 percent of those coming from two counties.\r\nThe Alabama Department of Public Healths April 26 9:30 a.m. numbers show a total of 6,213 cases in the state with 213 deaths. Seventy-two percent of a… [+1451 chars]"}, {"source": {"id": null, "name": "Wfla.com"}, "author": "WFLA 8 On Your Side Staff", "title": "Coronavirus in Florida: 689 new COVID-19 cases, 19 deaths in latest report - WFLA", "description": "Over 31,000 people in Florida have been infected with the novel coronavirus and more than 1,000 have died, according to the latest figures on the health department’s website.", "url": "https://www.wfla.com/community/health/coronavirus/coronavirus-in-florida-689-new-covid-19-cases-19-deaths-in-latest-report/", "urlToImage": null, "publishedAt": "2020-04-26T15:02:00Z", "content": "TAMPA, Fla. (WFLA) Over 31,000 people in Florida have been infected with the novel coronavirus and more than 1,000 have died, according to the latest figures on the health departments website.\r\nIn Sunday’s most recent update from the Florida Department of Hea… [+1838 chars]"}, {"source": {"id": null, "name": "Silive.com"}, "author": "Tom Wrobleski | wrobleski@siadvance.com", "title": "Why was the 1918 influenza pandemic so deadly? - SILive.com", "description": "Medical conditions of the day, plus World War I, were big factors.", "url": "https://www.silive.com/news/2020/04/why-was-the-1918-influenza-pandemic-so-deadly.html", "urlToImage": null, "publishedAt": "2020-04-26T14:22:00Z", "content": "STATEN ISLAND, N.Y. Influenza simply isnt supposed to be all that deadly.\r\nBut the flu pandemic that broke out in the fall of 1918 killed so many people that overall life expectancy in many places around the world was actually diminished.\r\nWhen all was said a… [+1084 chars]"}, {"source": {"id": null, "name": "Wnem.com"}, "author": "", "title": "11 deaths, high rate of infection at one Michigan prison - WNEM Saginaw", "description": "More than 50% of inmates tested at a Michigan prison have been infected with the highly contagious coronavirus and at least 11 have died, officials reported.", "url": "https://www.wnem.com/news/11-deaths-high-rate-of-infection-at-one-michigan-prison/article_7e6b722e-87c5-11ea-ab0b-db531b1aedc5.html", "urlToImage": null, "publishedAt": "2020-04-26T13:54:00Z", "content": "More than 50% of inmates tested at a Michigan prison have been infected with the highly contagious coronavirus and at least 11 have died, officials reported.\r\nLakeland prison in Branch County in southern Michigan continues to be a hot spot. It has a large sha… [+1313 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "For those who lived through the HIV/AIDS epidemic in Seattle, the coronavirus pandemic brings echoes of past trauma - Seattle Times", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMilQFodHRwczovL3d3dy5zZWF0dGxldGltZXMuY29tL2xpZmUvZm9yLXRob3NlLXdoby1saXZlZC10aHJvdWdoLXRoZS1oaXYtYWlkcy1lcGlkZW1pYy1pbi1zZWF0dGxlLXRoZS1jb3JvbmF2aXJ1cy1wYW5kZW1pYy1icmluZ3MtZWNob2VzLW9mLXBhc3QtdHJhdW1hL9IBmwFodHRwczovL3d3dy5zZWF0dGxldGltZXMuY29tL2xpZmUvZm9yLXRob3NlLXdoby1saXZlZC10aHJvdWdoLXRoZS1oaXYtYWlkcy1lcGlkZW1pYy1pbi1zZWF0dGxlLXRoZS1jb3JvbmF2aXJ1cy1wYW5kZW1pYy1icmluZ3MtZWNob2VzLW9mLXBhc3QtdHJhdW1hLz9hbXA9MQ?oc=5", "urlToImage": null, "publishedAt": "2020-04-26T13:00:00Z", "content": null}, {"source": {"id": "axios", "name": "Axios"}, "author": "Axios", "title": "96% of 3,300 inmates with coronavirus were asymptomatic, survey shows - Axios", "description": "Asymptomatic patients could be contributing to the spread of the virus at a far higher level than suspected.", "url": "https://www.axios.com/coronavirus-prisons-asymptomatic-8daaaa08-b53e-4368-adb7-88b7d93efece.html", "urlToImage": null, "publishedAt": "2020-04-26T12:11:18Z", "content": "96% of 3,277 inmates in state prison systems in Arkansas, North Carolina, Ohio and Virginia who tested positive for the coronavirus did not show symptoms, Reuters reports.\r\nWhy it matters: The findings suggest that asymptomatic patients could be contributing … [+881 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Mental Health Issues Swarm Health Care Workers Fighting COVID-19 | NowThis - NowThis News", "description": "‘This pandemic is going to break us.’ — These doctors are documenting their mental health struggles while fighting on the front lines of COVID-19. » Subscrib...", "url": "https://www.youtube.com/watch?v=UQGQ5HeQ33E", "urlToImage": null, "publishedAt": "2020-04-26T10:59:53Z", "content": null}, {"source": {"id": null, "name": "Capecodtimes.com"}, "author": "Beth Treffeisen", "title": "Cape reports 9 new COVID-19 cases, 5 deaths - News - Cape Cod Times", "description": "Nine more cases of coronavirus on Cape Cod confirmed Saturday brings the total to 756, according to a state Department of Public Health information", "url": "https://www.capecodtimes.com/article/20200426/NEWS/200429735", "urlToImage": null, "publishedAt": "2020-04-26T10:27:54Z", "content": "Nine more cases of coronavirus on Cape Cod confirmed Saturday brings the total to 756, according to a state Department of Public Health information dashboard. The number of deaths in Barnstable County increased by five, to a total of 37. \r\nAt Cape Cod Hospita… [+2666 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Katie Conner", "title": "How long will the coronavirus test take and when will I get my COVID-19 results? - CNET", "description": "The answer is complicated. Here's what we know about COVID-19 testing right now.", "url": "https://www.cnet.com/how-to/how-long-will-the-coronavirus-test-take-and-when-will-i-get-my-covid-19-results/", "urlToImage": null, "publishedAt": "2020-04-26T10:05:54Z", "content": "It may take over a week to get your coronavirus test results back.\r\nPaul Biris/Getty Images\r\nFor the most up-to-date news and information about the coronavirus pandemic, visit the WHO website.\r\nCoronavirus test kits are limited across the country, but the goo… [+4188 chars]"}, {"source": {"id": null, "name": "Theconversation.com"}, "author": "Asha Bowen, Christopher Blyth, Kirsty Short", "title": "5 reasons it's safe for kids to go back to school - The Conversation AU", "description": "More evidence has come in and confirmed what the government has been saying for some time. Children do get infected much less than adults with COVID-19 and when they do, they hardly spread it.", "url": "https://theconversation.com/5-reasons-its-safe-for-kids-to-go-back-to-school-137064", "urlToImage": null, "publishedAt": "2020-04-26T09:02:00Z", "content": "In mid March, cases of COVID-19 the disease caused by SARS-CoV-2 dramatically increased in Australia and the government responded with an effective public health strategy. People who could, shifted to working from home, social distancing measures were applied… [+5839 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "NICOLE WINFIELD", "title": "As virus lockdown eases, Italy ponders what went wrong - Yahoo Lifestyle", "description": "As Italy prepares to emerge from the West’s first and most extensive coronavirus lockdown, it is increasingly clear that something went terribly wrong in Lom...", "url": "https://www.yahoo.com/lifestyle/virus-lockdown-eases-italy-ponders-065817571.html", "urlToImage": null, "publishedAt": "2020-04-26T06:58:00Z", "content": "ROME (AP) As Italy prepares to emerge from the Wests first and most extensive coronavirus lockdown, it is increasingly clear that something went terribly wrong in Lombardy, the hardest-hit region in Europes hardest-hit country.\r\nItaly had the bad luck of bein… [+6016 chars]"}, {"source": {"id": null, "name": "Kgw.com"}, "author": null, "title": "Foster Farms will continue employee testing after 9 people test positive for COVID-19 - KGW.com", "description": "Foster Farms has had nine employees test positive for COVID-19. It will begin more testing for the rest of its employees on that processing plant floor on Monday.", "url": "https://www.kgw.com/article/news/local/foster-farms-tests-will-continue-employee-testing-after-9-test-positive-for-covid-19/283-332c27bd-400b-458e-9302-411b4d97f133", "urlToImage": null, "publishedAt": "2020-04-26T04:02:00Z", "content": "Editor's note: The video above is from April 22.\r\nFoster Farms has had nine employees test positive for COVID-19.\r\nAccording to a press release, three positive cases at the plant in Kelso, Washington were found on April 17. Two additional positive cases were … [+4128 chars]"}, {"source": {"id": null, "name": "10tv.com"}, "author": "https://www.facebook.com/WBNS10TV/", "title": "Bucyrus police chief says he has COVID-19 - 10TV", "description": "The chief is now in quarantine at home with his wife. He says she has had a fever, and they are both assuming she likely has contracted it, but she has not been tested.", "url": "https://www.10tv.com/article/bucyrus-police-chief-battling-coronavirus-i-wouldnt-wish-it-upon-anybody-2020-apr-1", "urlToImage": null, "publishedAt": "2020-04-26T03:33:01Z", "content": "COLUMBUS, Ohio - From the beginning of the coronavirus pandemic, Bucyrus Police Chief David Koepke has been a vocal advocate of social distancing.\r\nHe created several public service announcements with health officials and local leaders. And he says he's follo… [+2271 chars]"}, {"source": {"id": null, "name": "Woodtv.com"}, "author": null, "title": "MI publishes list of nursing homes with COVID-19 - WOODTV.com", "description": "The Michigan Department of Health and Human Services launched the online database, listing the nursing homes with COVID-19 patients.", "url": "https://www.woodtv.com/health/coronavirus/mi-publishes-list-of-nursing-homes-with-covid-19/", "urlToImage": null, "publishedAt": "2020-04-26T03:09:00Z", "content": "GRAND RAPIDS, Mich. (WOOD) Nearly 2,200 nursing home patients in Michigan are battling COVID-19, according to new data released by the state. \r\nThe Michigan Department of Health and Human Services launched the online database Friday, listing the nursing homes… [+2282 chars]"}, {"source": {"id": null, "name": "Qz.com"}, "author": "Gale Ure", "title": "African scientists must take part in coronavirus vaccine research - Quartz Africa", "description": "To refuse inclusion in global clinical trials would prevent Africa’s researchers from being significant players in the universal fight against the virus.", "url": "https://qz.com/africa/1845883/african-scientists-must-take-part-in-coronavirus-vaccine-research/", "urlToImage": null, "publishedAt": "2020-04-26T02:43:49Z", "content": "The search for a Covid-19 vaccine has sparked international media controversy and negative sentiment around the potential harm of people taking part in clinical trials once the research enters its human testing phase.\r\nA wave of anger was ignited when two top… [+6576 chars]"}, {"source": {"id": null, "name": "Wchstv.com"}, "author": "STAFF REPORTS", "title": "Charleston officer involved in crash Saturday night - WCHS-TV8", "description": "Two people have been transported to the hospital after a crash involving a Charleston police officer, according to Metro 911 dispatchers. Both the officer and a person from the other vehicle involved were taken to the hospital with minor injuries, according t…", "url": "http://wchstv.com/news/local/charleston-officer-involved-in-crash-saturday-night", "urlToImage": null, "publishedAt": "2020-04-26T02:05:18Z", "content": null}, {"source": {"id": null, "name": "Adn.com"}, "author": "Morgan Krakow", "title": "Resident at long-term care facility in Sitka tests positive for COVID-19 - Anchorage Daily News", "description": "It marks the first positive case of the new coronavirus in Sitka.", "url": "https://www.adn.com/alaska-news/2020/04/25/resident-at-long-term-care-facility-in-sitka-tests-positive-for-covid-19/", "urlToImage": null, "publishedAt": "2020-04-26T01:53:02Z", "content": "We're making coronavirus coverage available without a subscription as a public service. But we depend on reader support to do this work. Please consider joining others in supporting local journalism in Alaska for just $3.23 a week.\r\nThe first person to test p… [+1472 chars]"}, {"source": {"id": null, "name": "Nebraska.tv"}, "author": "KHGI", "title": "53 new cases in the Two Rivers district - NTV", "description": "53 new cases of COVID-19 were reported on Saturday, April 25, according to the Two Rivers Public Health Department, bringing the total to 449 in the seven-county region. New confirmed cases include: 12 in Buffalo County 12 and 41 in Dawson County. According t…", "url": "http://nebraska.tv/news/local/53-new-cases-in-the-two-rivers-district", "urlToImage": null, "publishedAt": "2020-04-26T01:37:11Z", "content": null}, {"source": {"id": null, "name": "Wusa9.com"}, "author": null, "title": "Poison control sees surge of calls for exposure to disinfectants and hand sanitizer - WUSA9.com", "description": "The National Capital Poison Center reported that calls in the DMV for exposures to hand sanitizer and disinfectants have seen a dramatic rise since March 1.", "url": "https://www.wusa9.com/article/news/health/coronavirus/poison-control-call-surge-exposure-to-disinfectants-and-hand-sanitizer/65-2b13dd88-b32b-4fe2-b3d9-7126acb67334", "urlToImage": null, "publishedAt": "2020-04-26T01:34:00Z", "content": "WASHINGTON, D.C., USA The National Capital Poison Center says calls from people being exposed to hand sanitizer and disinfectants have seen a surge since March compared to the same time period last year.\r\nThe report came as bogus home remedies for coronavirus… [+2454 chars]"}, {"source": {"id": null, "name": "Wkow.com"}, "author": "WKOW", "title": "Doctors assessing risk of stroke with COVID-19 - WKOW", "description": "A doctor in New York reported treating young patients who've had strokes with COVID-19.", "url": "https://wkow.com/2020/04/25/doctors-assessing-risk-of-stroke-with-covid-19/", "urlToImage": null, "publishedAt": "2020-04-26T00:24:20Z", "content": "MADISON (WKOW) -- A doctor in New York reported treating young patients who've had strokes with COVID-19.\r\nDr. Thomas Oxley, with Mt. Sinai in New York, said five COVID-19 patients in their 30s and 40s with no underlying conditions presented with strokes at t… [+1374 chars]"}, {"source": {"id": null, "name": "Kron4.com"}, "author": "KRON4 Staff", "title": "UCSF starts plasma treatments for coronavirus patients - KRON4", "description": "The first unit of COVID-19 plasma was transfused by UCSF into a critically ill patient in the ICU using a donors antibodies on Saturday, according to a professor of medicine.", "url": "https://www.kron4.com/health/coronavirus/ucsf-starts-plasma-treatments-for-coronavirus-patients/", "urlToImage": null, "publishedAt": "2020-04-25T22:43:00Z", "content": "SAN FRANCISCO, Calif. (KRON) – The University of California, San Francisco is now using plasma to treat coronavirus patients. \r\nOn Saturday, the first unit of COVID-19 plasma was transfused by UCSF into a critically ill patient in the ICU using a donors antib… [+982 chars]"}, {"source": {"id": null, "name": "Easttexasmatters.com"}, "author": "Sue Necessary", "title": "NET Health reports new COVID-19 cases for Anderson, Gregg, Smith Counties - KETK | FOX51 | EastTexasMatters.com", "description": "SMITH COUNTY, Texas (KETK) – The Northeast Texas Public Health District has reported new COVID-19 cases for Anderson, Gregg, and Smith Counties as of Saturday. Anderson County has one new cas…", "url": "https://www.easttexasmatters.com/news/top-stories/net-health-reports-new-covid-19-cases-for-anderson-gregg-smith-counties/", "urlToImage": null, "publishedAt": "2020-04-25T21:28:00Z", "content": "SMITH COUNTY, Texas (KETK) – The Northeast Texas Public Health District has reported new COVID-19 cases for Anderson, Gregg, and Smith Counties as of Saturday.\r\nAnderson County has one new case, bringing its total to 19.\r\nIn the county, 18 of the cases are in… [+1935 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Coronavirus updates: ‘No evidence’ to suggest recovered patients are immune; state passes 13K cases - Tacoma News Tribune", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiRWh0dHBzOi8vd3d3LnRoZW5ld3N0cmlidW5lLmNvbS9uZXdzL2Nvcm9uYXZpcnVzL2FydGljbGUyNDIyNzg1NzYuaHRtbNIBRWh0dHBzOi8vYW1wLnRoZW5ld3N0cmlidW5lLmNvbS9uZXdzL2Nvcm9uYXZpcnVzL2FydGljbGUyNDIyNzg1NzYuaHRtbA?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T21:25:20Z", "content": null}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "WHO warns against coronavirus 'immunity passports' - Al Jazeera English", "description": "UN health agency says there is 'no evidence' that recovered coronavirus patients are protected from reinfection.", "url": "https://www.aljazeera.com/news/2020/04/warns-coronavirus-immunity-passports-200425150532564.html", "urlToImage": null, "publishedAt": "2020-04-25T21:22:24Z", "content": "The United Nations's health agency has warned there is no scientific evidence to prove that people who have recovered from the coronavirus develop immunity against potential infection in the future, as the global death toll from COVID-19 passed 200,000 on Sat… [+4030 chars]"}, {"source": {"id": null, "name": "Wxow.com"}, "author": "Associated Press", "title": "Wisconsin reports largest 1-day increase of COVID-19 cases - WXOW.com", "description": "Wisconsin health officials report that 331 tests for the coronavirus have come back positive in the last 24 hours, the largest single-day rise since the outbreak started.", "url": "https://wxow.com/2020/04/25/wisconsin-reports-largest-1-day-increase-of-covid-19-cases/", "urlToImage": null, "publishedAt": "2020-04-25T20:18:13Z", "content": "MADISON, Wis (AP/WXOW) - Wisconsin health officials report that 331 tests for the coronavirus have come back positive in the last 24 hours, the largest single-day rise since the outbreak started. \r\nAn additional four people have died. \r\nThe update raises the … [+2335 chars]"}, {"source": {"id": null, "name": "Wibw.com"}, "author": "Danielle Martin", "title": "Kansas has 3,056 cases of COVID-19, up 279 - WIBW", "description": "The Kansas Department of Health and Environment is reporting 3,056  cases of COVID-19 in the state, up 279 from yesterday.", "url": "https://www.wibw.com/content/news/Kansas-has-3056-cases-of-COVID-19-up-279--569952231.html", "urlToImage": null, "publishedAt": "2020-04-25T20:09:18Z", "content": "TOPEKA, Kan. (WIBW) -- The Kansas Department of Health and Environment is reporting 3,056 cases of COVID-19 in the state, up 279 from yesterday. There have been 117 deaths. At least 474 have been hospitalized due to the virus.\r\nOf the tests given, 22,143 came… [+14 chars]"}, {"source": {"id": null, "name": "Abc11.com"}, "author": null, "title": "Doctors report 'COVID toes,' discolored skin on some coronavirus patients - WTVD-TV", "description": "A growing number of dermatologists treating suspected and confirmed coronavirus-positive patients are reporting patterns and trends of skin conditions.", "url": "https://abc11.com/covid-toes-covid19-coronavirus-symptoms/6128998/", "urlToImage": null, "publishedAt": "2020-04-25T20:08:59Z", "content": "As doctors around the world continue to battle COVID-19, researchers are noticing that the disease appears to attack the entire body, including the toes.A growing number of dermatologists treating suspected and confirmed coronavirus-positive patients are repo… [+1943 chars]"}, {"source": {"id": null, "name": "Glamour.com"}, "author": "Natasha Reda", "title": "Improve Your Face Masks With One Simple Item You Probably Have In Your Drawers - Glamour", "description": "A new study finds that adding an extra layer of nylon pantyhose to a DIY or cloth face masks improves protection.", "url": "https://www.glamour.com/story/improve-cloth-face-masks-nylon-added-protection", "urlToImage": null, "publishedAt": "2020-04-25T18:28:11Z", "content": "Your DIY face masks could use a pretty easy upgrade. A new study revealed there's a way to make your cloth masks significantly more effectiveand you probably have multiple sitting in your sock drawer or hanging in your closet.\r\nIn recent weeks, CDC guidelines… [+2166 chars]"}, {"source": {"id": null, "name": "Inverse.com"}, "author": "Abela Mahimbo, David Isaacs, Melissa Kang, Melanie Wong", "title": "Why are some people with Covid-19 asymptomatic? Evidence points to 2 factors - Inverse", "description": "Recent studies suggest as many as 80% or more of those infected are “silent carriers”, showing no or very mild symptoms.", "url": "https://www.inverse.com/science/covid-19-asymptomatic", "urlToImage": null, "publishedAt": "2020-04-25T17:58:15Z", "content": "SARS-CoV-2, the coronavirus which causes COVID-19, has infected almost 2.5 million people around the world and claimed 170,000 lives.\r\nBut some people dont even get symptoms. Recent studies suggest as many as 80 percentor more of those infected are silent car… [+5687 chars]"}, {"source": {"id": null, "name": "Mynbc15.com"}, "author": "Rachael Wilkerson | Lindsey Bullard", "title": "Food benefits, $300 per child, available for eligible Alabama school children in May - NBC 15 WPMI", "description": "The Alabama Department of Human Resources (DHR) announced it received approval by the United States Department of Agriculture Food and Nutrition Service to issue Pandemic EBT (P-EBT) benefits to eligible students in Alabama. Under this program, an estimated 4…", "url": "http://mynbc15.com/news/local/food-benefits-300-per-child-available-for-eligible-alabama-school-children-in-may", "urlToImage": null, "publishedAt": "2020-04-25T17:48:00Z", "content": null}, {"source": {"id": null, "name": "Kimt.com"}, "author": null, "title": "A 5-part series: What does it take to re-open one of Minnesota's largest cities? - KIMT 3", "description": "KIMT's Jessica Bringe talked to people throughout southeastern Minnesota to see what's next as people and communities fight the coronavirus.", "url": "https://www.kimt.com/content/news/A-5-part-series-What-does-it-take-to-re-open-one-of-Minnesotas-largest-cities-569950771.html", "urlToImage": null, "publishedAt": "2020-04-25T17:05:00Z", "content": "Governor Tim Walz is moving forward with plans to reopen the economy in our region by partnering with other Midwest governors.Walz said, “If I thought we could go back to work tomorrow that’s exactly what we would do.”As governors across the U.S. begin collab… [+3176 chars]"}, {"source": {"id": null, "name": "Fox8.com"}, "author": "CNNwire", "title": "5-month-old daughter of a New York firefighter dies from coronavirus - WJW FOX 8 News Cleveland", "description": "A New York firefighter’s infant daughter has died from coronavirus, her family says, making her one of the youngest known victims of the virus.", "url": "https://fox8.com/news/coronavirus/5-month-old-daughter-of-a-new-york-firefighter-dies-from-coronavirus/", "urlToImage": null, "publishedAt": "2020-04-25T16:08:53Z", "content": "(CNN) — A New York firefighter’s infant daughter has died from coronavirus, her family says, making her one of the youngest known victims of the virus.\r\nFive-month-old Jay-Natalie, the daughter of New York City firefighter Jerel La Santa and Board of Educatio… [+2469 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "J. Edward Moreno", "title": "Several states starting to reopen this weekend | TheHill - The Hill", "description": "A handful of states in the U.S. are beginning to reopen some businesses starting this weekend as governors across the country grapple with when and how to ease restrictions put in place to curb the spread of the coronavirus while salvaging what they can of th…", "url": "https://thehill.com/homenews/state-watch/494635-here-are-the-states-moving-toward-reopening-this-weekend", "urlToImage": null, "publishedAt": "2020-04-25T13:56:32Z", "content": "A handful of states in the U.S. are beginning to reopen some businesses starting this weekend as governors across the country grapple with when and how to ease restrictions put in place to curb the spread of the coronavirus.\r\nGeorgias stay-at-home order expir… [+3678 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "WHO Warns You May Catch Coronavirus More Than Once - Bloomberg", "description": null, "url": "https://www.bloomberg.com/tosv2.html?vid=&uuid=cd167a30-87ee-11ea-be62-69f070f39e5f&url=L25ld3MvYXJ0aWNsZXMvMjAyMC0wNC0yNS9jYXRjaGluZy1jb3ZpZC0xOS1tYXktbm90LXNoaWVsZC1hZ2FpbnN0LW5ldy1pbmZlY3Rpb24td2hvLXNheXM=", "urlToImage": null, "publishedAt": "2020-04-25T13:13:20Z", "content": "To continue, please click the box below to let us know you're not a robot."}, {"source": {"id": null, "name": "Abc7chicago.com"}, "author": null, "title": "Chicago cloth mask drive gets underway ahead of new statewide face covering requirements - WLS-TV", "description": "The cloth mask drive seeks to help those who might not otherwise have access to face masks, as they'll soon be required in some public situations.", "url": "https://abc7chicago.com/coronavirus-chicago-mask-drive-masks-covid/6128775/", "urlToImage": null, "publishedAt": "2020-04-25T11:18:22Z", "content": "CHICAGO (WLS) -- In an effort to help those who might not otherwise have access to face coverings, which will soon be required in the state, a citywide cloth mask drive kicked off Saturday.The state and Centers for Disease Control and Prevention are already r… [+2601 chars]"}, {"source": {"id": null, "name": "Weather.com"}, "author": "Deekshith Nevil Pinto", "title": "World Malaria Day: Would Coronavirus Revive or Derail India's Success Story Against Malaria? - The Weather Channel", "description": "The novel coronavirus is restricting the ongoing healthcare services that helped countries to fight several deadly diseases like Malaria.", "url": "https://weather.com/en-IN/india/coronavirus/news/2020-04-25-world-malaria-day-covid-19-revive-derail-india-success-story", "urlToImage": null, "publishedAt": "2020-04-25T07:28:54Z", "content": "On December 4, 2019, the World Health Organisation (WHO) released the World Malaria Report 2019a comprehensive analysis of the global Malaria situation. The report showed that India was one of the only two success stories among 11 countries facing the world's… [+7093 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "What COVID-19 Symptoms Should People Be On The Lookout For? - WCCO - CBS Minnesota", "description": "There are so many unknowns about COVID-19. But, one thing has been clear – the virus can present itself differently in different people, Heather Brown report...", "url": "https://www.youtube.com/watch?v=Ml0aBNKYVyc", "urlToImage": null, "publishedAt": "2020-04-25T03:58:36Z", "content": "There are so many unknowns about COVID-19. But, one thing has been clear the virus can present itself differently in different people, Heather Brown reports (2:37).WCCO 4 News at 10 April 24, 2020"}, {"source": {"id": null, "name": "Komonews.com"}, "author": "Tammy Mutasa, KOMO News Reporter", "title": "Will COVID-19 antibody testing help figure out how much the virus spreads? - KOMO News", "description": "There is a lot of anticipation and confusion about COVID-19 antibody tests&mdash;which detect natural immunity from the coronavirus. We're here to help you get answers about when people can get tested and who's even offering a test? As the discussion about re…", "url": "http://komonews.com/news/coronavirus/will-covid-19-antibody-testing-help-figure-out-how-much-the-virus-spreads", "urlToImage": null, "publishedAt": "2020-04-25T03:40:45Z", "content": null}]}