{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Seamus Duff", "title": "Inside billionaire Kylie Jenner's new $36 million seven bedroom home - Mirror Online", "description": "The price tag of $36 million will be but a drop in the ocean for billionaire Kylie Jenner – however it is believed she managed to haggle down the asking price from $55 million", "url": "https://www.mirror.co.uk/3am/celebrity-news/inside-billionaire-kylie-jenners-new-21924615", "urlToImage": null, "publishedAt": "2020-04-25T05:55:43Z", "content": "Kylie Jenner has spent a fortune snapping up a new mansion at the cost of $36 million which is small change to the self made billionaire.\r\nThe 22-year-old Keeping Up With The Kardashians star is said to have plashed the equivalent of £30 million on a new pad … [+3120 chars]"}, {"source": {"id": null, "name": "Nine.com.au"}, "author": "9Honey Celebrity with Variety", "title": "Andy Cohen calls for ending blood donations ban from gay and bisexual men amid coronavirus pandemic - 9Honey", "description": "", "url": "https://celebrity.nine.com.au/latest/andy-cohen/5498d18d-2197-4d34-8895-642eb625c40f", "urlToImage": null, "publishedAt": "2020-04-25T03:54:00Z", "content": "LOS ANGELES (Variety.com) Andy Cohen, who recently recovered from coronavirus, has called on the FDA to lift its three month waiting period for gay and bisexual men to donate blood and plasma.\r\nBroadcasting from his home on Thursday's Watch What Happens Live,… [+3513 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Jessamy Tredinnick Candice Jackson For Daily Mail Australia", "title": "Hamish Blake and Zoe share video of themselves as they celebrate a week of homeschooling being over - Daily Mail", "description": "They've been busy homeschooling their five-year-old son amid the coronavirus pandemic.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8255613/Hamish-Blake-Zo-Foster-Blake-celebrate-week-homeschooling-over.html", "urlToImage": null, "publishedAt": "2020-04-25T03:44:15Z", "content": "They've been busy homeschooling their five-year-old son amid the coronavirus pandemic. \r\nAnd on Friday, Hamish Blake and his beauty guru wife Zoë Foster-Blake shared a hilarious video of themselves sipping cocktails and having a party at their home as they ce… [+2748 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "Former Broncos star Daniel Vidot makes WWE Smackdown debut - Fox Sports", "description": "<b>Tune into our new show Fox League Live on Channel 502 Monday to Friday at 6.30pm and on Saturday at 3pm and Sunday at 5pm.</b>", "url": "https://www.foxsports.com.au/nrl/nrl-premiership/nrl-2020-daniel-vidot-wwe-smackdown-debut-brisbane-broncos-rugby-league/news-story/547c2c589f14894482608abf3ffee303", "urlToImage": null, "publishedAt": "2020-04-25T03:03:00Z", "content": "Former NRL player Daniel Vidot has taken his wrestling career to even greater heights making his WWE SmackDown debut during the coronavirus pandemic.\r\nVidot made the unlikely career switch after his rugby league life came to an end in 2017.\r\nWatch Foxtel in a… [+1615 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Barbara  Mcmahon Barbara Davies for the Daily Mail", "title": "Vogue editor Anna 'Nuclear' Wintour has fallen out with her right-hand man Andre Leon Talley... - Daily Mail", "description": "There was a time when Andre Leon Talley's friendship with Dame Anna Wintour was regarded as a match made in fashion heaven.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8255427/Vogue-editor-Anna-Nuclear-Wintour-fallen-right-hand-man-Andre-Leon-Talley.html", "urlToImage": null, "publishedAt": "2020-04-25T02:47:23Z", "content": "There was a time when Andre Leon Talley's friendship with Dame Anna Wintour was regarded as a match made in fashion heaven. She was the formidable British editor-in-chief of Vogue whose presence in the front row at catwalk shows left designers quaking in thei… [+15005 chars]"}, {"source": {"id": null, "name": "Ringsidenews.com"}, "author": "H Jenkins", "title": "Vince McMahon Appeared During Triple H Celebration To Say How Much It Sucked - Ringside News", "description": "Vince McMahon doesn't show up very often on his own programming. He made a very special appearance during the closing moments of WWE SmackDown this week.", "url": "https://www.ringsidenews.com/2020/04/24/vince-mcmahon-appeared-during-triple-h-celebration-to-say-how-much-it-sucked/", "urlToImage": null, "publishedAt": "2020-04-25T02:15:00Z", "content": "Vince McMahon doesn’t show up very often on his own programming. He made a very special appearance during the closing moments of WWE SmackDown this week.\r\nClick here for our complete coverage of WWE Friday Night SmackDown from this week.\r\nTriple H and Shawn M… [+952 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Kellie Chudzinski For Dailymail.com", "title": "Christina Applegate and Linda Cardellini try to cover up a murder in Dead to Me season 2 trailer - Daily Mail", "description": "Stars Christina Applegate and Linda Cardellini are returning to the small screen in their hit roles as Jen and Judy. The trailer for season two, released Friday, catches up with the unlikely friend.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8255621/Christina-Applegate-Linda-Cardellini-try-cover-murder-Dead-season-2-trailer.html", "urlToImage": null, "publishedAt": "2020-04-25T01:38:59Z", "content": "Hit Netflix series Dead To Me, left fans on the edge of their seats with its inaugural season, out last May. \r\nAnd now stars Christina Applegate and Linda Cardellini are returning to the small screen in their hit roles as Jen and Judy. \r\nThe trailer for seaso… [+6378 chars]"}, {"source": {"id": null, "name": "Nine.com.au"}, "author": "Maddison Leach", "title": "Five things we've learned from Meghan's court case so far - 9Honey", "description": "", "url": "https://honey.nine.com.au/royals/meghan-markle-lawsuit-court-case-five-things/59e6d80b-2c65-480f-8234-d974d3ea2ccb", "urlToImage": null, "publishedAt": "2020-04-25T01:37:18Z", "content": "Meghan Markle's lawsuit against the Mail on Sunday kicked off in the UK on Friday with a preliminary hearing at London's High Court.\r\nThe Duchess is suing the paper for publishing parts of what she has called a \"private and confidential\" letter she wrote to h… [+4810 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Stephen Gibbs for Daily Mail Australia", "title": "How the Kelly Gang shot dead three police at Stringybark Creek in Victoria Police's darkest day - Daily Mail", "description": "Ned Kelly is portrayed by some as an an Australian folk hero unjustly persecuted by police but to others he is best remembered as a cold-blooded cop killer.", "url": "https://www.dailymail.co.uk/news/article-8251717/How-Kelly-Gang-shot-dead-three-police-Stringybark-Creek-Victoria-Polices-darkest-day.html", "urlToImage": null, "publishedAt": "2020-04-25T01:10:48Z", "content": "Until the deaths of four police officers on a Melbourne freeway this week the worst day in the history of the Victorian force was more than 140 years ago.\r\nOn October 26, 1878 the Kelly Gang ruthlessly shot dead three policemen who had been hunting for them a… [+14253 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Vicky Roach", "title": "Movie reviews: Chris Hemsworth’s Extraction and kids’ flick The Willoughbys - Jimmys Post", "description": "LOOKING for something new to watch this weekend? Check out Chris Hemsworth’s new thriller and sweet kids’ romp The Willoughbys.", "url": "https://www.news.com.au/entertainment/movies/movie-reviews-chris-hemsworths-extraction-and-kids-flick-the-willoughbys/news-story/ceebdfbaf48d22882ccb9ad549e4cddc", "urlToImage": null, "publishedAt": "2020-04-25T01:04:54Z", "content": "LOOKING for something new to watch this weekend? Check out Chris Hemsworths new thriller and sweet kids romp The Willoughbys. \r\nEXTRACTION\r\nTwo stars \r\nDirector: Sam Hargrave\r\nStarring: Chris Hemsworth, Rudhraskh Jaiswal, David Harbour\r\nRating: MA15+\r\nRunning… [+6915 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Hannah-Rose Yee", "title": "The best podcasts of 2020: 10 podcasts to get on your isolation playlist. - NEWS.com.au", "description": "The best podcasts of 2020: 10 podcasts you need on your isolation playlist", "url": "https://www.news.com.au/entertainment/books-magazines/books/the-best-podcasts-of-2020-10-podcasts-you-need-on-your-isolation-playlist/news-story/bbc100a18ef318f100f00e0333abc8ba", "urlToImage": null, "publishedAt": "2020-04-25T00:55:40Z", "content": "Are you a podcast fan? If you answered yes, then youre unlikely to be part of the 17 per cent drop in podcast listening during the pandemic, according to research.For those who have dropped off, podcasting was something listened to on the long and weary commu… [+8130 chars]"}, {"source": {"id": null, "name": "Couriermail.com.au"}, "author": "admin", "title": "Cooking hack: Man's 'life changing' vegetable peeler trick - Jimmys Post", "description": "", "url": "https://www.couriermail.com.au/lifestyle/food/cooking-hack-mans-life-changing-vegetable-peeler-trick/news-story/ec23fd352c7b66dd3890c9769fb8c67d/", "urlToImage": null, "publishedAt": "2020-04-25T00:47:34Z", "content": "Peeling vegetables is easily one of the most time-consuming and, let’s be honest, boring tasks when it comes to cooking. \r\nBut it seems like most of us have been doing the everyday task wrong, with one man’s game-changing trick showing how we can speed up veg… [+1834 chars]"}, {"source": {"id": null, "name": "Nine.com.au"}, "author": "Isabel Thomson Officer", "title": "Dannii and Kylie Minogue pay tribute to ANZACs and their great grandfather on Anzac Day - 9Celebrity", "description": "", "url": "https://celebrity.nine.com.au/latest/kylie-dannii-minogue-anzac-day-2020-tributes/5b701cac-b03f-480e-baf4-5290eef3440f", "urlToImage": null, "publishedAt": "2020-04-25T00:44:00Z", "content": "Australian golden girls Kylie and Dannii Minogue haven't let lockdown stop them from \"remembering and paying respects\" to ANZAC veterans on Anzac Day.\r\nPosting a photo of their late great grandfather Charles who served in World War I, Dannii, 48, wrote a touc… [+1214 chars]"}, {"source": {"id": null, "name": "Newidea.com.au"}, "author": null, "title": "Princess Eugenie goes makeup free in stunning anniversary photo - New Idea", "description": "Princess Eugenie has shared a stunning makeup free photo as she celebrates her 10th anniversary with husband Jack Brooksbank.", "url": "https://www.newidea.com.au/princess-eugenie-goes-makeup-free-in-stunning-anniversary-photo", "urlToImage": null, "publishedAt": "2020-04-25T00:01:00Z", "content": "Eugenie is celebrating her 10th anniversary with husband, Jack Brooksbank.\r\nRoyal fans were quick to comment on the stunning photos of the happy couple.\r\n\"Happy 10th anniversary to you. Wonderful, it is a beautiful initiative,\" wrote one royal fan. \r\nAnother … [+1321 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/hannah--reich/9151774", "title": "TikTok offers connection, comedy and creativity during coronavirus lockdown - ABC News", "description": "The social video sharing app once seemed just for teenagers but since social isolation started, more and more people are joining TikTok for connection, comedy and creativity.", "url": "https://www.abc.net.au/news/2020-04-25/turning-to-tiktok-during-coronavirus-lockdown/12176814", "urlToImage": null, "publishedAt": "2020-04-24T23:57:27Z", "content": "Posted \r\nApril 25, 2020 09:19:12\r\n\"If it wasn't for coronavirus, I wouldn't have downloaded it and the fact that I have makes me feel a little bit embarrassed,\" says Hannah Baker, a new TikTok devotee.\r\nThe 27-year-old judge's associate says one thing that go… [+7054 chars]"}, {"source": {"id": null, "name": "Darkhorizons.com"}, "author": null, "title": "Ness To Pen Guadagnino's \"Lord of the Flies\" - Dark Horizons", "description": "“Chaos Walking” and “A Monster Calls” author Patrick Ness has been set to pen the newest adaptation of William Golding’s iconic 1954 novel “Lord of the Flies” for Warner Bros. Pictures. The dark allegory tale follows a group of British boys stranded on a dese…", "url": "https://www.darkhorizons.com/ness-to-pen-guadagninos-lord-of-the-flies/", "urlToImage": null, "publishedAt": "2020-04-24T23:35:00Z", "content": "“Chaos Walking” and “A Monster Calls” author Patrick Ness has been set to pen the newest adaptation of William Golding’s iconic 1954 novel “Lord of the Flies” for Warner Bros. Pictures.\r\nThe dark allegory tale follows a group of British boys stranded on a des… [+534 chars]"}, {"source": {"id": null, "name": "Belfasttelegraph.co.uk"}, "author": "By Keiran Southern, PA Los Angeles Correspondent", "title": "Kanye West is officially a billionaire, according to Forbes magazine - Belfast Telegraph", "description": "Kanye West is officially a billionaire, according to Forbes magazine.", "url": "https://www.belfasttelegraph.co.uk/entertainment/music/news/kanye-west-is-officially-a-billionaire-according-to-forbes-magazine-39156219.html", "urlToImage": null, "publishedAt": "2020-04-24T23:07:00Z", "content": "Kanye West is officially a billionaire, according to Forbes magazine.\r\nThe outlet says the rapper and fashion designer, who has long coveted the status, provided an eye-catching glimpse into his personal finances and valued his net worth at $1.3 billion (£1.0… [+2159 chars]"}, {"source": {"id": null, "name": "Digitalspy.com"}, "author": "Justin Harp", "title": "Will & Grace bosses solve massive mystery about the final season - digitalspy.com", "description": "Who's the daddy?", "url": "https://www.digitalspy.com/tv/ustv/a32272405/will-and-grace-baby-daddy-mystery-solved/", "urlToImage": null, "publishedAt": "2020-04-24T23:04:00Z", "content": "Will &amp; Grace series finale spoilers follow.\r\nThe team behind Will &amp; Grace have answered one of the biggest lingering questions from the final season.\r\nThe acclaimed sitcom wrapped up its second run on NBC in the US on Thursday night (April 23) without… [+1785 chars]"}, {"source": {"id": null, "name": "Nine.com.au"}, "author": "Isabel Thomson Officer", "title": "Seinfeld and Star Trek actor Gene Dynarski dies at 86 - 9Celebrity", "description": "", "url": "https://celebrity.nine.com.au/latest/gene-dynarski-seinfeld-dies-86/8c5cd70c-f492-4cc4-881b-d72b8e9c14a6", "urlToImage": null, "publishedAt": "2020-04-24T22:54:00Z", "content": "Gene Dynarski, the actor who played Izzy Mandelbaum Jr the son of Lloyd Bridges on the hit sitcom Seinfeld has died. He was 86.\r\nDynarski, who also starred in Steven Spielberg's Duel and Close Encounters of the Third Kind, died on February 27 at a rehabilitat… [+1504 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Lorena Allam", "title": "Arnhem Land is in lockdown – but you can visit through online concerts - The Guardian", "description": "Aboriginal artists are streaming free music and dance performances during the coronavirus crisis", "url": "https://www.theguardian.com/australia-news/2020/apr/24/arnhem-land-coronavirus-lockdown-but-you-can-visit-through-online-concerts", "urlToImage": null, "publishedAt": "2020-04-24T22:19:01Z", "content": "Aboriginal remote communities have been closed to the outside world for weeks amid the coronavirus crisis, designated as biosecurity areas and locked down for their own safety with non-essential visitors banned.\r\nIn the top end, it means big festivals such as… [+3329 chars]"}, {"source": {"id": null, "name": "Grandtournation.com"}, "author": "Alex Harrington", "title": "Jeremy Clarkson Reveals When The Next Episode Of The Grand Tour Will Be Ready - Grand Tour Nation", "description": "Jeremy Clarkson has confirmed that the next episode of The Grand Tour, the Madagascar Special, will be sent off to … More", "url": "https://www.grandtournation.com/thegrandtour/jeremy-clarkson-reveals-when-the-next-episode-of-the-grand-tour-will-be-ready/", "urlToImage": null, "publishedAt": "2020-04-24T21:26:15Z", "content": "Jeremy Clarkson has confirmed that the next episode of The Grand Tour, the Madagascar Special, will be sent off to Amazon in two weeks. In a conversation filmed by DriveTribe with executive producer Andy Wilman, who only recently recovered from Covid-19, they… [+1821 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": null, "title": "Captain Tom Moore becomes oldest person to top Britain's music chart - The Age", "description": "A World War II veteran who raised millions for charity has now become the oldest person to top Britain's main music chart.", "url": "https://www.smh.com.au/world/europe/captain-tom-moore-becomes-oldest-person-to-top-britain-s-music-chart-20200425-p54n4v.html", "urlToImage": null, "publishedAt": "2020-04-24T20:40:50Z", "content": "He also went to No.1 on the music charts - with a little help from a friend.\r\nThe cover version of You'll Never Walk Alone that Moore appears on with singer Michael Ball was on course to be pipped by The Weeknd's Blinding Lights, until the Canadian star asked… [+1312 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Etienne Fermie", "title": "Mike Tyson admits his tigers could have come from convicted Netflix star Joe Exotic, boxing news - NEWS.com.au", "description": "Mike Tyson admits his tigers ‘could have’ come from convicted Netflix star Joe Exotic", "url": "https://www.news.com.au/sport/sports-life/mike-tyson-admits-his-tigers-could-have-come-from-convicted-netflix-star-joe-exotic/news-story/b4713939e39cc60f49f8786d6712ae60", "urlToImage": null, "publishedAt": "2020-04-24T20:19:56Z", "content": "Mike Tyson has admitted his tigers may have come from jailed Netflix star Joe Exotic, The Sun reported.The boxing legend was renowned for owning the big cats at the height of his success in the 1990s, and Tyson, 53, appears to be a fan of the newly-famed Exot… [+1941 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Eve Wagstaff", "title": "Coronavirus: Ricky Gervais launches epic rant against ‘multi-millionaire celebs’ lecturing people during lockdown - NEWS.com.au", "description": "Coronavirus: Ricky Gervais launches epic rant against ‘multi-millionaire celebs’ lecturing people during lockdown", "url": "https://www.news.com.au/entertainment/celebrity-life/coronavirus-ricky-gervais-launches-epic-rant-against-multimillionaire-celebs-lecturing-people-during-lockdown/news-story/ac2d236332980c8b99d499ffb519dfe7", "urlToImage": null, "publishedAt": "2020-04-24T17:20:49Z", "content": "Ricky Gervais has launched an epic rant against \"multi-millionaire celebs\" who lecture \"normal nobodies\" on how to live while health staff risk their lives.The 58-year-old comedian blasted a string of A-listers including Gal Gadot and her Hollywood friends wh… [+3810 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Marta Jary For Daily Mail Australia", "title": "Prime Minister Scott Morrison addresses rumours he soiled himself at Engadine McDonald's - Daily Mail", "description": "Scott Morrison has again addressed rumours that he soiled himself at McDonald's the night the Cronulla Sharks lost the 1997 Grand Final.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8252669/Prime-Minister-Scott-Morrison-addresses-rumours-soiled-Engadine-McDonalds.html", "urlToImage": null, "publishedAt": "2020-04-24T10:58:38Z", "content": "Scott Morrison has again addressed rumours that he soiled himself at McDonald's the night the Cronulla Sharks lost the 1997 Grand Final. \r\nSpeaking to KIIS FM's Will and Woody show on Friday, the Prime Minister laughed heartily when asked if the story was tru… [+2930 chars]"}, {"source": {"id": null, "name": "9news.com.au"}, "author": "AAP", "title": "Love Is In The Air was 'partly copied' - 9News", "description": "Australian hit Love Is In the Air was partly copied by American duo, a judge ruled in copyright infringement case", "url": "https://www.9news.com.au/national/love-is-in-the-air-in-air-france-advert-was-partly-copied-court-rules/7a1e55a6-bb38-4ebb-82fc-470a0a1eb0dc", "urlToImage": null, "publishedAt": "2020-04-24T10:50:46Z", "content": "Auto news: Great Wall buys GM's last factory in India - caradvice.com.au"}, {"source": {"id": null, "name": "Perthnow.com.au"}, "author": "PerthNow", "title": "‘I hadn't made the mental connection’: Horrified mum accidentally names her baby girl ‘Lasagna’ - PerthNow", "description": "Some times things just don’t work out how you’d planned, even with the best intentions. That’s exactly what a new mother found out - and her family are absolutely paying her out for it.", "url": "https://www.perthnow.com.au/lifestyle/parenting/i-hadnt-made-the-mental-connection-horrified-mum-accidentally-names-her-baby-girl-lasagna-ng-b881529662z", "urlToImage": null, "publishedAt": "2020-04-24T09:49:34Z", "content": "Sometimes things just dont work out how youd planned, even with the best intentions.\r\nA mum has taken to Reddit to ask Am I the a******? after accidentally naming her kid, Lasagna.\r\nThe name was at first meant to be a tribute to her mother-in-law, who recentl… [+2238 chars]"}, {"source": {"id": null, "name": "Newidea.com.au"}, "author": null, "title": "Kate Middleton just shared her first 'Instagram versus Reality' post - New Idea", "description": "The Duchess of Cambridge has shared her very first \"Instagram versus Reality\" picture and it is guaranteed to make you laugh out loud.", "url": "https://www.newidea.com.au/kate-middleton-just-shared-her-first-instagram-versus-reality-post", "urlToImage": null, "publishedAt": "2020-04-24T09:09:00Z", "content": "\"Instagram Vs Reality,\" they cheekily captioned the two photos of little Louis.\r\n\"Thank you for your lovely messages on Prince Louiss second birthday . We are very pleased to share today, on Prince Louis second birthday, new photographs taken by The Duchess t… [+1156 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Wenlei Ma", "title": "Defending Jacob TV review: Chris Evans’ splashy new Apple TV+ series - NEWS.com.au", "description": "Chris Evans leads splashy Apple TV series, Defending Jacob", "url": "https://www.news.com.au/entertainment/tv/tv-shows/chris-evans-leads-splashy-apple-tv-series-defending-jacob/news-story/8a1090ed6067bcb3337ebc5c6a2e375b", "urlToImage": null, "publishedAt": "2020-04-24T08:19:44Z", "content": "From the outside, the Barbers seem like a blessed family.Dad Andy is a successful prosecutor, mum Laurie works with traumatised kids and son Jacob, 14, attends the local middle school in an upper-middle class Boston community where we’re told every second par… [+3627 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Besha Rodell", "title": "Watching America in Horror From a Curve-Flattened Australia - The New York Times", "description": "There’s an extreme emotional dissonance in feelings of gratitude for Australia’s relative safety, when so many people I know and love are in the United States where things seem out of control.", "url": "https://www.nytimes.com/2020/04/24/world/australia/coronavirus-united-states.html", "urlToImage": null, "publishedAt": "2020-04-24T07:54:37Z", "content": "Meanwhile, in Australia, our extreme social distancing and lockdown measures appear to be working. This week, Damien Cave reports on Australia and New Zealands rapid suppression of the coronavirus outbreak, with only a handful of new cases reported each day:\r… [+736 chars]"}, {"source": {"id": null, "name": "Perthnow.com.au"}, "author": "Bang Showbiz", "title": "Tom Hanks gifts Corona-branded typewriter to bullied Australian boy named Corona - PerthNow", "description": "The actor sent a heartwarming letter and gift to a young Australian boy named Corona after he revealed he had been bullied over his moniker.", "url": "https://www.perthnow.com.au/entertainment/celebrity-gossip/tom-hanks-gifts-corona-branded-typewriter-to-bullied-australian-boy-named-corona-ng-b881529498z", "urlToImage": null, "publishedAt": "2020-04-24T07:38:48Z", "content": "Tom Hanks has sent a typewriter to a young Australian boy named Corona after he revealed he had been bullied over his moniker.\r\nThe Castaway actor wrote a kind note to eight-year-old Corona De Vries after the young Australian sent him a letter when he and wif… [+1519 chars]"}, {"source": {"id": null, "name": "Who.com.au"}, "author": null, "title": "Kerri-Anne Kennerley caught out in cringeworthy on-air outburst - Who", "description": "Kerri-Anne Kennerley has revealed she once suffered a very embarrassing on-air gaffe early on in her career.", "url": "https://www.who.com.au/kerri-anne-kennerley-caught-out-in-cringeworthy-on-air-outburst", "urlToImage": null, "publishedAt": "2020-04-24T07:36:00Z", "content": "It was a commercial break and my panel operator asked me a question about something that was written in the previous day's newspaper, Kerri-Anne said.\r\nI explained how unhappy and unsatisfied with the journalist and probably gave her a bit of a critique that … [+334 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Carina Stathis For Daily Mail Australia", "title": "The Iconic launches massive HALF-PRICE flash sale on top fashion buys - Daily Mail", "description": "Popular Australian online fashion retailer The Iconic is having a flash sale from 12 to 2pm today. The exclusive sale will slash original prices and offer 50 per cent off a selective range of items.", "url": "https://www.dailymail.co.uk/femail/article-8251683/The-Iconic-launches-massive-HALF-PRICE-flash-sale-fashion-buys.html", "urlToImage": null, "publishedAt": "2020-04-24T06:54:15Z", "content": "Online fashion retailer The Iconic is set to launch an exclusive flash sale across Australia with prices on selected clothing items reduced by 50 per cent.\r\nCustomers will have to get in quick because the sale will only last for two hours once it launches at … [+1871 chars]"}, {"source": {"id": null, "name": "Newidea.com.au"}, "author": null, "title": "Kyle Sandilands finally admits why his marriage REALLY ended - New Idea", "description": "Shock jock Kyle Sandilands has spoken out about why his relationships never seem to last.", "url": "https://www.newidea.com.au/kyle-sandilands-finally-admits-why-his-marriage-really-ended", "urlToImage": null, "publishedAt": "2020-04-24T06:52:00Z", "content": "The 48-year-old spilt from his girlfriend Imogen Anthony last year, a decade after his marriage to Tamara Jaber ended in divorce. \r\nOn Thursday's Kyle and Jackie 'O' Show, the host deliberated over what he's done wrong in the past, saying he's been guilty of … [+565 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/paul-donoughue/6306596", "title": "Parks and Recreation is coming back for a one-off coronavirus episode. Here's what you need to know - ABC Technology and Games", "description": "Beloved US sitcom Parks and Recreation is coming back for a coronavirus-related special.", "url": "https://www.abc.net.au/news/2020-04-24/parks-and-recreation-is-coming-back-for-a-coroanvirus-special/12181048", "urlToImage": null, "publishedAt": "2020-04-24T06:02:49Z", "content": "Updated \r\nApril 24, 2020 16:33:56\r\nYour favourite troupe of dysfunctional local bureaucrats is back.\r\nThe original cast members of beloved US sitcom Parks and Recreation, including Amy Poehler, Rashida Jones, Chris Pratt and Aziz Ansari, will reprise their ro… [+2437 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nHarry Mount", "title": "How the Queen comes into her own during a crisis - Telegraph.co.uk", "description": "Why do we turn to the Queen during crises – and how does she know instinctively what to say? In the week she turns 94, Harry Mount reports", "url": "https://www.telegraph.co.uk/royal-family/0/queen-comes-crisis/", "urlToImage": null, "publishedAt": "2020-04-24T06:00:00Z", "content": "After thanking NHS workers, she turned to the majority of us, trapped at home, and subtly backed the Governments message that we should stay there. By thanking us for staying at home unlike the Governments irritating Americanism, asking us to stay home she ev… [+2382 chars]"}, {"source": {"id": null, "name": "Perthnow.com.au"}, "author": "PerthNow", "title": "Natalie Barr and Samantha Armytage stage ‘walk off’ on Sunrise after David Koch’s ‘disgusting’ joke - PerthNow", "description": "Natalie Barr and Samantha Armytage staged a walk off after David Koch’s rude joke.", "url": "https://www.perthnow.com.au/entertainment/tv/natalie-barr-and-samantha-armytage-stage-walk-off-on-sunrise-after-david-kochs-disgusting-joke-ng-b881529199z", "urlToImage": null, "publishedAt": "2020-04-24T05:14:55Z", "content": "Sunrise presenter David Koch caused his co-hosts to walk out on him in hysterics after a rude joke on live TV this morning.\r\nThe outgoing presenter shocked his fellow presenters during a discussion with his colleagues Natalie Barr and Samantha Armytage about … [+767 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Hannah-Rose Yee", "title": "Coronavirus horoscopes: How you should spend your time in isolation based on your star sign - NEWS.com.au", "description": "Coronavirus horoscopes: How you should be spending your time in isolation based solely on your star sign", "url": "https://www.news.com.au/lifestyle/health/mind/coronavirus-horoscopes-how-you-should-be-spending-your-time-in-isolation-based-solely-on-your-star-sign/news-story/6686563f69ca5aa1a758e8cf0b076dcb", "urlToImage": null, "publishedAt": "2020-04-24T05:09:47Z", "content": "With Prime Minister Scott Morrison hinting that coronavirus-related lockdown could last for up to six months, its time to start looking for hobbies you can indulge in while at home. No more trips to the gym, no more wild swimming jaunts, no more movie maratho… [+10383 chars]"}, {"source": {"id": null, "name": "Dailytelegraph.com.au"}, "author": null, "title": "Neighbours, Home And Away: Extreme measures to return amid COVID-19 - Daily Telegraph", "description": "Subscribe to The Daily Telegraph to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.dailytelegraph.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-24T05:00:00Z", "content": null}, {"source": {"id": null, "name": "Nine.com.au"}, "author": "Variety Staff", "title": "Taylor Swift slams 'unapproved' live album as 'tasteless' cash grab - 9Honey", "description": "", "url": "https://celebrity.nine.com.au/music/taylor-swift-slams-unapproved-live-album-as-tasteless-cash-grab/bdf464b6-8b5d-4c48-ad65-6b003147ebf2", "urlToImage": null, "publishedAt": "2020-04-24T04:46:00Z", "content": "LOS ANGELES (Variety.com) Taylor Swift was not pleased when fans began alerting her Thursday to the impending release of a live album from her early days as a recording artist, taking to social media to slam Big Machine for being \"tasteless\" and showing \"sham… [+3785 chars]"}, {"source": {"id": null, "name": "Nine.com.au"}, "author": "Christine Estera", "title": "Crazy Rich Asian star Henry Golding's dog reportedly mauls another pooch at a park - 9Honey", "description": "", "url": "https://celebrity.nine.com.au/latest/crazy-rich-asian-star-henry-golding-dog-reportedly-mauls-another-pooch/f74d9777-a1ac-495f-ab5a-9f5f617004b1", "urlToImage": null, "publishedAt": "2020-04-24T03:49:00Z", "content": "The dog of Crazy Rich Asians star Henry Golding has reportedly mauled another pup in a Los Angeles park.\r\nAccording to TMZ, the actor was walking his newly fostered dog, a pit bull named Stella, when she allegedly attacked a smaller pooch at LA's Pan Pacific … [+1275 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Kerry Sackville", "title": "Coronavirus Australia: How to get rid of wrinkles in isolation - NEWS.com.au", "description": "Coronavirus Australia: How to get rid of wrinkles in isolation", "url": "https://www.news.com.au/lifestyle/beauty/face-body/coronavirus-australia-how-to-get-rid-of-wrinkles-in-isolation/news-story/27d9ea50d83aba51394536e5cb10bf82", "urlToImage": null, "publishedAt": "2020-04-24T03:24:36Z", "content": "How can we ward off wrinkles in isolation? It’s the big question on all of our (pursed, crinkled) lips. So many women (and some pioneering men) are missing out on their regular Botox during the pandemic. How can we keep our faces intact until the cosmetic sur… [+3943 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Nate Day", "title": "Chris Hemsworth ‘failing miserably’ in lockdown - NEWS.com.au", "description": "Chris Hemsworth ‘failing miserably’ in lockdown", "url": "https://www.news.com.au/entertainment/celebrity-life/chris-hemsworth-failing-miserably-in-lockdown/news-story/6ff121048764d9b6d558e44540f0bc29", "urlToImage": null, "publishedAt": "2020-04-24T02:34:29Z", "content": "Like many parents around the globe, Chris Hemsworth is struggling to teach his children at home during the coronavirus outbreak.Hemsworth, 36, recently spoke to Jimmy Kimmel over video chat and opened up about his experience homeschooling his little ones: Ind… [+1934 chars]"}, {"source": {"id": null, "name": "Nine.com.au"}, "author": "9Honey Celebrity with CNN", "title": "Tom Selleck gives a rare interview on fame, family and why he quit Magnum P.I. - 9Celebrity", "description": "", "url": "https://celebrity.nine.com.au/tv/tom-selleck-gives-rare-interview-on-fame-family-and-why-he-quit-magnum-pi/badffc81-3835-46ee-ace3-e31eacfc2d69", "urlToImage": null, "publishedAt": "2020-04-24T01:45:00Z", "content": "(CNN) Tom Selleck was one of the hottest stars of the 1980s when he suddenly quit his hit show, Magnum P.I.\r\nThe fame got to be a bit much, he recalled recently.\r\n\"I quit Magnum, not because I didn't like it or I was tired of it,\" Selleck told People magazine… [+1947 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Luke Plunkett", "title": "Millions Of People Just Watched A Crazy Travis Scott Show In Fortnite - Kotaku Australia", "description": "Rapper Travis Scott just made an appearance for the first of five shows he’ll be starring in for Fortnite, and if you’re a fan of either of those things—like the millions of people who tuned in to watch—it was one hell of a thing....", "url": "https://www.kotaku.com.au/2020/04/millions-of-people-just-watched-a-crazy-travis-scott-show-in-fortnite/", "urlToImage": null, "publishedAt": "2020-04-24T01:00:00Z", "content": "Rapper Travis Scott just made an appearance for the first of five shows hell be starring in for Fortnite, and if youre a fan of either of those thingslike the millions of people who tuned in to watchit was one hell of a thing.\r\nWhile only running for around t… [+664 chars]"}, {"source": {"id": null, "name": "Newidea.com.au"}, "author": null, "title": "Aussie star Jane Kennedy suffers shocking head injury - New Idea", "description": "Radio host Jane Kennedy has been hospitalised after a serious accident where she fell from a tree and hit her head on the concrete.", "url": "https://www.newidea.com.au/jane-kennedy-suffers-shocking-head-injury", "urlToImage": null, "publishedAt": "2020-04-24T00:26:00Z", "content": "Jane fell and woke in hospital with amnesia.\r\nJane said she is now home but that she was hospitalised after the fall and now has to wear a neck brace so her head and back injuries recover.\r\nShe explained she was trying to put a night-vision camera in the tree… [+816 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "7NEWS", "title": "The Italian model who keeps testing positive to coronavirus, two months after diagnosis - 7NEWS.com.au", "description": "‘We are studying her case carefully.’", "url": "https://7news.com.au/lifestyle/health-wellbeing/the-italian-model-who-keeps-testing-positive-to-coronavirus-two-months-after-diagnosis-c-996498", "urlToImage": null, "publishedAt": "2020-04-24T00:12:23Z", "content": "This 23-year-old Italian model, one of the first people in her region to be diagnosed with coronavirus, is still positive for the virus - 55 days on.\r\nBianca Dobroiu was hospitalised in the SantOrsola hospital in the city of Bologna in northern Italy on Febru… [+1502 chars]"}, {"source": {"id": null, "name": "Who.com.au"}, "author": null, "title": "MasterChef scandal thickens over missing contestant Ben Ungermann - Who", "description": "Mystery continues to surround the strange and sudden departure of popular contestant, Ben Ungermann from the MasterChef competition.", "url": "https://www.who.com.au/masterchef-scandal-thickens-over-missing-contestant-ben", "urlToImage": null, "publishedAt": "2020-04-24T00:12:00Z", "content": "Confidential reports that Ungermann left the competition about three months ago, when production had only just started.\r\nAt that time, contestants were only told that he had left for personal reasons.\r\nThe publication further states that Ungermann does not ha… [+510 chars]"}, {"source": {"id": null, "name": "Perthnow.com.au"}, "author": "Reuters", "title": "Royals Prince William, Catherine, Charles and Camilla lead ‘Clap for Carers’ tribute to NHS health workers - PerthNow", "description": "The royals have taken part in a heartwarming doorstep tribute to Britain’s health workers.", "url": "https://www.perthnow.com.au/news/royal-family/royals-prince-william-catherine-charles-and-camilla-lead-clap-for-carers-tribute-to-nhs-health-workers-ng-b881528723z", "urlToImage": null, "publishedAt": "2020-04-23T23:22:10Z", "content": "The royals have taken part in a heartwarming doorstep tribute to Britains health workers.\r\nPrince William, Catherine, Duchess of Sussex and their children Prince George, Princess Charlotte and Prince Louis, stood outside their front doors to Clap for Carers f… [+2045 chars]"}, {"source": {"id": null, "name": "Thenewdaily.com.au"}, "author": "https://www.facebook.com/TheNewDaily", "title": "Prince William shows off his comedy talents in skit with Stephen Fry - The New Daily", "description": "Prince William has made his comedy debut, appearing in a TV sketch poking fun at himself for a BBC coronavirus fund-raiser.", "url": "https://thenewdaily.com.au/entertainment/celebrity/2020/04/24/prince-william-stephen-fry/", "urlToImage": null, "publishedAt": "2020-04-23T23:14:30Z", "content": "Prince William has made his comedy debut, appearing in a sketch poking fun at himself for a BBC coronavirus fund-raiser.\r\nThe Duke of Cambridge joked about home-schooling, being German and appropriate clothing for Zoom calls in a Blackadder-themed sketch with… [+2675 chars]"}, {"source": {"id": null, "name": "Pedestrian.tv"}, "author": "Matt Galea", "title": "Ellen Pompeo Apologises For Resurfaced Video Where She Appears To Blame Weinstein's Victims - Pedestrian TV", "description": "Pompeo issued an apology on Twitter.", "url": "http://www.pedestrian.tv/entertainment/ellen-pompeo-harvey-weinstein-comments/", "urlToImage": null, "publishedAt": "2020-04-23T23:13:16Z", "content": "Ellen Pompeo has come under fire for resurfaced remarks she made in a July 2018 interview about Harvey Weinsteins victims.\r\nIn a one-minute clip that was cut from an hour-long Oxford Union Q&amp;A, the actress star said, I think we bear some responsibility, n… [+4299 chars]"}, {"source": {"id": null, "name": "Perthnow.com.au"}, "author": "AP", "title": "Coronavirus crisis: Rolling Stones release Living in a Ghost Town, a song that ’resonates’ these days - PerthNow", "description": "Mick Jagger said the song was one they were working on long before the global lockdown and the band decided to revisit it in isolation.", "url": "https://www.perthnow.com.au/news/coronavirus/coronavirus-crisis-rolling-stones-release-living-in-a-ghost-town-a-song-that-resonates-these-days-ng-b881528720z", "urlToImage": null, "publishedAt": "2020-04-23T22:21:42Z", "content": "The Rolling Stones have unveiled a new song the band thinks is perfect for these coronavirus times.\r\nThe legendary band released the four-minute slow-burning bluesy and harmonica-driven Living in a Ghost Town on Thursday.\r\nIm a ghost/Living in a ghost town/Yo… [+811 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Teresa Roca", "title": "Courtney Stodden says Peter Nygard is a ‘monster’: Her shocking claims - NEWS.com.au", "description": "Courtney Stodden goes public with shocking claims against billionaire ‘monster’", "url": "https://www.news.com.au/entertainment/celebrity-life/courtney-stodden-goes-public-with-shocking-claims-against-billionaire-monster/news-story/465429762c0f759940705fce16139918", "urlToImage": null, "publishedAt": "2020-04-23T22:19:35Z", "content": "MODEL Courtney Stodden claimed billionaire Peter Nygard tried to lure her to his private island when she was just 19 years old after he allegedly sexually assaulted her at an event.In an excerpt from Predator King: Peter Nygard’s Dark Life of Rape, Drugs, and… [+3179 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": null, "title": "MasterChef 2020: Fans stunned to learn Poh's real age - NEWS.com.au", "description": "Fact about MasterChef star Poh that will shock you", "url": "https://www.news.com.au/entertainment/tv/reality-tv/fact-about-masterchef-star-poh-that-will-shock-you/news-story/4c735a73c379371cbda2aaaa6e704a60", "urlToImage": null, "publishedAt": "2020-04-23T22:10:14Z", "content": "She first appeared on MasterChef in its debut season in 2009.And fans have pointed out Poh Ling Yeow has somehow managed to defy the ageing process over the last decade, as many say they were surprised to learn her real age.\r\nThe cook, who is currently appear… [+1185 chars]"}, {"source": {"id": null, "name": "Pedestrian.tv"}, "author": "Matt Galea", "title": "We Now Know Which 'Too Hot To Handle' Couples Are Still Together In The Real World - Pedestrian TV", "description": "We love to see it.", "url": "http://www.pedestrian.tv/entertainment/too-hot-to-handle-couples-still-together/", "urlToImage": null, "publishedAt": "2020-04-23T22:07:30Z", "content": "Too Hot To Handle might have only dropped on Netflix last Friday, but it was actually filmed a whole year ago way back in April 2019.\r\nAnd while a lot of folks on the show broke the rules and got lucky, only two real couples emerged: Harry Jowsey and Francesc… [+1113 chars]"}, {"source": {"id": null, "name": "Tvblackbox.com.au"}, "author": "Robert McKnight", "title": "EXCLUSIVE | CELEBRITY GOGGLEBOX is coming soon - TV Blackbox", "description": "TV Blackbox can exclusively reveal Foxtel are launching a celebrity version of the TV favourite", "url": "https://tvblackbox.com.au/page/2020/04/24/exclusive-celebrity-gogglebox-is-coming-soon/", "urlToImage": null, "publishedAt": "2020-04-23T21:28:05Z", "content": "TV Blackbox can exclusively reveal plans are in place for Celebrity Gogglebox to hit our screens in September. Initial plans by Foxtel for the spin-off series were thrown into chaos due to the Coronavirus but producers are forging ahead with plans in place to… [+1111 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Yasmin Boland", "title": "Pisces Daily Horoscope – April 24 2020 - Yahoo Lifestyle Australia", "description": "How YOU doing? How is lockdown treating you? I did a New Moon ceremony here – tune in while we are still in the New Moon phase for a day or so longer. Your stars today… One of the worst things about the pandemic lockdown is the fact that some people are doing…", "url": "https://au.lifestyle.yahoo.com/pisces-daily-horoscope-april-24-190022956.html", "urlToImage": null, "publishedAt": "2020-04-23T19:00:00Z", "content": "How YOU doing?\r\nHow is lockdown treating you? I did a New Moon ceremony here tune in while we are still in the New Moon phase for a day or so longer.\r\nYour stars today\r\nOne of the worst things about the pandemic lockdown is the fact that some people are doing… [+582 chars]"}, {"source": {"id": null, "name": "Darkhorizons.com"}, "author": null, "title": "\"Mandalorian\" Doco Series Trailer & Yoda Talk - Dark Horizons", "description": "With the second season of “The Mandalorian” not hitting until this Fall, the Disney+ streaming service recently announced the eight-episode documentary series “Disney Gallery: The Mandalorian” which offers a behind the scenes glimpse at the making of the show…", "url": "https://www.darkhorizons.com/mandalorian-doco-series-trailer-yoda-talk/", "urlToImage": null, "publishedAt": "2020-04-23T15:11:31Z", "content": "With the second season of “The Mandalorian” not hitting until this Fall, the Disney+ streaming service recently announced the eight-episode documentary series “Disney Gallery: The Mandalorian” which offers a behind the scenes glimpse at the making of the show… [+979 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Alisha Buaya For Daily Mail Australia", "title": "MasterChef Australia's top contestants share their take on the classic Anzac biscuit - Daily Mail", "description": "MasterChef Australia's top chefs have shared  their unique takes on the classic Australian sweet treat - the Anzac biscuit - in the lead up to the national day of remembrance.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8248185/MasterChef-Australias-contestants-share-classic-Anzac-biscuit.html", "urlToImage": null, "publishedAt": "2020-04-23T11:48:07Z", "content": "MasterChef Australia's top chefs have shared their unique takes on the classic Australian sweet treat - the Anzac biscuit - in the lead up to the national day of remembrance.\r\nTV chef and cookbook author Justine Schofield, 34, shared a photo of her take on th… [+2625 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Brian Ashcraft", "title": "And Now, Pokémon Themed Lingerie - Kotaku Australia", "description": "Peach John, the lingerie brand which previously released Sailor Moon and One Piece themed underwear, will be selling Pocket Monster lingerie starting next month in Japan....", "url": "https://www.kotaku.com.au/2020/04/and-now-pokmon-themed-lingerie/", "urlToImage": null, "publishedAt": "2020-04-23T10:30:00Z", "content": "Peach John, the lingerie brand which previously released Sailor Moon and One Piece themed underwear, will be selling Pocket Monster lingerie starting next month in Japan.\r\nAs noted on IT Media, the Pokémon Girls line features iconic characters like Eevee and … [+133 chars]"}, {"source": {"id": null, "name": "Heraldsun.com.au"}, "author": null, "title": "Radio host Jane Kennedy loses her memory after a fall - Herald Sun", "description": "Subscribe to the Herald Sun to get unrestricted digital access, home paper delivery, Foxsports.com.au subscription,  Apps for iPad and Android and much more...", "url": "https://www.heraldsun.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-23T09:58:00Z", "content": null}, {"source": {"id": null, "name": "Perthnow.com.au"}, "author": "PerthNow", "title": "The full list of Netflix’s May releases - PerthNow", "description": "Netflix has revealed its May line up of binge-worthy releases with a glitzy Hollywood drama, its biggest comedy series of the year and new seasons of some of its most popular shows.", "url": "https://www.perthnow.com.au/entertainment/tv/the-full-list-of-netflixs-may-releases-ng-b881528351z", "urlToImage": null, "publishedAt": "2020-04-23T09:01:21Z", "content": "Netflix has revealed its May line up of binge-worthy releases with a glitzy Hollywood drama, its biggest comedy series of the year and new seasons of some of its most popular shows.\r\nWith plenty of new subscribers signing up during the coronavirus pandemic, t… [+3349 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Chloe-lee Longhetti For Daily Mail Australia", "title": "MAFS' Sam Ball hits back at critics after copping backlash for his dramatic transformation - Daily Mail", "description": "He's copped plenty of backlash from fans online due to his changing looks and dramatic transformation.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8248163/MAFS-Sam-Ball-hits-critics-copping-backlash-dramatic-transformation.html", "urlToImage": null, "publishedAt": "2020-04-23T08:20:17Z", "content": "He's copped plenty of backlash from fans online due to his changing looks and dramatic transformation. \r\nAnd now Married At First Sight star Sam Ball has hit back. \r\nThe buff 27-year-old told Daily Mail Australia on Thursday that he's simply trying to be 'the… [+3283 chars]"}, {"source": {"id": null, "name": "Heraldsun.com.au"}, "author": null, "title": "Tiffani Wood plans Bardot as a three piece as Sophie Monk blocks former bandmates on Instagram - Herald Sun", "description": "Subscribe to the Herald Sun to get unrestricted digital access, home paper delivery, Foxsports.com.au subscription,  Apps for iPad and Android and much more...", "url": "https://www.heraldsun.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-23T07:49:00Z", "content": null}, {"source": {"id": null, "name": "7news.com.au"}, "author": "Lucy Quaggin", "title": "Australian model, Elyse Knowles, calls COVID-19 ‘a gift’ to the elements of our earth - 7NEWS.com.au", "description": "The post has been dubbed insensitive, considering the scale of the loss of life and devastating impact on the economy.", "url": "https://7news.com.au/entertainment/celebrity/australian-model-elyse-knowles-calls-covid-19-a-gift-to-the-elements-of-our-earth-c-994315", "urlToImage": null, "publishedAt": "2020-04-23T07:41:00Z", "content": "Aussie model Elyse Knowles has called coronavirus a gift to the elements of our earth on her Instagram.\r\nIn the post for Earth Day, the model refers to the positive impact worldwide coronavirus lockdowns have had on the environment.\r\nWhile Knowles did acknowl… [+1895 chars]"}, {"source": {"id": null, "name": "Mamamia.com.au"}, "author": "Mamamia Celebrity", "title": "The Spill: Thursday's best entertainment and gossip news. - Mamamia", "description": "MAFS KC and Michael sex life: Married At First Sight contestants Michael Goonan and KC Osborne just got very open about their sex life on the radio.", "url": "https://www.mamamia.com.au/mafs-kc-and-michael-sex-life/", "urlToImage": null, "publishedAt": "2020-04-23T07:35:35Z", "content": "1. “He was like a dog with a bone.” MAFS’ KC and Michael have shared details of their sex life and wow.\r\nWhether they’re flying around in private jets or addressing rumours on Instagram, Married At First Sight contestants, Michael and KC, certainly haven’t be… [+1640 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Wenlei Ma", "title": "What to stream this week: Outer Banks, The Last Dance, Community and more - NEWS.com.au", "description": "What to stream this week: Das Boot, Community, Outer Banks and more", "url": "https://www.news.com.au/entertainment/tv/tv-shows/what-to-stream-this-week-das-boot-community-outer-banks-and-more/news-story/9ae8186251306f08eb7569836503abbb", "urlToImage": null, "publishedAt": "2020-04-23T07:08:38Z", "content": "From a winning kid’s animation to share with the family to the self-referential comedy of a TV powerhouse producer, there’s no shortage of series to watch.\r\nSo what are you in the mood for?\r\nSOMETHING NEW\r\nThe Last Dance: For sports fans jonesing for a fix, T… [+5735 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Julius Young", "title": "Top Gun star Val Kilmer reveals on-set rivalry with Tom Cruise - NEWS.com.au", "description": "Top Gun star Val Kilmer reveals on-set rivalry with Tom Cruise", "url": "https://www.news.com.au/entertainment/movies/top-gun-star-val-kilmer-reveals-onset-rivalry-with-tom-cruise/news-story/e72e7238e626a964ad374a3770ef3dcf", "urlToImage": null, "publishedAt": "2020-04-23T06:38:52Z", "content": "The latest trailer for 'Top Gun: Maverick'.\r\nVal Kilmer has revealed some epic insight into the cast dynamic on the set of the 1986 action blockbuster Top Gun.The Kiss Kiss Bang Bang star explained a faction-type dichotomy where he was the leader of the party… [+3971 chars]"}, {"source": {"id": null, "name": "Theage.com.au"}, "author": "Bianca Hall", "title": "Musicians and crews get a lifeline after music festival cancelled - The Age", "description": "It's a rare thing in the arts community to get good news at the moment, so when she opened her emails musican Emily Ulman burst into tears.", "url": "https://www.theage.com.au/national/victoria/musicians-and-crews-get-a-lifeline-after-music-festival-cancelled-20200423-p54mhw.html", "urlToImage": null, "publishedAt": "2020-04-23T06:14:32Z", "content": "It's a rare thing in the arts community to get good news at the moment, so when she opened her emails, musician Emily Ulman burst into tears.\r\nThe Brunswick Music Festival Australia's longest-running inner-city music festival was abruptly cancelled in March, … [+826 chars]"}, {"source": {"id": null, "name": "Hit.com.au"}, "author": "The Hit Network Team", "title": "No One Can Believe Poh From Masterchef's Age - Hit 107", "description": "WHAT?!", "url": "https://www.hit.com.au/story/no-one-can-believe-poh-from-masterchef-s-age-1-153831", "urlToImage": null, "publishedAt": "2020-04-23T05:10:16Z", "content": "In some news that's made me shake my fists at the sun, blaming it for my fast-ageing face, Masterchef star Poh's actual age has been revealed. \r\nAs someone in their 20's who definitely looks older than Poh, I can't let this go!\r\nFULL STORY HERE: \r\nDownload th… [+90 chars]"}]}