{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Nine.com.au"}, "author": "Rachael Gavin", "title": "Music From the Home Front concert opens with fitting tributes and iconic songs - Nine", "description": "Ben Lee and Jimmy Barnes perform", "url": "https://www.nine.com.au/entertainment/latest/music-from-the-home-front-ben-lee-jimmy-barnes/499adb3a-d09e-4752-8efe-8228e7350f8a", "urlToImage": null, "publishedAt": "2020-04-25T10:57:37Z", "content": "Music From The Home Front has paid tribute on Anzac Day to both those Aussies who have served and died in wars and conflicts, while also thanking workers on the frontline of the COVID-19 pandemic.\r\nThe show opened with three meaningful performances, each perf… [+1789 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Hannah Paine", "title": "Coronavirus: Disney World facing tough recovery because of COVID-19 - NEWS.com.au", "description": "Coronavirus: Disney World facing tough recovery because of COVID-19", "url": "https://www.news.com.au/finance/economy/coronavirus-disney-world-facing-tough-recovery-because-of-covid19/news-story/f9fab61605471808eca9b2c6e6309d99", "urlToImage": null, "publishedAt": "2020-04-25T09:26:08Z", "content": "It might be known as the happiest place on earth but Disney World is tipped to suffer a world of financial hurt thanks to coronavirus. All of Disney's theme parks have been shut since March until further notice due to the coronavirus pandemic, with prediction… [+2458 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Yahoo News Staff", "title": "Lord of the Rings actor dies aged 89 - Yahoo News Australia", "description": "The actor died in his Auckland home surrounded by family.", "url": "https://au.news.yahoo.com/lord-of-the-rings-actor-dies-aged-89-083423867.html", "urlToImage": null, "publishedAt": "2020-04-25T08:34:00Z", "content": "New Zealand actor Bruce Allpress, who featured in Lord of the Rings, has died aged 89.\r\nIn a statement obtained by the New Zealand Herald, Allpresss family said he died in his Auckland home surrounded by loved ones on Thursday.\r\nHis son Michael told the paper… [+628 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Oliver Harvey", "title": "Coronavirus: Prince William is lifting Britain’s spirits during lockdown - NEWS.com.au", "description": "Coronavirus: Prince William is lifting Britain’s spirits during lockdown", "url": "https://www.news.com.au/entertainment/celebrity-life/royals/coronavirus-prince-william-is-lifting-britains-spirits-during-lockdown/news-story/4a84968209de83390eacd01faa586cd4", "urlToImage": null, "publishedAt": "2020-04-25T07:55:17Z", "content": "Like monarchs down a long line of history, Prince William has proved himself strongest as his country faces its darkest hours.\r\nGrabbing the baton for the royal family, William, wife Kate, and their joyful young family have led by example, with their knack of… [+2564 chars]"}, {"source": {"id": null, "name": "Perthnow.com.au"}, "author": "PerthNow", "title": "Hugh Jackman and Deborra-Lee Furness support Telethon and Seven West Media’s #dancingtogether isolation challenge - PerthNow", "description": "One of Hollywood’s biggest stars, and an unlikely new Perth celebrity have come out to support Telethon and Seven West Media’s #dancingtogether challenge.", "url": "https://www.perthnow.com.au/entertainment/celebrity/hugh-jackman-and-deborra-lee-furness-support-telethon-and-seven-west-medias-dancingtogether-isolation-challenge-ng-b881530031z", "urlToImage": null, "publishedAt": "2020-04-25T07:20:47Z", "content": "One of Hollywoods biggest stars, and an unlikely new Perth celebrity have come out to support Telethon and Seven West Medias #dancingtogether challenge.\r\nA-lister Hugh Jackman, who is no slouch in the dance department, has urged West Australians to keep danci… [+1971 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Bella Fowler", "title": "Triple M’s Jane Kennedy explains radio absence after frightening fall - NEWS.com.au", "description": "Triple M’s Jane Kennedy explains radio absence after frightening fall", "url": "https://www.news.com.au/entertainment/tv/radio/triple-ms-jane-kennedy-explains-radio-absence-after-frightening-fall/news-story/17d5ad0d5b1c37202bb34d8fcb420752", "urlToImage": null, "publishedAt": "2020-04-25T04:56:45Z", "content": "Triple Ms Jane Kennedy has explained her absence from Kennedy-Molloy, the drive time show she hosts alongside Mick Molloy this week, revealing she had been in hospital following a nasty fall.Kennedy described waking up in Melbourne’s The Alfred hospital with … [+2024 chars]"}, {"source": {"id": null, "name": "Perthnow.com.au"}, "author": "PerthNow", "title": "Australian celebrities Hugh Jackman, Russell Crowe, Kylie Minogue and Andy Lee pay tribute on Anzac day - PerthNow", "description": "As people across the country stood in their driveways to commemorate the Anzacs, so too have Australian celebrities including Hugh Jackman, Russell Crowe, Kylie Minogue and Andy Lee.", "url": "https://www.perthnow.com.au/news/anzac/australian-celebrities-hugh-jackman-russell-crowe-kylie-minogue-and-andy-lee-pay-tribute-on-anzac-day-ng-b881529941z", "urlToImage": null, "publishedAt": "2020-04-25T04:47:14Z", "content": "As people across the country stood in their driveways to commemorate the Anzacs, so too have Australian celebrities including Hugh Jackman, Russell Crowe, Kylie Minogue and Andy Lee.\r\nPresenter and comedian Andy Lee shared a video of himself on Twitter playin… [+963 chars]"}, {"source": {"id": null, "name": "Hollywoodreporter.com"}, "author": "Sharareh Drury", "title": "Jeff Goldblum Faces Social Media Backlash Over Islam Comments on 'RuPaul's Drag Race' - Hollywood Reporter", "description": "\"Is there something in this religion that is anti-homosexuality? And anti-woman?” the actor and special guest asked during Friday night's episode.", "url": "https://www.hollywoodreporter.com/news/jeff-goldblum-faces-social-media-backlash-islam-comments-rupauls-drag-race-1291882", "urlToImage": null, "publishedAt": "2020-04-25T03:49:21Z", "content": "Jeff Goldblum came under fire on social media for asking if Islam was \"anti-homosexuality\" and \"anti-woman\" during Friday night’s episode of RuPaul’s Drag Race.\r\nThe comments came after the seven remaining queens on the show, now in its 12th season, walked a … [+3523 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Jessamy Tredinnick Candice Jackson For Daily Mail Australia", "title": "Hamish Blake and Zoe share video of themselves as they celebrate a week of homeschooling being over - Daily Mail", "description": "They've been busy homeschooling their five-year-old son amid the coronavirus pandemic.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8255613/Hamish-Blake-Zo-Foster-Blake-celebrate-week-homeschooling-over.html", "urlToImage": null, "publishedAt": "2020-04-25T03:44:15Z", "content": "They've been busy homeschooling their five-year-old son amid the coronavirus pandemic. \r\nAnd on Friday, Hamish Blake and his beauty guru wife Zoë Foster-Blake shared a hilarious video of themselves sipping cocktails and having a party at their home as they ce… [+2748 chars]"}, {"source": {"id": null, "name": "Foxsports.com.au"}, "author": null, "title": "Former Broncos star Daniel Vidot makes WWE Smackdown debut - Fox Sports", "description": "<b>Tune into our new show Fox League Live on Channel 502 Monday to Friday at 6.30pm and on Saturday at 3pm and Sunday at 5pm.</b>", "url": "https://www.foxsports.com.au/nrl/nrl-premiership/nrl-2020-daniel-vidot-wwe-smackdown-debut-brisbane-broncos-rugby-league/news-story/547c2c589f14894482608abf3ffee303", "urlToImage": null, "publishedAt": "2020-04-25T03:03:00Z", "content": "Former NRL player Daniel Vidot has taken his wrestling career to even greater heights making his WWE SmackDown debut during the coronavirus pandemic.\r\nVidot made the unlikely career switch after his rugby league life came to an end in 2017.\r\nWatch Foxtel in a… [+1615 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Barbara  Mcmahon Barbara Davies for the Daily Mail", "title": "Vogue editor Anna 'Nuclear' Wintour has fallen out with her right-hand man Andre Leon Talley... - Daily Mail", "description": "There was a time when Andre Leon Talley's friendship with Dame Anna Wintour was regarded as a match made in fashion heaven.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8255427/Vogue-editor-Anna-Nuclear-Wintour-fallen-right-hand-man-Andre-Leon-Talley.html", "urlToImage": null, "publishedAt": "2020-04-25T02:47:23Z", "content": "There was a time when Andre Leon Talley's friendship with Dame Anna Wintour was regarded as a match made in fashion heaven. She was the formidable British editor-in-chief of Vogue whose presence in the front row at catwalk shows left designers quaking in thei… [+15005 chars]"}, {"source": {"id": null, "name": "Ringsidenews.com"}, "author": "H Jenkins", "title": "Vince McMahon Appeared During Triple H Celebration To Say How Much It Sucked - Ringside News", "description": "Vince McMahon doesn't show up very often on his own programming. He made a very special appearance during the closing moments of WWE SmackDown this week.", "url": "https://www.ringsidenews.com/2020/04/24/vince-mcmahon-appeared-during-triple-h-celebration-to-say-how-much-it-sucked/", "urlToImage": null, "publishedAt": "2020-04-25T02:15:00Z", "content": "Vince McMahon doesn’t show up very often on his own programming. He made a very special appearance during the closing moments of WWE SmackDown this week.\r\nClick here for our complete coverage of WWE Friday Night SmackDown from this week.\r\nTriple H and Shawn M… [+952 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Kellie Chudzinski For Dailymail.com", "title": "Christina Applegate and Linda Cardellini try to cover up a murder in Dead to Me season 2 trailer - Daily Mail", "description": "Stars Christina Applegate and Linda Cardellini are returning to the small screen in their hit roles as Jen and Judy. The trailer for season two, released Friday, catches up with the unlikely friend.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8255621/Christina-Applegate-Linda-Cardellini-try-cover-murder-Dead-season-2-trailer.html", "urlToImage": null, "publishedAt": "2020-04-25T01:38:59Z", "content": "Hit Netflix series Dead To Me, left fans on the edge of their seats with its inaugural season, out last May. \r\nAnd now stars Christina Applegate and Linda Cardellini are returning to the small screen in their hit roles as Jen and Judy. \r\nThe trailer for seaso… [+6378 chars]"}, {"source": {"id": null, "name": "Thebrag.com"}, "author": "Zanda Wilson", "title": "Watch Post Malone shred Nirvana tribute set with Travis Barker - Tone Deaf", "description": "The Home Of Australian Music", "url": "https://tonedeaf.thebrag.com/post-malone-nirvana-tribute-travis-barker/", "urlToImage": null, "publishedAt": "2020-04-25T01:37:50Z", "content": "There’s no doubting Post Malone is one of the most talented musicians of our time, and he’s just proven that he could have made it as a grunge artist, with a killer Nirvana tribute set.\r\nPostie showed off his chops as a grunge singer and guitarist, nailing so… [+1595 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Stephen Gibbs for Daily Mail Australia", "title": "How the Kelly Gang shot dead three police at Stringybark Creek in Victoria Police's darkest day - Daily Mail", "description": "Ned Kelly is portrayed by some as an an Australian folk hero unjustly persecuted by police but to others he is best remembered as a cold-blooded cop killer.", "url": "https://www.dailymail.co.uk/news/article-8251717/How-Kelly-Gang-shot-dead-three-police-Stringybark-Creek-Victoria-Polices-darkest-day.html", "urlToImage": null, "publishedAt": "2020-04-25T01:10:48Z", "content": "Until the deaths of four police officers on a Melbourne freeway this week the worst day in the history of the Victorian force was more than 140 years ago.\r\nOn October 26, 1878 the Kelly Gang ruthlessly shot dead three policemen who had been hunting for them a… [+14253 chars]"}, {"source": {"id": null, "name": "Who.com.au"}, "author": null, "title": "Kylie Jenner goes makeup free in absolutely stunning new photo - Who", "description": "Kylie Jenner has shared a smoking hot makeup free selfie as she continues to self-isolate amid the coronavirus pandemic.", "url": "https://www.who.com.au/kylie-jenner-goes-makeup-free-in-absolutely-stunning-new-photo", "urlToImage": null, "publishedAt": "2020-04-25T01:06:00Z", "content": "Kylie Jenner has shared a smoking hot makeup free selfie.\r\nThe makeup mogul appeared bare faced on Instagram.\r\nThe photos come days after other pics of a makeup free Kylie made headlines.\r\nThe photos come days after images obtained by news.com.au, show Kylie … [+685 chars]"}, {"source": {"id": null, "name": "Couriermail.com.au"}, "author": "admin", "title": "Movie reviews: Chris Hemsworth’s Extraction and kids’ flick The Willoughbys - Jimmys Post", "description": "", "url": "https://www.couriermail.com.au/entertainment/movies/movie-reviews-chris-hemsworths-extraction-and-kids-flick-the-willoughbys/news-story/ceebdfbaf48d22882ccb9ad549e4cddc/", "urlToImage": null, "publishedAt": "2020-04-25T01:04:54Z", "content": "LOOKING for something new to watch this weekend? Check out Chris Hemsworths new thriller and sweet kids romp The Willoughbys. \r\nEXTRACTION\r\nTwo stars \r\nDirector: Sam Hargrave\r\nStarring: Chris Hemsworth, Rudhraskh Jaiswal, David Harbour\r\nRating: MA15+\r\nRunning… [+6876 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Hannah-Rose Yee", "title": "The best podcasts of 2020: 10 podcasts to get on your isolation playlist. - NEWS.com.au", "description": "The best podcasts of 2020: 10 podcasts you need on your isolation playlist", "url": "https://www.news.com.au/entertainment/books-magazines/books/the-best-podcasts-of-2020-10-podcasts-you-need-on-your-isolation-playlist/news-story/bbc100a18ef318f100f00e0333abc8ba", "urlToImage": null, "publishedAt": "2020-04-25T00:55:40Z", "content": "Are you a podcast fan? If you answered yes, then youre unlikely to be part of the 17 per cent drop in podcast listening during the pandemic, according to research.For those who have dropped off, podcasting was something listened to on the long and weary commu… [+8130 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Nick Bond", "title": "Bardot’s ex-manager David Caplice weighs in on girl group’s split - NEWS.com.au", "description": "Bardot’s ex-manager David Caplice weighs in on girl group’s split", "url": "https://www.news.com.au/entertainment/music/bardots-exmanager-david-caplice-weighs-in-on-girl-groups-split/news-story/e60eda099a001dc28e0ba155b65f0c6b", "urlToImage": null, "publishedAt": "2020-04-25T00:44:48Z", "content": "There are two sides to every story but when it comes to your average pop group, you can probably multiply that figure by a hundred.Australian girl group Bardot burned briefly but brightly, forming in 2000 out of hit reality series Popstars and breaking up aft… [+8625 chars]"}, {"source": {"id": null, "name": "Newidea.com.au"}, "author": "New Idea", "title": "Stunning claim made about Meghan Markle and her father in court - New Idea", "description": "A shock new claim has been made about the Duchess of Sussex and her estranged father Thomas Markle.", "url": "https://www.newidea.com.au/stunning-claim-made-about-meghan-markle-and-her-father-in-court", "urlToImage": null, "publishedAt": "2020-04-25T00:33:00Z", "content": "It has been claimed that Meghan Markle has not seen her father Thomas in two years.\r\nLawyers for the the royal husband and wife claim the letters publication was a misuse of private information and breached her copyright.\r\nThe publication of the letter is cla… [+1059 chars]"}, {"source": {"id": null, "name": "Newidea.com.au"}, "author": null, "title": "Princess Eugenie goes makeup free in stunning anniversary photo - New Idea", "description": "Princess Eugenie has shared a stunning makeup free photo as she celebrates her 10th anniversary with husband Jack Brooksbank.", "url": "https://www.newidea.com.au/princess-eugenie-goes-makeup-free-in-stunning-anniversary-photo", "urlToImage": null, "publishedAt": "2020-04-25T00:01:00Z", "content": "Eugenie is celebrating her 10th anniversary with husband, Jack Brooksbank.\r\nRoyal fans were quick to comment on the stunning photos of the happy couple.\r\n\"Happy 10th anniversary to you. Wonderful, it is a beautiful initiative,\" wrote one royal fan. \r\nAnother … [+1321 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Hannah Paine", "title": "Cooking hack: Man's 'life changing' vegetable peeler trick - NEWS.com.au", "description": "Cooking hack: Man's 'life changing' vegetable peeler trick", "url": "https://www.news.com.au/lifestyle/food/eat/cooking-hack-mans-life-changing-vegetable-peeler-trick/news-story/ec23fd352c7b66dd3890c9769fb8c67d", "urlToImage": null, "publishedAt": "2020-04-24T23:59:07Z", "content": "Peeling vegetables is easily one of the most time-consuming and, let's be honest, boring tasks when it comes to cooking. But it seems like most of us have been doing the everyday task wrong, with one man's game-changing trick showing how we can speed up veget… [+1519 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/hannah--reich/9151774", "title": "TikTok offers connection, comedy and creativity during coronavirus lockdown - ABC News", "description": "The social video sharing app once seemed just for teenagers but since social isolation started, more and more people are joining TikTok for connection, comedy and creativity.", "url": "https://www.abc.net.au/news/2020-04-25/turning-to-tiktok-during-coronavirus-lockdown/12176814", "urlToImage": null, "publishedAt": "2020-04-24T23:57:27Z", "content": "Posted \r\nApril 25, 2020 09:19:12\r\n\"If it wasn't for coronavirus, I wouldn't have downloaded it and the fact that I have makes me feel a little bit embarrassed,\" says Hannah Baker, a new TikTok devotee.\r\nThe 27-year-old judge's associate says one thing that go… [+7054 chars]"}, {"source": {"id": null, "name": "Darkhorizons.com"}, "author": null, "title": "Ness To Pen Guadagnino's \"Lord of the Flies\" - Dark Horizons", "description": "“Chaos Walking” and “A Monster Calls” author Patrick Ness has been set to pen the newest adaptation of William Golding’s iconic 1954 novel “Lord of the Flies” for Warner Bros. Pictures. The dark allegory tale follows a group of British boys stranded on a dese…", "url": "https://www.darkhorizons.com/ness-to-pen-guadagninos-lord-of-the-flies/", "urlToImage": null, "publishedAt": "2020-04-24T23:35:00Z", "content": "“Chaos Walking” and “A Monster Calls” author Patrick Ness has been set to pen the newest adaptation of William Golding’s iconic 1954 novel “Lord of the Flies” for Warner Bros. Pictures.\r\nThe dark allegory tale follows a group of British boys stranded on a des… [+534 chars]"}, {"source": {"id": null, "name": "Belfasttelegraph.co.uk"}, "author": "By Keiran Southern, PA Los Angeles Correspondent", "title": "Kanye West is officially a billionaire, according to Forbes magazine - Belfast Telegraph", "description": "Kanye West is officially a billionaire, according to Forbes magazine.", "url": "https://www.belfasttelegraph.co.uk/entertainment/music/news/kanye-west-is-officially-a-billionaire-according-to-forbes-magazine-39156219.html", "urlToImage": null, "publishedAt": "2020-04-24T23:07:00Z", "content": "Kanye West is officially a billionaire, according to Forbes magazine.\r\nThe outlet says the rapper and fashion designer, who has long coveted the status, provided an eye-catching glimpse into his personal finances and valued his net worth at $1.3 billion (£1.0… [+2159 chars]"}, {"source": {"id": null, "name": "Digitalspy.com"}, "author": "Justin Harp", "title": "Will & Grace bosses solve massive mystery about the final season - digitalspy.com", "description": "Who's the daddy?", "url": "https://www.digitalspy.com/tv/ustv/a32272405/will-and-grace-baby-daddy-mystery-solved/", "urlToImage": null, "publishedAt": "2020-04-24T23:04:00Z", "content": "Will &amp; Grace series finale spoilers follow.\r\nThe team behind Will &amp; Grace have answered one of the biggest lingering questions from the final season.\r\nThe acclaimed sitcom wrapped up its second run on NBC in the US on Thursday night (April 23) without… [+1785 chars]"}, {"source": {"id": null, "name": "Nine.com.au"}, "author": "Isabel Thomson Officer", "title": "Seinfeld and Star Trek actor Gene Dynarski dies at 86 - 9Celebrity", "description": "", "url": "https://celebrity.nine.com.au/latest/gene-dynarski-seinfeld-dies-86/8c5cd70c-f492-4cc4-881b-d72b8e9c14a6", "urlToImage": null, "publishedAt": "2020-04-24T22:54:00Z", "content": "Gene Dynarski, the actor who played Izzy Mandelbaum Jr the son of Lloyd Bridges on the hit sitcom Seinfeld has died. He was 86.\r\nDynarski, who also starred in Steven Spielberg's Duel and Close Encounters of the Third Kind, died on February 27 at a rehabilitat… [+1504 chars]"}, {"source": {"id": null, "name": "Nine.com.au"}, "author": "Victoria Arbiter", "title": "Victoria Arbiter: 'A royal response to a global health crisis' - 9Honey", "description": "", "url": "https://honey.nine.com.au/royals/victoria-arbiter-royal-family/26891aaf-3d3e-45b6-b4cd-1ae58f25f696", "urlToImage": null, "publishedAt": "2020-04-24T22:31:06Z", "content": "Earlier this week a friend sent through a very funny meme. In the Who Wants to be a Millionaire clip the £64,000 question read: What day is it? The available answers: A) Monday B) Tuesday C) 1982 or D) Saturday. After wracking her brain the flummoxed contesta… [+7809 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Lorena Allam", "title": "Arnhem Land is in lockdown – but you can visit through online concerts - The Guardian", "description": "Aboriginal artists are streaming free music and dance performances during the coronavirus crisis", "url": "https://www.theguardian.com/australia-news/2020/apr/24/arnhem-land-coronavirus-lockdown-but-you-can-visit-through-online-concerts", "urlToImage": null, "publishedAt": "2020-04-24T22:19:01Z", "content": "Aboriginal remote communities have been closed to the outside world for weeks amid the coronavirus crisis, designated as biosecurity areas and locked down for their own safety with non-essential visitors banned.\r\nIn the top end, it means big festivals such as… [+3329 chars]"}, {"source": {"id": null, "name": "Grandtournation.com"}, "author": "Alex Harrington", "title": "Jeremy Clarkson Reveals When The Next Episode Of The Grand Tour Will Be Ready - Grand Tour Nation", "description": "Jeremy Clarkson has confirmed that the next episode of The Grand Tour, the Madagascar Special, will be sent off to … More", "url": "https://www.grandtournation.com/thegrandtour/jeremy-clarkson-reveals-when-the-next-episode-of-the-grand-tour-will-be-ready/", "urlToImage": null, "publishedAt": "2020-04-24T21:26:15Z", "content": "Jeremy Clarkson has confirmed that the next episode of The Grand Tour, the Madagascar Special, will be sent off to Amazon in two weeks. In a conversation filmed by DriveTribe with executive producer Andy Wilman, who only recently recovered from Covid-19, they… [+1821 chars]"}, {"source": {"id": null, "name": "Smh.com.au"}, "author": null, "title": "Captain Tom Moore becomes oldest person to top Britain's music chart - The Age", "description": "A World War II veteran who raised millions for charity has now become the oldest person to top Britain's main music chart.", "url": "https://www.smh.com.au/world/europe/captain-tom-moore-becomes-oldest-person-to-top-britain-s-music-chart-20200425-p54n4v.html", "urlToImage": null, "publishedAt": "2020-04-24T20:40:50Z", "content": "He also went to No.1 on the music charts - with a little help from a friend.\r\nThe cover version of You'll Never Walk Alone that Moore appears on with singer Michael Ball was on course to be pipped by The Weeknd's Blinding Lights, until the Canadian star asked… [+1312 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Etienne Fermie", "title": "Mike Tyson admits his tigers could have come from convicted Netflix star Joe Exotic, boxing news - NEWS.com.au", "description": "Mike Tyson admits his tigers ‘could have’ come from convicted Netflix star Joe Exotic", "url": "https://www.news.com.au/sport/sports-life/mike-tyson-admits-his-tigers-could-have-come-from-convicted-netflix-star-joe-exotic/news-story/b4713939e39cc60f49f8786d6712ae60", "urlToImage": null, "publishedAt": "2020-04-24T20:19:56Z", "content": "Mike Tyson has admitted his tigers may have come from jailed Netflix star Joe Exotic, The Sun reported.The boxing legend was renowned for owning the big cats at the height of his success in the 1990s, and Tyson, 53, appears to be a fan of the newly-famed Exot… [+1941 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Eve Wagstaff", "title": "Coronavirus: Ricky Gervais launches epic rant against ‘multi-millionaire celebs’ lecturing people during lockdown - NEWS.com.au", "description": "Coronavirus: Ricky Gervais launches epic rant against ‘multi-millionaire celebs’ lecturing people during lockdown", "url": "https://www.news.com.au/entertainment/celebrity-life/coronavirus-ricky-gervais-launches-epic-rant-against-multimillionaire-celebs-lecturing-people-during-lockdown/news-story/ac2d236332980c8b99d499ffb519dfe7", "urlToImage": null, "publishedAt": "2020-04-24T17:20:49Z", "content": "Ricky Gervais has launched an epic rant against \"multi-millionaire celebs\" who lecture \"normal nobodies\" on how to live while health staff risk their lives.The 58-year-old comedian blasted a string of A-listers including Gal Gadot and her Hollywood friends wh… [+3810 chars]"}, {"source": {"id": "entertainment-weekly", "name": "Entertainment Weekly"}, "author": "James Hibberd", "title": "Andy Cohen slams FDA rule preventing him from helping coronavirus patients - Entertainment Weekly", "description": "\"My blood could save a life but instead it's over here boiling,\" said the <em>Watch What Happens Live</em> host.", "url": "https://ew.com/tv/andy-cohen-coronavirus-donating-blood/", "urlToImage": null, "publishedAt": "2020-04-24T16:51:40Z", "content": "One of the most promising treatments for COVID-19 patients is using plasma from survivors to give antibodies to those who are currently hospitalized with the disease.\r\nBut Bravo executive and talk show host Andy Cohen — who has recovered from the coronavirus … [+2165 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Claire Anderson", "title": "Kate drops huge bombshell announcement about Louis after his second birthday - Express.co.uk", "description": "KATE, the Duchess of Cambridge has revealed Prince Louis' favourite song after celebrating his birthday on Thursday.", "url": "https://www.express.co.uk/news/royal/1273446/kate-middleton-prince-louis-birthday-photos-duchess-of-cambridge-royal-family-latest", "urlToImage": null, "publishedAt": "2020-04-24T13:02:00Z", "content": null}, {"source": {"id": null, "name": "Gamesradar.com"}, "author": "Jack Shepherd", "title": "Extraction director explains how he pulled off the Netflix movie's incredible one-shot (exclusive) - GamesRadar+ AU", "description": "Netflix's latest action movie features an incredible 30-minute single take. We spoke to Extraction's director, Sam Hardgrave, about how he pulled off the ambition feat of filmmaking", "url": "https://www.gamesradar.com/extraction-netflix-sam-hargrave-interview/", "urlToImage": null, "publishedAt": "2020-04-24T11:37:40Z", "content": "Netflix's original output has grown exponentially ambitious these last few years. Just look back to the tail end of 2019, when the streaming service released Michael Bay's bombastic 6 Underground and Martin Scorsese's epic The Irishman. And while Extraction d… [+11457 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Marta Jary For Daily Mail Australia", "title": "Prime Minister Scott Morrison addresses rumours he soiled himself at Engadine McDonald's - Daily Mail", "description": "Scott Morrison has again addressed rumours that he soiled himself at McDonald's the night the Cronulla Sharks lost the 1997 Grand Final.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8252669/Prime-Minister-Scott-Morrison-addresses-rumours-soiled-Engadine-McDonalds.html", "urlToImage": null, "publishedAt": "2020-04-24T10:58:38Z", "content": "Scott Morrison has again addressed rumours that he soiled himself at McDonald's the night the Cronulla Sharks lost the 1997 Grand Final. \r\nSpeaking to KIIS FM's Will and Woody show on Friday, the Prime Minister laughed heartily when asked if the story was tru… [+2930 chars]"}, {"source": {"id": null, "name": "Nine.com.au"}, "author": "Jemima Skelley", "title": "The Simpsons episodes you probably watched on repeat while growing up - 9Honey", "description": "", "url": "https://celebrity.nine.com.au/tv/the-simpsons-best-episodes-of-all-time/f4b29eeb-153f-461b-b1f8-26ac4c3bb99a", "urlToImage": null, "publishedAt": "2020-04-24T10:46:00Z", "content": "The Simpsons has been on our screens for more than 30 years, with hundreds and hundreds of episodes. Though I think we can all agree that its first 10 seasons were its best every episode was good, with smart jokes, novel storylines, and excellent character de… [+5832 chars]"}, {"source": {"id": null, "name": "Perthnow.com.au"}, "author": "PerthNow", "title": "‘I hadn't made the mental connection’: Horrified mum accidentally names her baby girl ‘Lasagna’ - PerthNow", "description": "Some times things just don’t work out how you’d planned, even with the best intentions. That’s exactly what a new mother found out - and her family are absolutely paying her out for it.", "url": "https://www.perthnow.com.au/lifestyle/parenting/i-hadnt-made-the-mental-connection-horrified-mum-accidentally-names-her-baby-girl-lasagna-ng-b881529662z", "urlToImage": null, "publishedAt": "2020-04-24T09:49:34Z", "content": "Sometimes things just dont work out how youd planned, even with the best intentions.\r\nA mum has taken to Reddit to ask Am I the a******? after accidentally naming her kid, Lasagna.\r\nThe name was at first meant to be a tribute to her mother-in-law, who recentl… [+2238 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "By Margaret Scheikowski", "title": "Love Is In The Air was 'partly copied' - NEWS.com.au", "description": "Love Is In The Air was 'partly copied'", "url": "https://www.news.com.au/national/breaking-news/love-is-in-the-air-was-partly-copied/news-story/af689e43f80a7452ed54973733b50008", "urlToImage": null, "publishedAt": "2020-04-24T08:40:22Z", "content": "An American duo copied part of the musical work in the Australian pop hit Love Is In the Air, a judge has ruled in a copyright infringement lawsuit.Describing the copying as \"flagrant\", Justice Nye Perram said a Federal Court hearing would be held later to as… [+1405 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Wenlei Ma", "title": "Defending Jacob TV review: Chris Evans’ splashy new Apple TV+ series - NEWS.com.au", "description": "Chris Evans leads splashy Apple TV series, Defending Jacob", "url": "https://www.news.com.au/entertainment/tv/tv-shows/chris-evans-leads-splashy-apple-tv-series-defending-jacob/news-story/8a1090ed6067bcb3337ebc5c6a2e375b", "urlToImage": null, "publishedAt": "2020-04-24T08:19:44Z", "content": "From the outside, the Barbers seem like a blessed family.Dad Andy is a successful prosecutor, mum Laurie works with traumatised kids and son Jacob, 14, attends the local middle school in an upper-middle class Boston community where we’re told every second par… [+3627 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Besha Rodell", "title": "Watching America in Horror From a Curve-Flattened Australia - The New York Times", "description": "There’s an extreme emotional dissonance in feelings of gratitude for Australia’s relative safety, when so many people I know and love are in the United States where things seem out of control.", "url": "https://www.nytimes.com/2020/04/24/world/australia/coronavirus-united-states.html", "urlToImage": null, "publishedAt": "2020-04-24T07:54:37Z", "content": "Meanwhile, in Australia, our extreme social distancing and lockdown measures appear to be working. This week, Damien Cave reports on Australia and New Zealands rapid suppression of the coronavirus outbreak, with only a handful of new cases reported each day:\r… [+736 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "https://www.abc.net.au/news/paul-donoughue/6306596", "title": "Parks and Recreation is coming back for a one-off coronavirus episode. Here's what you need to know - ABC News", "description": "Beloved US sitcom Parks and Recreation is coming back for a coronavirus-related special.", "url": "https://www.abc.net.au/news/2020-04-24/parks-and-recreation-is-coming-back-for-a-coroanvirus-special/12181048", "urlToImage": null, "publishedAt": "2020-04-24T07:41:17Z", "content": "Updated \r\nApril 24, 2020 16:58:53\r\nYour favourite troupe of dysfunctional local bureaucrats is back.\r\nThe original cast members of beloved US sitcom Parks and Recreation, including Amy Poehler, Rashida Jones, Chris Pratt and Aziz Ansari, will reprise their ro… [+2472 chars]"}, {"source": {"id": null, "name": "Perthnow.com.au"}, "author": "Bang Showbiz", "title": "Tom Hanks gifts Corona-branded typewriter to bullied Australian boy named Corona - PerthNow", "description": "The actor sent a heartwarming letter and gift to a young Australian boy named Corona after he revealed he had been bullied over his moniker.", "url": "https://www.perthnow.com.au/entertainment/celebrity-gossip/tom-hanks-gifts-corona-branded-typewriter-to-bullied-australian-boy-named-corona-ng-b881529498z", "urlToImage": null, "publishedAt": "2020-04-24T07:38:48Z", "content": "Tom Hanks has sent a typewriter to a young Australian boy named Corona after he revealed he had been bullied over his moniker.\r\nThe Castaway actor wrote a kind note to eight-year-old Corona De Vries after the young Australian sent him a letter when he and wif… [+1519 chars]"}, {"source": {"id": null, "name": "Who.com.au"}, "author": null, "title": "Kerri-Anne Kennerley caught out in cringeworthy on-air outburst - Who", "description": "Kerri-Anne Kennerley has revealed she once suffered a very embarrassing on-air gaffe early on in her career.", "url": "https://www.who.com.au/kerri-anne-kennerley-caught-out-in-cringeworthy-on-air-outburst", "urlToImage": null, "publishedAt": "2020-04-24T07:36:00Z", "content": "It was a commercial break and my panel operator asked me a question about something that was written in the previous day's newspaper, Kerri-Anne said.\r\nI explained how unhappy and unsatisfied with the journalist and probably gave her a bit of a critique that … [+334 chars]"}, {"source": {"id": null, "name": "Newidea.com.au"}, "author": null, "title": "Kyle Sandilands finally admits why his marriage REALLY ended - New Idea", "description": "Shock jock Kyle Sandilands has spoken out about why his relationships never seem to last.", "url": "https://www.newidea.com.au/kyle-sandilands-finally-admits-why-his-marriage-really-ended", "urlToImage": null, "publishedAt": "2020-04-24T06:52:00Z", "content": "The 48-year-old spilt from his girlfriend Imogen Anthony last year, a decade after his marriage to Tamara Jaber ended in divorce. \r\nOn Thursday's Kyle and Jackie 'O' Show, the host deliberated over what he's done wrong in the past, saying he's been guilty of … [+565 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nHarry Mount", "title": "How the Queen comes into her own during a crisis - Telegraph.co.uk", "description": "Why do we turn to the Queen during crises – and how does she know instinctively what to say? In the week she turns 94, Harry Mount reports", "url": "https://www.telegraph.co.uk/royal-family/0/queen-comes-crisis/", "urlToImage": null, "publishedAt": "2020-04-24T06:00:00Z", "content": "After thanking NHS workers, she turned to the majority of us, trapped at home, and subtly backed the Governments message that we should stay there. By thanking us for staying at home unlike the Governments irritating Americanism, asking us to stay home she ev… [+2382 chars]"}, {"source": {"id": null, "name": "Lifehacker.com.au"}, "author": "Mariam Gabaji", "title": "Everything Coming to Netflix In May - Lifehacker Australia", "description": "With stay-at-home orders still in place, there's nothing like having a new list of shows and movies to look forward to. For your entertainment this May, we bring to you everything coming to Netflix including Rick & Morty, which is back for season four, and a …", "url": "https://www.lifehacker.com.au/2020/04/everything-coming-to-netflix-in-may/", "urlToImage": null, "publishedAt": "2020-04-24T05:15:00Z", "content": "With stay-at-home orders still in place, there's nothing like having a new list of shows and movies to look forward to. For your entertainment this May, we bring to you everything coming to Netflix including Rick &amp; Morty, which is back for season four, an… [+9529 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Hannah-Rose Yee", "title": "Coronavirus horoscopes: How you should spend your time in isolation based on your star sign - NEWS.com.au", "description": "Coronavirus horoscopes: How you should be spending your time in isolation based solely on your star sign", "url": "https://www.news.com.au/lifestyle/health/mind/coronavirus-horoscopes-how-you-should-be-spending-your-time-in-isolation-based-solely-on-your-star-sign/news-story/6686563f69ca5aa1a758e8cf0b076dcb", "urlToImage": null, "publishedAt": "2020-04-24T05:09:47Z", "content": "With Prime Minister Scott Morrison hinting that coronavirus-related lockdown could last for up to six months, its time to start looking for hobbies you can indulge in while at home. No more trips to the gym, no more wild swimming jaunts, no more movie maratho… [+10383 chars]"}, {"source": {"id": null, "name": "Dailytelegraph.com.au"}, "author": null, "title": "Neighbours, Home And Away: Extreme measures to return amid COVID-19 - Daily Telegraph", "description": "Subscribe to The Daily Telegraph to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.dailytelegraph.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-24T05:00:00Z", "content": null}, {"source": {"id": null, "name": "Nine.com.au"}, "author": "Variety Staff", "title": "Taylor Swift slams 'unapproved' live album as 'tasteless' cash grab - 9Honey", "description": "", "url": "https://celebrity.nine.com.au/music/taylor-swift-slams-unapproved-live-album-as-tasteless-cash-grab/bdf464b6-8b5d-4c48-ad65-6b003147ebf2", "urlToImage": null, "publishedAt": "2020-04-24T04:46:00Z", "content": "LOS ANGELES (Variety.com) Taylor Swift was not pleased when fans began alerting her Thursday to the impending release of a live album from her early days as a recording artist, taking to social media to slam Big Machine for being \"tasteless\" and showing \"sham… [+3785 chars]"}, {"source": {"id": null, "name": "Nine.com.au"}, "author": "Bianka Farmakis", "title": "Prince William reveals he hasn't seen Tiger King: 'I tend to avoid shows about royalty' - 9Honey", "description": "", "url": "https://honey.nine.com.au/royals/coronavirus-prince-william-makes-tiger-king-joke-in-charity-skit-stephen-fry/1e671473-9fc5-4446-bb34-cd47c94d5647", "urlToImage": null, "publishedAt": "2020-04-24T04:42:59Z", "content": "The Duke of Cambridge can officially add 'comedian' to his CV after flexing his funny bone in an appearance on the BBC's charity show Big Night In.\r\nAppearing alongside comedy legend Stephen Fry - via Zoom, of course the future king took part in a quick sketc… [+2913 chars]"}, {"source": {"id": null, "name": "Nine.com.au"}, "author": "Christine Estera", "title": "Crazy Rich Asian star Henry Golding's dog reportedly mauls another pooch at a park - 9Honey", "description": "", "url": "https://celebrity.nine.com.au/latest/crazy-rich-asian-star-henry-golding-dog-reportedly-mauls-another-pooch/f74d9777-a1ac-495f-ab5a-9f5f617004b1", "urlToImage": null, "publishedAt": "2020-04-24T03:49:00Z", "content": "The dog of Crazy Rich Asians star Henry Golding has reportedly mauled another pup in a Los Angeles park.\r\nAccording to TMZ, the actor was walking his newly fostered dog, a pit bull named Stella, when she allegedly attacked a smaller pooch at LA's Pan Pacific … [+1275 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Nate Day", "title": "Chris Hemsworth 'failing miserably' in lockdown - The Advertiser", "description": "Like many parents around the globe, Chris Hemsworth is struggling to teach his children at home during the coronavirus outbreak.", "url": "https://www.news.com.au/entertainment/celebrity-life/chris-hemsworth-failing-miserably-in-lockdown/news-story/6ff121048764d9b6d558e44540f0bc29", "urlToImage": null, "publishedAt": "2020-04-24T03:02:00Z", "content": "Like many parents around the globe, Chris Hemsworth is struggling to teach his children at home during the coronavirus outbreak.\r\nHemsworth, 36, recently spoke to Jimmy Kimmel over video chat and opened up about his experience homeschooling his little ones: I… [+2149 chars]"}, {"source": {"id": null, "name": "Nine.com.au"}, "author": "9Honey Celebrity with CNN", "title": "Tom Selleck gives a rare interview on fame, family and why he quit Magnum P.I. - 9Celebrity", "description": "", "url": "https://celebrity.nine.com.au/tv/tom-selleck-gives-rare-interview-on-fame-family-and-why-he-quit-magnum-pi/badffc81-3835-46ee-ace3-e31eacfc2d69", "urlToImage": null, "publishedAt": "2020-04-24T01:45:00Z", "content": "(CNN) Tom Selleck was one of the hottest stars of the 1980s when he suddenly quit his hit show, Magnum P.I.\r\nThe fame got to be a bit much, he recalled recently.\r\n\"I quit Magnum, not because I didn't like it or I was tired of it,\" Selleck told People magazine… [+1947 chars]"}, {"source": {"id": null, "name": "Goodfood.com.au"}, "author": "Eloise Basuki", "title": "Recap: The MasterChef immunity challenge proved you Khanh't always get what you want - Good Food", "description": "Find out which contestant gets immunity, and which judge has pepper problems.", "url": "https://www.goodfood.com.au/eat-out/news/recap-the-masterchef-immunity-challenge-proved-you-khanht-always-get-what-you-want-20200423-h1nkyn", "urlToImage": null, "publishedAt": "2020-04-24T01:22:00Z", "content": "We made it, guys. We've finished a full working week of making gently sarcastic comments about this show and we're finally at the immunity challenge end. Thanks for sticking with me.\r\nAfter last night's #BrothOff, Khanh, Sarah Tiong, Ben Ungermann, Laura and … [+7238 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Luke Plunkett", "title": "Millions Of People Just Watched A Crazy Travis Scott Show In Fortnite - Kotaku Australia", "description": "Rapper Travis Scott just made an appearance for the first of five shows he’ll be starring in for Fortnite, and if you’re a fan of either of those things—like the millions of people who tuned in to watch—it was one hell of a thing....", "url": "https://www.kotaku.com.au/2020/04/millions-of-people-just-watched-a-crazy-travis-scott-show-in-fortnite/", "urlToImage": null, "publishedAt": "2020-04-24T01:00:00Z", "content": "Rapper Travis Scott just made an appearance for the first of five shows hell be starring in for Fortnite, and if youre a fan of either of those thingslike the millions of people who tuned in to watchit was one hell of a thing.\r\nWhile only running for around t… [+664 chars]"}, {"source": {"id": null, "name": "Newidea.com.au"}, "author": null, "title": "Aussie star Jane Kennedy suffers shocking head injury - New Idea", "description": "Radio host Jane Kennedy has been hospitalised after a serious accident where she fell from a tree and hit her head on the concrete.", "url": "https://www.newidea.com.au/jane-kennedy-suffers-shocking-head-injury", "urlToImage": null, "publishedAt": "2020-04-24T00:26:00Z", "content": "Jane fell and woke in hospital with amnesia.\r\nJane said she is now home but that she was hospitalised after the fall and now has to wear a neck brace so her head and back injuries recover.\r\nShe explained she was trying to put a night-vision camera in the tree… [+816 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "7NEWS", "title": "The Italian model who keeps testing positive to coronavirus, two months after diagnosis - 7NEWS.com.au", "description": "‘We are studying her case carefully.’", "url": "https://7news.com.au/lifestyle/health-wellbeing/the-italian-model-who-keeps-testing-positive-to-coronavirus-two-months-after-diagnosis-c-996498", "urlToImage": null, "publishedAt": "2020-04-24T00:12:23Z", "content": "This 23-year-old Italian model, one of the first people in her region to be diagnosed with coronavirus, is still positive for the virus - 55 days on.\r\nBianca Dobroiu was hospitalised in the SantOrsola hospital in the city of Bologna in northern Italy on Febru… [+1502 chars]"}, {"source": {"id": null, "name": "Who.com.au"}, "author": null, "title": "MasterChef scandal thickens over missing contestant Ben Ungermann - Who", "description": "Mystery continues to surround the strange and sudden departure of popular contestant, Ben Ungermann from the MasterChef competition.", "url": "https://www.who.com.au/masterchef-scandal-thickens-over-missing-contestant-ben", "urlToImage": null, "publishedAt": "2020-04-24T00:12:00Z", "content": "Confidential reports that Ungermann left the competition about three months ago, when production had only just started.\r\nAt that time, contestants were only told that he had left for personal reasons.\r\nThe publication further states that Ungermann does not ha… [+510 chars]"}, {"source": {"id": null, "name": "Perthnow.com.au"}, "author": "Reuters", "title": "Royals Prince William, Catherine, Charles and Camilla lead ‘Clap for Carers’ tribute to NHS health workers - PerthNow", "description": "The royals have taken part in a heartwarming doorstep tribute to Britain’s health workers.", "url": "https://www.perthnow.com.au/news/royal-family/royals-prince-william-catherine-charles-and-camilla-lead-clap-for-carers-tribute-to-nhs-health-workers-ng-b881528723z", "urlToImage": null, "publishedAt": "2020-04-23T23:22:10Z", "content": "The royals have taken part in a heartwarming doorstep tribute to Britains health workers.\r\nPrince William, Catherine, Duchess of Sussex and their children Prince George, Princess Charlotte and Prince Louis, stood outside their front doors to Clap for Carers f… [+2045 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "Hamish Goodall", "title": "Sunrise stars Natalie Barr and Samantha Armytage ‘walk off’ after Kochie joke - 7NEWS.com.au", "description": "The Sunrise stars jokingly walked off the Sunrise set after David ‘Kochie’ Koch made a “disgusting” joke live on air.", "url": "https://7news.com.au/sunrise/entertainment/sunrise-stars-natalie-barr-and-samantha-armytage-walk-off-set-after-kochie-joke-c-996500", "urlToImage": null, "publishedAt": "2020-04-23T23:20:50Z", "content": "Sunrise stars Natalie Barr and Samantha Armytage have jokingly walked off set after David Kochie Koch made a disgusting joke live on air.\r\nIn the hilarious clip, Armytage asks her colleague how he unwinds before bed after airing a segment about the importance… [+487 chars]"}, {"source": {"id": null, "name": "Pedestrian.tv"}, "author": "Matt Galea", "title": "Ellen Pompeo Apologises For Resurfaced Video Where She Appears To Blame Weinstein's Victims - Pedestrian TV", "description": "Pompeo issued an apology on Twitter.", "url": "http://www.pedestrian.tv/entertainment/ellen-pompeo-harvey-weinstein-comments/", "urlToImage": null, "publishedAt": "2020-04-23T23:13:16Z", "content": "Ellen Pompeo has come under fire for resurfaced remarks she made in a July 2018 interview about Harvey Weinsteins victims.\r\nIn a one-minute clip that was cut from an hour-long Oxford Union Q&amp;A, the actress star said, I think we bear some responsibility, n… [+4299 chars]"}, {"source": {"id": null, "name": "Perthnow.com.au"}, "author": "AP", "title": "Coronavirus crisis: Rolling Stones release Living in a Ghost Town, a song that ’resonates’ these days - PerthNow", "description": "Mick Jagger said the song was one they were working on long before the global lockdown and the band decided to revisit it in isolation.", "url": "https://www.perthnow.com.au/news/coronavirus/coronavirus-crisis-rolling-stones-release-living-in-a-ghost-town-a-song-that-resonates-these-days-ng-b881528720z", "urlToImage": null, "publishedAt": "2020-04-23T22:21:42Z", "content": "The Rolling Stones have unveiled a new song the band thinks is perfect for these coronavirus times.\r\nThe legendary band released the four-minute slow-burning bluesy and harmonica-driven Living in a Ghost Town on Thursday.\r\nIm a ghost/Living in a ghost town/Yo… [+811 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Teresa Roca", "title": "Courtney Stodden says Peter Nygard is a ‘monster’: Her shocking claims - NEWS.com.au", "description": "Courtney Stodden goes public with shocking claims against billionaire ‘monster’", "url": "https://www.news.com.au/entertainment/celebrity-life/courtney-stodden-goes-public-with-shocking-claims-against-billionaire-monster/news-story/465429762c0f759940705fce16139918", "urlToImage": null, "publishedAt": "2020-04-23T22:19:35Z", "content": "MODEL Courtney Stodden claimed billionaire Peter Nygard tried to lure her to his private island when she was just 19 years old after he allegedly sexually assaulted her at an event.In an excerpt from Predator King: Peter Nygard’s Dark Life of Rape, Drugs, and… [+3179 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": null, "title": "MasterChef 2020: Fans stunned to learn Poh's real age - NEWS.com.au", "description": "Fact about MasterChef star Poh that will shock you", "url": "https://www.news.com.au/entertainment/tv/reality-tv/fact-about-masterchef-star-poh-that-will-shock-you/news-story/4c735a73c379371cbda2aaaa6e704a60", "urlToImage": null, "publishedAt": "2020-04-23T22:10:14Z", "content": "She first appeared on MasterChef in its debut season in 2009.And fans have pointed out Poh Ling Yeow has somehow managed to defy the ageing process over the last decade, as many say they were surprised to learn her real age.\r\nThe cook, who is currently appear… [+1185 chars]"}, {"source": {"id": null, "name": "Tvblackbox.com.au"}, "author": "Robert McKnight", "title": "EXCLUSIVE | CELEBRITY GOGGLEBOX is coming soon - TV Blackbox", "description": "TV Blackbox can exclusively reveal Foxtel are launching a celebrity version of the TV favourite", "url": "https://tvblackbox.com.au/page/2020/04/24/exclusive-celebrity-gogglebox-is-coming-soon/", "urlToImage": null, "publishedAt": "2020-04-23T21:28:05Z", "content": "TV Blackbox can exclusively reveal plans are in place for Celebrity Gogglebox to hit our screens in September. Initial plans by Foxtel for the spin-off series were thrown into chaos due to the Coronavirus but producers are forging ahead with plans in place to… [+1111 chars]"}, {"source": {"id": null, "name": "Nine.com.au"}, "author": "Christine Estera", "title": "Rapper Fred the Godson dies from coronavirus weeks after 'winning' battle with virus - 9Honey", "description": "", "url": "https://celebrity.nine.com.au/latest/rapper-fred-the-godson-dies-coronavirus-aged-35/e87f68a1-3e3b-422a-bacd-4a4d6bccd920", "urlToImage": null, "publishedAt": "2020-04-23T20:34:00Z", "content": "Rapper Fred the Godson has died from coronavirus, just two weeks after announcing he had tested positive to the virus. He was 35.\r\nA representative for the South Bronx rapper who released his new album, Paycheck, just last month confirmed the sad news to Comp… [+2533 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Yasmin Boland", "title": "Pisces Daily Horoscope – April 24 2020 - Yahoo Lifestyle Australia", "description": "How YOU doing? How is lockdown treating you? I did a New Moon ceremony here – tune in while we are still in the New Moon phase for a day or so longer. Your stars today… One of the worst things about the pandemic lockdown is the fact that some people are doing…", "url": "https://au.lifestyle.yahoo.com/pisces-daily-horoscope-april-24-190022956.html", "urlToImage": null, "publishedAt": "2020-04-23T19:00:00Z", "content": "How YOU doing?\r\nHow is lockdown treating you? I did a New Moon ceremony here tune in while we are still in the New Moon phase for a day or so longer.\r\nYour stars today\r\nOne of the worst things about the pandemic lockdown is the fact that some people are doing… [+582 chars]"}, {"source": {"id": null, "name": "Darkhorizons.com"}, "author": null, "title": "\"Mandalorian\" Doco Series Trailer & Yoda Talk - Dark Horizons", "description": "With the second season of “The Mandalorian” not hitting until this Fall, the Disney+ streaming service recently announced the eight-episode documentary series “Disney Gallery: The Mandalorian” which offers a behind the scenes glimpse at the making of the show…", "url": "https://www.darkhorizons.com/mandalorian-doco-series-trailer-yoda-talk/", "urlToImage": null, "publishedAt": "2020-04-23T15:11:31Z", "content": "With the second season of “The Mandalorian” not hitting until this Fall, the Disney+ streaming service recently announced the eight-episode documentary series “Disney Gallery: The Mandalorian” which offers a behind the scenes glimpse at the making of the show… [+979 chars]"}]}