{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "20minutes.fr"}, "author": "J.G.", "title": "Un concours pour désigner la pire coiffure du confinement dans le Morbihan - 20 Minutes", "description": "Une coiffeuse de Larré vient de désigner les deux gagnants du concours", "url": "https://www.20minutes.fr/societe/2768051-20200426-coronavirus-morbihan-concours-designer-coiffure-plus-moche-confinement", "urlToImage": null, "publishedAt": "2020-04-27T00:00:41Z", "content": "Voici les deux gagnants du concours de la coiffure la plus moche du confinement dans le Morbihan. Page Facebook @ElieCoiffure\r\nLes salons de coiffure fermés, les désastres capillaires se multiplient pendant le confinement. Beaucoup de personnes ont en effet t… [+1029 chars]"}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": "Guadeloupe 1ère", "title": "Coronavirus : Le règne de Clémence Botino ne sera pas prolongé - Guadeloupe la 1ère - Outre-mer la 1ère", "description": "Sylvie Tellier a annonc&eacute; dans le R&eacute;publicain Lorrain que l&#39;&eacute;lection de Miss France 2021 ne sera pas report&eacute;e, m&ecirc;me si l&#39;ann&eacute;e de Miss France 2020 est p", "url": "https://la1ere.francetvinfo.fr/guadeloupe/coronavirus-le-sacre-de-clemence-botino-ne-sera-pas-prolonge-826934.html", "urlToImage": null, "publishedAt": "2020-04-26T22:11:22Z", "content": "Le règne de Clémence Botino ne sera pas prolongé. Sylvie Tellier, la présidente du Comité Miss France l'annoncé dans un entretien au Républicain Lorrain. \"La prochaine élection de Miss France 2021 nest pas reportée, mais elle sera différente. On fera des amén… [+1958 chars]"}, {"source": {"id": null, "name": "Barbanews.com"}, "author": null, "title": "Clara Morgane - Une nouvelle fois, elle dépasse les bornes avec ses clichés non censurés ! - barbanews", "description": "Clara est forcément connue pour son histoire avec les films. Les internautes ne manquent donc pas une seule occasion pour découvrir des photos et la jeune femme a décidé de combler tous ses fans.", "url": "https://www.barbanews.com/peoples/clara-morgane-une-nouvelle-fois-elle-depasse-les-bornes-avec-ses-cliches-non-censures/", "urlToImage": null, "publishedAt": "2020-04-26T21:18:00Z", "content": "Clara a tendance à faire couler beaucoup dencre, il suffit quun cliché soit posté sur les réseaux sociaux pour quil se retrouve rapidement en Une de la presse people.\r\nLe dernier est assez sympathique pour les fans de la star qui propose régulièrement des cal… [+3967 chars]"}, {"source": {"id": null, "name": "Public.fr"}, "author": "Public", "title": "Lily-Rose Depp est désormais célibataire ! - Public", "description": "C’est du moins ce qu’annoncent les médias américains suite à un article paru dans US Weekly. Les deux jeunes stars n’ont, pour le moment, rien dit à ce sujet et n’ont même jamais officialisé leur amour. C’est sur le plateau de tournage de « The King » produit…", "url": "https://www.public.fr/News/Lily-Rose-Depp-est-desormais-celibataire-1639821", "urlToImage": null, "publishedAt": "2020-04-26T20:22:59Z", "content": "Cest du moins ce quannoncent les médias américains suite à un article paru dans US Weekly. Les deux jeunes stars nont, pour le moment, rien dit à ce sujet et nont même jamais officialisé leur amour. Cest sur le plateau de tournage de « The King » produit par … [+1665 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "A.L.", "title": "Astérix : « Le Menhir d’or », un récit illustré de Goscinny et Uderzo pour octobre - 20 Minutes", "description": "« Le Menhir d’Or » est l’adaptation d’un livre audio, sorti en 1967", "url": "https://www.20minutes.fr/arts-stars/culture/2768139-20200426-asterix-menhir-or-recit-illustre-goscinny-uderzo-octobre", "urlToImage": null, "publishedAt": "2020-04-26T19:57:22Z", "content": "Extrait de « Astérix le Gaulois », publié en 1961 ASTERIX ® OBELIX ® IDEFIX ® © 2019 ED. ALBERT RENE / GOSCINNY-UDERZO\r\nUn nouvel album dAstérix va paraître le 21 octobre, selon Céleste Surugue, directeur général des éditions Albert René, interviewé par le JD… [+791 chars]"}, {"source": {"id": null, "name": "Presse-citron.net"}, "author": "David Laurent", "title": "Comment le succès des Gardiens de la Galaxie a changé le MCU - Presse-citron", "description": "Les Gardiens de la Galaxie n'étaient pas destinés à connaître un succès aussi majeur. Le Marvel Cinematic Universe a donc été contraint de s'adapter.", "url": "https://www.presse-citron.net/comment-le-succes-des-gardiens-de-la-galaxie-a-change-le-mcu/", "urlToImage": null, "publishedAt": "2020-04-26T18:16:49Z", "content": "Avengers : Infinity War et Endgame ont été d’incroyables succès au cinéma, tant pour les fans que pour la critique. Avec des records d’audience, un casting XXL et une ambition démesurée, Marvel a redéfini le monde des super-héros au cinéma. Mieux, désormais,c… [+1725 chars]"}, {"source": {"id": null, "name": "Stars-actu.fr"}, "author": "Céline S.", "title": "Les 12 coups de midi : Jean-Luc Reichmann annonce l’arrêt de la diffusion des inédits ! (VIDEO) - Stars Actu", "description": "Confinement oblige, cela fait plus d'un mois que le tournage du jeu quotidien de TF1 \"Les 12 coups de midi\" a été stoppé. Résultat, et il fallait bien s'en", "url": "https://www.stars-actu.fr/2020/04/les-12-coups-de-midi-jean-luc-reichmann-annonce-larret-de-la-diffusion-des-inedits-video/", "urlToImage": null, "publishedAt": "2020-04-26T18:09:00Z", "content": "Les 12 coups de midi déprogrammation coronavirus – Confinement oblige, cela fait plus d’un mois que le tournage du jeu quotidien de TF1 « Les 12 coups de midi » a été stoppé. Résultat, et il fallait bien s’en douter, TF1 va arriver à court d’émissions inédite… [+622 chars]"}, {"source": {"id": null, "name": "Huffingtonpost.fr"}, "author": "Vincent Gibert", "title": "\"Koh-Lanta\": Pascal Salviani, figure de l'émission, se lâche sur la production - Le HuffPost", "description": "L'ancien double finaliste du jeu télévisé a poussé un coup de gueule mémorable sur Instagram.", "url": "https://www.huffingtonpost.fr/entry/koh-lanta-pascal-salviani-figure-de-lemission-se-lache-sur-la-production_fr_5ea5b296c5b6805f9ecf05d9", "urlToImage": null, "publishedAt": "2020-04-26T18:05:57Z", "content": "KOH-LANTA - Lors du dernier épisode de “Koh-Lanta” diffusé sur TFI vendredi 24 avril, Sam, candidat très apprécié des téléspectateurs et parmi les favoris à la victoire finale, a été éliminé.\r\nLe jeune homme de 20 ans a fait les frais d’une coalition menée pa… [+1471 chars]"}, {"source": {"id": null, "name": "Melty.fr"}, "author": "Aurore C", "title": "Nabilla et Thomas Vergara confinés pendant un an, ils font des révélations choc sur ce qui s'est passé après l'affaire du couteau - melty", "description": "Après l'affaire du couteau et la prison, Nabilla et Thomas Vergara se sont cachés pendant un an et se confient pour la première fois...", "url": "https://www.melty.fr/nabilla-et-thomas-vergara-confines-pendant-un-an-ils-font-des-revelations-choc-sur-ce-qui-s-est-passe-apres-l-affaire-du-couteau-a717538.html", "urlToImage": null, "publishedAt": "2020-04-26T17:02:32Z", "content": "Il y a quelques années, l'affaire du couteau entre Nabilla et Thomas Vergara avait fait couler beaucoup d'encre sur la toile. Si aujourd'hui tout va bien pour le couple qui est marié et a un petit garçon du nom de Milann, Nabilla et Thomas Vergara ont confié … [+1157 chars]"}, {"source": {"id": null, "name": "Allocine.fr"}, "author": "Emilie Schneider", "title": "La Fille de d'Artagnan sur Arte : quand Sophie Marceau exige le renvoi du réalisateur - AlloCiné", "description": "Arte diffuse à 20h55 \"La Fille de D'Artagnan\" de Bertrand Tavernier, qui a remplacé au pied levé un autre réalisateur, dont on dit qu'il était trop âgé (84 ans) et en froid avec la star du film. Que s...", "url": "http://www.allocine.fr/article/fichearticle_gen_carticle=18689586.html", "urlToImage": null, "publishedAt": "2020-04-26T17:00:00Z", "content": "Arte diffuse à 20h55 \"La Fille de D'Artagnan\" de Bertrand Tavernier, qui a remplacé au pied levé un autre réalisateur, dont on dit qu'il était trop âgé (84 ans) et en froid avec la star du film. Que s'est-il vraiment passé ?Capture d'écran\r\nEntre deux drames … [+4149 chars]"}, {"source": {"id": null, "name": "Purepeople.com"}, "author": "Olivia Maunoury", "title": "Laeticia Hallyday chante avec Jade et Joy pour célébrer une amie chère - Pure People", "description": "Loin des yeux ne signifie pas loin du coeur. Samedi 25 avril 2020, Laeticia Hallyday, entourée de ses deux filles Jade et Joy, s'est adressée à l'une de ses amies proches sur Instagram, pour son anniversaire. Il s'agit de Sandra Sisley, l'épouse de l'acteur T…", "url": "https://www.purepeople.com/article/laeticia-hallyday-chante-avec-jade-et-joy-pour-celebrer-une-amie-chere_a385829/1", "urlToImage": null, "publishedAt": "2020-04-26T16:07:00Z", "content": "Certaines personnes occupent une place privilégiée dans le coeur de Laeticia Hallyday. Sandra Sisley en fait partie et la veuve de Johnny Hallyday l'a prouvé une nouvelle fois à l'occasion d'une date particulière.\r\nSamedi 25 avril 2020, la femme de l'acteur T… [+1646 chars]"}, {"source": {"id": null, "name": "Allocine.fr"}, "author": "[Url href='https://twitter.com/maxp26']Maximilien Pierrette (@maxp26)[/Url]", "title": "Penny Dreadful : tout ce qu'il faut savoir sur le spin-off City of Angels - AlloCiné", "description": "Quatre ans après la fin de la série, l'univers de \"Penny Dreadful\" fait son retour sur petit écran avec un spin-off appelé \"City of Angels\". Époque, personnages, castings, ambiance… Voici ce qu'il fau...", "url": "http://www.allocine.fr/article/fichearticle_gen_carticle=18689419.html", "urlToImage": null, "publishedAt": "2020-04-26T16:00:00Z", "content": "Quatre ans après la fin de la série, l'univers de \"Penny Dreadful\" fait son retour sur petit écran avec un spin-off appelé \"City of Angels\". Époque, personnages, castings, ambiance Voici ce qu'il faut savoir sur le show écrit et créé par John Logan.Showtime\r\n… [+4363 chars]"}, {"source": {"id": null, "name": "Allocine.fr"}, "author": "Laurent Schenck", "title": "La Guerre des boutons sur France 2 : savez-vous qu'un film concurrent est sorti au même moment ? - AlloCiné", "description": "A l’occasion de la diffusion de \"La Guerre des boutons\" ce soir sur France 2, retour sur la concurrence qu’il y a eu, en 2011, avec \"La Nouvelle Guerre des boutons\", sorti en salles une semaine après...", "url": "http://www.allocine.fr/article/fichearticle_gen_carticle=18689577.html", "urlToImage": null, "publishedAt": "2020-04-26T16:00:00Z", "content": "A loccasion de la diffusion de \"La Guerre des boutons\" ce soir sur France 2, retour sur la concurrence quil y a eu, en 2011, avec \"La Nouvelle Guerre des boutons\", sorti en salles une semaine après le film de Yann Samuell.\r\nLa Guerre des boutons de Yann Samue… [+2538 chars]"}, {"source": {"id": null, "name": "Programme-tv.net"}, "author": "Anne-Laure Deparis", "title": "Karine Ferri \"gâtée\" pour son anniversaire, elle dévoile ce que lui a offert son mari - Télé Loisirs.fr", "description": "Anniversaire confiné mais heureux pour Karine Ferri ce samedi 25 avril 2020. Sur Instagram, l'animatrice de TF1 a montré les cadeaux qu'elle a reçus, notamment de la part de son chéri, le footballeur Yoann Gourcuff.", "url": "https://www.programme-tv.net/news/tv/253631-karine-ferri-gatee-pour-son-anniversaire-elle-devoile-ce-que-lui-a-offert-son-mari/", "urlToImage": null, "publishedAt": "2020-04-26T15:57:54Z", "content": "Comme beaucoup de personnes, c'est en cette période de confinement que Karine Ferri a fêté son anniversaire. Ce samedi 25 avril, l'animatrice de TF1 a en effet célébré ses 38 ans. Et s'il n'était bien évidemment pas question d'inviter la famille et les amis d… [+1577 chars]"}, {"source": {"id": null, "name": "Programme-tv.net"}, "author": "Rime El Himani", "title": "Arielle Dombasle confinée avec Bernard-Henri Lévy : ses rares confidences sur leur vie de couple - Télé Loisirs.fr", "description": "Arielle Dombasle a dévoilé les coulisses de son confinement dans un entretien accordé au Journal du dimanche. La chanteuse et comédienne a préféré rester à Paris avec son mari Bernard-Henri Lévy.", "url": "https://www.programme-tv.net/news/cinema/253630-arielle-dombasle-confinee-avec-bernard-henri-levy-ses-rares-confidences-sur-leur-vie-de-couple/", "urlToImage": null, "publishedAt": "2020-04-26T15:27:48Z", "content": "Arielle Dombasle donne de ses nouvelles. Ce 26 avril, la chanteuse et comédienne sest livrée dans les colonnes du Journal du dimanche. Loccasion den savoir plus sur son confinement avec son époux Bernard-Henri Lévy. Alors que de nombreux Parisiens, à linstar … [+1338 chars]"}, {"source": {"id": null, "name": "Www.rtl.fr"}, "author": null, "title": "VIDÉO - Confinement : le groupe \"Les Goguettes\" cartonne avec leur reprise de \"Vesoul\" - RTL.fr", "description": "VIDÉO - Le groupe qui reprend des chansons pour en faire des parodies, cartonne avec sa reprise de \"Vesoul\".", "url": "https://www.rtl.fr/culture/musique/video-confinement-le-groupe-les-goguette-cartonne-avec-leur-reprise-de-vesoul-7800444478", "urlToImage": null, "publishedAt": "2020-04-26T15:02:00Z", "content": "La vidéo a déjà fait plus de deux millions de vues en seulement 48 heures. Les Goguettes, un groupe de musique qui reprend de chansons très connues pour en faire des parodies, et \"se moquer de l'actualité\", a encore frappé. \r\nCette fois, ce \"trio à quatre\", q… [+739 chars]"}, {"source": {"id": null, "name": "Ldpeople.com"}, "author": null, "title": "Michèle Torr \"dézingue brutalement\" l'épouse de Christophe - LDpeople.com", "description": "Michèle Torr: Suite à la mort de Christophe, survenue le 16 avril dernier à l’âge de 74 ans, deux clans s’opposent de manière assez violente.", "url": "https://www.ldpeople.com/michele-torr-dezingue-brutalement-lepouse-de-christophe-64811", "urlToImage": null, "publishedAt": "2020-04-26T14:55:58Z", "content": "Michèle Torr: Suite à la mort de Christophe, survenue le 16 avril dernier à lâge de 74 ans, deux clans sopposent de manière assez violente. Dun côté Michèle Torr, qui avait partagé la vie de linterprète des « Mots bleus » dans les années 1970 et sa seconde fe… [+6258 chars]"}, {"source": {"id": null, "name": "Bfmtv.com"}, "author": "BFMTV", "title": "Mort de l'écrivain suédois Per Olov Enquist - BFMTV", "description": "Son roman Le médecin personnel du roi lui avait permis de décrocher en 2001 en France le prix du Meilleur livre étranger.", "url": "https://www.bfmtv.com/culture/mort-de-l-ecrivain-suedois-per-olov-enquist-1902013.html", "urlToImage": null, "publishedAt": "2020-04-26T14:28:34Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Mort de Gene Dynarski (Seinfeld, Star Trek) à l’âge de 86 ans - Yahoo Actualités", "description": null, "url": "https://consent.yahoo.com/collectConsent?sessionId=1_cc-session_fd935f06-cc96-4b31-a7ab-eb38bb4c5665&lang=fr-FR&inline=false", "urlToImage": null, "publishedAt": "2020-04-26T14:07:00Z", "content": "Yahoo fait partie de Verizon Media. Cliquez sur J'accepte afin dautoriser Verizon Media et ses partenaires à utiliser des cookies et des technologies similaires pour accéder à votre appareil, utiliser vos données (y compris votre position géographique), compr… [+596 chars]"}, {"source": {"id": null, "name": "Purepeople.com"}, "author": "Emma Vanpoulle", "title": "The Voice 2020 : Nessa éliminée mais déjà sollicitée pour des projets alléchants - Pure People", "description": "À l'issue des ultimes épreuves des K.O. la jeune Nessa a vu son aventure \"The Voice\" toucher à sa fin. Éliminée par Pascal Obispo, la candidate ne retient que du positif de cette expérience sur TF1 et annonce avoir d'ores et déjà de nombreux projets pour la s…", "url": "https://www.purepeople.com/article/the-voice-2020-nessa-eliminee-mais-deja-sollicitee-pour-des-projets-allechants_a385796/1", "urlToImage": null, "publishedAt": "2020-04-26T13:56:00Z", "content": "Samedi 25 avril 2020 avait lieu le dernier épisode des K.O. dans The Voice. C'est Pascal Obispo qui a clôturé cette épreuve de l'aventure en établissant des choix déchirants au sein de son équipe. En effet, le coach a dû se séparer de quatre de ses sept talen… [+1757 chars]"}, {"source": {"id": null, "name": "Nextplz.fr"}, "author": "Lauriane", "title": "Carla Moreau : les internautes la félicitent de son régime très efficace - NextPlz", "description": "Carla Moreau est bien décidée à perdre du poids.Elle profite donc du confinement pour faire du sport, manger plus équilibré et ça se voit !", "url": "https://www.nextplz.fr/telerealite/172119-carla-moreau-internautes-la-felicitent-regime-tres-efficace", "urlToImage": null, "publishedAt": "2020-04-26T13:52:00Z", "content": "Carla Moreau est bien décidée à perdre du poids. Cest une chose sur laquelle la jeune maman complexe. Elle profite donc du confinement pour faire du sport, manger plus équilibré et ça se voit !La preuve en image.\r\nDepuis la naissance de sa fille Ruby, la mars… [+1520 chars]"}, {"source": {"id": null, "name": "Closermag.fr"}, "author": "Clara Carlesimo", "title": "Meghan Markle et le prince Harry : leur participation secrète à un livre explosif sur le Megxit - Closer France", "description": "Désormais installés à Los Angeles après avoir quitté la famille royale britannique, Meghan Markle et le prince Harry vont de nouveau refaire parler d'eux. Selon le Daily Mail, les Sussex ont activement participé à un livre qui sera écrit sur le Megxit...", "url": "https://www.closermag.fr/royautes/meghan-markle-et-le-prince-harry-leur-participation-secrete-a-un-livre-explosif-1106418", "urlToImage": null, "publishedAt": "2020-04-26T13:15:55Z", "content": "Une publication qui promet d'être explosive. Après le départ de Meghan Markle et du prince Harry, la famille royale britannique pensait être débarrassée des rebelles de la Couronne. Mais c'était sans compter la rancune des Sussex. Selon le Daily Mail, les par… [+2783 chars]"}, {"source": {"id": null, "name": "Closermag.fr"}, "author": "La rédaction", "title": "Tom Hanks, guéri du coronavirus : il va aider la science d'une façon très particulière - Closer France", "description": "Première personnalité à avoir contracté le coronavirus, Tom Hanks est désormais guéri. De retour aux Etats-Unis, l’acteur va tenter d’enrayer la pandémie du Covid-19.", "url": "https://www.closermag.fr/people/tom-hanks-gueri-du-coronavirus-il-va-aider-la-science-d-une-facon-tres-particuli-1106382", "urlToImage": null, "publishedAt": "2020-04-26T12:17:35Z", "content": "Tom Hanks et Rita Wilson veulent aider. Au début du mois de mars, l'acteur et son épouse ont été les premières personnalités à expliquer avoir contracté le coronavirus. Confinés en Australie, où Tom Hanks était en tournage, ils ont régulièrement donné de leur… [+2418 chars]"}, {"source": {"id": null, "name": "Europe1.fr"}, "author": "Julien Ricotta", "title": "Alexandra Lamy est confinée avec sa sœur Audrey : \"C’est comme si on était gamines, c’est super\" - Europe1", "description": "Chaque semaine pendant le confinement, Frédéric Taddeï interroge des invités non plus &quot;En Balade&quot;, mais par téléphone, pour leur demander comment ils vivent cette période si particulière. Alexandra Lamy a assuré apprécier la cohabitation avec sa sœu…", "url": "https://www.europe1.fr/culture/alexandra-lamy-est-confinee-avec-sa-soeur-audrey-cest-comme-si-on-etait-gamines-cest-super-3963893", "urlToImage": null, "publishedAt": "2020-04-26T12:17:00Z", "content": "INTERVIEWElles sont toutes les deux actrices de renom et passent leur confinement ensemble. Alexandra Lamy vit depuis plusieurs semaines avec sa sur Audrey, dans sa maison située dans les Cévennes. Et visiblement, la cohabitation se passe bien. \"Cest comme si… [+2123 chars]"}, {"source": {"id": null, "name": "Programme-tv.net"}, "author": "Anne-Laure Deparis", "title": "Les 12 Coups de midi : Eric franchit un nouveau cap et menace Christian Quesada - Télé Loisirs.fr", "description": "Rien ne semble pouvoir arrêter Eric dans Les Douze Coups de midi. L'actuel champion de jeu de Jean-Luc Reichmann a franchi un nouveau palier dans l'émission diffusée ce dimanche 26 avril sur TF1.", "url": "https://www.programme-tv.net/news/tv/253622-les-12-coups-de-midi-eric-franchit-un-nouveau-cap-et-menace-christian-quesada/", "urlToImage": null, "publishedAt": "2020-04-26T11:31:08Z", "content": "Mais jusqu'où ira Eric, l'actuel grand champion desDouze Coups de midi ? Depuis son arrivée dans le jeu de Jean-Luc Reichmann sur TF1 le 29 novembre dernier, le père de famille breton effectuait ce dimanche 26 avril sa 159e participation dans l'émission. Et l… [+1753 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "20 Minutes avec agences", "title": "VIDEO. Val Kilmer se souvient de sa rivalité avec Tom Cruise sur le tournage de « Top Gun » - 20 Minutes", "description": "Mais les deux acteurs ont été heureux de se retrouver sur le tournage de «Top Gun : Maverick»", "url": "https://www.20minutes.fr/arts-stars/people/2766491-20200426-video-val-kilmer-souvient-rivalite-tom-cruise-tournage-top-gun", "urlToImage": null, "publishedAt": "2020-04-26T11:19:21Z", "content": "L'acteur Val Kilmer Zuma / Starface\r\nSur le tournage de Top Gun, les acteurs étaient divisés en deux camps : celui de Val Kilmer, et celui de \r\nTom Cruise. En fait, la rivalité entre Iceman et Maverick se retrouvait en coulisse avec deux acteurs aux caractère… [+1267 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "Jérôme Gicquel", "title": "Coronavirus en Bretagne : Le festival Les Vieilles Charrues espère accueillir Céline Dion en 2021 - 20 Minutes", "description": "La chanteuse a annoncé qu’elle reportait toutes les dates de sa tournée européenne", "url": "https://www.20minutes.fr/arts-stars/culture/2768007-20200426-coronavirus-bretagne-festival-vieilles-charrues-espere-accueillir-celine-dion-2021", "urlToImage": null, "publishedAt": "2020-04-26T11:18:08Z", "content": "Céline Dion en concert à Londres, le 5 juillet 2019. NLC/Neil Lupin/WENN/SIPA\r\nCest la mort dans lâme que les organisateurs des Vieilles Charrues ont annoncé le 15 avril lannulation de lédition 2020 qui devait se tenir du 16 au 19 juillet à Carhaix (Finistère… [+1616 chars]"}, {"source": {"id": null, "name": "Tirage-gagnant.com"}, "author": "Nicolas Robineau", "title": "Résultat Keno du dimanche 26 avril 2020 : tirage du midi en ligne - Tirage Gagnant", "description": "Les tirages Keno FDJ de ce dimanche 26 avril 2020 ✅ Résultats disponibles à 13h45 (midi) et 21h00 (soir)", "url": "https://tirage-gagnant.com/46508/resultat-keno-dimanche-26-avril-2020/", "urlToImage": null, "publishedAt": "2020-04-26T10:43:00Z", "content": "Les tirages du Keno FDJ de ce dimanche 26 avril 2020 sont être tiré au sort comme chaque jour de la semaine. Le week-end, ne modifie pas les règles du jeu Keno et le jackpot maximum que vous pourrez remporter est toujours de 100’000/an à vie (si vous jouez un… [+1830 chars]"}, {"source": {"id": null, "name": "Nextplz.fr"}, "author": "Lauriane", "title": "Iris Mittenaere tacle Kev Adams avec des confidences très intimes - NextPlz", "description": "Iris Mittenaere s’est lâchée dans un live avec Jarry. L’ancienne Miss Universe 2016 a taclé ses ex en révélant des détails très intimes.", "url": "https://www.nextplz.fr/people/172079-iris-mittenaere-tacle-kev-adams-confidences-tres-intimes", "urlToImage": null, "publishedAt": "2020-04-26T10:36:00Z", "content": "Iris Mittenaere sest complètement lâchée dans le live Instagram de lhumoriste Jarry. Sans les nommer, Lancienne Miss Universe 2016 a taclé ses ex en révélant des détails très intimes.\r\nIris Mittenaere trouve le confinement long. Pourtant, elle le passe dans s… [+1566 chars]"}, {"source": {"id": null, "name": "13or-du-hiphop.fr"}, "author": "Squat", "title": "Sniper a affronté la Fonky Family lors d’un battle historique en live sur Instagram [Vidéo] - 13OR-du-HipHop.fr", "description": "Annoncé cette semaine sur les réseaux sociaux, le battle opposant les deux groupes légendaires du rap français, Sniper et Fonky Family a eu lieu ce samedi soir en live sur Instagram réunissant le duo Parisien, Aketo et Tunisiano face au rappeur Marseillais, S…", "url": "https://www.13or-du-hiphop.fr/2020/04/26/sniper-a-affronte-la-fonky-family-lors-dun-battle-historique-en-live-sur-instagram-video/", "urlToImage": null, "publishedAt": "2020-04-26T10:34:46Z", "content": "Annoncé cette semaine sur les réseaux sociaux, le battle opposant les deux groupes légendaires du rap français, Sniper et Fonky Family a eu lieu ce samedi soir en live sur Instagram réunissant le duo Parisien, Aketo et Tunisiano face au rappeur Marseillais, S… [+1560 chars]"}, {"source": {"id": null, "name": "Www.rtl.fr"}, "author": null, "title": "Confinement : aidez les abeilles en plantant des fleurs mellifères - RTL.fr", "description": "Dimanche 26 avril, Juliette Dumas, la coach bien être de RTL, nous invite à nous confiner responsable.", "url": "https://www.rtl.fr/culture/arts-spectacles/confinement-aidez-les-abeilles-en-plantant-des-fleurs-melliferes-7800443620", "urlToImage": null, "publishedAt": "2020-04-26T10:06:00Z", "content": "Dimanche 26 avril, Juliette Dumas, la coach bien être de RTL, nous invite à nous confiner responsable. \"J'ai rencontré de loin Antoine Lamy, qui travaille à l'Observatoire français d'apidologie, là où étudie le comportement des abeilles. Grâce à elle, 30% de … [+725 chars]"}, {"source": {"id": null, "name": "Bfmtv.com"}, "author": "BFMTV", "title": "Les pâtissiers d'Elizabeth II dévoilent la recette de ses cupcakes d'anniversaire au chocolat - BFMTV people", "description": "Le palais de Buckingham a partagé une recette permettant de reproduire les adorables gâteaux imaginés pour le 94e anniversaire de la reine d'Angleterre.", "url": "https://people.bfmtv.com/tetes-couronnees/les-patissiers-d-elizabeth-ii-devoilent-la-recette-de-ses-cupcakes-d-anniversaire-au-chocolat-1901627.html", "urlToImage": null, "publishedAt": "2020-04-26T09:49:00Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "PODCAST. L’acteur Bernard Menez est remonté contre « le pouvoir qui ne fait que de la surcommunication » - Ouest-France", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMinwFodHRwczovL3d3dy5vdWVzdC1mcmFuY2UuZnIvc2FudGUvdmlydXMvY29yb25hdmlydXMvcG9kY2FzdC1sLWFjdGV1ci1iZXJuYXJkLW1lbmV6LWVzdC1yZW1vbnRlLWNvbnRyZS1sZS1wb3V2b2lyLXF1aS1uZS1mYWl0LXF1ZS1kZS1sYS1zdXJjb21tdW5pY2F0aW9uLTY4MTc5MTPSAZ8BaHR0cHM6Ly9hbXAub3Vlc3QtZnJhbmNlLmZyL3NhbnRlL3ZpcnVzL2Nvcm9uYXZpcnVzL3BvZGNhc3QtbC1hY3RldXItYmVybmFyZC1tZW5lei1lc3QtcmVtb250ZS1jb250cmUtbGUtcG91dm9pci1xdWktbmUtZmFpdC1xdWUtZGUtbGEtc3VyY29tbXVuaWNhdGlvbi02ODE3OTEz?oc=5", "urlToImage": null, "publishedAt": "2020-04-26T09:45:02Z", "content": null}, {"source": {"id": null, "name": "Nextplz.fr"}, "author": "Lauriane", "title": "Julien Tanti : très affecté par le confinement, il se confie - NextPlz", "description": "Julien Tanti n'a pas le moral au beau fixe. Sur Instagram, le candidat de LMAC partage un post très nostalgique sur le confinement.", "url": "https://www.nextplz.fr/telerealite/172072-julien-tanti-affecte-par-confinement-il-se-confie", "urlToImage": null, "publishedAt": "2020-04-26T09:40:00Z", "content": "Julien Tanti a beau attendre un deuxième enfant, son moral ne semble pas au beau fixe. Sur Instagram, le candidat des Marseillais aux Caraïbes se livre et partage sa réflexion sur le confinement.\r\nCes derniers temps, le couple Julien Tanti et Manon Marsault n… [+1701 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Cet ancien finaliste de Top Chef veut nous faire sortir de la crise en consommant mieux - LeHuffPost", "description": "Ancien finaliste de \"Top Chef\", le restaurateur a publié un manifeste pour convaincre ses confrères et consommateurs d'acheter et produire de manière plus re...", "url": "https://www.youtube.com/watch?v=3tWCclfAkXs", "urlToImage": null, "publishedAt": "2020-04-26T09:23:43Z", "content": "Ancien finaliste de \"Top Chef\", le restaurateur a publié un manifeste pour convaincre ses confrères et consommateurs d'acheter et produire de manière plus responsable."}, {"source": {"id": null, "name": "Melty.fr"}, "author": "Mélanie Tillement", "title": "Avengers Endgame : Ty Simpkins (Harley Keener) révèle comment Marvel Studios a gardé les funérailles de Tony Stark secrètes - melty", "description": "Ty Simpkins révèle le nom de code employé par les studios Marvel pour désigner les funérailles de Tony Stark !", "url": "https://www.melty.fr/avengers-endgame-ty-simpkins-harley-keener-revele-comment-marvel-studios-a-garde-les-funerailles-de-tony-stark-secretes-a717468.html", "urlToImage": null, "publishedAt": "2020-04-26T09:00:49Z", "content": "L'un des secrets les mieux gardés du MCU est la séquence des funérailles de Tony Stark à la fin d'Avengers Endgame. Une scène pendant laquelle Harley avaient des pensées émues au sujet de son super-héros préféré... Mais pour l'acteur qui incarne l'ancien prot… [+1533 chars]"}, {"source": {"id": null, "name": "Leparisien.fr"}, "author": null, "title": "Programme TV du dimanche 26 avril : notre sélection - Le Parisien", "description": "Un Dracula papy gâteau, la fille de d’Artagnan qui croise le fer, un duel en cuisine inénarrable et un corniaud qui l’est tout autant... on", "url": "http://www.leparisien.fr/culture-loisirs/tv/programme-tv-du-dimanche-26-avril-notre-selection-26-04-2020-8305956.php", "urlToImage": null, "publishedAt": "2020-04-26T08:32:00Z", "content": "A 21h05 sur TF1. Décidément, Mavis, la fille de Dracula, ne ménage pas son père : dans « Hôtel Transylvanie » (2012), elle lui avait déjà fait le sale coup d'épouser un humain. Dans cette suite, elle accouche d'un petit garçon, qui semble plus disposé à deven… [+6043 chars]"}, {"source": {"id": null, "name": "Programme-tv.net"}, "author": "Anne-Laure Deparis", "title": "Jérôme Anthony sur la prolongation de Tous en cuisine : \"Plus je serai confiné chez moi, plus je serai content - Télé Loisirs.fr", "description": "Jérôme Anthony faisait partie des invités d'On refait la télé ce samedi 25 avril sur RTL. Celui qui coanime Tous en cuisine chaque soir avec Cyril Lignac a évoqué la possible prolongation, au-delà du confinement, de l'émission qui cartonne en access sur M6.", "url": "https://www.programme-tv.net/news/tv/253618-jerome-anthony-sur-la-prolongation-de-tous-en-cuisine-plus-je-serai-confine-chez-moi-plus-je-serai-content-video/", "urlToImage": null, "publishedAt": "2020-04-26T08:31:02Z", "content": "C'est l'émission phare de cette période de confinement. Lancée le samedi 21 mars dernier juste avant de s'installer en access du lundi au vendredi sur M6, Tous en cuisine est devenue le rendez-vous incontournable de nombreux Français. Jusqu'à 2,5 millions de … [+1800 chars]"}, {"source": {"id": null, "name": "Ozap.com"}, "author": "Florian Guadalupe", "title": "Confinement : Stéphane Bern détaille la soirée qui remplacera l'Eurovision sur France 2 - Ozap", "description": "L'animateur était l'invité hier de l'émission \"On refait la télé\" présentée par Eric Dussart et Jade sur RTL.", "url": "https://www.ozap.com/actu/confinement-stephane-bern-detaille-la-soiree-qui-remplacera-l-eurovision-sur-france-2/592351", "urlToImage": null, "publishedAt": "2020-04-26T08:27:02Z", "content": "Une soirée spéciale dédiée au concours européen. Le 18 mars dernier, l'Union Européenne de Radio-télévision avait officialisé l'annulation de la prochaine édition de l'Eurovision, qui devait se tenir le 16 mai prochain aux Pays-Bas, en raison de la crise sani… [+1471 chars]"}, {"source": {"id": null, "name": "Bfmtv.com"}, "author": "BFMTV", "title": "Grimé en docteur Fauci, Brad Pitt se moque des points presse de Trump - BFMTV people", "description": "L'acteur américain a profité d'une édition spéciale à domicile du Saturday Night Live pour pointer du doigt les nombreuses fausses informations, énoncées par le président des Etats-Unis durant la crise du coronavirus.", "url": "https://people.bfmtv.com/actualite-people/grime-en-docteur-fauci-brad-pitt-se-moque-des-points-presse-de-trump-1901563.html", "urlToImage": null, "publishedAt": "2020-04-26T08:15:00Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "FORTNITE : le concert de TRAVIS SCOTT dans le jeu ! - JeuxActu", "description": "Les Meilleurs Jeux ? C'est ici ➜ https://www.youtube.com/playlist?list=PLwue_DlBktRNRJJL7w8KOwOnSJx9XkGgC FORTNITE : le concert de TRAVIS SCOTT dans le jeu !...", "url": "https://www.youtube.com/watch?v=xY2KqzUd49s", "urlToImage": null, "publishedAt": "2020-04-26T08:00:30Z", "content": "Les Meilleurs Jeux ? C'est ici https://www.youtube.com/playlist?list...\r\nFORTNITE : le concert de TRAVIS SCOTT dans le jeu !© 2020 - JEUXACTU / Epic Games"}, {"source": {"id": null, "name": "Programme-tv.net"}, "author": "Katia DE LA BALLINA", "title": "Les Mystères de l’amour (Spoilers) : Cathy et Béatrice envisagent le meurtre, José jette son dévolu sur Lou da - Télé Loisirs.fr", "description": "C'est le jour des mauvaises nouvelles pour Stéphanie ainsi que pour Cathy et Béatrice, qui envisagent de commettre le pire avec Emilie. José flirte avec Lou.", "url": "https://www.programme-tv.net/news/series-tv/253549-les-mysteres-de-lamour-spoilers-cathy-et-beatrice-envisagent-le-meurtre-jose-jette-son-devolu-sur-lou-dans-lepisode-de-dimanche-26-avril/", "urlToImage": null, "publishedAt": "2020-04-26T08:00:00Z", "content": "Dimanche 26 avril dans Les Mystères de l'amour (dont le tournage devrait reprendre le 12 mai) José (Philippe Vasseur) retrouve Béné (Laure Guibert) au petit déjeuner. Ils se remémorent, attendris, leurs souvenirs, avant dêtre interrompus par Manuela. Toujours… [+3271 chars]"}, {"source": {"id": null, "name": "Parismatch.com"}, "author": "Paris Match", "title": "Astrid Veillon : \"Enfin la nature respire !\" - Paris Match", "description": "Depuis trois saisons, Astrid Veillon incarne Léa Soler dans la série «Tandem» diffusée sur France 3. L’actrice dévoile aujourd’hui son quotidien en...", "url": "https://www.parismatch.com/People/Astrid-Veillon-Enfin-la-nature-respire-1683220", "urlToImage": null, "publishedAt": "2020-04-26T07:03:36Z", "content": "Depuis trois saisons, Astrid Veillon incarne Léa Soler dans la série «Tandem» diffusée sur France 3. Lactrice dévoile aujourdhui son quotidien en plein confinement et évoque quelques-uns de ses secrets. Paris Match. Où êtes-vous confinée ?Astrid Veillon. Je s… [+3658 chars]"}, {"source": {"id": null, "name": "Allocine.fr"}, "author": "Jérémie Dunand [Url href='https://twitter.com/JejeSeries'](@JejeSeries)[/Url]", "title": "The Wall sur 13ème Rue : que vaut la série dans la veine de Broadchurch et The Killing ? - AlloCiné", "description": "13ème Rue lance ce soir \"The Wall\", une nouvelle série québécoise sur fond de meurtres dans une colonie minière du Grand Nord canadien. Ce polar glacé, taillé pour les amateurs de \"Broadchurch\" ou \"Fo...", "url": "http://www.allocine.fr/article/fichearticle_gen_carticle=18689595.html", "urlToImage": null, "publishedAt": "2020-04-26T07:00:00Z", "content": "13ème Rue lance ce soir \"The Wall\", une nouvelle série québécoise sur fond de meurtres dans une colonie minière du Grand Nord canadien. Ce polar glacé, taillé pour les amateurs de \"Broadchurch\" ou \"Fortitude\", vaut-il le détour ? Voilà notre avis.Pixcom\r\nLa c… [+3589 chars]"}, {"source": {"id": null, "name": "Forumopera.com"}, "author": null, "title": "At Home Gala (streaming) - New York - Critique - Forum Opéra", "description": "Contraint comme tous les théâtres de la planète à baisser le rideau, New York propose le premier e-gala d’opéra jamais organisé. L’instant est historique. La réponse du Metropolitan Opera à la pandémie de coronavirus confirme la pole position de l’institution…", "url": "https://www.forumopera.com/at-home-gala-streaming-new-york-le-grand-zapping-streaming", "urlToImage": null, "publishedAt": "2020-04-26T06:20:47Z", "content": "Contraint comme tous les théâtres de la planète à baisser le rideau, New York propose le premier e-gala dopéra jamais organisé. Linstant est historique. La réponse du Metropolitan Opera à la pandémie de coronavirus confirme la pole position de linstitution en… [+5851 chars]"}, {"source": {"id": null, "name": "Barbanews.com"}, "author": null, "title": "Laurent Ournac garde des mauvais souvenir - Ma fille a dit au pédiatre qu'elle se trouvait un peu grosse ! - barbanews", "description": "Laurent Ournac est un acteur très connu des français grâce à la série télévisée Camping Paradis qui cartonne depuis 2006. Il y incarne le personnage principal. Il avait été repéré...", "url": "https://www.barbanews.com/peoples/laurent-ournac-garde-des-mauvais-souvenir-ma-fille-a-dit-au-pediatre-quelle-se-trouvait-un-peu-grosse/", "urlToImage": null, "publishedAt": "2020-04-26T05:51:00Z", "content": "Laurent Ournac est un acteur très connu des français grâce à la série télévisée Camping Paradis qui cartonne depuis 2006. Il y incarne le personnage principal. Il avait été repéré dans lémission « Mon incroyable fiancé » qui a dailleurs battu des records daud… [+2502 chars]"}, {"source": {"id": null, "name": "Sortiraparis.com"}, "author": null, "title": "Que faire aujourd'hui, dimanche 26 avril 2020, en restant chez soi - sortiraparis", "description": "Même en restant chez soi, il y a beaucoup de choses à faire pour s'occuper, se cultiver ou s'instruire. Retrouvez chaque jour notre sélection de choses à faire pendant le confinement.", "url": "https://www.sortiraparis.com/actualites/a-la-maison/guides/197654-que-faire-aujourd-hui-dimanche-26-avril-2020-en-restant-chez-soi", "urlToImage": null, "publishedAt": "2020-04-26T05:24:00Z", "content": "Par\r\nJulie M.· Photos par\r\nMy B.· Publié le 26 avril 2020 à 07h24\r\n· Mis à jour le 26 avril 2020 à 07h58\r\nMême en restant chez soi, il y a beaucoup de choses à faire pour s'occuper, se cultiver ou s'instruire. Retrouvez chaque jour notre sélection de choses à… [+145013 chars]"}, {"source": {"id": null, "name": "Www.rtl.fr"}, "author": null, "title": "Déconfinement : les cinémas pourront-ils rouvrir et quand ? - RTL.fr", "description": "Pierre Lescure a fait le point sur les pistes envisagées pour rouvrir les cinémas après le déconfinement.", "url": "https://www.rtl.fr/culture/cine-series/deconfinement-les-cinemas-pourront-ils-rouvrir-et-quand-7800438390", "urlToImage": null, "publishedAt": "2020-04-26T05:22:00Z", "content": "Alors que le déconfinement prévu le 11 mai approche, les salles de cinéma, elles, ne rouvriront pas à cette date mais potentiellement au début de l'été. La Fédération des exploitants de cinéma et le Centre national du cinéma travaillent conjointement sur cett… [+1267 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "Arthur RainBot", "title": "Horoscope chinois du Dimanche 26 avril 2020 - 20minutes.fr", "description": "Découvrez l’horoscope chinois de 20 Minutes du 26/04/2020", "url": "https://www.20minutes.fr/horoscope-quotidien-chinois/2761003-20200415-horoscope-chinois-du-dimanche-26-avril-2020", "urlToImage": null, "publishedAt": "2020-04-26T04:05:02Z", "content": "Découvrez l'horoscope quotidien chinois DR\r\nCôté amour, vous donnerez la priorité à votre vie de famille. Vous voudrez vous sentir proche de vos enfants et de votre partenaire. Pour cela, organisez des sorties en commun. Concernant l'argent et le travail, vot… [+8608 chars]"}, {"source": {"id": "le-monde", "name": "Le Monde"}, "author": "Martine Delahaye", "title": "« Dix petits nègres » adapté en thriller sans enquêteur - Le Monde", "description": "TF1 diffuse, trois ans après sa sortie sur la BBC, l’une des meilleures versions du classique d’Agatha Christie.", "url": "https://www.lemonde.fr/culture/article/2020/04/26/dix-petits-negres-adapte-en-thriller-sans-enqueteur_6037819_3246.html", "urlToImage": null, "publishedAt": "2020-04-25T22:18:33Z", "content": "Maeve Dermody dans ladaptation des « Dix petits nègres » réalisée par Sarah Phelps. 20TH CENTURY FOX/TF1\r\nTF1 SÉRIES FILMS - DIMANCHE 26 AVRIL À 21 H 00 - TÉLÉFILM\r\n« A Christie for Christmas », autrement dit « un Agatha Christie pour Noël », fut longtemps le… [+3387 chars]"}, {"source": {"id": null, "name": "Lejdd.fr"}, "author": "Charlotte Langrand", "title": "Philippe Etchebest alerte sur le sort des restaurateurs : \"Nous sommes les globules rouges de l'économie\" - Le Journal du dimanche", "description": "Le chef Philippe Etchebest alerte sur le &quot;cauchemar national&quot; vécu par les restaurateurs. Il propose que les assureurs soient les &quot;collecteurs&quot; et redistributeurs d'une aide financière d'un montant de 14 milliards d'euros pour les professi…", "url": "https://www.lejdd.fr/Societe/philippe-etchebest-alerte-sur-le-sort-des-restaurateurs-nous-sommes-les-globules-rouges-de-leconomie-3964371", "urlToImage": null, "publishedAt": "2020-04-25T20:53:24Z", "content": "Philippe Etchebest, chef du Quatrième Mur à Bordeaux et juré de lémission Top Chef, a participé à la réunion des restaurateurs avec Emmanuel Macron vendredi dernier. Le président de la République a donné un cap, annonçant une nouvelle réunion fin mai pour dét… [+3920 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Mariage de Kate Middleton et William : ce que le marié et son frère Harry ont tenté de cacher - Yahoo Actualités", "description": null, "url": "https://consent.yahoo.com/collectConsent?sessionId=1_cc-session_39903637-2103-49da-8f6f-783b60d25484&lang=fr-FR&inline=false", "urlToImage": null, "publishedAt": "2020-04-25T19:50:00Z", "content": "Yahoo fait partie de Verizon Media. Cliquez sur J'accepte afin dautoriser Verizon Media et ses partenaires à utiliser des cookies et des technologies similaires pour accéder à votre appareil, utiliser vos données (y compris votre position géographique), compr… [+596 chars]"}, {"source": {"id": null, "name": "Letribunaldunet.fr"}, "author": "https://www.facebook.com/letribunaldunet/, Salomee", "title": "Un cinéma parisien projette des films sur les murs de la capitale ! - Tribunal Du Net", "description": "Le cinéma de La Clef a offert une projection d'un film emblématique de l'histoire du cinéma sur un mur de la capitale.", "url": "http://www.letribunaldunet.fr/culture/cinema-parisien-projette-films-sur-murs-capitale.html", "urlToImage": null, "publishedAt": "2020-04-25T17:41:59Z", "content": "Le cinéma parisien La Clef a offert une projection d’un film emblématique de l’histoire du cinéma« La nuit du chasseur » de Charles Laughton, sur un mur de la capitale. Ce petit cinéma tente de faire profiter les habitants confinés du quartier et de continuer… [+3214 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Comment Kanye West est devenu milliardaire... avec Yeezy, sa marque de sneakers - Le Parisien", "description": "Rappeur unanimement salué par la critique parmi les plus gros vendeurs de disques et les plus récompensés, Kanye West ne doit pas son nouveau statut de milli...", "url": "https://www.youtube.com/watch?v=4IS7IfoHPnE", "urlToImage": null, "publishedAt": "2020-04-25T17:39:02Z", "content": null}, {"source": {"id": null, "name": "My-angers.info"}, "author": "La rédaction", "title": "E-Quinté. Le Prix Drôle de Farce ce dimanche 26 avril 2020 - Angers Info", "description": "Direction Solvalla , ce dimanche 12 avril 2020 pour le e-Tiercé-Quarté-Quinté + .Dans cette épreuve, le Prix Drôle de Farce s’affronteront 12 partants.", "url": "https://www.my-angers.info/04/25/e-quinte-le-prix-drole-de-farce-ce-dimanche-26-avril-2020/87694", "urlToImage": null, "publishedAt": "2020-04-25T15:04:29Z", "content": "Direction Solvalla , ce dimanche 12 avril 2020 pour le e-Tiercé-Quarté-Quinté + .Dans cette épreuve, le Prix Drôle de Farce saffronteront 12 partants. La course sera disputée sur 2140 mètres, et dotée de 8108\r\nRendez-vous sur l’hippodrome de Solvalla (Suède),… [+2013 chars]"}, {"source": {"id": null, "name": "Bfmtv.com"}, "author": "BFMTV", "title": "Mort de l'acteur Bruce Allpress, vu dans Le Seigneur des Anneaux - BFMTV.COM", "description": "L'acteur, âgé de 89 ans, a incarné le personnage d'Aldor dans Le Seigneur des anneaux : Les Deux Tours, sorti en 2002.", "url": "https://people.bfmtv.com/cinema/mort-de-l-acteur-bruce-allpress-vu-dans-le-seigneur-des-anneaux-1900793.html", "urlToImage": null, "publishedAt": "2020-04-25T14:49:20Z", "content": null}, {"source": {"id": null, "name": "Nextplz.fr"}, "author": "Lauriane", "title": "Alix et Benjamin Samat (LMAC) n’ont pas rompu à leur retour en France - NextPlz", "description": "Alix et Benjamin Samat, ne sont plus ensemble, mais ils n’ont pas immédiatement rompu après leur retour à Marseille. Alix raconte sa version.", "url": "https://www.nextplz.fr/telerealite/172026-alix-benjamin-samat-lmac-nont-pas-rompu-retour-france", "urlToImage": null, "publishedAt": "2020-04-25T13:03:00Z", "content": "Bien que les deux candidats des Marseillais aux Caraïbes, Alix et Benjamin Samat, ne soient plus ensemble, ils nont pas immédiatement rompu après leur retour à Marseille. Alix a mis les choses au clair sur ce quil sest exactement passé.\r\nLa saison 9 des Marse… [+1691 chars]"}, {"source": {"id": null, "name": "Programme-tv.net"}, "author": "Rime El Himani", "title": "Tout le monde veut prendre sa place : Nagui amusé par la mésaventure d’une candidate tête en l’air (VIDEO) - Télé Loisirs.fr", "description": "Les candidats de Tout le monde veut prendre sa place ont des anecdotes toutes plus drôles les unes que les autres. La preuve, une nouvelle fois, avec Marie-Aline, une participante victime de trous de mémoire.", "url": "https://www.programme-tv.net/news/tv/253605-tout-le-monde-veut-prendre-sa-place-nagui-amuse-par-la-mesaventure-dune-candidate-tete-en-lair-video/", "urlToImage": null, "publishedAt": "2020-04-25T12:11:07Z", "content": "Après Noubliez pas les paroles, cest au tour de Tout le monde veut prendre sa place dêtre rediffusé sur France 2. Depuis le lundi 20 avril, les fidèles du jeu de Nagui peuvent revoir le parcours de la super championne Marie-Christine, qui avait éliminée avec … [+1892 chars]"}, {"source": {"id": null, "name": "Purepeople.com"}, "author": "Claire Ageef-Legrand", "title": "Jenifer : Qui sont les hommes de sa vie ? - Pure People", "description": "Jenifer est devenue une artiste incontournable de la scène musicale française. Côté vie privée, la chanteuse est maman de deux garçons : Aaron et Joseph. Désormais mariée à Ambroise, la jeune femme a vécu plusieurs histoires d'amour avant de trouver l'homme d…", "url": "https://www.purepeople.com/article/jenifer-qui-sont-les-hommes-de-sa-vie_a380060/1", "urlToImage": null, "publishedAt": "2020-04-25T11:18:00Z", "content": "Révélée dans l'émission Star Academy en 2001, Jenifer est devenue une figure emblématique de la chanson française. Charmeuse et pétillante, la belle brune a rencontré plusieurs fois l'amour tout au long de son parcours dans la musique. Malgré quelques décepti… [+3196 chars]"}, {"source": {"id": null, "name": "Bfmtv.com"}, "author": "BFMTV", "title": "Ces nouveaux romans d'auteurs à succès que vous pourrez (enfin) dévorer après le confinement - BFMTV", "description": "Du dernier livre de Joël Dicker à celui de Guillaume Musso, découvrez les dates auxquelles seront publiés les best-sellers de l'été.", "url": "https://www.bfmtv.com/culture/ces-nouveaux-romans-d-auteurs-a-succes-que-vous-pourrez-enfin-devorer-apres-le-confinement-1900556.html", "urlToImage": null, "publishedAt": "2020-04-25T11:07:43Z", "content": null}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "B.Ch.", "title": "Mick Jagger et Paul McCartney rejouent (pour rire) la guerre entre Beatles et Rolling Stones - 20 Minutes", "description": "Les deux chanteurs se répondent par médias interposés sur la question de la supériorité de leurs groupes respectifs", "url": "https://www.20minutes.fr/arts-stars/culture/2767647-20200425-mick-jagger-paul-mccartney-rejouent-rire-guerre-entre-beatles-rolling-stones", "urlToImage": null, "publishedAt": "2020-04-25T10:51:33Z", "content": "Paul McCartney et Mick Jagger en 2011 à New York Richard Young / Rex Fea/REX/SIPA\r\nPaul McCartney et Mick Jagger relancent \r\n la polémique la plus \r\nvive des dernières décennies : plutôt Beatles ou Rolling Stones? Alors bien sûr, cest pour rire, bien sûr, ils… [+1575 chars]"}, {"source": {"id": null, "name": "Metalzone.fr"}, "author": "Adrien Duffour", "title": "Nightwish au sommet des charts avec Human. :II: Nature. (dans le Top 10 dans plus d’une douzaine de ... - MetalZone", "description": "Le nouvel album de Nightwish, Human. :II : Nature., a fait des débuts en force dans le Top 10 dans plus d'une douzaine de pays, dont la Finlande, l'Allemagne, le Canada, l'Autriche, la Hongrie et la Suisse. Human. :II: Nature. est un double album. Il contient…", "url": "https://www.metalzone.fr/news/132747-nightwish-human-ii-nature-charts/", "urlToImage": null, "publishedAt": "2020-04-25T10:44:37Z", "content": "Le nouvel album de Nightwish, Human. :II : Nature., a fait des débuts en force dans le Top 10 dans plus d’une douzaine de pays, dont la Finlande, l’Allemagne, le Canada, l’Autriche, la Hongrie et la Suisse.\r\nHuman. :II: Nature. est un double album. Il contien… [+863 chars]"}, {"source": {"id": null, "name": "Zone-turf.fr"}, "author": null, "title": "Quinté plus PMU : Vine Vision se retrouve bien placé - Quinté+ - zone-turf.fr", "description": "Quinté plus PMU : Vine Vision se retrouve bien placé Troisième dans un très bon temps sur le parcours qui nous intéresse, Vine Vision (5) aura notre …", "url": "https://www.zone-turf.fr/quinte/quinte-plus-pmu-vine-vision-se-retrouve-bien-place-104694.html", "urlToImage": null, "publishedAt": "2020-04-25T09:30:00Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Mort de Christophe : pourquoi sa femme Véronique refuse d’évoquer le coronavirus - Yahoo Actualités", "description": null, "url": "https://consent.yahoo.com/collectConsent?sessionId=1_cc-session_5d2ad7e8-5a62-4b53-a836-09c96b9bec45&lang=fr-FR&inline=false", "urlToImage": null, "publishedAt": "2020-04-25T09:22:00Z", "content": "Yahoo fait partie de Verizon Media. Cliquez sur J'accepte afin dautoriser Verizon Media et ses partenaires à utiliser des cookies et des technologies similaires pour accéder à votre appareil, utiliser vos données (y compris votre position géographique), compr… [+596 chars]"}, {"source": {"id": null, "name": "Allocine.fr"}, "author": "Mégane Choquet", "title": "Marvel : nouvelles dates pour les suites de Spider-Man, Doctor Strange et Thor - AlloCiné", "description": "Après les sorties repoussées de Black Widow et The Eternals, d’autres films Marvel voient leur sortie décalée en raison de l’épidémie de coronavirus. Cette décision concerne notamment les films Spider...", "url": "http://www.allocine.fr/article/fichearticle_gen_carticle=18689624.html", "urlToImage": null, "publishedAt": "2020-04-25T09:15:00Z", "content": "Après les sorties repoussées de Black Widow et The Eternals, dautres films Marvel voient leur sortie décalée en raison de lépidémie de coronavirus. Cette décision concerne notamment les films Spider-Man et le sequel de Doctor Strange.Sony Pictures\r\nEn raison … [+1642 chars]"}, {"source": {"id": null, "name": "Letribunaldunet.fr"}, "author": "https://www.facebook.com/letribunaldunet/, Jeanne", "title": "« Il était insupportable… » : Nathalie Marquay révèle avoir été harcelée par un célèbre homme politique - Tribunal Du Net", "description": "Nathalie Marquay s'est confiée dans un live Instagram ce mercredi 22 avril. Elle confie avoir été harcelée par un homme politique.", "url": "http://www.letribunaldunet.fr/people/insupportable-nathalie-marquay-revele-avoir-harcelee-celebre-homme-politique.html", "urlToImage": null, "publishedAt": "2020-04-25T08:47:06Z", "content": "Dans un live Instagram présenté par Sylvie Tellier, Nathalie Marquay qui était invitée, s’est laissé aller à quelques confidences. Elle a avoué avoir été harcelée pendant plusieurs mois par un célèbre homme politique dont elle souhaite taire le nom.\r\n&gt;&gt;… [+1768 chars]"}, {"source": {"id": null, "name": "Jeuxactu.com"}, "author": null, "title": "Tyler Rake 2 : une suite est-elle possible ? Qu'arrive-t-il à Chris Hemsworth ? (Extraction 2) - FilmsActu", "description": "Attention spoilers ! La fin de Tyler Rake (Extraction) est-elle définitive ? Un Tyler Rake 2 est-il possible ? On a pu poser la question au réalisateur Sam Hargrave.", "url": "https://cinema.jeuxactu.com/news-cinema-tyler-rake-2-une-suite-de-prevu-qu-arrive-t-il-a-chris-hemsworth-extraction-33041.htm", "urlToImage": null, "publishedAt": "2020-04-25T07:34:01Z", "content": "Attention spoilers ! La fin de Tyler Rake (Extraction) est-elle définitive ? Un Tyler Rake 2 est-il possible ? On a pu poser la question au réalisateur Sam Hargrave.\r\nPourrait-il y avoir une suite à Tyler Rake ?Sam Hargrave : \"Peut-être (rires).  Il y a eu be… [+1959 chars]"}, {"source": {"id": null, "name": "Allocine.fr"}, "author": "CTC", "title": "Les séries en mai sur Netflix : The Eddy, Hollywood de Ryan Murphy, la nouvelle comédie de Steve Carell... - AlloCiné", "description": "Un club de jazz en danger dans The Eddy, des acteurs en herbe dans Hollywood, deux veuves en difficulté dans Dead To Me..., AlloCiné vous dit quelles séries arrivent sur Netflix en mai.", "url": "http://www.allocine.fr/article/fichearticle_gen_carticle=18689609.html", "urlToImage": null, "publishedAt": "2020-04-25T07:00:00Z", "content": "Un club de jazz en danger dans The Eddy, des acteurs en herbe dans Hollywood, deux veuves en difficulté dans Dead To Me..., AlloCiné vous dit quelles séries arrivent sur Netflix en mai.\r\nLE 1er MAI : Hollywood\r\nEn attendant le retour de son autre série sur la… [+1598 chars]"}, {"source": {"id": null, "name": "Stars-actu.fr"}, "author": "Gregory S.", "title": "Étoile mystérieuse des « 12 coups de midi » : les deux premiers indices… - Stars Actu", "description": "Étoile mystérieuse des « 12 coups de midi ». Alors qu'on se demande toujours ce qu'il adviendra du jeu quotidien de Jean-Luc Reichmann", "url": "https://www.stars-actu.fr/2020/04/etoile-mysterieuse-des-12-coups-de-midi-les-deux-premiers-indices/", "urlToImage": null, "publishedAt": "2020-04-25T06:46:00Z", "content": "Étoile mystérieuse des « 12 coups de midi ». Alors que des rediffusions du jeu quotidien de Jean-Luc Reichmann devraient prendre le relais à compter du 29 avril 2020,  faute d’émissions inédites, « Les 12 coups de midi » ont encore résonné hier sur TF1. Et c’… [+1655 chars]"}, {"source": {"id": null, "name": "Causeur.fr"}, "author": "Causeur.fr, Xavier Legay", "title": "\"Dérapages\" sur Arte, Cantona contre la \"firme\" - Causeur.fr", "description": "Avec \"Dérapages\", Arte propose un thriller social qui invite à la réflexion sur les dérives du management", "url": "https://www.causeur.fr/derapages-sur-arte-la-face-sombre-du-management-175983", "urlToImage": null, "publishedAt": "2020-04-25T04:00:12Z", "content": "Jusqu’où Eric Cantona est-il prêt à aller pour retrouver un emploi à son âge? Avec Dérapages, Arte nous offre un thriller social qui invite à la réflexion sur les dérives du monde de lentreprise. Réussi\r\nDans cette mini-série, Eric Cantona campe brillamment A… [+5652 chars]"}]}