{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Purepeople.com"}, "author": "Emma Vanpoulle", "title": "Paga (Les Marseillais) bourré de cachets et déprimé, il a failli être interné - Pure People", "description": "C'est l'un des candidats emblématiques des \"Marseillais\", et pourtant, Paga reste très mystérieux sur sa vie privée. Il y a quelques jours, lors d'un live avec Magali Berdah, il a toutefois accepté de faire de rares confidences notamment autour des soucis psy…", "url": "https://www.purepeople.com/article/paga-les-marseillais-bourre-de-cachets-et-deprime-il-a-failli-etre-interne_a385832/1", "urlToImage": null, "publishedAt": "2020-04-27T05:40:00Z", "content": "Toujours le sourire aux lèvres, pétillant et prêt à la rigolade lorsqu'on le voit dans Les Marseillais, difficile de s'imaginer que Paga cache en réalité de lourdes blessures. Le jeune homme a notamment traversé une période très éprouvante à l'époque où il ét… [+2051 chars]"}, {"source": {"id": null, "name": "Barbanews.com"}, "author": null, "title": "Les 12 coups de midi : Eric dépasse les 800 000 euros et menace Christian Quesada ! - barbanews", "description": "Au terme de l’émission des Douze coups de midi du 26 avril, le candidat Eric a franchi la barre des 800 000 euros. En franchissant ce nouveau cap, le participant...", "url": "https://www.barbanews.com/peoples/les-12-coups-de-midi-eric-depasse-les-800-000-euros-et-menace-christian-quesada/", "urlToImage": null, "publishedAt": "2020-04-27T05:33:00Z", "content": "Au terme de l’émission des Douze coups de midi du 26 avril, le candidat Eric a franchi la barre des 800 000 euros. En franchissant ce nouveau cap, le participant breton qui ne cesse de grimper dans le classement des plus grands champions des 12 coups de midi,… [+3236 chars]"}, {"source": {"id": null, "name": "Purepeople.com"}, "author": "Olivia Maunoury", "title": "Franck Gastambide : Cette pathologie dont il souffre et qui l'handicape - Pure People", "description": "Rien ne prédestinait Franck Gastambide à la carrière qui est la sienne. Issu d'un milieu modeste, il cartonne aujourd'hui avec sa série \"Validé\" qui compte plus de 18 millions de vues sur MyCanal. Dans les colonnes du \"Parisien\", il revient sur son parcours e…", "url": "https://www.purepeople.com/article/franck-gastambide-cette-pathologie-dont-il-souffre-et-qui-l-handicape_a385817/1", "urlToImage": null, "publishedAt": "2020-04-27T05:02:00Z", "content": "C'est ce qui s'appelle un véritable carton ! Depuis que Validé a été mise en ligne par MyCanal, la série de, et avec Franck Gastambide, ne cesse d'attirer les spectateurs. Le confinement n'y est certes pas pour rien mais il ne fait pas tout dans le succès de … [+2650 chars]"}, {"source": {"id": null, "name": "Www.rtl.fr"}, "author": null, "title": "L'horoscope du 27 avril 2020 - RTL.fr", "description": "Signe par signe, retrouvez l'horoscope de Christine Haas pour le dimanche 27 avril 2020.", "url": "https://www.rtl.fr/actu/bien-etre/l-horoscope-du-27-avril-2020-7800445194", "urlToImage": null, "publishedAt": "2020-04-27T03:30:00Z", "content": "Bélier\r\nLa semaine se terminera mieux qu'elle ne commence. En effet, vous constaterez aujourd'hui qu'une somme ne vous a pas été virée en temps et en heure. Il va falloir réclamer mais Mercure et Saturne étant en dissonance, vous n'arriverez pas à joindre les… [+5355 chars]"}, {"source": {"id": null, "name": "Huffingtonpost.fr"}, "author": "Clément Vaillant", "title": "”Le Bureau des Légendes\": ce test de recrutement est bien réel à la DGSE - Le HuffPost", "description": "L'épreuve du bar avec Malotru et Marina Loiseau, vue dans la saison 1 de la série de Canal+, est un incontournable pour les apprentis espions du boulevard Mortier à Paris.", "url": "https://www.huffingtonpost.fr/entry/bureau-des-legendes-ce-test-de-recrutement-est-bien-reel-a-la-dgse_fr_5e9ff452c5b69150246ac2b9", "urlToImage": null, "publishedAt": "2020-04-27T02:27:46Z", "content": "SÉRIES - La prochaine fois qu’un(e) inconnu(e) vous aborde et demande votre numéro de téléphone, gardez en tête que ce n’est peut-être pas pour vous draguer. Il pourrait s’agir d’un test de recrutement de la Direction générale de la Sécurité extérieure (DGSE)… [+1698 chars]"}, {"source": {"id": null, "name": "Barbanews.com"}, "author": null, "title": "Clara Morgane - Une nouvelle fois, elle dépasse les bornes avec ses clichés non censurés ! - barbanews", "description": "Clara est forcément connue pour son histoire avec les films. Les internautes ne manquent donc pas une seule occasion pour découvrir des photos et la jeune femme a décidé de combler tous ses fans.", "url": "https://www.barbanews.com/peoples/clara-morgane-une-nouvelle-fois-elle-depasse-les-bornes-avec-ses-cliches-non-censures/", "urlToImage": null, "publishedAt": "2020-04-26T21:18:00Z", "content": "Clara a tendance à faire couler beaucoup dencre, il suffit quun cliché soit posté sur les réseaux sociaux pour quil se retrouve rapidement en Une de la presse people.\r\nLe dernier est assez sympathique pour les fans de la star qui propose régulièrement des cal… [+3967 chars]"}, {"source": {"id": null, "name": "Public.fr"}, "author": "Public", "title": "Lily-Rose Depp est désormais célibataire ! - Public", "description": "C’est du moins ce qu’annoncent les médias américains suite à un article paru dans US Weekly. Les deux jeunes stars n’ont, pour le moment, rien dit à ce sujet et n’ont même jamais officialisé leur amour. C’est sur le plateau de tournage de « The King » produit…", "url": "https://www.public.fr/News/Lily-Rose-Depp-est-desormais-celibataire-1639821", "urlToImage": null, "publishedAt": "2020-04-26T20:22:59Z", "content": "Cest du moins ce quannoncent les médias américains suite à un article paru dans US Weekly. Les deux jeunes stars nont, pour le moment, rien dit à ce sujet et nont même jamais officialisé leur amour. Cest sur le plateau de tournage de « The King » produit par … [+1665 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "20 Minutes", "title": "Eurovision 2020 annulé : Stéphane Bern détaille le dispositif de la soirée spéciale « Europe Shine A Light » - 20 Minutes", "description": "Une émission spéciale de deux heures diffusée le 16 mai, « Europe Shine A Light », va mettre en lumière les 41 candidats qui auraient dû concourir lors de cet Eurovision 2020", "url": "https://www.20minutes.fr/arts-stars/television/2768095-20200426-eurovision-2020-annule-stephane-bern-detaille-dispositif-soiree-speciale-europe-shine-light", "urlToImage": null, "publishedAt": "2020-04-26T20:09:43Z", "content": "Tom Leeb, sur la scène du Palais Nikaia à Nice, en octobre 2019. SYSPEO/SIPA\r\nVous le saviez peut-être déjà, si vous appréciez ce concours : lEurovision 2020, qui devait se tenir le 16 mai prochain à Rotterdam (Pays-Bas), naura pas lieu, en raison de lépidémi… [+2076 chars]"}, {"source": {"id": null, "name": "Allocine.fr"}, "author": "La Rédaction", "title": "Plus belle la vie du lundi 27 avril 2020 : résumé en avance de l'épisode 4046 [SPOILERS] - AlloCiné", "description": "Dans le prochain épisode de \"Plus belle la vie\"... Alors qu’Irina subit les conséquences de son geste, Thomas se met à la recherche de son double. De son côté, Nathan parviendra-t-il à passer une nouv...", "url": "http://www.allocine.fr/article/fichearticle_gen_carticle=18689076.html", "urlToImage": null, "publishedAt": "2020-04-26T20:06:01Z", "content": "Dans le prochain épisode de \"Plus belle la vie\"... Alors quIrina subit les conséquences de son geste, Thomas se met à la recherche de son double. De son côté, Nathan parviendra-t-il à passer une nouvelle étape dans son coaching ?Capture d'écran/FTV\r\nAttention… [+1157 chars]"}, {"source": {"id": null, "name": "Purepeople.com"}, "author": "Oriane Alcarini", "title": "Sophie Marceau (La Fille de d'Artagnan): Sa \"terrible chute\" pendant le tournage - Pure People", "description": "Ce dimanche 26 avril 2020 à 20h55, Arte rediffuse le classique \"La fille de d'Artagnan\", dont le rôle principal est tenu par Sophie Marceau. L'actrice, \"risque-tout\", avait tenu à réaliser ses propres cascades, à ses risques et périls...", "url": "https://www.purepeople.com/article/sophie-marceau-la-fille-de-d-artagnan-sa-terrible-chute-pendant-le-tournage_a385676/1", "urlToImage": null, "publishedAt": "2020-04-26T18:53:00Z", "content": "Décidément, le confinement aura fait revivre les plus grands classiques du cinéma français. Ce dimanche à 20h55, Arte rediffuse La fille de d'Artagnan, où l'on retrouve la solaire Sophie Marceau. Dans cette comédie d'aventure, qui se déroule en 1650 dans le P… [+1953 chars]"}, {"source": {"id": null, "name": "Offside.fr"}, "author": null, "title": "Agathe Auproux pose en \"Bikini\" pour le plaisir de ses fans - Actualités Offside", "description": "Besoin de plage de sable fin ou approche de l’été, Agathe Auproux s’affiche dans un magnifique maillot blanc !! Elle poste ses nouvelles...", "url": "https://www.offside.fr/agathe-auproux-pose-en-bikini-pour-le-plaisir-de-ses-fans/", "urlToImage": null, "publishedAt": "2020-04-26T18:33:29Z", "content": "Besoin de plage de sable fin ou approche de lété, Agathe Auproux saffiche dans un magnifique maillot blanc !! Souvenir de ses vacances en Martinique, elle poste ses nouvelles photos qui nont pas manqué de faire réagir ses quelques 820 000 fans. En effet, plus… [+5828 chars]"}, {"source": {"id": null, "name": "Purepeople.com"}, "author": "Claire Ageef-Legrand", "title": "Andie MacDowell : Son incroyable effraction en pleine crise qui ne passe pas - Pure People", "description": "Le confinement ne réussit pas à Andie Macdowell. L'actrice a commis deux impairs en quelques jours d'intervalle. Après s'être introduite par effraction dans un parc pourtant fermé avec ses filles pendant le confinement, l'ex-femme de Paul Qualley a menti de m…", "url": "https://www.purepeople.com/article/andie-macdowell-son-incroyable-effraction-en-pleine-crise-qui-ne-passe-pas_a385820/1", "urlToImage": null, "publishedAt": "2020-04-26T18:21:00Z", "content": "Grillée ! Derrière le visage d'ange d'Andie MacDowell se cacherait-il en réalité une sombre délinquante ? L'actrice a été surprise en pleine infraction pendant le confinement, le 19 avril 2020 à Los Angeles. En compagnie de ses deux filles (Margaret, 25 ans e… [+1147 chars]"}, {"source": {"id": null, "name": "Presse-citron.net"}, "author": "David Laurent", "title": "Comment le succès des Gardiens de la Galaxie a changé le MCU - Presse-citron", "description": "Les Gardiens de la Galaxie n'étaient pas destinés à connaître un succès aussi majeur. Le Marvel Cinematic Universe a donc été contraint de s'adapter.", "url": "https://www.presse-citron.net/comment-le-succes-des-gardiens-de-la-galaxie-a-change-le-mcu/", "urlToImage": null, "publishedAt": "2020-04-26T18:16:49Z", "content": "Avengers : Infinity War et Endgame ont été d’incroyables succès au cinéma, tant pour les fans que pour la critique. Avec des records d’audience, un casting XXL et une ambition démesurée, Marvel a redéfini le monde des super-héros au cinéma. Mieux, désormais,c… [+1725 chars]"}, {"source": {"id": null, "name": "Stars-actu.fr"}, "author": "Céline S.", "title": "Les 12 coups de midi : Jean-Luc Reichmann annonce l’arrêt de la diffusion des inédits ! (VIDEO) - Stars Actu", "description": "Confinement oblige, cela fait plus d'un mois que le tournage du jeu quotidien de TF1 \"Les 12 coups de midi\" a été stoppé. Résultat, et il fallait bien s'en", "url": "https://www.stars-actu.fr/2020/04/les-12-coups-de-midi-jean-luc-reichmann-annonce-larret-de-la-diffusion-des-inedits-video/", "urlToImage": null, "publishedAt": "2020-04-26T18:09:00Z", "content": "Les 12 coups de midi déprogrammation coronavirus – Confinement oblige, cela fait plus d’un mois que le tournage du jeu quotidien de TF1 « Les 12 coups de midi » a été stoppé. Résultat, et il fallait bien s’en douter, TF1 va arriver à court d’émissions inédite… [+622 chars]"}, {"source": {"id": null, "name": "Public.fr"}, "author": "Public", "title": "Chris Pratt : La star et la fille d'Arnold Schwarzenegger attendent leur premier enfant ! - Public", "description": "Chris Pratt et Katherine Schwarzenegger vont bientôt pouponner ! Tout juste un an après leur mariage célébré en juin 2019 à Montecito en Californie, le couple qui avait officialisé leur relation courant de l'été 2018 attendent leur premier enfant ensemble. À …", "url": "https://www.public.fr/News/Chris-Pratt-La-star-et-la-fille-d-Arnold-Schwarzenegger-attendent-leur-premier-enfant-1639817", "urlToImage": null, "publishedAt": "2020-04-26T17:25:06Z", "content": "Chris Pratt et Katherine Schwarzenegger vont bientôt pouponner ! Tout juste un an après leur mariage célébré en juin 2019 à Montecito en Californie, le couple qui avait officialisé leur relation courant de l'été 2018 attendent leur premier enfant ensemble. À … [+635 chars]"}, {"source": {"id": null, "name": "Www.lci.fr"}, "author": "La rédaction de LCI", "title": "Coronavirus : dans la peau du Dr Anthony Fauci, Brad Pitt s'en prend avec humour à Donald Trump - LCI", "description": "ETATS-UNIS - Critiqué pour ses dernières déclarations concernant la crise sanitaire provoquée par l'épidémie de Covid-19, le président américain Donald Trump a été moqué par l'acteur Brad Pitt, grimé en Dr Anthony Fauci, dans l'émission \"Saturday Night Live\".…", "url": "https://www.lci.fr/international/coronavirus-aux-usa-dans-une-video-brad-pitt-se-moque-de-donald-trump-en-anthony-fauci-pour-le-saturday-night-live-2152105.html", "urlToImage": null, "publishedAt": "2020-04-26T16:17:28Z", "content": "Depuis plusieurs semaines, la gestion de la crise du Covid-19 par le président des Etats-Unis Donald Trump fait l'objet de nombreuses critiques, ses déclarations douteuses à propos du virus et de son traitement se multipliant. Dernière sortie en date, celle p… [+2056 chars]"}, {"source": {"id": null, "name": "Purepeople.com"}, "author": "Olivia Maunoury", "title": "Laeticia Hallyday chante avec Jade et Joy pour célébrer une amie chère - Pure People", "description": "Loin des yeux ne signifie pas loin du coeur. Samedi 25 avril 2020, Laeticia Hallyday, entourée de ses deux filles Jade et Joy, s'est adressée à l'une de ses amies proches sur Instagram, pour son anniversaire. Il s'agit de Sandra Sisley, l'épouse de l'acteur T…", "url": "https://www.purepeople.com/article/laeticia-hallyday-chante-avec-jade-et-joy-pour-celebrer-une-amie-chere_a385829/1", "urlToImage": null, "publishedAt": "2020-04-26T16:07:00Z", "content": "Certaines personnes occupent une place privilégiée dans le coeur de Laeticia Hallyday. Sandra Sisley en fait partie et la veuve de Johnny Hallyday l'a prouvé une nouvelle fois à l'occasion d'une date particulière.\r\nSamedi 25 avril 2020, la femme de l'acteur T… [+1646 chars]"}, {"source": {"id": null, "name": "Melty.fr"}, "author": "Vanessa R", "title": "Kevin Guedj fiancé à Carla Moreau et transformé physiquement, les internautes réagissent en masse - melty", "description": "La transformation physique de Kevin Guedj a fait réagir les internautes. Et on vous laisse la découvrir dans cet article.", "url": "https://www.melty.fr/kevin-guedj-fiance-a-carla-moreau-et-transforme-physiquement-les-internautes-reagissent-en-masse-a717526.html", "urlToImage": null, "publishedAt": "2020-04-26T16:02:42Z", "content": "Greg transformé physiquement, Maeva Ghennam réagit. En période de confinement, les candidats des Marseillais aux Caraïbes, on tous un peu changé... Et certains plus que d'autres ! D'ailleurs, Kevin Guedj est presque méconnaissable depuis quelques jours. Coupe… [+1008 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Cette belle surprise d'Elizabeth II et de son mari pour les 5 ans de la princesse Charlotte - Yahoo Actualités", "description": null, "url": "https://consent.yahoo.com/collectConsent?sessionId=1_cc-session_fbbb50e6-7708-4d75-bc5f-9af8d3af9676&lang=fr-FR&inline=false", "urlToImage": null, "publishedAt": "2020-04-26T16:00:00Z", "content": "Yahoo fait partie de Verizon Media. Cliquez sur J'accepte afin dautoriser Verizon Media et ses partenaires à utiliser des cookies et des technologies similaires pour accéder à votre appareil, utiliser vos données (y compris votre position géographique), compr… [+596 chars]"}, {"source": {"id": null, "name": "Allocine.fr"}, "author": "[Url href='https://twitter.com/maxp26']Maximilien Pierrette (@maxp26)[/Url]", "title": "Penny Dreadful : tout ce qu'il faut savoir sur le spin-off City of Angels - AlloCiné", "description": "Quatre ans après la fin de la série, l'univers de \"Penny Dreadful\" fait son retour sur petit écran avec un spin-off appelé \"City of Angels\". Époque, personnages, castings, ambiance… Voici ce qu'il fau...", "url": "http://www.allocine.fr/article/fichearticle_gen_carticle=18689419.html", "urlToImage": null, "publishedAt": "2020-04-26T16:00:00Z", "content": "Quatre ans après la fin de la série, l'univers de \"Penny Dreadful\" fait son retour sur petit écran avec un spin-off appelé \"City of Angels\". Époque, personnages, castings, ambiance Voici ce qu'il faut savoir sur le show écrit et créé par John Logan.Showtime\r\n… [+4363 chars]"}, {"source": {"id": null, "name": "Leparisien.fr"}, "author": null, "title": "Patti Smith, Ben Harper et Johnny Depp en concert virtuel dimanche soir sur Instagram - Le Parisien", "description": "Pour les 50 ans de la Journée de la Terre, un festival virtuel réunit ce dimanche soir une vingtaine d’artistes et activistes environnementa", "url": "http://www.leparisien.fr/culture-loisirs/musique/patti-smith-ben-harper-et-johnny-depp-en-concert-virtuel-dimanche-soir-sur-instagram-26-04-2020-8306163.php", "urlToImage": null, "publishedAt": "2020-04-26T15:59:00Z", "content": "L'écrivaine et musicienne américaine Jesse Paris Smith, la fille de Patti Smith, et la musicienne canadienne Rebecca Foon, ne pouvaient pas passer à côté du 50e anniversaire de « La Journée de la Terre » ou « Earth Day ». Les deux fondatrices de l'association… [+2412 chars]"}, {"source": {"id": null, "name": "Programme-tv.net"}, "author": "Anne-Laure Deparis", "title": "Karine Ferri \"gâtée\" pour son anniversaire, elle dévoile ce que lui a offert son mari - Télé Loisirs.fr", "description": "Anniversaire confiné mais heureux pour Karine Ferri ce samedi 25 avril 2020. Sur Instagram, l'animatrice de TF1 a montré les cadeaux qu'elle a reçus, notamment de la part de son chéri, le footballeur Yoann Gourcuff.", "url": "https://www.programme-tv.net/news/tv/253631-karine-ferri-gatee-pour-son-anniversaire-elle-devoile-ce-que-lui-a-offert-son-mari/", "urlToImage": null, "publishedAt": "2020-04-26T15:57:54Z", "content": "Comme beaucoup de personnes, c'est en cette période de confinement que Karine Ferri a fêté son anniversaire. Ce samedi 25 avril, l'animatrice de TF1 a en effet célébré ses 38 ans. Et s'il n'était bien évidemment pas question d'inviter la famille et les amis d… [+1577 chars]"}, {"source": {"id": null, "name": "Programme-tv.net"}, "author": "Rime El Himani", "title": "Arielle Dombasle confinée avec Bernard-Henri Lévy : ses rares confidences sur leur vie de couple - Télé Loisirs.fr", "description": "Arielle Dombasle a dévoilé les coulisses de son confinement dans un entretien accordé au Journal du dimanche. La chanteuse et comédienne a préféré rester à Paris avec son mari Bernard-Henri Lévy.", "url": "https://www.programme-tv.net/news/cinema/253630-arielle-dombasle-confinee-avec-bernard-henri-levy-ses-rares-confidences-sur-leur-vie-de-couple/", "urlToImage": null, "publishedAt": "2020-04-26T15:27:48Z", "content": "Arielle Dombasle donne de ses nouvelles. Ce 26 avril, la chanteuse et comédienne sest livrée dans les colonnes du Journal du dimanche. Loccasion den savoir plus sur son confinement avec son époux Bernard-Henri Lévy. Alors que de nombreux Parisiens, à linstar … [+1338 chars]"}, {"source": {"id": null, "name": "Www.rtl.fr"}, "author": null, "title": "VIDÉO - Confinement : le groupe \"Les Goguettes\" cartonne avec leur reprise de \"Vesoul\" - RTL.fr", "description": "VIDÉO - Le groupe qui reprend des chansons pour en faire des parodies, cartonne avec sa reprise de \"Vesoul\".", "url": "https://www.rtl.fr/culture/musique/video-confinement-le-groupe-les-goguette-cartonne-avec-leur-reprise-de-vesoul-7800444478", "urlToImage": null, "publishedAt": "2020-04-26T15:02:00Z", "content": "La vidéo a déjà fait plus de deux millions de vues en seulement 48 heures. Les Goguettes, un groupe de musique qui reprend de chansons très connues pour en faire des parodies, et \"se moquer de l'actualité\", a encore frappé. \r\nCette fois, ce \"trio à quatre\", q… [+739 chars]"}, {"source": {"id": null, "name": "Ldpeople.com"}, "author": null, "title": "Michèle Torr \"dézingue brutalement\" l'épouse de Christophe - LDpeople.com", "description": "Michèle Torr: Suite à la mort de Christophe, survenue le 16 avril dernier à l’âge de 74 ans, deux clans s’opposent de manière assez violente.", "url": "https://www.ldpeople.com/michele-torr-dezingue-brutalement-lepouse-de-christophe-64811", "urlToImage": null, "publishedAt": "2020-04-26T14:55:58Z", "content": "Michèle Torr: Suite à la mort de Christophe, survenue le 16 avril dernier à lâge de 74 ans, deux clans sopposent de manière assez violente. Dun côté Michèle Torr, qui avait partagé la vie de linterprète des « Mots bleus » dans les années 1970 et sa seconde fe… [+6258 chars]"}, {"source": {"id": null, "name": "Ladepeche.fr"}, "author": "Lucas Serdic", "title": "Koh-Lanta : Inès, la candidate toulousaine, en larmes à l'hôpital, Denis Brogniart prend sa défense - LaDepeche.fr", "description": "Depuis l'élimination de Sam vendredi dernier, l'un des candidats les plus appréciés par le public de cette saison de Koh-Lanta, Inès, la candidate toulousaine, reçoit de très nombreux messages de haine sur les réseaux sociaux. Alors qu'elle travaille à l'hôpi…", "url": "https://www.ladepeche.fr/2020/04/26/koh-lanta-en-larmes-a-lhopital-ines-linfirmiere-toulousaine-porte-plainte,8863466.php", "urlToImage": null, "publishedAt": "2020-04-26T14:36:27Z", "content": "l'essentiel\r\n Depuis l'élimination de Sam vendredi dernier, l'un des candidats les plus appréciés par le public de cette saison de Koh-Lanta, Inès, la candidate toulousaine, reçoit de très nombreux messages de haine sur les réseaux sociaux. Alors qu'elle trav… [+4266 chars]"}, {"source": {"id": null, "name": "Programme-tv.net"}, "author": "Rime El Himani", "title": "Ary Abittan dévoile sa surprenante nouvelle coupe de cheveux, ses abonnés sont morts de rire (VIDEO) - Télé Loisirs.fr", "description": "À la fin du confinement, Ary Abittan se précipitera très probablement chez son coiffeur. Dans une vidéo publiée sur son compte Instagram, l'acteur et humoriste a dévoilé sa nouvelle coupe de cheveux. De quoi lui valoir les moqueries des internautes.", "url": "https://www.programme-tv.net/news/cinema/253628-ary-abittan-devoile-sa-surprenante-nouvelle-coupe-de-cheveux-ses-abonnes-sont-morts-de-rire-video/", "urlToImage": null, "publishedAt": "2020-04-26T14:34:56Z", "content": "Difficile de prendre soin de son apparence en période de confinement. Alors que louverture prochaine des salons de coiffure reste incertaine, nos people préférés tentent tant bien que mal de soccuper de leur tignasse. Si Gérard Darmon sest laissé teindre les … [+1386 chars]"}, {"source": {"id": "liberation", "name": "Libération"}, "author": "Claire Devarrieux", "title": "Mort du romancier Per Olov Enquist, l'observateur engagé - Libération", "description": "A 85 ans, l'auteur suédois laisse une œuvre documentée, de «l'Extradition des Baltes» à «Une autre vie».", "url": "https://next.liberation.fr/livres/2020/04/26/mort-du-romancier-per-olov-enquist-l-observateur-engage_1786460", "urlToImage": null, "publishedAt": "2020-04-26T14:30:00Z", "content": "Le romancier suédois Per Olov Enquist, lauteur de lExtradition des Baltes et du Médecin personnel du roi, est mort samedi soir à 85 ans. Cétait un grand écrivain, à double titre : son uvre, majoritairement traduite aux éditions Actes Sud depuis 1985, est cons… [+5417 chars]"}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": "Olivier Delcroix", "title": "Un nouvel album d'Astérix et Obélix signé Uderzo et Goscinny publié à la rentrée - Le Figaro", "description": "Les éditions Albert René exhument un œuvre rare des célèbres créateurs de l'irréductible petit Gaulois réalisée en 1967 sous forme d'album sonore. Intitulé Le Menhir d'or, cette histoire qui a pour héros le barde Assurancetourix, paraîtra le 21 octobre procha…", "url": "http://www.lefigaro.fr/bd/un-nouvel-album-d-asterix-et-obelix-signe-uderzo-et-goscinny-publie-a-la-rentree-20200426", "urlToImage": null, "publishedAt": "2020-04-26T14:08:00Z", "content": "Par Toutatis! Il y a de quoi être surpris. Alors qu'Albert Uderzo, l'un des derniers géants de la bande dessinée franco-belge a tiré sa révérence le 24 mars dernier, voilà qu'on annonce déjà son retour sous la forme d'un nouvel album d'Astérix, Le Menhir d'or… [+3150 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Mort de Gene Dynarski (Seinfeld, Star Trek) à l’âge de 86 ans - Yahoo Actualités", "description": null, "url": "https://consent.yahoo.com/collectConsent?sessionId=1_cc-session_fd935f06-cc96-4b31-a7ab-eb38bb4c5665&lang=fr-FR&inline=false", "urlToImage": null, "publishedAt": "2020-04-26T14:07:00Z", "content": "Yahoo fait partie de Verizon Media. Cliquez sur J'accepte afin dautoriser Verizon Media et ses partenaires à utiliser des cookies et des technologies similaires pour accéder à votre appareil, utiliser vos données (y compris votre position géographique), compr… [+596 chars]"}, {"source": {"id": null, "name": "Melty.fr"}, "author": "Marine Leprince", "title": "Fear & The Walking Dead : Un énorme crossover entre les 2 séries prévu dans la saison 11 de The Walking Dead ? - melty", "description": "L'univers de The Walking Dead continue de s'agrandir et il pourrait bientôt proposer un énorme crossover...", "url": "https://www.melty.fr/fear-et-the-walking-dead-un-enorme-crossover-entre-les-2-series-prevu-dans-la-saison-11-a717413.html", "urlToImage": null, "publishedAt": "2020-04-26T14:01:28Z", "content": "Les rumeurs et les spéculations continuent en attendant la diffusion de l'épisode 16 de la saison 10 de The Walking Dead sur OCS, et aujourd'hui on va parler crossover. D'après les sources de We Got This Covered, AMC serait en train de préparer un important c… [+1176 chars]"}, {"source": {"id": null, "name": "Purepeople.com"}, "author": "Emma Vanpoulle", "title": "The Voice 2020 : Nessa éliminée mais déjà sollicitée pour des projets alléchants - Pure People", "description": "À l'issue des ultimes épreuves des K.O. la jeune Nessa a vu son aventure \"The Voice\" toucher à sa fin. Éliminée par Pascal Obispo, la candidate ne retient que du positif de cette expérience sur TF1 et annonce avoir d'ores et déjà de nombreux projets pour la s…", "url": "https://www.purepeople.com/article/the-voice-2020-nessa-eliminee-mais-deja-sollicitee-pour-des-projets-allechants_a385796/1", "urlToImage": null, "publishedAt": "2020-04-26T13:56:00Z", "content": "Samedi 25 avril 2020 avait lieu le dernier épisode des K.O. dans The Voice. C'est Pascal Obispo qui a clôturé cette épreuve de l'aventure en établissant des choix déchirants au sein de son équipe. En effet, le coach a dû se séparer de quatre de ses sept talen… [+1757 chars]"}, {"source": {"id": null, "name": "Closermag.fr"}, "author": "Clara Carlesimo", "title": "Meghan Markle et le prince Harry : leur participation secrète à un livre explosif sur le Megxit - Closer France", "description": "Désormais installés à Los Angeles après avoir quitté la famille royale britannique, Meghan Markle et le prince Harry vont de nouveau refaire parler d'eux. Selon le Daily Mail, les Sussex ont activement participé à un livre qui sera écrit sur le Megxit...", "url": "https://www.closermag.fr/royautes/meghan-markle-et-le-prince-harry-leur-participation-secrete-a-un-livre-explosif-1106418", "urlToImage": null, "publishedAt": "2020-04-26T13:15:55Z", "content": "Une publication qui promet d'être explosive. Après le départ de Meghan Markle et du prince Harry, la famille royale britannique pensait être débarrassée des rebelles de la Couronne. Mais c'était sans compter la rancune des Sussex. Selon le Daily Mail, les par… [+2783 chars]"}, {"source": {"id": null, "name": "Jeanmarcmorandini.com"}, "author": "Jean-Marc Morandini", "title": "Coronavirus - Des industriels et des chercheurs Français ont mis au point un masque réutilisable 100 fois... - Le Blog de Jean-Marc Morandini", "description": "Des industriels et des chercheurs, dont certains employés par le Commissariat à l'énergie atomique et aux énergies alternatives (CEA) de Grenoble et Mich...", "url": "https://www.jeanmarcmorandini.com/article-423151-coronavirus-des-industriels-et-des-chercheurs-francais-ont-mis-au-point-un-masque-reutilisable-100-fois-et-qui-serait-vendu-a-seulement-28-euros.html", "urlToImage": null, "publishedAt": "2020-04-26T13:01:00Z", "content": "Des industriels et des chercheurs, dont certains employés par le Commissariat à l'énergie atomique et aux énergies alternatives (CEA) de Grenoble et Michelin à Clermont-Ferrand, ont mis au point un masque réutilisable 100 fois et d'un coût grand public de 28 … [+498 chars]"}, {"source": {"id": null, "name": "Europe1.fr"}, "author": "Julien Ricotta", "title": "Alexandra Lamy est confinée avec sa sœur Audrey : \"C’est comme si on était gamines, c’est super\" - Europe1", "description": "Chaque semaine pendant le confinement, Frédéric Taddeï interroge des invités non plus &quot;En Balade&quot;, mais par téléphone, pour leur demander comment ils vivent cette période si particulière. Alexandra Lamy a assuré apprécier la cohabitation avec sa sœu…", "url": "https://www.europe1.fr/culture/alexandra-lamy-est-confinee-avec-sa-soeur-audrey-cest-comme-si-on-etait-gamines-cest-super-3963893", "urlToImage": null, "publishedAt": "2020-04-26T12:17:00Z", "content": "INTERVIEWElles sont toutes les deux actrices de renom et passent leur confinement ensemble. Alexandra Lamy vit depuis plusieurs semaines avec sa sur Audrey, dans sa maison située dans les Cévennes. Et visiblement, la cohabitation se passe bien. \"Cest comme si… [+2123 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "20 Minutes avec agences", "title": "VIDEO. Val Kilmer se souvient de sa rivalité avec Tom Cruise sur le tournage de « Top Gun » - 20 Minutes", "description": "Mais les deux acteurs ont été heureux de se retrouver sur le tournage de «Top Gun : Maverick»", "url": "https://www.20minutes.fr/arts-stars/people/2766491-20200426-video-val-kilmer-souvient-rivalite-tom-cruise-tournage-top-gun", "urlToImage": null, "publishedAt": "2020-04-26T11:19:21Z", "content": "L'acteur Val Kilmer Zuma / Starface\r\nSur le tournage de Top Gun, les acteurs étaient divisés en deux camps : celui de Val Kilmer, et celui de \r\nTom Cruise. En fait, la rivalité entre Iceman et Maverick se retrouvait en coulisse avec deux acteurs aux caractère… [+1267 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "Jérôme Gicquel", "title": "Coronavirus en Bretagne : Le festival Les Vieilles Charrues espère accueillir Céline Dion en 2021 - 20 Minutes", "description": "La chanteuse a annoncé qu’elle reportait toutes les dates de sa tournée européenne", "url": "https://www.20minutes.fr/arts-stars/culture/2768007-20200426-coronavirus-bretagne-festival-vieilles-charrues-espere-accueillir-celine-dion-2021", "urlToImage": null, "publishedAt": "2020-04-26T11:18:08Z", "content": "Céline Dion en concert à Londres, le 5 juillet 2019. NLC/Neil Lupin/WENN/SIPA\r\nCest la mort dans lâme que les organisateurs des Vieilles Charrues ont annoncé le 15 avril lannulation de lédition 2020 qui devait se tenir du 16 au 19 juillet à Carhaix (Finistère… [+1616 chars]"}, {"source": {"id": null, "name": "Telestar.fr"}, "author": "La rédaction", "title": "Le Corniaud : de quelle histoire vraie s'inspire le film ? - Téléstar", "description": "A partir de 14h25 dimanche 26 avril, les téléspectateurs de France 2 auront la chance de redécouvrir un film culte : Le Corniaud. Et si ce long-métrage de Gérard Oury est bien connu, l’histoire vraie qui l’a inspiré l’est un peu moins...", "url": "https://www.telestar.fr/culture/le-corniaud-de-quelle-histoire-vraie-s-inspire-le-film-505496", "urlToImage": null, "publishedAt": "2020-04-26T10:59:13Z", "content": "Près de 40 ans après sa mort, Louis de Funès reste toujours l'un des acteurs préférés des Français. Depuis le début du confinement d'ailleurs, les chaînes ont été nombreuses à parier sur l'une de ses nombreuses comédies pour faire s'évader les téléspectateurs… [+2324 chars]"}, {"source": {"id": null, "name": "Tirage-gagnant.com"}, "author": "Nicolas Robineau", "title": "Résultat Keno du dimanche 26 avril 2020 : tirage du midi en ligne - Tirage Gagnant", "description": "Les tirages Keno FDJ de ce dimanche 26 avril 2020 ✅ Résultats disponibles à 13h45 (midi) et 21h00 (soir)", "url": "https://tirage-gagnant.com/46508/resultat-keno-dimanche-26-avril-2020/", "urlToImage": null, "publishedAt": "2020-04-26T10:43:00Z", "content": "Les tirages du Keno FDJ de ce dimanche 26 avril 2020 sont être tiré au sort comme chaque jour de la semaine. Le week-end, ne modifie pas les règles du jeu Keno et le jackpot maximum que vous pourrez remporter est toujours de 100’000/an à vie (si vous jouez un… [+1830 chars]"}, {"source": {"id": null, "name": "Nextplz.fr"}, "author": "Lauriane", "title": "Iris Mittenaere tacle Kev Adams avec des confidences très intimes - NextPlz", "description": "Iris Mittenaere s’est lâchée dans un live avec Jarry. L’ancienne Miss Universe 2016 a taclé ses ex en révélant des détails très intimes.", "url": "https://www.nextplz.fr/people/172079-iris-mittenaere-tacle-kev-adams-confidences-tres-intimes", "urlToImage": null, "publishedAt": "2020-04-26T10:36:00Z", "content": "Iris Mittenaere sest complètement lâchée dans le live Instagram de lhumoriste Jarry. Sans les nommer, Lancienne Miss Universe 2016 a taclé ses ex en révélant des détails très intimes.\r\nIris Mittenaere trouve le confinement long. Pourtant, elle le passe dans s… [+1566 chars]"}, {"source": {"id": null, "name": "13or-du-hiphop.fr"}, "author": "Squat", "title": "Sniper a affronté la Fonky Family lors d’un battle historique en live sur Instagram [Vidéo] - 13OR-du-HipHop.fr", "description": "Annoncé cette semaine sur les réseaux sociaux, le battle opposant les deux groupes légendaires du rap français, Sniper et Fonky Family a eu lieu ce samedi soir en live sur Instagram réunissant le duo Parisien, Aketo et Tunisiano face au rappeur Marseillais, S…", "url": "https://www.13or-du-hiphop.fr/2020/04/26/sniper-a-affronte-la-fonky-family-lors-dun-battle-historique-en-live-sur-instagram-video/", "urlToImage": null, "publishedAt": "2020-04-26T10:34:46Z", "content": "Annoncé cette semaine sur les réseaux sociaux, le battle opposant les deux groupes légendaires du rap français, Sniper et Fonky Family a eu lieu ce samedi soir en live sur Instagram réunissant le duo Parisien, Aketo et Tunisiano face au rappeur Marseillais, S… [+1560 chars]"}, {"source": {"id": null, "name": "Bfmtv.com"}, "author": "BFMTV", "title": "Les pâtissiers d'Elizabeth II dévoilent la recette de ses cupcakes d'anniversaire au chocolat - BFMTV people", "description": "Le palais de Buckingham a partagé une recette permettant de reproduire les adorables gâteaux imaginés pour le 94e anniversaire de la reine d'Angleterre.", "url": "https://people.bfmtv.com/tetes-couronnees/les-patissiers-d-elizabeth-ii-devoilent-la-recette-de-ses-cupcakes-d-anniversaire-au-chocolat-1901627.html", "urlToImage": null, "publishedAt": "2020-04-26T09:49:00Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "PODCAST. L’acteur Bernard Menez est remonté contre « le pouvoir qui ne fait que de la surcommunication » - Ouest-France", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMinwFodHRwczovL3d3dy5vdWVzdC1mcmFuY2UuZnIvc2FudGUvdmlydXMvY29yb25hdmlydXMvcG9kY2FzdC1sLWFjdGV1ci1iZXJuYXJkLW1lbmV6LWVzdC1yZW1vbnRlLWNvbnRyZS1sZS1wb3V2b2lyLXF1aS1uZS1mYWl0LXF1ZS1kZS1sYS1zdXJjb21tdW5pY2F0aW9uLTY4MTc5MTPSAZ8BaHR0cHM6Ly9hbXAub3Vlc3QtZnJhbmNlLmZyL3NhbnRlL3ZpcnVzL2Nvcm9uYXZpcnVzL3BvZGNhc3QtbC1hY3RldXItYmVybmFyZC1tZW5lei1lc3QtcmVtb250ZS1jb250cmUtbGUtcG91dm9pci1xdWktbmUtZmFpdC1xdWUtZGUtbGEtc3VyY29tbXVuaWNhdGlvbi02ODE3OTEz?oc=5", "urlToImage": null, "publishedAt": "2020-04-26T09:45:02Z", "content": null}, {"source": {"id": null, "name": "Nextplz.fr"}, "author": "Lauriane", "title": "Julien Tanti : très affecté par le confinement, il se confie - NextPlz", "description": "Julien Tanti n'a pas le moral au beau fixe. Sur Instagram, le candidat de LMAC partage un post très nostalgique sur le confinement.", "url": "https://www.nextplz.fr/telerealite/172072-julien-tanti-affecte-par-confinement-il-se-confie", "urlToImage": null, "publishedAt": "2020-04-26T09:40:00Z", "content": "Julien Tanti a beau attendre un deuxième enfant, son moral ne semble pas au beau fixe. Sur Instagram, le candidat des Marseillais aux Caraïbes se livre et partage sa réflexion sur le confinement.\r\nCes derniers temps, le couple Julien Tanti et Manon Marsault n… [+1701 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Cet ancien finaliste de Top Chef veut nous faire sortir de la crise en consommant mieux - LeHuffPost", "description": "Ancien finaliste de \"Top Chef\", le restaurateur a publié un manifeste pour convaincre ses confrères et consommateurs d'acheter et produire de manière plus re...", "url": "https://www.youtube.com/watch?v=3tWCclfAkXs", "urlToImage": null, "publishedAt": "2020-04-26T09:23:43Z", "content": "Ancien finaliste de \"Top Chef\", le restaurateur a publié un manifeste pour convaincre ses confrères et consommateurs d'acheter et produire de manière plus responsable."}, {"source": {"id": null, "name": "Programme-tv.net"}, "author": "Anne-Laure Deparis", "title": "Jérôme Anthony sur la prolongation de Tous en cuisine : \"Plus je serai confiné chez moi, plus je serai content - Télé Loisirs.fr", "description": "Jérôme Anthony faisait partie des invités d'On refait la télé ce samedi 25 avril sur RTL. Celui qui coanime Tous en cuisine chaque soir avec Cyril Lignac a évoqué la possible prolongation, au-delà du confinement, de l'émission qui cartonne en access sur M6.", "url": "https://www.programme-tv.net/news/tv/253618-jerome-anthony-sur-la-prolongation-de-tous-en-cuisine-plus-je-serai-confine-chez-moi-plus-je-serai-content-video/", "urlToImage": null, "publishedAt": "2020-04-26T08:31:02Z", "content": "C'est l'émission phare de cette période de confinement. Lancée le samedi 21 mars dernier juste avant de s'installer en access du lundi au vendredi sur M6, Tous en cuisine est devenue le rendez-vous incontournable de nombreux Français. Jusqu'à 2,5 millions de … [+1800 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "FORTNITE : le concert de TRAVIS SCOTT dans le jeu ! - JeuxActu", "description": "Les Meilleurs Jeux ? C'est ici ➜ https://www.youtube.com/playlist?list=PLwue_DlBktRNRJJL7w8KOwOnSJx9XkGgC FORTNITE : le concert de TRAVIS SCOTT dans le jeu !...", "url": "https://www.youtube.com/watch?v=xY2KqzUd49s", "urlToImage": null, "publishedAt": "2020-04-26T08:00:30Z", "content": "Les Meilleurs Jeux ? C'est ici https://www.youtube.com/playlist?list...\r\nFORTNITE : le concert de TRAVIS SCOTT dans le jeu !© 2020 - JEUXACTU / Epic Games"}, {"source": {"id": null, "name": "Sortiraparis.com"}, "author": null, "title": "Coronavirus : la situation à Paris et en Ile-de-France ce dimanche 26 avril - sortiraparis", "description": "Envie de connaitre les dernières infos sur la situation à Paris et en Région parisienne concernant l'épidémie de Covid-19 et ses conséquences ? On fait le point ce lundi 27 avril : courses, marchés, transports, mesures, distribution de masques et dernier bila…", "url": "https://www.sortiraparis.com/actualites/a-paris/articles/210162-coronavirus-a-paris-et-en-ile-de-france-bilan-et-distribution-de-masques", "urlToImage": null, "publishedAt": "2020-04-26T07:30:36Z", "content": "Par\r\nMy B.· Photos par\r\nMy B.· Publié le 27 avril 2020 à 08h40\r\n· Mis à jour le 27 avril 2020 à 08h46\r\nEnvie de connaitre les dernières infos sur la situation à Paris et en Région parisienne concernant l'épidémie de Covid-19 et ses conséquences ? On fait le p… [+98358 chars]"}, {"source": {"id": null, "name": "Programme-television.org"}, "author": null, "title": "REPLAY - N’oubliez pas les paroles (France 2) : qui a remporté les masters 2019 ? - Télé 7 Jours", "description": "Ce samedi 25 avril 2020, France 2 proposait une rediffusion des demi-finales des masters de &quot;N’oubliez pas les paroles&quot;.", "url": "https://www.programme-television.org/news-tv/N-oubliez-pas-les-paroles-France-2-les-demi-finales-des-masters-en-prime-4657941", "urlToImage": null, "publishedAt": "2020-04-26T07:01:00Z", "content": "Ce samedi 25 avril 2020, les téléspectateurs réunis devant France 2 pourront voir ou revoir les demi-finales des masters de Noubliez pas les paroles. En effet, en cette période de confinement, la chaîne du service public a choisi de rediffuser la compétition … [+1047 chars]"}, {"source": {"id": null, "name": "Allocine.fr"}, "author": "Jérémie Dunand [Url href='https://twitter.com/JejeSeries'](@JejeSeries)[/Url]", "title": "The Wall sur 13ème Rue : que vaut la série dans la veine de Broadchurch et The Killing ? - AlloCiné", "description": "13ème Rue lance ce soir \"The Wall\", une nouvelle série québécoise sur fond de meurtres dans une colonie minière du Grand Nord canadien. Ce polar glacé, taillé pour les amateurs de \"Broadchurch\" ou \"Fo...", "url": "http://www.allocine.fr/article/fichearticle_gen_carticle=18689595.html", "urlToImage": null, "publishedAt": "2020-04-26T07:00:00Z", "content": "13ème Rue lance ce soir \"The Wall\", une nouvelle série québécoise sur fond de meurtres dans une colonie minière du Grand Nord canadien. Ce polar glacé, taillé pour les amateurs de \"Broadchurch\" ou \"Fortitude\", vaut-il le détour ? Voilà notre avis.Pixcom\r\nLa c… [+3589 chars]"}, {"source": {"id": null, "name": "Forumopera.com"}, "author": null, "title": "At Home Gala (streaming) - New York - Critique - Forum Opéra", "description": "Contraint comme tous les théâtres de la planète à baisser le rideau, New York propose le premier e-gala d’opéra jamais organisé. L’instant est historique. La réponse du Metropolitan Opera à la pandémie de coronavirus confirme la pole position de l’institution…", "url": "https://www.forumopera.com/at-home-gala-streaming-new-york-le-grand-zapping-streaming", "urlToImage": null, "publishedAt": "2020-04-26T06:20:47Z", "content": "Contraint comme tous les théâtres de la planète à baisser le rideau, New York propose le premier e-gala dopéra jamais organisé. Linstant est historique. La réponse du Metropolitan Opera à la pandémie de coronavirus confirme la pole position de linstitution en… [+5851 chars]"}, {"source": {"id": null, "name": "Barbanews.com"}, "author": null, "title": "Laurent Ournac garde des mauvais souvenir - Ma fille a dit au pédiatre qu'elle se trouvait un peu grosse ! - barbanews", "description": "Laurent Ournac est un acteur très connu des français grâce à la série télévisée Camping Paradis qui cartonne depuis 2006. Il y incarne le personnage principal. Il avait été repéré...", "url": "https://www.barbanews.com/peoples/laurent-ournac-garde-des-mauvais-souvenir-ma-fille-a-dit-au-pediatre-quelle-se-trouvait-un-peu-grosse/", "urlToImage": null, "publishedAt": "2020-04-26T05:51:00Z", "content": "Laurent Ournac est un acteur très connu des français grâce à la série télévisée Camping Paradis qui cartonne depuis 2006. Il y incarne le personnage principal. Il avait été repéré dans lémission « Mon incroyable fiancé » qui a dailleurs battu des records daud… [+2502 chars]"}, {"source": {"id": null, "name": "Barbanews.com"}, "author": null, "title": "Loana - Revient enfin sur les réseaux et fait sensation avec un cliché sexy ! - barbanews", "description": "Depuis cette époque, celle qui avait marqué l’émission avec la fameuse scène de la piscine et le non moins célèbre Jean-Édouard, n’a pas vécu que des moments heureux. Bien au...", "url": "https://www.barbanews.com/peoples/loana-revient-enfin-sur-les-reseaux-et-fait-sensation-avec-un-cliche-sexy/", "urlToImage": null, "publishedAt": "2020-04-26T05:48:00Z", "content": "Depuis cette époque, celle qui avait marqué l’émission avec la fameuse scène de la piscine et le non moins célèbre Jean-Édouard, n’a pas vécu que des moments heureux.\r\nBien au contraire, on ne compte plus le nombre de fois où la jeune femme a voulu se suicide… [+3240 chars]"}, {"source": {"id": "le-monde", "name": "Le Monde"}, "author": "Martine Delahaye", "title": "« Dix petits nègres » adapté en thriller sans enquêteur - Le Monde", "description": "TF1 diffuse, trois ans après sa sortie sur la BBC, l’une des meilleures versions du classique d’Agatha Christie.", "url": "https://www.lemonde.fr/culture/article/2020/04/26/dix-petits-negres-adapte-en-thriller-sans-enqueteur_6037819_3246.html", "urlToImage": null, "publishedAt": "2020-04-25T22:18:33Z", "content": "Maeve Dermody dans ladaptation des « Dix petits nègres » réalisée par Sarah Phelps. 20TH CENTURY FOX/TF1\r\nTF1 SÉRIES FILMS - DIMANCHE 26 AVRIL À 21 H 00 - TÉLÉFILM\r\n« A Christie for Christmas », autrement dit « un Agatha Christie pour Noël », fut longtemps le… [+3387 chars]"}, {"source": {"id": null, "name": "Lejdd.fr"}, "author": "Charlotte Langrand", "title": "Philippe Etchebest alerte sur le sort des restaurateurs : \"Nous sommes les globules rouges de l'économie\" - Le Journal du dimanche", "description": "Le chef Philippe Etchebest alerte sur le &quot;cauchemar national&quot; vécu par les restaurateurs. Il propose que les assureurs soient les &quot;collecteurs&quot; et redistributeurs d'une aide financière d'un montant de 14 milliards d'euros pour les professi…", "url": "https://www.lejdd.fr/Societe/philippe-etchebest-alerte-sur-le-sort-des-restaurateurs-nous-sommes-les-globules-rouges-de-leconomie-3964371", "urlToImage": null, "publishedAt": "2020-04-25T20:53:24Z", "content": "Philippe Etchebest, chef du Quatrième Mur à Bordeaux et juré de lémission Top Chef, a participé à la réunion des restaurateurs avec Emmanuel Macron vendredi dernier. Le président de la République a donné un cap, annonçant une nouvelle réunion fin mai pour dét… [+3920 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Mariage de Kate Middleton et William : ce que le marié et son frère Harry ont tenté de cacher - Yahoo Actualités", "description": null, "url": "https://consent.yahoo.com/collectConsent?sessionId=1_cc-session_39903637-2103-49da-8f6f-783b60d25484&lang=fr-FR&inline=false", "urlToImage": null, "publishedAt": "2020-04-25T19:50:00Z", "content": "Yahoo fait partie de Verizon Media. Cliquez sur J'accepte afin dautoriser Verizon Media et ses partenaires à utiliser des cookies et des technologies similaires pour accéder à votre appareil, utiliser vos données (y compris votre position géographique), compr… [+596 chars]"}, {"source": {"id": null, "name": "Letribunaldunet.fr"}, "author": "https://www.facebook.com/letribunaldunet/, Salomee", "title": "Un cinéma parisien projette des films sur les murs de la capitale ! - Tribunal Du Net", "description": "Le cinéma de La Clef a offert une projection d'un film emblématique de l'histoire du cinéma sur un mur de la capitale.", "url": "http://www.letribunaldunet.fr/culture/cinema-parisien-projette-films-sur-murs-capitale.html", "urlToImage": null, "publishedAt": "2020-04-25T17:41:59Z", "content": "Le cinéma parisien La Clef a offert une projection d’un film emblématique de l’histoire du cinéma« La nuit du chasseur » de Charles Laughton, sur un mur de la capitale. Ce petit cinéma tente de faire profiter les habitants confinés du quartier et de continuer… [+3214 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Comment Kanye West est devenu milliardaire... avec Yeezy, sa marque de sneakers - Le Parisien", "description": "Rappeur unanimement salué par la critique parmi les plus gros vendeurs de disques et les plus récompensés, Kanye West ne doit pas son nouveau statut de milli...", "url": "https://www.youtube.com/watch?v=4IS7IfoHPnE", "urlToImage": null, "publishedAt": "2020-04-25T17:39:02Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Miss France 2020 : le règne de Clémence Botino ne sera pas prolongé malgré le confinement - Yahoo Actualités", "description": null, "url": "https://consent.yahoo.com/collectConsent?sessionId=1_cc-session_4781f921-4fff-49d7-ac42-4151e7b567d7&lang=fr-FR&inline=false", "urlToImage": null, "publishedAt": "2020-04-25T15:42:00Z", "content": "Yahoo fait partie de Verizon Media. Cliquez sur J'accepte afin dautoriser Verizon Media et ses partenaires à utiliser des cookies et des technologies similaires pour accéder à votre appareil, utiliser vos données (y compris votre position géographique), compr… [+596 chars]"}, {"source": {"id": null, "name": "My-angers.info"}, "author": "La rédaction", "title": "E-Quinté. Le Prix Drôle de Farce ce dimanche 26 avril 2020 - Angers Info", "description": "Direction Solvalla , ce dimanche 12 avril 2020 pour le e-Tiercé-Quarté-Quinté + .Dans cette épreuve, le Prix Drôle de Farce s’affronteront 12 partants.", "url": "https://www.my-angers.info/04/25/e-quinte-le-prix-drole-de-farce-ce-dimanche-26-avril-2020/87694", "urlToImage": null, "publishedAt": "2020-04-25T15:04:29Z", "content": "Direction Solvalla , ce dimanche 12 avril 2020 pour le e-Tiercé-Quarté-Quinté + .Dans cette épreuve, le Prix Drôle de Farce saffronteront 12 partants. La course sera disputée sur 2140 mètres, et dotée de 8108\r\nRendez-vous sur l’hippodrome de Solvalla (Suède),… [+2013 chars]"}, {"source": {"id": null, "name": "Programme-tv.net"}, "author": "Rime El Himani", "title": "Tout le monde veut prendre sa place : Nagui amusé par la mésaventure d’une candidate tête en l’air (VIDEO) - Télé Loisirs.fr", "description": "Les candidats de Tout le monde veut prendre sa place ont des anecdotes toutes plus drôles les unes que les autres. La preuve, une nouvelle fois, avec Marie-Aline, une participante victime de trous de mémoire.", "url": "https://www.programme-tv.net/news/tv/253605-tout-le-monde-veut-prendre-sa-place-nagui-amuse-par-la-mesaventure-dune-candidate-tete-en-lair-video/", "urlToImage": null, "publishedAt": "2020-04-25T12:11:07Z", "content": "Après Noubliez pas les paroles, cest au tour de Tout le monde veut prendre sa place dêtre rediffusé sur France 2. Depuis le lundi 20 avril, les fidèles du jeu de Nagui peuvent revoir le parcours de la super championne Marie-Christine, qui avait éliminée avec … [+1892 chars]"}, {"source": {"id": null, "name": "Programme-television.org"}, "author": null, "title": "Bernard Montiel en confinement à la mer : \"Je ne suis pas venu me planquer\" - Télé 7 Jours", "description": "Depuis le début du confinement le 16 mars dernier, Bernard Montiel, qui intervient régulièrement dans l'émission Touche pas à mon poste de Cyril Hanouna, réside dans sa maison du sud-ouest. Un choix souvent critiqué dont il s'est défendu dans un numéro de Com…", "url": "https://www.programme-television.org/news-tv/Bernard-Montiel-en-confinement-a-la-mer-Je-ne-suis-pas-venu-me-planquer-4657945", "urlToImage": null, "publishedAt": "2020-04-25T11:04:00Z", "content": "Alors que près de 30% des parisiens ont déserté la capitale pour la province à l'annonce du confinement, Bernard Montiel, qui a lui aussi trouvé refuge dans sa maison de Pylat sur mer, est sous le feu des critiques. Beaucoup lui reprochent d'avoir fui Paris. … [+1024 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "B.Ch.", "title": "Mick Jagger et Paul McCartney rejouent (pour rire) la guerre entre Beatles et Rolling Stones - 20 Minutes", "description": "Les deux chanteurs se répondent par médias interposés sur la question de la supériorité de leurs groupes respectifs", "url": "https://www.20minutes.fr/arts-stars/culture/2767647-20200425-mick-jagger-paul-mccartney-rejouent-rire-guerre-entre-beatles-rolling-stones", "urlToImage": null, "publishedAt": "2020-04-25T10:51:33Z", "content": "Paul McCartney et Mick Jagger en 2011 à New York Richard Young / Rex Fea/REX/SIPA\r\nPaul McCartney et Mick Jagger relancent \r\n la polémique la plus \r\nvive des dernières décennies : plutôt Beatles ou Rolling Stones? Alors bien sûr, cest pour rire, bien sûr, ils… [+1575 chars]"}, {"source": {"id": null, "name": "Zone-turf.fr"}, "author": null, "title": "Quinté plus PMU : Vine Vision se retrouve bien placé - Quinté+ - zone-turf.fr", "description": "Quinté plus PMU : Vine Vision se retrouve bien placé Troisième dans un très bon temps sur le parcours qui nous intéresse, Vine Vision (5) aura notre …", "url": "https://www.zone-turf.fr/quinte/quinte-plus-pmu-vine-vision-se-retrouve-bien-place-104694.html", "urlToImage": null, "publishedAt": "2020-04-25T09:30:00Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Mort de Christophe : pourquoi sa femme Véronique refuse d’évoquer le coronavirus - Yahoo Actualités", "description": null, "url": "https://consent.yahoo.com/collectConsent?sessionId=1_cc-session_5d2ad7e8-5a62-4b53-a836-09c96b9bec45&lang=fr-FR&inline=false", "urlToImage": null, "publishedAt": "2020-04-25T09:22:00Z", "content": "Yahoo fait partie de Verizon Media. Cliquez sur J'accepte afin dautoriser Verizon Media et ses partenaires à utiliser des cookies et des technologies similaires pour accéder à votre appareil, utiliser vos données (y compris votre position géographique), compr… [+596 chars]"}, {"source": {"id": null, "name": "Letribunaldunet.fr"}, "author": "https://www.facebook.com/letribunaldunet/, Claire", "title": "TPMP : Cyril Hanouna balance une très mauvaise nouvelle… - Tribunal Du Net", "description": "Ce jeudi 23 avril,dans l'émission Ce soir chez Baba, Cyril Hanouna annonce une très mauvaise nouvelle pour tous les fans de TPMP", "url": "http://www.letribunaldunet.fr/people/tpmp-cyril-hanouna-balance-tres-mauvaise-nouvelle.html", "urlToImage": null, "publishedAt": "2020-04-25T09:16:29Z", "content": "Ce jeudi 23 avril, c’était une nouvelle édition de l’émission Ce soir chez Baba. Et rapidement, Cyril Hanouna oriente le sujet vers le déconfinement qui s’annonce progressif et sans garantie. Voilà pourquoi, l’animateur a été franc : TPMP ne reprendra pas ava… [+2487 chars]"}, {"source": {"id": null, "name": "Allocine.fr"}, "author": "Mégane Choquet", "title": "Marvel : nouvelles dates pour les suites de Spider-Man, Doctor Strange et Thor - AlloCiné", "description": "Après les sorties repoussées de Black Widow et The Eternals, d’autres films Marvel voient leur sortie décalée en raison de l’épidémie de coronavirus. Cette décision concerne notamment les films Spider...", "url": "http://www.allocine.fr/article/fichearticle_gen_carticle=18689624.html", "urlToImage": null, "publishedAt": "2020-04-25T09:15:00Z", "content": "Après les sorties repoussées de Black Widow et The Eternals, dautres films Marvel voient leur sortie décalée en raison de lépidémie de coronavirus. Cette décision concerne notamment les films Spider-Man et le sequel de Doctor Strange.Sony Pictures\r\nEn raison … [+1642 chars]"}, {"source": {"id": null, "name": "Letribunaldunet.fr"}, "author": "https://www.facebook.com/letribunaldunet/, Jeanne", "title": "« Il était insupportable… » : Nathalie Marquay révèle avoir été harcelée par un célèbre homme politique - Tribunal Du Net", "description": "Nathalie Marquay s'est confiée dans un live Instagram ce mercredi 22 avril. Elle confie avoir été harcelée par un homme politique.", "url": "http://www.letribunaldunet.fr/people/insupportable-nathalie-marquay-revele-avoir-harcelee-celebre-homme-politique.html", "urlToImage": null, "publishedAt": "2020-04-25T08:47:06Z", "content": "Dans un live Instagram présenté par Sylvie Tellier, Nathalie Marquay qui était invitée, s’est laissé aller à quelques confidences. Elle a avoué avoir été harcelée pendant plusieurs mois par un célèbre homme politique dont elle souhaite taire le nom.\r\n&gt;&gt;… [+1768 chars]"}, {"source": {"id": null, "name": "Jeuxactu.com"}, "author": null, "title": "Tyler Rake 2 : une suite est-elle possible ? Qu'arrive-t-il à Chris Hemsworth ? (Extraction 2) - FilmsActu", "description": "Attention spoilers ! La fin de Tyler Rake (Extraction) est-elle définitive ? Un Tyler Rake 2 est-il possible ? On a pu poser la question au réalisateur Sam Hargrave.", "url": "https://cinema.jeuxactu.com/news-cinema-tyler-rake-2-une-suite-de-prevu-qu-arrive-t-il-a-chris-hemsworth-extraction-33041.htm", "urlToImage": null, "publishedAt": "2020-04-25T07:34:01Z", "content": "Attention spoilers ! La fin de Tyler Rake (Extraction) est-elle définitive ? Un Tyler Rake 2 est-il possible ? On a pu poser la question au réalisateur Sam Hargrave.\r\nPourrait-il y avoir une suite à Tyler Rake ?Sam Hargrave : \"Peut-être (rires).  Il y a eu be… [+1959 chars]"}, {"source": {"id": null, "name": "Stars-actu.fr"}, "author": "Gregory S.", "title": "Étoile mystérieuse des « 12 coups de midi » : les deux premiers indices… - Stars Actu", "description": "Étoile mystérieuse des « 12 coups de midi ». Alors qu'on se demande toujours ce qu'il adviendra du jeu quotidien de Jean-Luc Reichmann", "url": "https://www.stars-actu.fr/2020/04/etoile-mysterieuse-des-12-coups-de-midi-les-deux-premiers-indices/", "urlToImage": null, "publishedAt": "2020-04-25T06:46:00Z", "content": "Étoile mystérieuse des « 12 coups de midi ». Alors que des rediffusions du jeu quotidien de Jean-Luc Reichmann devraient prendre le relais à compter du 29 avril 2020,  faute d’émissions inédites, « Les 12 coups de midi » ont encore résonné hier sur TF1. Et c’… [+1655 chars]"}]}