{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Sortiraparis.com"}, "author": null, "title": "Coronavirus à Paris et en Ile-de-France, distribution de masques et bilan - sortiraparis", "description": "Envie de connaitre les dernières infos sur la situation à Paris et en Région parisienne concernant l'épidémie de Covid-19 et ses conséquences ? On fait le point ce dimanche 26 avril : courses, marchés, transports, mesures, distribution de masques et dernier b…", "url": "https://www.sortiraparis.com/actualites/a-paris/articles/210162-coronavirus-a-paris-et-en-ile-de-france-distribution-de-masques-et-bilan", "urlToImage": null, "publishedAt": "2020-04-26T14:03:56Z", "content": "Par\r\nMy B.· Photos par\r\nMy B.· Publié le 26 avril 2020 à 15h30\r\n· Mis à jour le 26 avril 2020 à 15h37\r\nEnvie de connaitre les dernières infos sur la situation à Paris et en Région parisienne concernant l'épidémie de Covid-19 et ses conséquences ? On fait le p… [+98724 chars]"}, {"source": {"id": null, "name": "Bfmtv.com"}, "author": "BFMTV", "title": "Koh-Lanta: Denis Brogniart condamne les menaces de mort et de viol subies par des candidats - BFMTV people", "description": "Sur les réseaux sociaux, Régis et Inès subissent les foudres de nombreux internautes, déçus de l'élimination de Sam.", "url": "https://people.bfmtv.com/tv/koh-lanta-denis-brogniart-condamne-les-menaces-de-mort-et-de-viol-subies-par-des-candidats-1901835.html", "urlToImage": null, "publishedAt": "2020-04-26T13:19:29Z", "content": null}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": null, "title": "Une aventure d'Astérix signée Goscinny et Uderzo sortira en octobre - franceinfo", "description": "", "url": "https://www.francetvinfo.fr/culture/bd/goscinny/une-aventure-d-asterix-signee-goscinny-et-uderzo-sortira-en-octobre_3935703.html", "urlToImage": null, "publishedAt": "2020-04-26T13:19:25Z", "content": "Cet album illustré, intitulé \"Le Menhir d'Or\", reprendra le récit d'un livre audio édité en 1967.Par Toutatis ! Un nouvel album des aventures d'Astérix va paraître le 21 octobre prochain aux éditions Albert René, révèle leJDD (article payant), dimanche 26 avr… [+1340 chars]"}, {"source": {"id": null, "name": "Purepeople.com"}, "author": "Emma Vanpoulle", "title": "Karine Ferri gâtée par Yoann Gourcuff pour son anniversaire confiné - Pure People", "description": "Samedi 25 avril 2020, Karine Ferri célébrait ses 38 ans entourée de ses enfants et de son mari Yoann Gourcuff. Ce dernier n'a d'ailleurs pas fait les choses à moitié pour combler sa belle, et ce, même en période de confinement !", "url": "https://www.purepeople.com/article/karine-ferri-gatee-par-yoann-gourcuff-pour-son-anniversaire-confine_a385799/1", "urlToImage": null, "publishedAt": "2020-04-26T13:11:00Z", "content": "À défaut de célébrer son anniversaire en grande pompe avec de nombreux invités, c'est en version confinée que Karine Ferri a soufflé ses 38 bougies samedi 25 avril 2020. Un moment privilégié avec sa famille qu'elle n'aurait échangé pour rien au monde. D'aille… [+1460 chars]"}, {"source": {"id": null, "name": "Europe1.fr"}, "author": "Julien Ricotta", "title": "Alexandra Lamy est confinée avec sa sœur Audrey : \"C'est comme si on était gamines, c'est super\" - Europe1", "description": "Chaque semaine pendant le confinement, Frédéric Taddeï interroge des invités non plus &quot;En Balade&quot;, mais par téléphone, pour leur demander comment ils vivent cette période si particulière. Alexandra Lamy a assuré apprécier la cohabitation avec sa sœu…", "url": "https://www.europe1.fr/culture/alexandra-lamy-est-confinee-avec-sa-soeur-audrey-cest-comme-si-on-etait-gamines-cest-super-3963893", "urlToImage": null, "publishedAt": "2020-04-26T12:17:00Z", "content": "INTERVIEWElles sont toutes les deux actrices de renom et passent leur confinement ensemble. Alexandra Lamy vit depuis plusieurs semaines avec sa sur Audrey, dans sa maison située dans les Cévennes. Et visiblement, la cohabitation se passe bien. \"Cest comme si… [+2123 chars]"}, {"source": {"id": null, "name": "Closermag.fr"}, "author": "Clara Carlesimo", "title": "Arielle Dombasle : ses rares confidences sur sa vie avec Bernard-Henri Lévy - Closer France", "description": "Confinée à Paris auprès de Bernard-Henri Lévy, Arielle Dombasle s'est laissée aller à quelques confidences sur leur couple dans les colonnes du Journal du dimanche.", "url": "https://www.closermag.fr/people/arielle-dombasle-ses-rares-confidences-sur-sa-vie-avec-bernard-henri-levy-1106374", "urlToImage": null, "publishedAt": "2020-04-26T11:38:31Z", "content": "Le confinement, c'est à deux qu'ils le vivent. Mariés depuis 1993, Arielle Dombasle et Bernard-Henri Lévy ne sont pas vraiment loquaces lorsqu'il s'agit d'évoquer leurs sentiments et leur quotidien. Mais dans les colonnes du Journal du dimanche le 26 avril, l… [+2548 chars]"}, {"source": {"id": null, "name": "Offside.fr"}, "author": null, "title": "Laurent Ournac se lâche et révèle ce qu'il pense de Mimie Mathy - Actualités Offside", "description": "Laurent Ournac et Mimie Mathy: Les deux vedettes sont connues pour leurs séries respectives sur TF1 par le grand public. Camping Paradis", "url": "https://www.offside.fr/laurent-ournac-lache-revele-pense-mimie-mathy/", "urlToImage": null, "publishedAt": "2020-04-26T11:30:05Z", "content": "Laurent Ournac et Mimie Mathy: Les deux vedettes sont connues pour leurs séries respectives sur TF1 par le grand public. Camping Paradis et Joséphine, ange gardien ont beaucoup d succès auprès des fans. Laurent Ournac et Mimie Mathy sont amenés à se côtoyer e… [+5061 chars]"}, {"source": {"id": null, "name": "Public.fr"}, "author": "Public", "title": "PHOTO - The Voice : Pascal Obispo embrasse l’une de ses candidates sur la bouche... La Toile est sous le choc ! - Public", "description": "La neuvième saison de l’émission The Voice a continué d’être diffusé malgré le confinement. Mais hier soir, samedi 25 avril, les derniers KO ont pris fin. Après les passages des apprentis artistes, Nikos est apparu quelques minutes pour annoncer la suite des …", "url": "https://www.public.fr/News/PHOTO-The-Voice-Pascal-Obispo-embrasse-l-une-de-ses-candidates-sur-la-bouche-La-Toile-est-sous-le-choc-1639804", "urlToImage": null, "publishedAt": "2020-04-26T11:20:07Z", "content": "La neuvième saison de lémission The Voice a continué dêtre diffusé malgré le confinement. Mais hier soir, samedi 25 avril, les derniers KO ont pris fin. Après les passages des apprentis artistes, Nikos est apparu quelques minutes pour annoncer la suite des év… [+1419 chars]"}, {"source": {"id": null, "name": "Tirage-gagnant.com"}, "author": "Nicolas Robineau", "title": "Résultat Keno du dimanche 26 avril 2020 : tirage du midi en ligne - Tirage Gagnant", "description": "Les tirages Keno FDJ de ce dimanche 26 avril 2020 ✅ Résultats disponibles à 13h45 (midi) et 21h00 (soir)", "url": "https://tirage-gagnant.com/46508/resultat-keno-dimanche-26-avril-2020/", "urlToImage": null, "publishedAt": "2020-04-26T10:43:00Z", "content": "Les tirages du Keno FDJ de ce dimanche 26 avril 2020 sont être tiré au sort comme chaque jour de la semaine. Le week-end, ne modifie pas les règles du jeu Keno et le jackpot maximum que vous pourrez remporter est toujours de 100’000/an à vie (si vous jouez un… [+1830 chars]"}, {"source": {"id": null, "name": "Leparisien.fr"}, "author": null, "title": "Dans le Morbihan, le duc et la duchesse de Rohan confinés dans leur château de Josselin - Le Parisien", "description": "Le duc et la duchesse de Rohan, confinés dans ce monument historique du Morbihan, espèrent encore sauver la saison touristique au mois d’aoû", "url": "http://www.leparisien.fr/culture-loisirs/dans-le-morbihan-le-duc-et-la-duchesse-de-rohan-confines-dans-leur-chateau-de-josselin-26-04-2020-8306001.php", "urlToImage": null, "publishedAt": "2020-04-26T10:40:00Z", "content": "Ils vivent à deux dans l'un des plus beaux châteaux de la Bretagne historique. Antoinette de Rohan, 73 ans, et son époux, le 14e duc de Rohan (et ancien sénateur) plus connu sous son nom d'usage, Josselin de Rohan, 82 ans, uvrent toute l'année à faire vivre c… [+1381 chars]"}, {"source": {"id": null, "name": "Nextplz.fr"}, "author": "Lauriane", "title": "Iris Mittenaere tacle Kev Adams avec des confidences très intimes - NextPlz", "description": "Iris Mittenaere s’est lâchée dans un live avec Jarry. L’ancienne Miss Universe 2016 a taclé ses ex en révélant des détails très intimes.", "url": "https://www.nextplz.fr/people/172079-iris-mittenaere-tacle-kev-adams-confidences-tres-intimes", "urlToImage": null, "publishedAt": "2020-04-26T10:36:00Z", "content": "Iris Mittenaere sest complètement lâchée dans le live Instagram de lhumoriste Jarry. Sans les nommer, Lancienne Miss Universe 2016 a taclé ses ex en révélant des détails très intimes.\r\nIris Mittenaere trouve le confinement long. Pourtant, elle le passe dans s… [+1566 chars]"}, {"source": {"id": null, "name": "Ldpeople.com"}, "author": null, "title": "Laurence Boccolini n'a plus la possibilité de guérir, son traitement est interdit - LDpeople.com", "description": "Laurence Boccolini est atteinte d'une polyarthrite rhumatoïde sévère. Et depuis son dernier voyage en Afrique du Sud, elle est interdite", "url": "https://www.ldpeople.com/laurence-boccolini-plus-possibilite-guerir-traitement-interdit-64730", "urlToImage": null, "publishedAt": "2020-04-26T10:27:10Z", "content": "Laurence Boccolini est atteinte d’une polyarthrite rhumatoïde sévère. Et depuis son dernier voyage en Afrique du Sud, elle est interdite de médicaments contenant de l’ibuprofène. Alors elle doit faire avec ses douleurs et l’aggravation de sa condition, tous l… [+3949 chars]"}, {"source": {"id": null, "name": "Www.rtl.fr"}, "author": null, "title": "Confinement : aidez les abeilles en plantant des fleurs mellifères - RTL.fr", "description": "Dimanche 26 avril, Juliette Dumas, la coach bien être de RTL, nous invite à nous confiner responsable.", "url": "https://www.rtl.fr/culture/arts-spectacles/confinement-aidez-les-abeilles-en-plantant-des-fleurs-melliferes-7800443620", "urlToImage": null, "publishedAt": "2020-04-26T10:06:00Z", "content": "Dimanche 26 avril, Juliette Dumas, la coach bien être de RTL, nous invite à nous confiner responsable. \"J'ai rencontré de loin Antoine Lamy, qui travaille à l'Observatoire français d'apidologie, là où étudie le comportement des abeilles. Grâce à elle, 30% de … [+725 chars]"}, {"source": {"id": null, "name": "Melty.fr"}, "author": "Vanessa R", "title": "Carla Moreau amincie sur cette photo, les internautes réagissent en masse - melty", "description": "Les internautes ont été nombreux à réagir à la dernière photo Instagram de Carla Moreau. Ils trouvent qu'elle a bien minci !", "url": "https://www.melty.fr/carla-moreau-amincie-sur-cette-photo-les-internautes-reagissent-en-masse-a717512.html", "urlToImage": null, "publishedAt": "2020-04-26T10:02:00Z", "content": null}, {"source": {"id": null, "name": "Allocine.fr"}, "author": "Laurent Schenck", "title": "Le Corniaud sur France 2 à 14h : pourquoi de Funès est-il entré dans une colère noire lors du tournage ? - AlloCiné", "description": "Emmené par un duo mythique, \"Le Corniaud\" est diffusé cet après-midi sur France 2. Pour l'occasion, retour sur le moment où Louis de Funès s'est... Pour le moins emporté contre le réalisateur Gérard O...", "url": "http://www.allocine.fr/article/fichearticle_gen_carticle=18689522.html", "urlToImage": null, "publishedAt": "2020-04-26T10:00:00Z", "content": "Emmené par un duo mythique, \"Le Corniaud\" est diffusé cet après-midi sur France 2. Pour l'occasion, retour sur le moment où Louis de Funès s'est... Pour le moins emporté contre le réalisateur Gérard Oury.\r\nDans Le Corniaud, Louis de Funès incarne Leopold Saro… [+2807 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "PODCAST. L’acteur Bernard Menez est remonté contre « le pouvoir qui ne fait que de la surcommunication » - Ouest-France", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMinwFodHRwczovL3d3dy5vdWVzdC1mcmFuY2UuZnIvc2FudGUvdmlydXMvY29yb25hdmlydXMvcG9kY2FzdC1sLWFjdGV1ci1iZXJuYXJkLW1lbmV6LWVzdC1yZW1vbnRlLWNvbnRyZS1sZS1wb3V2b2lyLXF1aS1uZS1mYWl0LXF1ZS1kZS1sYS1zdXJjb21tdW5pY2F0aW9uLTY4MTc5MTPSAZ8BaHR0cHM6Ly9hbXAub3Vlc3QtZnJhbmNlLmZyL3NhbnRlL3ZpcnVzL2Nvcm9uYXZpcnVzL3BvZGNhc3QtbC1hY3RldXItYmVybmFyZC1tZW5lei1lc3QtcmVtb250ZS1jb250cmUtbGUtcG91dm9pci1xdWktbmUtZmFpdC1xdWUtZGUtbGEtc3VyY29tbXVuaWNhdGlvbi02ODE3OTEz?oc=5", "urlToImage": null, "publishedAt": "2020-04-26T09:45:02Z", "content": null}, {"source": {"id": null, "name": "13or-du-hiphop.fr"}, "author": "Squat", "title": "Booba et Kaaris enfin en face en face dans l'octogone grâce à Rap Fighters avec Gims, Maes, Lacrim - 13OR-du-HipHop.fr", "description": "En 2019, Booba et Kaaris avaient fait le buzz dans les médias pendant plusieurs mois sur l'organisation d'une confrontation entre eux dans un combat de MMA mais après des mois négociations tendues le rappeur de Sevran avait finalement décidé d’annuler l'événe…", "url": "https://www.13or-du-hiphop.fr/2020/04/26/booba-et-kaaris-enfin-en-face-en-face-dans-loctogone-grace-a-rap-fighters-avec-gims-maes-lacrim/", "urlToImage": null, "publishedAt": "2020-04-26T09:33:12Z", "content": "En 2019, Booba et Kaaris avaient fait le buzz dans les médias pendant plusieurs mois sur l’organisation d’une confrontation entre eux dans un combat de MMA mais après des mois négociations tendues le rappeur de Sevran avait finalement décidé dannuler l’événem… [+938 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Décès de l’écrivain suédois Per Olov Enquist - Ouest-France", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiWWh0dHBzOi8vd3d3Lm91ZXN0LWZyYW5jZS5mci9ldXJvcGUvc3VlZGUvZGVjZXMtZGUtbC1lY3JpdmFpbi1zdWVkb2lzLW9sb3YtZW5xdWlzdC02ODE3OTA30gFZaHR0cHM6Ly9hbXAub3Vlc3QtZnJhbmNlLmZyL2V1cm9wZS9zdWVkZS9kZWNlcy1kZS1sLWVjcml2YWluLXN1ZWRvaXMtb2xvdi1lbnF1aXN0LTY4MTc5MDc?oc=5", "urlToImage": null, "publishedAt": "2020-04-26T09:18:14Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Brad Pitt détruit Donald Trump et ses propos sur le coronavirus dans une vidéo parodique - Yahoo Actualités", "description": null, "url": "https://consent.yahoo.com/collectConsent?sessionId=1_cc-session_73366129-695b-4d8e-93ea-ec7a1cf9dea3&lang=fr-FR&inline=false", "urlToImage": null, "publishedAt": "2020-04-26T09:17:00Z", "content": "Yahoo fait partie de Verizon Media. Cliquez sur J'accepte afin dautoriser Verizon Media et ses partenaires à utiliser des cookies et des technologies similaires pour accéder à votre appareil, utiliser vos données (y compris votre position géographique), compr… [+596 chars]"}, {"source": {"id": null, "name": "Purepeople.com"}, "author": "Olivia Maunoury", "title": "Lily-Rose Depp séparée de Timothée Chalamet : rupture après un an d'amour - Pure People", "description": "Comme Lily-Rose Depp et Timothée Chalamet ne se sont jamais exprimés sur leur histoire d'amour, l'annonce de leur supposée rupture ne vient pas d'eux. La presse américaine affirme en effet que la fille de Vanessa Paradis et Johnny Depp et l'acteur se seraient…", "url": "https://www.purepeople.com/article/lily-rose-depp-separee-de-timothee-chalamet-rupture-apres-un-an-d-amour_a385766/1", "urlToImage": null, "publishedAt": "2020-04-26T09:07:00Z", "content": "L'histoire d'amour entre Lily-Rose Depp et Timothée Chalamet s'écrirait-elle déjà au passé ? Oui si l'on en croit la presse américaine. US Weekly, repris par People, annonce que la fille de 20 ans de Vanessa Paradis et Johnny Depp et l'acteur franco-américain… [+1738 chars]"}, {"source": {"id": null, "name": "Leparisien.fr"}, "author": null, "title": "Programme TV du dimanche 26 avril : notre sélection - Le Parisien", "description": "Un Dracula papy gâteau, la fille de d’Artagnan qui croise le fer, un duel en cuisine inénarrable et un corniaud qui l’est tout autant... on", "url": "http://www.leparisien.fr/culture-loisirs/tv/programme-tv-du-dimanche-26-avril-notre-selection-26-04-2020-8305956.php", "urlToImage": null, "publishedAt": "2020-04-26T08:32:00Z", "content": "A 21h05 sur TF1. Décidément, Mavis, la fille de Dracula, ne ménage pas son père : dans « Hôtel Transylvanie » (2012), elle lui avait déjà fait le sale coup d'épouser un humain. Dans cette suite, elle accouche d'un petit garçon, qui semble plus disposé à deven… [+6043 chars]"}, {"source": {"id": null, "name": "Ozap.com"}, "author": "Florian Guadalupe", "title": "Confinement : Stéphane Bern détaille la soirée qui remplacera l'Eurovision sur France 2 - Ozap", "description": "L'animateur était l'invité hier de l'émission \"On refait la télé\" présentée par Eric Dussart et Jade sur RTL.", "url": "https://www.ozap.com/actu/confinement-stephane-bern-detaille-la-soiree-qui-remplacera-l-eurovision-sur-france-2/592351", "urlToImage": null, "publishedAt": "2020-04-26T08:27:02Z", "content": "Une soirée spéciale dédiée au concours européen. Le 18 mars dernier, l'Union Européenne de Radio-télévision avait officialisé l'annulation de la prochaine édition de l'Eurovision, qui devait se tenir le 16 mai prochain aux Pays-Bas, en raison de la crise sani… [+1471 chars]"}, {"source": {"id": null, "name": "Jeanmarcmorandini.com"}, "author": "Jean-Marc Morandini", "title": "Audiences Prime: \"The Voice\" sur TF1 leader hier soir avec moins de 5 millions suivie de très près par un... - Le Blog de Jean-Marc Morandini", "description": "Médiamétrie rencontrant des difficultés techniques ce dimanche matin, les audiences ne sont pas disponibles dans l'immédiat. A cette heure aucune chaîne...", "url": "https://www.jeanmarcmorandini.com/article-422965-audiences-prime-the-voice-sur-tf1-leader-hier-soir-avec-moins-de-5-millions-suivie-de-tres-pres-par-une-rediffusion-de-mongeville-sur-france-3.html", "urlToImage": null, "publishedAt": "2020-04-26T07:58:19Z", "content": "Médiamétrie rencontrant des difficultés techniques ce dimanche matin, les audiences ne sont pas disponibles dans l'immédiat. A cette heure aucune chaîne de télé n'a accès aux audiences. Elles seront en ligne sur jeanmarcmorandini.com dès qu'elles seront publi… [+1706 chars]"}, {"source": {"id": null, "name": "Barbanews.com"}, "author": null, "title": "Laeticia Hallyday très complice avec Joy : un moment mère-fille émouvant ! - barbanews", "description": "Laeticia Hallyday et ses deux filles, Jade et Joy, adoptées avec son défunt mari Johnny Hallyday, sont plus proches que jamais depuis la mort du rockeur. Les deux soeurs soutiennent...", "url": "https://www.barbanews.com/peoples/laeticia-hallyday-tres-complice-avec-joy-un-moment-mere-fille-emouvant/", "urlToImage": null, "publishedAt": "2020-04-26T07:52:00Z", "content": "Laeticia Hallyday et ses deux filles, Jade et Joy, adoptées avec son défunt mari Johnny Hallyday, sont plus proches que jamais depuis la mort du rockeur. Les deux soeurs soutiennent leur maman dans les moments durs et cette dernière semble toujours aussi atte… [+3029 chars]"}, {"source": {"id": null, "name": "Parismatch.com"}, "author": "Paris Match", "title": "Astrid Veillon : \"Enfin la nature respire !\" - Paris Match", "description": "Depuis trois saisons, Astrid Veillon incarne Léa Soler dans la série «Tandem» diffusée sur France 3. L’actrice dévoile aujourd’hui son quotidien en...", "url": "https://www.parismatch.com/People/Astrid-Veillon-Enfin-la-nature-respire-1683220", "urlToImage": null, "publishedAt": "2020-04-26T07:03:36Z", "content": "Depuis trois saisons, Astrid Veillon incarne Léa Soler dans la série «Tandem» diffusée sur France 3. Lactrice dévoile aujourdhui son quotidien en plein confinement et évoque quelques-uns de ses secrets. Paris Match. Où êtes-vous confinée ?Astrid Veillon. Je s… [+3658 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Carmen Kassovitz : \"Mes partenaire de confinement ? Mon père et ma sœur Raika\" - Paris Match", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMic2h0dHBzOi8vd3d3LnBhcmlzbWF0Y2guY29tL1Blb3BsZS9DYXJtZW4tS2Fzc292aXR6LU1lcy1wYXJ0ZW5haXJlLWRlLWNvbmZpbmVtZW50LU1vbi1wZXJlLWV0LW1hLXNvZXVyLVJhaWthLTE2ODMyODbSAXNodHRwczovL2FtcC5wYXJpc21hdGNoLmNvbS9QZW9wbGUvQ2FybWVuLUthc3Nvdml0ei1NZXMtcGFydGVuYWlyZS1kZS1jb25maW5lbWVudC1Nb24tcGVyZS1ldC1tYS1zb2V1ci1SYWlrYS0xNjgzMjg2?oc=5", "urlToImage": null, "publishedAt": "2020-04-26T07:03:32Z", "content": null}, {"source": {"id": null, "name": "Allocine.fr"}, "author": "Jérémie Dunand [Url href='https://twitter.com/JejeSeries'](@JejeSeries)[/Url]", "title": "The Wall sur 13ème Rue : que vaut la série dans la veine de Broadchurch et The Killing ? - AlloCiné", "description": "13ème Rue lance ce soir \"The Wall\", une nouvelle série québécoise sur fond de meurtres dans une colonie minière du Grand Nord canadien. Ce polar glacé, taillé pour les amateurs de \"Broadchurch\" ou \"Fo...", "url": "http://www.allocine.fr/article/fichearticle_gen_carticle=18689595.html", "urlToImage": null, "publishedAt": "2020-04-26T07:00:00Z", "content": "13ème Rue lance ce soir \"The Wall\", une nouvelle série québécoise sur fond de meurtres dans une colonie minière du Grand Nord canadien. Ce polar glacé, taillé pour les amateurs de \"Broadchurch\" ou \"Fortitude\", vaut-il le détour ? Voilà notre avis.Pixcom\r\nLa c… [+3589 chars]"}, {"source": {"id": null, "name": "Forumopera.com"}, "author": null, "title": "At Home Gala (streaming) - New York - Critique - Forum Opéra", "description": "Contraint comme tous les théâtres de la planète à baisser le rideau, New York propose le premier e-gala d’opéra jamais organisé. L’instant est historique. La réponse du Metropolitan Opera à la pandémie de coronavirus confirme la pole position de l’institution…", "url": "https://www.forumopera.com/at-home-gala-streaming-new-york-le-grand-zapping-streaming", "urlToImage": null, "publishedAt": "2020-04-26T06:20:47Z", "content": "Contraint comme tous les théâtres de la planète à baisser le rideau, New York propose le premier e-gala dopéra jamais organisé. Linstant est historique. La réponse du Metropolitan Opera à la pandémie de coronavirus confirme la pole position de linstitution en… [+5851 chars]"}, {"source": {"id": null, "name": "Barbanews.com"}, "author": null, "title": "Michel Drucker - Propos bouleversants concernant le fils de Christophe! - barbanews", "description": "Les réactions par rapport à la mort de Christophe sont de plus en plus nombreuses puisque le chanteur était largement connu. Après Michèle Torr, c’est au tour de Michel Drucker de partager son avis.", "url": "https://www.barbanews.com/peoples/michel-drucker-propos-bouleversants-concernant-le-fils-de-christophe/", "urlToImage": null, "publishedAt": "2020-04-26T06:02:00Z", "content": "Michel Drucker a également décidé de sexprimer sur le sujet comme ont pu le faire de nombreuses stars en France.\r\nVoici les paroles de Michel Drucker par rapport à cette affaire\r\nIl faut savoir que Michel Drucker a perdu de nombreux amis ces dernières années … [+4603 chars]"}, {"source": {"id": null, "name": "Www.rtl.fr"}, "author": null, "title": "Elizabeth II : ses pâtissiers dévoilent la recette de ses cupcakes préférés - RTL.fr", "description": "La reine d'Angleterre a eu 94 ans mardi 21 avril. Pour l'occasion, ses chefs partagent la recette de ses gâteaux préférés.", "url": "https://www.rtl.fr/culture/medias-people/les-chefs-de-buckingham-revelent-la-recette-des-cupcakes-au-chocolat-dont-la-reine-raffole-7800432495", "urlToImage": null, "publishedAt": "2020-04-26T05:56:00Z", "content": "La reine Élisabeth II a fêté ses 94 ans, mardi 21 avril, au palais de Windsor. Confinée avec son mari, elle n'a pas pu profiter des habituelles célébrations qui ponctuent son anniversaire. Mais les chefs de la souveraine lui ont concocté ses cupcakes favoris.… [+1976 chars]"}, {"source": {"id": null, "name": "Barbanews.com"}, "author": null, "title": "Annie et Thierry de l'Amour est dans le Pré - Le diagnostic est tombé ! - barbanews", "description": "Qui ne connaît pas l’Amour est dans le Pré, émission produite par le Groupe M6 et présenté par la charismatique Karine Le Marchand. L’émission, qui en est à sa 15ème...", "url": "https://www.barbanews.com/peoples/annie-et-thierry-de-lamour-est-dans-le-pre-le-diagnostic-est-tombe/", "urlToImage": null, "publishedAt": "2020-04-26T05:50:00Z", "content": "Qui ne connaît pas lAmour est dans le Pré, émission produite par le Groupe M6 et présenté par la charismatique Karine Le Marchand. Lémission, qui en est à sa 15ème édition, enregistre des records daudience et comptabilise de plus en plus de fans au fil des sa… [+2645 chars]"}, {"source": {"id": null, "name": "Barbanews.com"}, "author": null, "title": "Loana - Revient enfin sur les réseaux et fait sensation avec un cliché sexy ! - barbanews", "description": "Depuis cette époque, celle qui avait marqué l’émission avec la fameuse scène de la piscine et le non moins célèbre Jean-Édouard, n’a pas vécu que des moments heureux. Bien au...", "url": "https://www.barbanews.com/peoples/loana-revient-enfin-sur-les-reseaux-et-fait-sensation-avec-un-cliche-sexy/", "urlToImage": null, "publishedAt": "2020-04-26T05:48:00Z", "content": "Depuis cette époque, celle qui avait marqué l’émission avec la fameuse scène de la piscine et le non moins célèbre Jean-Édouard, n’a pas vécu que des moments heureux.\r\nBien au contraire, on ne compte plus le nombre de fois où la jeune femme a voulu se suicide… [+3240 chars]"}, {"source": {"id": null, "name": "Gqmagazine.fr"}, "author": "Paloma González", "title": "11 séries et films recommandés par Stephen King à regarder sur Netflix - GQ Magazine", "description": "Stephen King, le maître de la terreur, s'est mis au service de la communauté en donnant son guide sur Netflix.", "url": "https://www.gqmagazine.fr/pop-culture/article/11-series-et-films-recommandes-par-stephen-king-a-regarder-sur-netflix", "urlToImage": null, "publishedAt": "2020-04-26T05:13:23Z", "content": "Vous avez fini de regarder votre série préférée ? Stephen King sait ce que vous devez regarder maintenant sur Netflix ; le maître de l'horreur a partagé une liste sur son compte Twitter recommandant 11 séries et films. Maintenant que nous passons tous plus de… [+3587 chars]"}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": "Claire Conruyt", "title": "Dix mots anciens ou rares dont vous ne pourrez plus vous passer - Le Figaro", "description": "QUIZ - «Squalide», «infrangible»... Connaissez-vous ces termes? Le Figaro vous propose de le découvrir en un court test.", "url": "http://www.lefigaro.fr/langue-francaise/quiz-francais/dix-mots-anciens-ou-rares-dont-vous-ne-pourrez-plus-vous-passer-20200426", "urlToImage": null, "publishedAt": "2020-04-26T05:00:00Z", "content": "Ce sont des mots étonnants et qui, lorsque nous les lisons, nous font sourire. Dabord, parce quils ont du charme. Ensuite, parce que certains sont absolument précis. Et enfin, parce quils témoignent de la richesse insoupçonnée de la langue française.\r\n» LIRE … [+807 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "Arthur RainBot", "title": "Horoscope chinois du Dimanche 26 avril 2020 - 20minutes.fr", "description": "Découvrez l’horoscope chinois de 20 Minutes du 26/04/2020", "url": "https://www.20minutes.fr/horoscope-quotidien-chinois/2761003-20200415-horoscope-chinois-du-dimanche-26-avril-2020", "urlToImage": null, "publishedAt": "2020-04-26T04:05:02Z", "content": "Découvrez l'horoscope quotidien chinois DR\r\nCôté amour, vous donnerez la priorité à votre vie de famille. Vous voudrez vous sentir proche de vos enfants et de votre partenaire. Pour cela, organisez des sorties en commun. Concernant l'argent et le travail, vot… [+8608 chars]"}, {"source": {"id": null, "name": "Programme-television.org"}, "author": null, "title": "The Voice : Le message de Nikos Aliagas à propos des demi-finales (VIDEO) - Télé 7 Jours", "description": "En raison de l’actualité, les demi-finales de &quot;The Voice&quot;, prévue au Palais des sports de Paris, est reportée pour une durée encore indéterminée. Nikos Aliagas nous en dit plus.", "url": "https://www.programme-television.org/news-tv/The-Voice-Le-message-de-Nikos-Aliagas-a-propos-des-demi-finales-VIDEO-4657947", "urlToImage": null, "publishedAt": "2020-04-25T21:01:00Z", "content": "Ce samedi 25 avril 2020, TF1 diffusait en prime la dernière salve des K.O de The Voice centrée sur léquipe de Pascal Obispo. Prochaine étape pour les 12 candidats encore en lice : les demi-finales, qui devaient se tenir au Palais des sports les 2 et 9 mai pro… [+1762 chars]"}, {"source": {"id": null, "name": "Lejdd.fr"}, "author": "Charlotte Langrand", "title": "Philippe Etchebest alerte sur le sort des restaurateurs : \"Nous sommes les globules rouges de l'économie\" - Le Journal du dimanche", "description": "Le chef Philippe Etchebest alerte sur le &quot;cauchemar national&quot; vécu par les restaurateurs. Il propose que les assureurs soient les &quot;collecteurs&quot; et redistributeurs d'une aide financière d'un montant de 14 milliards d'euros pour les professi…", "url": "https://www.lejdd.fr/Societe/philippe-etchebest-alerte-sur-le-sort-des-restaurateurs-nous-sommes-les-globules-rouges-de-leconomie-3964371", "urlToImage": null, "publishedAt": "2020-04-25T20:53:24Z", "content": "Philippe Etchebest, chef du Quatrième Mur à Bordeaux et juré de lémission Top Chef, a participé à la réunion des restaurateurs avec Emmanuel Macron vendredi dernier. Le président de la République a donné un cap, annonçant une nouvelle réunion fin mai pour dét… [+3920 chars]"}, {"source": {"id": null, "name": "Programme-tv.net"}, "author": "Clémence Leroy", "title": "Sylvie Tellier rayonnante en maillot de bain dans son jardin : les internautes charmés (PHOTO) - Télé Loisirs.fr", "description": "Le confinement nous oblige à nous occuper comme on le peut. Ce 25 avril, après avoir fini les devoirs avec ses trois enfants, Sylvie Tellier a posté une photo en famille sur Instagram. Les internautes étaient ravis !", "url": "https://www.programme-tv.net/news/people/253614-sylvie-tellier-rayonnante-en-maillot-de-bain-dans-son-jardin-les-internautes-charmes-photo/", "urlToImage": null, "publishedAt": "2020-04-25T20:27:58Z", "content": "Le confinement nous pousse à voir dans chaque petite chose de la vie une occasion de passer un bon moment. Ce retour aux choses simples, Sylvie Tellier l'a bien compris. Confinée avec ses trois enfants, la présidente de la société Miss Francetente déjà de con… [+1709 chars]"}, {"source": {"id": null, "name": "Dexerto.fr"}, "author": "Isabelle Thierens", "title": "Un dataminer dévoile comment Epic a dissimulé l'event Travis Scott - Dexerto", "description": "Un dataminer a révélé comment Epic Games avait utilisé des noms de code pour tenter de préserver l'événement Travis Scott.", "url": "https://www.dexerto.fr/fortnite/un-dataminer-devoile-comment-epic-a-dissimule-levent-travis-scott-1256675", "urlToImage": null, "publishedAt": "2020-04-25T18:13:26Z", "content": "Un dataminer sur Fortnite a révélé comment Epic Games avait utilisé des noms de code pour tenter de préserver l'événement Travis Scott et éviter qu'il ne soit gâché par des leaks.\r\nEpic Games n'en est pas à son coup d'essai concernant l'organisation de ce gen… [+2597 chars]"}, {"source": {"id": null, "name": "Presse-citron.net"}, "author": "David Laurent", "title": "Quand Tarantino voulait faire un James Bond - Presse-citron", "description": "Le réalisateur avait même proposé le pitch pour un film James Bond. On avoue un regret à la perspective de ne pas avoir pu découvrir ce film.", "url": "https://www.presse-citron.net/quand-tarantino-voulait-faire-un-james-bond/", "urlToImage": null, "publishedAt": "2020-04-25T18:13:13Z", "content": "Chaque semaine ou presque, on apprend un nouveau projet dans lequel Quentin Tarantino aurait voulu se lancer. Entre l’adaptation d’un film Star Trek, un éventuel reboot de la saga Predator, l’époque durant laquelle il voulait réaliser un film Marvel sur le pe… [+1725 chars]"}, {"source": {"id": null, "name": "Programme-television.org"}, "author": null, "title": "REPLAY - N’oubliez pas les paroles (France 2) : qui a remporté les masters 2019 ? - Télé 7 Jours", "description": "Ce samedi 25 avril 2020, France 2 proposait une rediffusion des demi-finales des masters de &quot;N’oubliez pas les paroles&quot;.", "url": "https://www.programme-television.org/news-tv/N-oubliez-pas-les-paroles-France-2-les-demi-finales-des-masters-en-prime-4657941", "urlToImage": null, "publishedAt": "2020-04-25T17:01:00Z", "content": "Ce samedi 25 avril 2020, les téléspectateurs réunis devant France 2 pourront voir ou revoir les demi-finales des masters de Noubliez pas les paroles. En effet, en cette période de confinement, la chaîne du service public a choisi de rediffuser la compétition … [+1047 chars]"}, {"source": {"id": null, "name": "Allocine.fr"}, "author": "Thomas Imbert ([Url href='https://twitter.com/Thomas_Theory?lang=fr']@Thomas_Theory[/Url])", "title": "QUIZ salles de cinéma vol.1 : à quels films appartiennent-elles ? - AlloCiné", "description": "En attendant de pouvoir y retourner, saurez-vous retrouver dans quels films on trouve ces salles de ciné ? De \"La La Land\" à \"Gremlins\", testez vos connaissances avec notre quiz spécial.", "url": "http://www.allocine.fr/diaporamas/cinema/diaporama-18689543/", "urlToImage": null, "publishedAt": "2020-04-25T17:00:00Z", "content": "Contact|Qui sommes-nous| Recrutement|Publicité|CGU|Politique de cookies|Données Personnelles|Revue de presse|Jeux concours|\r\n ©AlloCiné\r\nRetrouvez tous les horaires et infos de votre cinéma sur le numéro AlloCiné : 0 892 892 892 (0,34/minute)"}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": "Mary Sohier", "title": "Coronavirus Covid-19 : le groupe Les Goguettes fait le buzz avec sa reprise parodique de \"Vesoul\" de Jacques B - France 3 Régions", "description": "Avec près de 2,5 millions de vues en quelques jours, une reprise parodique de \"Vesoul\" de Jacques Brel cartonne. À l'origine de cette vidéo, le groupe parisien Les Goguettes.", "url": "https://france3-regions.francetvinfo.fr/bourgogne-franche-comte/haute-saone/vesoul/coronavirus-covid-19-groupe-goguettes-fait-buzz-sa-reprise-parodique-vesoul-jacques-brel-1820900.html", "urlToImage": null, "publishedAt": "2020-04-25T16:47:16Z", "content": "Il a du mal à réaliser. \"On ne s'y attendait pas. Cest une très bonne surprise. Ça rencontre un écho que nous n'aurions pas soupçonné\", se réjouit Valentin Vander, chanteur du groupe \"Les Goguettes\". Avec près de 2,5 millions de vues en l'espace de trois jour… [+2687 chars]"}, {"source": {"id": null, "name": "Booska-p.com"}, "author": "Booska-p", "title": "Kanye West est désormais milliardaire - Booska-p", "description": "Et cette fois, c'est officiel.", "url": "https://www.booska-p.com/new-kanye-west-est-desormais-milliardaire-n123191.html", "urlToImage": null, "publishedAt": "2020-04-25T15:48:00Z", "content": "Kanye West s’était déjà autoproclamé milliardaire par le passé. Cette fois, ses dires se voient corroborés par la célèbre publication Forbes.\r\nPlus riche que Kylie Jenner\r\nSelon Forbes, le rappeur adepte de la controverse pèserait pas moins de 1,3 milliard de… [+1560 chars]"}, {"source": {"id": null, "name": "Ldpeople.com"}, "author": null, "title": "Manon Marsault très mal, \"proche d'être ruinée\" elle s'exprime - LDpeople.com", "description": "Manon Marsault que nous connaissons maintenant sous le nom de Manon Tanti, s'est faite connaître grâce à la télé-réalité. Julien Tanti...", "url": "https://www.ldpeople.com/manon-marsault-tres-mal-proche-etre-ruinee-exprime-64794", "urlToImage": null, "publishedAt": "2020-04-25T15:25:30Z", "content": "Manon Marsault que nous connaissons maintenant sous le nom de Manon Tanti, s’est faite connaître grâce à la télé-réalité. Julien Tanti est son mari, a participé à toutes les saisons de l’émission Les Marseillais, et il rencontre celle qui devient sa femme sur… [+4661 chars]"}, {"source": {"id": null, "name": "Programme-tv.net"}, "author": "Rime El Himani", "title": "Jean-Luc Reichmann attaqué gratuitement par un internaute : sa réponse pleine d’humour - Télé Loisirs.fr", "description": "Jean-Luc Reichmann s'est bien malgré lui attiré les foudres d'un abonné sur Instagram. Pris à partie  dans les commentaires d'une récente vidéo, l'animateur a répondu avec tout l'humour qu'on lui connait.", "url": "https://www.programme-tv.net/news/tv/253608-jean-luc-reichmann-attaque-gratuitement-par-un-internaute-sa-reponse-pleine-dhumour/", "urlToImage": null, "publishedAt": "2020-04-25T14:49:34Z", "content": "Bien quil soit lun des animateurs préférés des Français, Jean-Luc Reichmann compte lui aussi quelques détracteurs. En mars dernier, lanimateur des 12 Coups de midi sest fait tacler par un internaute qui pensait, à tort, que son jeu était diffusé en direct cha… [+1677 chars]"}, {"source": {"id": null, "name": "Actus.sfr.fr"}, "author": null, "title": "Le nouveau calendrier des films et séries Marvel - SFR Actus", "description": "Même les super-héros n'ont rien pu faire contre la pandémie de coronavirus, qui va entraîner de nombreux reports pour les films et séries Marvel....", "url": "https://actus.sfr.fr/cine-series/cinema/le-nouveau-calendrier-des-films-et-series-marvel-202004250003.html", "urlToImage": null, "publishedAt": "2020-04-25T14:01:00Z", "content": "Même les super-héros n'ont rien pu faire contre la pandémie de coronavirus, qui va entraîner de nombreux reports pour les films et séries Marvel. Alors, quand pourra-t-on voir Black Widow, découvrir l'intriguante WandaVision ou retrouver Les Gardiens de la Ga… [+7870 chars]"}, {"source": {"id": null, "name": "Sortiraparis.com"}, "author": null, "title": "On a testé Ducasse chez moi, le service de livraison de plats by Alain Ducasse - sortiraparis", "description": "Les sept restaurants parisiens d'Alain Ducasse sont désormais disponibles à la livraison chez vous, grâce au tout nouveau service de livraison \"Ducasse chez moi\". Régalade assurée !", "url": "https://www.sortiraparis.com/hotel-restaurant/restaurant/articles/214959-on-a-teste-ducasse-chez-moi-le-service-de-livraison-de-plats-by-alain-ducasse", "urlToImage": null, "publishedAt": "2020-04-25T13:53:00Z", "content": "Par\r\nManon C.· Photos par\r\nManon C.· Publié le 25 avril 2020 à 15h53\r\n· Mis à jour le 25 avril 2020 à 18h25\r\nLes sept restaurants parisiens d'Alain Ducasse sont désormais disponibles à la livraison chez vous, grâce au tout nouveau service de livraison \"Ducass… [+4727 chars]"}, {"source": {"id": null, "name": "Nextplz.fr"}, "author": "Lauriane", "title": "Alix et Benjamin Samat (LMAC) n’ont pas rompu à leur retour en France - NextPlz", "description": "Alix et Benjamin Samat, ne sont plus ensemble, mais ils n’ont pas immédiatement rompu après leur retour à Marseille. Alix raconte sa version.", "url": "https://www.nextplz.fr/telerealite/172026-alix-benjamin-samat-lmac-nont-pas-rompu-retour-france", "urlToImage": null, "publishedAt": "2020-04-25T13:03:00Z", "content": "Bien que les deux candidats des Marseillais aux Caraïbes, Alix et Benjamin Samat, ne soient plus ensemble, ils nont pas immédiatement rompu après leur retour à Marseille. Alix a mis les choses au clair sur ce quil sest exactement passé.\r\nLa saison 9 des Marse… [+1691 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "L'émission de cuisine de Cyril Lignac sur M6 va-t-elle continuer ? Jérôme Anthony répond... - RTL - On a tellement de choses à se dire", "description": "Avec 2,5 millions de téléspectateurs quasiment chaque soir, \"Tous en cuisine en direct avec Cyril Lignac\" c'est le carton du moment à la télé... https://www....", "url": "https://www.youtube.com/watch?v=_zTZ2s-0wpI", "urlToImage": null, "publishedAt": "2020-04-25T12:19:09Z", "content": "Avec 2,5 millions de téléspectateurs quasiment chaque soir, \"Tous en cuisine en direct avec Cyril Lignac\" c'est le carton du moment à la télé...https://www.rtl.fr/culture/medias-peo..."}, {"source": {"id": null, "name": "Programme-tv.net"}, "author": "Rime El Himani", "title": "Tout le monde veut prendre sa place : Nagui amusé par la mésaventure d’une candidate tête en l’air (VIDEO) - Télé Loisirs.fr", "description": "Les candidats de Tout le monde veut prendre sa place ont des anecdotes toutes plus drôles les unes que les autres. La preuve, une nouvelle fois, avec Marie-Aline, une participante victime de trous de mémoire.", "url": "https://www.programme-tv.net/news/tv/253605-tout-le-monde-veut-prendre-sa-place-nagui-amuse-par-la-mesaventure-dune-candidate-tete-en-lair-video/", "urlToImage": null, "publishedAt": "2020-04-25T12:11:07Z", "content": "Après Noubliez pas les paroles, cest au tour de Tout le monde veut prendre sa place dêtre rediffusé sur France 2. Depuis le lundi 20 avril, les fidèles du jeu de Nagui peuvent revoir le parcours de la super championne Marie-Christine, qui avait éliminée avec … [+1892 chars]"}, {"source": {"id": null, "name": "Closermag.fr"}, "author": "Pauline Laforgue", "title": "Kate Middleton : pourquoi elle se charge elle-même des portraits de George, Charlotte et Louis - Closer France", "description": "Le 23 avril dernier, tandis que le prince Louis célébrait son deuxième anniversaire, Kensington Palace a dévoilé d'adorables nouveaux clichés du petit garçon pris pas Kate Middleton. Mais pourquoi la duchesse tient-elle tant à photographier elle-même les port…", "url": "https://www.closermag.fr/royautes/kate-middleton-pourquoi-elle-se-charge-elle-meme-des-portraits-de-george-charlot-1106190", "urlToImage": null, "publishedAt": "2020-04-25T11:13:20Z", "content": "Les photographes font partis de leurs quotidien. A chacune de leurs sorties officielles, les membres de la famille royale sont suivis par des professionnels qui immortalisent leurs faits et gestes, et ce parfois même, jusque dans leur demeure, pour gérer leur… [+1853 chars]"}, {"source": {"id": null, "name": "Bfmtv.com"}, "author": "BFMTV", "title": "Ces nouveaux romans d'auteurs à succès que vous pourrez (enfin) dévorer après le confinement - BFMTV", "description": "Du dernier livre de Joël Dicker à celui de Guillaume Musso, découvrez les dates auxquelles seront publiés les best-sellers de l'été.", "url": "https://www.bfmtv.com/culture/ces-nouveaux-romans-d-auteurs-a-succes-que-vous-pourrez-enfin-devorer-apres-le-confinement-1900556.html", "urlToImage": null, "publishedAt": "2020-04-25T11:07:43Z", "content": null}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "B.Ch.", "title": "Mick Jagger et Paul McCartney rejouent (pour rire) la guerre entre Beatles et Rolling Stones - 20 Minutes", "description": "Les deux chanteurs se répondent par médias interposés sur la question de la supériorité de leurs groupes respectifs", "url": "https://www.20minutes.fr/arts-stars/culture/2767647-20200425-mick-jagger-paul-mccartney-rejouent-rire-guerre-entre-beatles-rolling-stones", "urlToImage": null, "publishedAt": "2020-04-25T10:51:33Z", "content": "Paul McCartney et Mick Jagger en 2011 à New York Richard Young / Rex Fea/REX/SIPA\r\nPaul McCartney et Mick Jagger relancent \r\n la polémique la plus \r\nvive des dernières décennies : plutôt Beatles ou Rolling Stones? Alors bien sûr, cest pour rire, bien sûr, ils… [+1575 chars]"}, {"source": {"id": null, "name": "Ecranlarge.com"}, "author": null, "title": "Tyler Rake : critique qui Thor dur - ÉcranLarge.com", "description": "Découvrez la critique du film Tyler Rake de Sam Hargrave, sorti en 2020 - L'avis d'EcranLarge.com", "url": "https://www.ecranlarge.com/films/critique/1174447-tyler-rake-critique-qui-thor-dur", "urlToImage": null, "publishedAt": "2020-04-25T10:23:06Z", "content": "Les films d'action à l'ancienne, basés sur un personnage fort, un concept simple, une mise en scène de l'action réfléchie et des acteurs capables d'assumer la dimension physique de leur rôle, est tristement oublié par le Hollywood des super-héros. Mais il sem… [+4017 chars]"}, {"source": {"id": null, "name": "Allocine.fr"}, "author": "Mégane Choquet", "title": "Vikings : l'histoire vraie de Floki, le guerrier qui a découvert l'Islande - AlloCiné", "description": "Personnage atypique de Vikings, Floki est connu pour sa conception de bateaux et sa dévotion pour Ragnar. Mais quelle est l'histoire vraie de cette figure nordique ?", "url": "http://www.allocine.fr/article/fichearticle_gen_carticle=18689537.html", "urlToImage": null, "publishedAt": "2020-04-25T09:30:00Z", "content": "Personnage atypique de Vikings, Floki est connu pour sa conception de bateaux et sa dévotion pour Ragnar. Mais quelle est l'histoire vraie de cette figure nordique ?History Channel\r\nAttention, spoilers ! Les paragraphes suivants révèlent des éléments d'intrig… [+2580 chars]"}, {"source": {"id": null, "name": "Zone-turf.fr"}, "author": null, "title": "Quinté plus PMU : Vine Vision se retrouve bien placé - Quinté+ - zone-turf.fr", "description": "Quinté plus PMU : Vine Vision se retrouve bien placé Troisième dans un très bon temps sur le parcours qui nous intéresse, Vine Vision (5) aura notre …", "url": "https://www.zone-turf.fr/quinte/quinte-plus-pmu-vine-vision-se-retrouve-bien-place-104694.html", "urlToImage": null, "publishedAt": "2020-04-25T09:30:00Z", "content": null}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "Jean Saint-Marc", "title": "Coronavirus : Biscottes, sons et dessins… Les archives du confinement sont déjà collectées - 20 Minutes", "description": "Le Mucem et de nombreux services d’archives lancent des collectes d’objets liés au confinement. Après la crise sanitaire, les chercheurs les utiliseront pour analyser ce moment de notre histoire collective", "url": "https://www.20minutes.fr/arts-stars/culture/2767311-20200425-coronavirus-biscottes-sons-dessins-archives-confinement-deja-collectees", "urlToImage": null, "publishedAt": "2020-04-25T09:25:24Z", "content": "Ce puzzle et cette attestation de sortie pourraient rejoindre le fonds du Mucem. J. Saint-Marc / 20 Minutes\r\nQuallez-vous faire de ce magnifique escargot en pâte à sel fabriqué par vos enfants ? Si le confinement vous donne des envies de grand tri de printemp… [+5122 chars]"}, {"source": {"id": null, "name": "Melty.fr"}, "author": "Amandine G", "title": "Touche Pas à Mon Poste : Baptiste Giabiconi, Franck Gastambide, Gradur... Qui est le nouveau chroniqueur annoncé par Cyril Hanouna ? - melty", "description": "Touche pas à mon Poste accueillera de nouveaux chroniqueurs à la rentrée prochaine, et Cyril Hanouna n'a pas hésité à teaser l'identité de l'un d'entre eux.", "url": "https://www.melty.fr/touche-pas-a-mon-poste-baptiste-giabiconi-franck-gastambide-gradur-qui-est-le-nouveau-chroniqueur-annonce-par-cyril-hanouna-a717433.html", "urlToImage": null, "publishedAt": "2020-04-25T09:01:27Z", "content": "Malgré le confinement, c'est officiel, Touche pas à mon Poste rempilera encore pour quelques saisons, comme l'a récemment officialisé Cyril Hanouna ! En plus de toute l'équipe habituelle, l'animateur star de C8 a également teasé l'arrivée de plusieurs nouvell… [+1918 chars]"}, {"source": {"id": null, "name": "Closermag.fr"}, "author": "La rédaction", "title": "Meghan Markle très remontée : dans les coulisses de la première audience qui l'oppose à la presse - Closer France", "description": "Ce vendredi 25 avril se tenait la première audience préliminaire opposant Harry et Meghan et les tabloïds britanniques. Et les avocats de la duchesse n’ont pas mâché leurs mots.", "url": "https://www.closermag.fr/royautes/meghan-markle-tres-remontee-dans-les-coulisses-de-la-premiere-audience-qui-l-opp-1106144", "urlToImage": null, "publishedAt": "2020-04-25T08:16:40Z", "content": "Ce vendredi 25 avril marquait pour Meghan et Harry, le début d'une bataille judiciaire avec les tabloïds britanniques qui leur mènent la vie si dure depuis plusieurs années. Et durant la première audience préliminaire face au groupe Associated Newspapers (édi… [+1687 chars]"}, {"source": {"id": null, "name": "Programme-tv.net"}, "author": "Hugo de Saint Phalle", "title": "Programme TV : les meilleurs films à voir ce samedi 25 avril - Télé Loisirs.fr", "description": "Ambiance familiale avec Le Papillon sur France 2 ou plus sombre avec Parasite ou Les Baronnes sur Canal+… Voici notre sélection de films à voir à la télé ce samedi 25 avril.", "url": "https://www.programme-tv.net/news/cinema/253588-programme-tv-les-meilleurs-films-a-voir-ce-samedi-25-avril/", "urlToImage": null, "publishedAt": "2020-04-25T08:00:00Z", "content": "En période de confinement, chacun occupe son temps comme il peut. Les stars nous le montrent chaque jour comme Franck Dubosc avec ses vidéos humoristiques ou Cristiano Ronaldo qui fait du sport en compagnie de sa chérie Georgina Rodriguez. Mais l'on a le droi… [+3399 chars]"}, {"source": {"id": null, "name": "Stars-actu.fr"}, "author": "Gregory S.", "title": "Étoile mystérieuse des « 12 coups de midi » : les deux premiers indices… - Stars Actu", "description": "Étoile mystérieuse des « 12 coups de midi ». Alors qu'on se demande toujours ce qu'il adviendra du jeu quotidien de Jean-Luc Reichmann", "url": "https://www.stars-actu.fr/2020/04/etoile-mysterieuse-des-12-coups-de-midi-les-deux-premiers-indices/", "urlToImage": null, "publishedAt": "2020-04-25T06:46:00Z", "content": "Étoile mystérieuse des « 12 coups de midi ». Alors que des rediffusions du jeu quotidien de Jean-Luc Reichmann devraient prendre le relais à compter du 29 avril 2020,  faute d’émissions inédites, « Les 12 coups de midi » ont encore résonné hier sur TF1. Et c’… [+1655 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "Arthur RainBot", "title": "Horoscope chinois du Samedi 25 avril 2020 - 20minutes.fr", "description": "Découvrez l’horoscope chinois de 20 Minutes du 25/04/2020", "url": "https://www.20minutes.fr/horoscope-quotidien-chinois/2761047-20200415-horoscope-chinois-du-samedi-25-avril-2020", "urlToImage": null, "publishedAt": "2020-04-25T04:05:02Z", "content": "Découvrez l'horoscope quotidien chinois DR\r\nA propos de l'amour, vos sentiments se renforcent et, comme ils sont partagés, vous pouvez espérer vivre une très belle histoire. Ne craignez pas de vous libérer complètement, vous pourrez avoir confiance en votre p… [+8514 chars]"}, {"source": {"id": null, "name": "Causeur.fr"}, "author": "Causeur.fr, Xavier Legay", "title": "\"Dérapages\" sur Arte, Cantona contre la \"firme\" - Causeur.fr", "description": "Avec \"Dérapages\", Arte propose un thriller social qui invite à la réflexion sur les dérives du management", "url": "https://www.causeur.fr/derapages-sur-arte-la-face-sombre-du-management-175983", "urlToImage": null, "publishedAt": "2020-04-25T04:00:12Z", "content": "Jusqu’où Eric Cantona est-il prêt à aller pour retrouver un emploi à son âge? Avec Dérapages, Arte nous offre un thriller social qui invite à la réflexion sur les dérives du monde de lentreprise. Réussi\r\nDans cette mini-série, Eric Cantona campe brillamment A… [+5652 chars]"}, {"source": {"id": null, "name": "13or-du-hiphop.fr"}, "author": "estelle", "title": "Jul : les montants des enchères continuent de grimper, le prix pour “My World” est démentiel - 13OR-du-HipHop.fr", "description": "Alors que les enchères de la mise en vente des certifications de Jul vont prendre fin dans 2 jours (ce lundi 27 avril), les montants ne cessent d'augmenter chaque jour et l'enchère du Double disque de platine remis à l'artiste Marseillais pour l'album \"My Wor…", "url": "https://www.13or-du-hiphop.fr/2020/04/25/jul-les-montants-des-encheres-continuent-de-grimper-le-prix-pour-my-world-est-dementiel/", "urlToImage": null, "publishedAt": "2020-04-25T00:46:53Z", "content": "Alors que les enchères de la mise en vente des certifications de Jul vont prendre fin dans 2 jours (ce lundi 27 avril), les montants ne cessent d’augmenter chaque jour et l’enchère du Double disque de platine remis à l’artiste Marseillais pour l’album “My Wor… [+1149 chars]"}, {"source": {"id": null, "name": "Journaldugeek.com"}, "author": "Julie Hay", "title": "Disney+ développe une série Star Wars avec un casting féminin - Journal du geek", "description": "Disney+ va développer une nouvelle série Star Wars, avec un casting féminin et la créatrice de Poupées Russes aux commandes.", "url": "https://www.journaldugeek.com/2020/04/24/disney-serie-star-wars-casting-feminin/", "urlToImage": null, "publishedAt": "2020-04-24T17:57:23Z", "content": "On na pas fini dentendre parler de la galaxie de George Lucas. Disney+ va développer une nouvelle série Star Wars, avec un casting féminin et la créatrice de Poupées Russes aux commandes.Crédits : LucasFilm\r\nLa galaxie Star Wars va encore s’agrandir, à en cro… [+1907 chars]"}, {"source": {"id": null, "name": "Allocine.fr"}, "author": "La Rédaction", "title": "Plus belle la vie du mardi 28 avril 2020 : résumé en avance de l'épisode 4047 [SPOILERS] - AlloCiné", "description": "Dans le prochain épisode de \"Plus belle la vie\"... Alors que Samia se lance dans un nouveau projet, Jimmy Moon soumet ses apprentis à une nouvelle épreuve. De son côté, Irina réussira-t-elle à surmont...", "url": "http://www.allocine.fr/article/fichearticle_gen_carticle=18689077.html", "urlToImage": null, "publishedAt": "2020-04-24T17:45:00Z", "content": "Dans le prochain épisode de \"Plus belle la vie\"... Alors que Samia se lance dans un nouveau projet, Jimmy Moon soumet ses apprentis à une nouvelle épreuve. De son côté, Irina réussira-t-elle à surmonter sa peine ?Capture d'écran/FTV\r\nAttention, les paragraphe… [+1213 chars]"}, {"source": {"id": null, "name": "Www.rtl.fr"}, "author": null, "title": "VIDÉO - Les Grosses Têtes : Karine Le Marchand s'y connait en femme à barbe - RTL.fr", "description": "REPLAY - Écoutez ou réécoutez l'émission du vendredi 24 avril 2020 avec Laurent Ruquier et ses Grosses Têtes du jour.", "url": "https://www.rtl.fr/culture/medias-people/video-les-grosses-tetes-karine-le-marchand-s-y-connait-en-femme-a-barbe-7800419976", "urlToImage": null, "publishedAt": "2020-04-24T16:05:00Z", "content": "Découvrez Les Grosses Têtes du vendredi 24 avril 2020 ! Laurent Ruquier vous présente le plateau du jour : Une Grosse Tête avec qui on se demande comment on va lui faire porter un masque vu quelle a déjà du mal à porter une culotte : Karine Le Marchand. Une G… [+1840 chars]"}, {"source": {"id": null, "name": "Konbini.com"}, "author": "Lucille Bion", "title": "Les 5 films incontournables de François Truffaut qu'il faut voir sur Netflix - Konbini France", "description": "Alors que 12 films de Truffaut sont disponibles sur Netflix, voici quelques pistes pour accueillir son œuvre et la comprendre.", "url": "https://www.konbini.com/fr/cinema/les-5-films-incontournables-de-francois-truffaut-quil-faut-voir-sur-netflix/", "urlToImage": null, "publishedAt": "2020-04-24T15:57:49Z", "content": "Netflix a décidé délargir son catalogue en piochant dans luvre de François Truffaut. Grâce à un partenariat signé avec MK2, la plateforme a récupéré 12 films du réalisateur français. \r\nChef de file de la Nouvelle Vague, grand rival de Jean-Luc Godard, critiqu… [+7875 chars]"}, {"source": {"id": null, "name": "Programme-tv.net"}, "author": "Lisa ETCHEBERRY", "title": "Netflix : séries, films, documentaires… Toutes les nouveautés attendues en mai 2020 sur la plateforme - Télé Loisirs.fr", "description": "De nombreuses nouveautés sont prévues pour ce mois de mai 2020 sur Netflix. Entre autre, la saison 1 de The Eddy, la série de Damien Chazelle, Hollywood, la nouvelle création de Ryan Murphy et côté cinéma, Get Out, signé Jordan Peele ou encore Mission impossi…", "url": "https://www.programme-tv.net/news/evenement/netflix-series-films-et-documentaires-sur-netflix/253583-netflix-series-films-documentaires-toutes-les-nouveautes-attendues-en-mai-2020-sur-la-plateforme/", "urlToImage": null, "publishedAt": "2020-04-24T15:45:00Z", "content": "De nombreuses nouveauté attendent encore les abonnés Netflix pour mai 2020. Lévénement de ce mois ? The Eddy, série musicale et dramatique signée Damien Chazelle (La La Land, Whiplash), et réunissant Tahar Rahim et Leïla Bekhti. Autre moment fort pour les sér… [+8698 chars]"}]}