{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "20minutes.fr"}, "author": "J.G.", "title": "Un concours pour désigner la pire coiffure du confinement dans le Morbihan - 20 Minutes", "description": "Une coiffeuse de Larré vient de désigner les deux gagnants du concours", "url": "https://www.20minutes.fr/societe/2768051-20200426-coronavirus-morbihan-concours-designer-coiffure-plus-moche-confinement", "urlToImage": null, "publishedAt": "2020-04-26T16:08:34Z", "content": "Voici les deux gagnants du concours de la coiffure la plus moche du confinement dans le Morbihan. Page Facebook @ElieCoiffure\r\nLes salons de coiffure fermés, les désastres capillaires se multiplient pendant le confinement. Beaucoup de personnes ont en effet t… [+1029 chars]"}, {"source": {"id": null, "name": "Ldpeople.com"}, "author": null, "title": "Michèle Torr \"dézingue brutalement\" l'épouse de Christophe - LDpeople.com", "description": "Michèle Torr: Suite à la mort de Christophe, survenue le 16 avril dernier à l’âge de 74 ans, deux clans s’opposent de manière assez violente.", "url": "https://www.ldpeople.com/michele-torr-dezingue-brutalement-lepouse-de-christophe-64811", "urlToImage": null, "publishedAt": "2020-04-26T14:55:58Z", "content": "Michèle Torr: Suite à la mort de Christophe, survenue le 16 avril dernier à lâge de 74 ans, deux clans sopposent de manière assez violente. Dun côté Michèle Torr, qui avait partagé la vie de linterprète des « Mots bleus » dans les années 1970 et sa seconde fe… [+6258 chars]"}, {"source": {"id": null, "name": "Barbanews.com"}, "author": null, "title": "Carla Moreau (Les Marseillais) : sa perte de poids fulgurante encouragée par ses abonnés - barbanews", "description": "Depuis sa grossesse et la naissance de sa fille, la jolie blonde de l’émission « Les Marseillais » avait dû s’accommoder de quelques kilos en trop. Malheureusement, malgré le soutien...", "url": "https://www.barbanews.com/peoples/carla-moreau-les-marseillais-sa-perte-de-poids-fulgurante-encouragee-par-ses-abonnes/", "urlToImage": null, "publishedAt": "2020-04-26T14:45:00Z", "content": "Depuis sa grossesse et la naissance de sa fille, la jolie blonde de l’émission « Les Marseillais » avait dû s’accommoder de quelques kilos en trop.\r\nMalheureusement, malgré le soutien de son chéri et de ses abonnés, cette dernière ne s’est jamais vraiment hab… [+3109 chars]"}, {"source": {"id": null, "name": "Ladepeche.fr"}, "author": "Lucas Serdic", "title": "Koh-Lanta : Inès, la candidate toulousaine, en larmes à l'hôpital, Denis Brogniart prend sa défense - LaDepeche.fr", "description": "Depuis l'élimination de Sam vendredi dernier, l'un des candidats les plus appréciés par le public de cette saison de Koh-Lanta, Inès, la candidate toulousaine, reçoit de très nombreux messages de haine sur les réseaux sociaux. Alors qu'elle travaille à l'hôpi…", "url": "https://www.ladepeche.fr/2020/04/26/koh-lanta-en-larmes-a-lhopital-ines-linfirmiere-toulousaine-porte-plainte,8863466.php", "urlToImage": null, "publishedAt": "2020-04-26T14:36:27Z", "content": "l'essentiel\r\n Depuis l'élimination de Sam vendredi dernier, l'un des candidats les plus appréciés par le public de cette saison de Koh-Lanta, Inès, la candidate toulousaine, reçoit de très nombreux messages de haine sur les réseaux sociaux. Alors qu'elle trav… [+4266 chars]"}, {"source": {"id": null, "name": "Bfmtv.com"}, "author": "BFMTV", "title": "Mort de l'écrivain suédois Per Olov Enquist - BFMTV", "description": "Son roman Le médecin personnel du roi lui avait permis de décrocher en 2001 en France le prix du Meilleur livre étranger.", "url": "https://www.bfmtv.com/culture/mort-de-l-ecrivain-suedois-per-olov-enquist-1902013.html", "urlToImage": null, "publishedAt": "2020-04-26T14:28:34Z", "content": null}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": "Olivier Delcroix", "title": "Un nouvel album d'Astérix et Obélix signé Uderzo et Goscinny publié à la rentrée - Le Figaro", "description": "Les éditions Albert René exhument un œuvre rare des célèbres créateurs de l'irréductible petit Gaulois réalisée en 1967 sous forme d'album sonore. Intitulé Le Menhir d'or, cette histoire qui a pour héros le barde Assurancetourix, paraîtra le 21 octobre procha…", "url": "http://www.lefigaro.fr/bd/un-nouvel-album-d-asterix-et-obelix-signe-uderzo-et-goscinny-publie-a-la-rentree-20200426", "urlToImage": null, "publishedAt": "2020-04-26T14:08:00Z", "content": "Par Toutatis! Il y a de quoi être surpris. Alors qu'Albert Uderzo, l'un des derniers géants de la bande dessinée franco-belge a tiré sa révérence le 24 mars dernier, voilà qu'on annonce déjà son retour sous la forme d'un nouvel album d'Astérix, Le Menhir d'or… [+3150 chars]"}, {"source": {"id": null, "name": "Sortiraparis.com"}, "author": null, "title": "Coronavirus à Paris et en Ile-de-France, distribution de masques et bilan - sortiraparis", "description": "Envie de connaitre les dernières infos sur la situation à Paris et en Région parisienne concernant l'épidémie de Covid-19 et ses conséquences ? On fait le point ce dimanche 26 avril : courses, marchés, transports, mesures, distribution de masques et dernier b…", "url": "https://www.sortiraparis.com/actualites/a-paris/articles/210162-coronavirus-a-paris-et-en-ile-de-france-distribution-de-masques-et-bilan", "urlToImage": null, "publishedAt": "2020-04-26T14:03:56Z", "content": "Par\r\nMy B.· Photos par\r\nMy B.· Publié le 26 avril 2020 à 15h30\r\n· Mis à jour le 26 avril 2020 à 15h37\r\nEnvie de connaitre les dernières infos sur la situation à Paris et en Région parisienne concernant l'épidémie de Covid-19 et ses conséquences ? On fait le p… [+98724 chars]"}, {"source": {"id": null, "name": "Purepeople.com"}, "author": "Emma Vanpoulle", "title": "The Voice 2020 : Nessa éliminée mais déjà sollicitée pour des projets alléchants - Pure People", "description": "À l'issue des ultimes épreuves des K.O. la jeune Nessa a vu son aventure \"The Voice\" toucher à sa fin. Éliminée par Pascal Obispo, la candidate ne retient que du positif de cette expérience sur TF1 et annonce avoir d'ores et déjà de nombreux projets pour la s…", "url": "https://www.purepeople.com/article/the-voice-2020-nessa-eliminee-mais-deja-sollicitee-pour-des-projets-allechants_a385796/1", "urlToImage": null, "publishedAt": "2020-04-26T13:56:00Z", "content": "Samedi 25 avril 2020 avait lieu le dernier épisode des K.O. dans The Voice. C'est Pascal Obispo qui a clôturé cette épreuve de l'aventure en établissant des choix déchirants au sein de son équipe. En effet, le coach a dû se séparer de quatre de ses sept talen… [+1757 chars]"}, {"source": {"id": null, "name": "Public.fr"}, "author": "Public", "title": "Jean-Luc Reichmann : critiqué sur son train de vie \"aisé\", il répond cash ! - Public", "description": "« Mesdames et Messieurs, aujourd’hui, je le déclare haut et fort, Eric passe devant Paul ! Il reviendra demain pour une 154e participation », annonçait Jean-Luc Reichmann durant l’émission du mardi 21 avril. « C’est une grande fierté », a déclaré le candidat …", "url": "https://www.public.fr/News/Jean-Luc-Reichmann-critique-sur-son-train-de-vie-aise-il-repond-cash-1639805", "urlToImage": null, "publishedAt": "2020-04-26T13:30:02Z", "content": "« Mesdames et Messieurs, aujourdhui, je le déclare haut et fort, Eric passe devant Paul ! Il reviendra demain pour une 154e participation », annonçait Jean-Luc Reichmann durant lémission du mardi 21 avril. « Cest une grande fierté », a déclaré le candidat à F… [+1681 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "A.L.", "title": "Coronavirus : Pas de finale en direct le 9 mai pour « The Voice », confirme Nikos Aliagas - 20 Minutes", "description": "« Nous ne sommes pas en mesure de réaliser ces grands shows en direct tant attendus », a confirmé l’animateur de « The Voice » Nikos Aliagas, alors que la demi-finale et la finale devaient se tenir les 2 et 9 mai", "url": "https://www.20minutes.fr/arts-stars/television/2768075-20200426-coronavirus-finale-direct-9-mai-the-voice-confirme-nikos-aliagas", "urlToImage": null, "publishedAt": "2020-04-26T13:19:24Z", "content": "\"The Voice\" domine une fois encore les audiences du samedi soir. The Voice © 2020 Licencée par TALPA INTERNATIONAL - Format créé par TALPA CONTENT. THOMAS BRAUT / ITV STUDIOS FRANCE / BUREAU 233 / TF1\r\nOn sen doutait, cest désormais confirmé : la demi-finale … [+1553 chars]"}, {"source": {"id": null, "name": "Purepeople.com"}, "author": "Emma Vanpoulle", "title": "Karine Ferri gâtée par Yoann Gourcuff pour son anniversaire confiné - Pure People", "description": "Samedi 25 avril 2020, Karine Ferri célébrait ses 38 ans entourée de ses enfants et de son mari Yoann Gourcuff. Ce dernier n'a d'ailleurs pas fait les choses à moitié pour combler sa belle, et ce, même en période de confinement !", "url": "https://www.purepeople.com/article/karine-ferri-gatee-par-yoann-gourcuff-pour-son-anniversaire-confine_a385799/1", "urlToImage": null, "publishedAt": "2020-04-26T13:11:00Z", "content": "À défaut de célébrer son anniversaire en grande pompe avec de nombreux invités, c'est en version confinée que Karine Ferri a soufflé ses 38 bougies samedi 25 avril 2020. Un moment privilégié avec sa famille qu'elle n'aurait échangé pour rien au monde. D'aille… [+1460 chars]"}, {"source": {"id": null, "name": "Europe1.fr"}, "author": "Julien Ricotta", "title": "Alexandra Lamy est confinée avec sa sœur Audrey : \"C’est comme si on était gamines, c’est super\" - Europe1", "description": "Chaque semaine pendant le confinement, Frédéric Taddeï interroge des invités non plus &quot;En Balade&quot;, mais par téléphone, pour leur demander comment ils vivent cette période si particulière. Alexandra Lamy a assuré apprécier la cohabitation avec sa sœu…", "url": "https://www.europe1.fr/culture/alexandra-lamy-est-confinee-avec-sa-soeur-audrey-cest-comme-si-on-etait-gamines-cest-super-3963893", "urlToImage": null, "publishedAt": "2020-04-26T12:17:00Z", "content": "INTERVIEWElles sont toutes les deux actrices de renom et passent leur confinement ensemble. Alexandra Lamy vit depuis plusieurs semaines avec sa sur Audrey, dans sa maison située dans les Cévennes. Et visiblement, la cohabitation se passe bien. \"Cest comme si… [+2123 chars]"}, {"source": {"id": null, "name": "Programme-tv.net"}, "author": "Rime El Himani", "title": "Brad Pitt ridiculise Donald Trump dans une parodie hilarante (VIDEO) - Télé Loisirs.fr", "description": "Ce samedi 25 avril, Brad Pitt a offert un très beau spectacle aux téléspectateurs du Saturday Night Live. Grimé en médecin, l'acteur a pris un malin plaisir à se moquer de Donald Trump sur sa gestion de la crise du coronavirus.", "url": "https://www.programme-tv.net/news/cinema/253623-brad-pitt-ridiculise-donald-trump-dans-une-parodie-hilarante-video/", "urlToImage": null, "publishedAt": "2020-04-26T11:38:36Z", "content": "Les récentes déclarations de Donald Trump sur le coronavirus ont horrifié la communauté scientifique mondiale. Lors dune conférence de presse organisée à la Maison Blanche, jeudi 23 avril, le président des Etats-Unis a suggéré de soigner les malades du Covid-… [+2206 chars]"}, {"source": {"id": null, "name": "Closermag.fr"}, "author": "Clara Carlesimo", "title": "Arielle Dombasle : ses rares confidences sur sa vie avec Bernard-Henri Lévy - Closer France", "description": "Confinée à Paris auprès de Bernard-Henri Lévy, Arielle Dombasle s'est laissée aller à quelques confidences sur leur couple dans les colonnes du Journal du dimanche.", "url": "https://www.closermag.fr/people/arielle-dombasle-ses-rares-confidences-sur-sa-vie-avec-bernard-henri-levy-1106374", "urlToImage": null, "publishedAt": "2020-04-26T11:38:31Z", "content": "Le confinement, c'est à deux qu'ils le vivent. Mariés depuis 1993, Arielle Dombasle et Bernard-Henri Lévy ne sont pas vraiment loquaces lorsqu'il s'agit d'évoquer leurs sentiments et leur quotidien. Mais dans les colonnes du Journal du dimanche le 26 avril, l… [+2548 chars]"}, {"source": {"id": null, "name": "Ecranlarge.com"}, "author": "", "title": "Marvel : Disney repousse à nouveau la suite de Doctor Strange mais avance la sortie de Thor 4 - Actualité Film - ÉcranLarge.com", "description": "Doctor Strange in the Multiverse of Madness: Il va falloir attendre un peu plus avant de voir le Doctor Strange de Sam Raimi et la raison ne va (pas) vous surprendre. Par contre Thor 4 est avancé !\nCela fait une quarantaine de jours que le", "url": "https://www.ecranlarge.com/films/news/1174500-marvel-disney-repousse-a-nouveau-la-suite-de-doctor-strange-mais-avance-la-sortie-de-thor-4", "urlToImage": null, "publishedAt": "2020-04-26T11:35:00Z", "content": "Il va falloir attendre un peu plus avant de voir le Doctor Strange de Sam Raimi et la raison ne va (pas) vous surprendre. Par contre Thor 4 est avancé !\r\nCela fait une quarantaine de jours que le coronavirus sévit aux US et si les studios ont dans un premier … [+1802 chars]"}, {"source": {"id": null, "name": "Programme-tv.net"}, "author": "Anne-Laure Deparis", "title": "Les 12 Coups de midi : Eric franchit un nouveau cap et menace Christian Quesada - Télé Loisirs.fr", "description": "Rien ne semble pouvoir arrêter Eric dans Les Douze Coups de midi. L'actuel champion de jeu de Jean-Luc Reichmann a franchi un nouveau palier dans l'émission diffusée ce dimanche 26 avril sur TF1.", "url": "https://www.programme-tv.net/news/tv/253622-les-12-coups-de-midi-eric-franchit-un-nouveau-cap-et-menace-christian-quesada/", "urlToImage": null, "publishedAt": "2020-04-26T11:31:08Z", "content": "Mais jusqu'où ira Eric, l'actuel grand champion desDouze Coups de midi ? Depuis son arrivée dans le jeu de Jean-Luc Reichmann sur TF1 le 29 novembre dernier, le père de famille breton effectuait ce dimanche 26 avril sa 159e participation dans l'émission. Et l… [+1753 chars]"}, {"source": {"id": null, "name": "Offside.fr"}, "author": null, "title": "Laurent Ournac se lâche et révèle ce qu'il pense de Mimie Mathy - Actualités Offside", "description": "Laurent Ournac et Mimie Mathy: Les deux vedettes sont connues pour leurs séries respectives sur TF1 par le grand public. Camping Paradis", "url": "https://www.offside.fr/laurent-ournac-lache-revele-pense-mimie-mathy/", "urlToImage": null, "publishedAt": "2020-04-26T11:30:05Z", "content": "Laurent Ournac et Mimie Mathy: Les deux vedettes sont connues pour leurs séries respectives sur TF1 par le grand public. Camping Paradis et Joséphine, ange gardien ont beaucoup d succès auprès des fans. Laurent Ournac et Mimie Mathy sont amenés à se côtoyer e… [+5061 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "Jérôme Gicquel", "title": "Coronavirus en Bretagne : Le festival Les Vieilles Charrues espère accueillir Céline Dion en 2021 - 20 Minutes", "description": "La chanteuse a annoncé qu’elle reportait toutes les dates de sa tournée européenne", "url": "https://www.20minutes.fr/arts-stars/culture/2768007-20200426-coronavirus-bretagne-festival-vieilles-charrues-espere-accueillir-celine-dion-2021", "urlToImage": null, "publishedAt": "2020-04-26T11:18:08Z", "content": "Céline Dion en concert à Londres, le 5 juillet 2019. NLC/Neil Lupin/WENN/SIPA\r\nCest la mort dans lâme que les organisateurs des Vieilles Charrues ont annoncé le 15 avril lannulation de lédition 2020 qui devait se tenir du 16 au 19 juillet à Carhaix (Finistère… [+1616 chars]"}, {"source": {"id": null, "name": "Tirage-gagnant.com"}, "author": "Nicolas Robineau", "title": "Résultat Keno du dimanche 26 avril 2020 : tirage du midi en ligne - Tirage Gagnant", "description": "Les tirages Keno FDJ de ce dimanche 26 avril 2020 ✅ Résultats disponibles à 13h45 (midi) et 21h00 (soir)", "url": "https://tirage-gagnant.com/46508/resultat-keno-dimanche-26-avril-2020/", "urlToImage": null, "publishedAt": "2020-04-26T10:43:00Z", "content": "Les tirages du Keno FDJ de ce dimanche 26 avril 2020 sont être tiré au sort comme chaque jour de la semaine. Le week-end, ne modifie pas les règles du jeu Keno et le jackpot maximum que vous pourrez remporter est toujours de 100’000/an à vie (si vous jouez un… [+1830 chars]"}, {"source": {"id": null, "name": "Leparisien.fr"}, "author": null, "title": "Dans le Morbihan, le duc et la duchesse de Rohan confinés dans leur château de Josselin - Le Parisien", "description": "Le duc et la duchesse de Rohan, confinés dans ce monument historique du Morbihan, espèrent encore sauver la saison touristique au mois d’aoû", "url": "http://www.leparisien.fr/culture-loisirs/dans-le-morbihan-le-duc-et-la-duchesse-de-rohan-confines-dans-leur-chateau-de-josselin-26-04-2020-8306001.php", "urlToImage": null, "publishedAt": "2020-04-26T10:40:00Z", "content": "Ils vivent à deux dans l'un des plus beaux châteaux de la Bretagne historique. Antoinette de Rohan, 73 ans, et son époux, le 14e duc de Rohan (et ancien sénateur) plus connu sous son nom d'usage, Josselin de Rohan, 82 ans, uvrent toute l'année à faire vivre c… [+1381 chars]"}, {"source": {"id": null, "name": "Nextplz.fr"}, "author": "Lauriane", "title": "Iris Mittenaere tacle Kev Adams avec des confidences très intimes - NextPlz", "description": "Iris Mittenaere s’est lâchée dans un live avec Jarry. L’ancienne Miss Universe 2016 a taclé ses ex en révélant des détails très intimes.", "url": "https://www.nextplz.fr/people/172079-iris-mittenaere-tacle-kev-adams-confidences-tres-intimes", "urlToImage": null, "publishedAt": "2020-04-26T10:36:00Z", "content": "Iris Mittenaere sest complètement lâchée dans le live Instagram de lhumoriste Jarry. Sans les nommer, Lancienne Miss Universe 2016 a taclé ses ex en révélant des détails très intimes.\r\nIris Mittenaere trouve le confinement long. Pourtant, elle le passe dans s… [+1566 chars]"}, {"source": {"id": null, "name": "Www.rtl.fr"}, "author": null, "title": "Confinement : aidez les abeilles en plantant des fleurs mellifères - RTL.fr", "description": "Dimanche 26 avril, Juliette Dumas, la coach bien être de RTL, nous invite à nous confiner responsable.", "url": "https://www.rtl.fr/culture/arts-spectacles/confinement-aidez-les-abeilles-en-plantant-des-fleurs-melliferes-7800443620", "urlToImage": null, "publishedAt": "2020-04-26T10:06:00Z", "content": "Dimanche 26 avril, Juliette Dumas, la coach bien être de RTL, nous invite à nous confiner responsable. \"J'ai rencontré de loin Antoine Lamy, qui travaille à l'Observatoire français d'apidologie, là où étudie le comportement des abeilles. Grâce à elle, 30% de … [+725 chars]"}, {"source": {"id": null, "name": "Allocine.fr"}, "author": "Laurent Schenck", "title": "Le Corniaud sur France 2 à 14h : pourquoi de Funès est-il entré dans une colère noire lors du tournage ? - AlloCiné", "description": "Emmené par un duo mythique, \"Le Corniaud\" est diffusé cet après-midi sur France 2. Pour l'occasion, retour sur le moment où Louis de Funès s'est... Pour le moins emporté contre le réalisateur Gérard O...", "url": "http://www.allocine.fr/article/fichearticle_gen_carticle=18689522.html", "urlToImage": null, "publishedAt": "2020-04-26T10:00:00Z", "content": "Emmené par un duo mythique, \"Le Corniaud\" est diffusé cet après-midi sur France 2. Pour l'occasion, retour sur le moment où Louis de Funès s'est... Pour le moins emporté contre le réalisateur Gérard Oury.\r\nDans Le Corniaud, Louis de Funès incarne Leopold Saro… [+2807 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "PODCAST. L’acteur Bernard Menez est remonté contre « le pouvoir qui ne fait que de la surcommunication » - Ouest-France", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMinwFodHRwczovL3d3dy5vdWVzdC1mcmFuY2UuZnIvc2FudGUvdmlydXMvY29yb25hdmlydXMvcG9kY2FzdC1sLWFjdGV1ci1iZXJuYXJkLW1lbmV6LWVzdC1yZW1vbnRlLWNvbnRyZS1sZS1wb3V2b2lyLXF1aS1uZS1mYWl0LXF1ZS1kZS1sYS1zdXJjb21tdW5pY2F0aW9uLTY4MTc5MTPSAZ8BaHR0cHM6Ly9hbXAub3Vlc3QtZnJhbmNlLmZyL3NhbnRlL3ZpcnVzL2Nvcm9uYXZpcnVzL3BvZGNhc3QtbC1hY3RldXItYmVybmFyZC1tZW5lei1lc3QtcmVtb250ZS1jb250cmUtbGUtcG91dm9pci1xdWktbmUtZmFpdC1xdWUtZGUtbGEtc3VyY29tbXVuaWNhdGlvbi02ODE3OTEz?oc=5", "urlToImage": null, "publishedAt": "2020-04-26T09:45:02Z", "content": null}, {"source": {"id": null, "name": "Closermag.fr"}, "author": "La rédaction", "title": "Læticia Hallyday poste une vidéo trop mignonne avec Jade et Joy pour l'anniversaire de la femme de Tomer Sisley - Closer France", "description": "Pour souhaiter un bon anniversaire à leur amie Sandra Sisley, ce samedi 25 avril, Læticia, Jade et Joy Hallyday ont poussé la chansonnette, en vidéo.", "url": "https://www.closermag.fr/people/l-ticia-hallyday-poste-une-video-trop-mignonne-avec-jade-et-joy-pour-l-anniversa-1106339", "urlToImage": null, "publishedAt": "2020-04-26T09:14:05Z", "content": "Depuis la mort de Johnny en décembre 2017, Læticia Hallyday peut compter sur le soutien de ses amies parmi lesquelles figure, à une très bonne place, Sandra, l'épouse de l'acteur Tomer Sisley. Alors quand cette dernière fête son anniversaire, hors de question… [+1548 chars]"}, {"source": {"id": null, "name": "Purepeople.com"}, "author": "Olivia Maunoury", "title": "Lily-Rose Depp séparée de Timothée Chalamet : rupture après un an d'amour - Pure People", "description": "Comme Lily-Rose Depp et Timothée Chalamet ne se sont jamais exprimés sur leur histoire d'amour, l'annonce de leur supposée rupture ne vient pas d'eux. La presse américaine affirme en effet que la fille de Vanessa Paradis et Johnny Depp et l'acteur se seraient…", "url": "https://www.purepeople.com/article/lily-rose-depp-separee-de-timothee-chalamet-rupture-apres-un-an-d-amour_a385766/1", "urlToImage": null, "publishedAt": "2020-04-26T09:07:00Z", "content": "L'histoire d'amour entre Lily-Rose Depp et Timothée Chalamet s'écrirait-elle déjà au passé ? Oui si l'on en croit la presse américaine. US Weekly, repris par People, annonce que la fille de 20 ans de Vanessa Paradis et Johnny Depp et l'acteur franco-américain… [+1738 chars]"}, {"source": {"id": null, "name": "Leparisien.fr"}, "author": null, "title": "Programme TV du dimanche 26 avril : notre sélection - Le Parisien", "description": "Un Dracula papy gâteau, la fille de d’Artagnan qui croise le fer, un duel en cuisine inénarrable et un corniaud qui l’est tout autant... on", "url": "http://www.leparisien.fr/culture-loisirs/tv/programme-tv-du-dimanche-26-avril-notre-selection-26-04-2020-8305956.php", "urlToImage": null, "publishedAt": "2020-04-26T08:32:00Z", "content": "A 21h05 sur TF1. Décidément, Mavis, la fille de Dracula, ne ménage pas son père : dans « Hôtel Transylvanie » (2012), elle lui avait déjà fait le sale coup d'épouser un humain. Dans cette suite, elle accouche d'un petit garçon, qui semble plus disposé à deven… [+6043 chars]"}, {"source": {"id": null, "name": "Ozap.com"}, "author": "Florian Guadalupe", "title": "Confinement : Stéphane Bern détaille la soirée qui remplacera l'Eurovision sur France 2 - Ozap", "description": "L'animateur était l'invité hier de l'émission \"On refait la télé\" présentée par Eric Dussart et Jade sur RTL.", "url": "https://www.ozap.com/actu/confinement-stephane-bern-detaille-la-soiree-qui-remplacera-l-eurovision-sur-france-2/592351", "urlToImage": null, "publishedAt": "2020-04-26T08:27:02Z", "content": "Une soirée spéciale dédiée au concours européen. Le 18 mars dernier, l'Union Européenne de Radio-télévision avait officialisé l'annulation de la prochaine édition de l'Eurovision, qui devait se tenir le 16 mai prochain aux Pays-Bas, en raison de la crise sani… [+1471 chars]"}, {"source": {"id": null, "name": "Radioscoop.com"}, "author": null, "title": "NETFLIX dévoile les codes secrets pour débloquer une liste infinie de films, séries et documentaires ... - Radio Scoop", "description": "Vous pensiez avoir exploré la totalité de Netflix  en cette période de confinement ? Voici tous les codes pour accéder aux contenus cachés.", "url": "https://www.radioscoop.com/people/netflix-devoile-les-codes-secrets-pour-debloquer-une-liste-infinie-de-films-series-et-documentaires_185896", "urlToImage": null, "publishedAt": "2020-04-26T08:07:00Z", "content": "Netflix ne propose pas l'intégralité de son catalogue à ses abonnés. Le géant du streaming a en effet un algorithme qui rend visible les contenus correspondants à vos goûts, ce qui rend parfois compliqué la recherche de films ou séries qui sortent de vos habi… [+792 chars]"}, {"source": {"id": null, "name": "Programme-tv.net"}, "author": "Claire Picard", "title": "Programme TV : les meilleurs films à voir ce dimanche 26 avril - Télé Loisirs.fr", "description": "Découvrez notre sélection des meilleurs films à voir ou à revoir ce dimanche 26 avril à la télévision.", "url": "https://www.programme-tv.net/news/cinema/253587-programme-tv-les-meilleurs-films-a-voir-ce-dimanche-26-avril/", "urlToImage": null, "publishedAt": "2020-04-26T08:00:00Z", "content": "A chacun sa façon de nourrir son temps de loisir pendant ce long confinement. Certains vont se réfugier dans la lecture, dautres dans la méditation, pour dautres encore, ce sera une activité manuelle. Mais pour la plupart, les écrans restent le meilleur moyen… [+3205 chars]"}, {"source": {"id": null, "name": "Ozap.com"}, "author": null, "title": "Audiences : \"The Voice\" leader devant \"Mongeville\", Nagui au dessus des 3 millions - Ozap", "description": "Les audiences de la soirée du samedi 25 avril 2020.", "url": "https://www.ozap.com/actu/audiences-the-voice-leader-devant-mongeville-nagui-au-dessus-des-3-millions/592330", "urlToImage": null, "publishedAt": "2020-04-26T07:32:30Z", "content": "Samedi soir, TF1 s'est hissée en tête des audiences avec \"The Voice, la plus belle voix\", produit par ITV Studios France et présenté par Nikos Aliagas. Le télé-crochet a été suivi par 4,97 millions de fidèles, en audiences veille selon Médiamétrie. La dernièr… [+3336 chars]"}, {"source": {"id": null, "name": "Allocine.fr"}, "author": "Jérémie Dunand [Url href='https://twitter.com/JejeSeries'](@JejeSeries)[/Url]", "title": "The Wall sur 13ème Rue : que vaut la série dans la veine de Broadchurch et The Killing ? - AlloCiné", "description": "13ème Rue lance ce soir \"The Wall\", une nouvelle série québécoise sur fond de meurtres dans une colonie minière du Grand Nord canadien. Ce polar glacé, taillé pour les amateurs de \"Broadchurch\" ou \"Fo...", "url": "http://www.allocine.fr/article/fichearticle_gen_carticle=18689595.html", "urlToImage": null, "publishedAt": "2020-04-26T07:00:00Z", "content": "13ème Rue lance ce soir \"The Wall\", une nouvelle série québécoise sur fond de meurtres dans une colonie minière du Grand Nord canadien. Ce polar glacé, taillé pour les amateurs de \"Broadchurch\" ou \"Fortitude\", vaut-il le détour ? Voilà notre avis.Pixcom\r\nLa c… [+3589 chars]"}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": "Olivier Delcroix", "title": "Pierce Brosnan révèle que Tarantino voulait tourner un James Bond avec lui - Le Figaro", "description": "Confiné chez lui à Hawaï, l'ex-007 a raconté comment le réalisateur de Kill Bill s'était jeté sur lui en 2004, souhaitant réaliser une aventure du célèbre espion au service de sa Majesté.", "url": "http://www.lefigaro.fr/cinema/pierce-brosnan-revele-que-tarantino-voulait-tourner-un-james-bond-avec-lui-20200426", "urlToImage": null, "publishedAt": "2020-04-26T07:00:00Z", "content": "On ne prête qu'aux riches. Le réalisateur Quentin Tarantino, dont le nom a déjà été associé au tournage d'un possible film sur Star Trek, est à nouveau cité par l'acteur Pierce Brosnan concernant la saga James Bond. L'anecdote mérite d'être racontée par le me… [+3008 chars]"}, {"source": {"id": null, "name": "Forumopera.com"}, "author": null, "title": "At Home Gala (streaming) - New York - Critique - Forum Opéra", "description": "Contraint comme tous les théâtres de la planète à baisser le rideau, New York propose le premier e-gala d’opéra jamais organisé. L’instant est historique. La réponse du Metropolitan Opera à la pandémie de coronavirus confirme la pole position de l’institution…", "url": "https://www.forumopera.com/at-home-gala-streaming-new-york-le-grand-zapping-streaming", "urlToImage": null, "publishedAt": "2020-04-26T06:20:47Z", "content": "Contraint comme tous les théâtres de la planète à baisser le rideau, New York propose le premier e-gala dopéra jamais organisé. Linstant est historique. La réponse du Metropolitan Opera à la pandémie de coronavirus confirme la pole position de linstitution en… [+5851 chars]"}, {"source": {"id": null, "name": "Barbanews.com"}, "author": null, "title": "Loana - Revient enfin sur les réseaux et fait sensation avec un cliché sexy ! - barbanews", "description": "Depuis cette époque, celle qui avait marqué l’émission avec la fameuse scène de la piscine et le non moins célèbre Jean-Édouard, n’a pas vécu que des moments heureux. Bien au...", "url": "https://www.barbanews.com/peoples/loana-revient-enfin-sur-les-reseaux-et-fait-sensation-avec-un-cliche-sexy/", "urlToImage": null, "publishedAt": "2020-04-26T05:48:00Z", "content": "Depuis cette époque, celle qui avait marqué l’émission avec la fameuse scène de la piscine et le non moins célèbre Jean-Édouard, n’a pas vécu que des moments heureux.\r\nBien au contraire, on ne compte plus le nombre de fois où la jeune femme a voulu se suicide… [+3240 chars]"}, {"source": {"id": null, "name": "Gqmagazine.fr"}, "author": "Paloma González", "title": "11 séries et films recommandés par Stephen King à regarder sur Netflix - GQ Magazine", "description": "Stephen King, le maître de la terreur, s'est mis au service de la communauté en donnant son guide sur Netflix.", "url": "https://www.gqmagazine.fr/pop-culture/article/11-series-et-films-recommandes-par-stephen-king-a-regarder-sur-netflix", "urlToImage": null, "publishedAt": "2020-04-26T05:13:23Z", "content": "Vous avez fini de regarder votre série préférée ? Stephen King sait ce que vous devez regarder maintenant sur Netflix ; le maître de l'horreur a partagé une liste sur son compte Twitter recommandant 11 séries et films. Maintenant que nous passons tous plus de… [+3587 chars]"}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": "Claire Conruyt", "title": "Dix mots anciens ou rares dont vous ne pourrez plus vous passer - Le Figaro", "description": "QUIZ - «Squalide», «infrangible»... Connaissez-vous ces termes? Le Figaro vous propose de le découvrir en un court test.", "url": "http://www.lefigaro.fr/langue-francaise/quiz-francais/dix-mots-anciens-ou-rares-dont-vous-ne-pourrez-plus-vous-passer-20200426", "urlToImage": null, "publishedAt": "2020-04-26T05:00:00Z", "content": "Ce sont des mots étonnants et qui, lorsque nous les lisons, nous font sourire. Dabord, parce quils ont du charme. Ensuite, parce que certains sont absolument précis. Et enfin, parce quils témoignent de la richesse insoupçonnée de la langue française.\r\n» LIRE … [+807 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "Arthur RainBot", "title": "Horoscope chinois du Dimanche 26 avril 2020 - 20minutes.fr", "description": "Découvrez l’horoscope chinois de 20 Minutes du 26/04/2020", "url": "https://www.20minutes.fr/horoscope-quotidien-chinois/2761003-20200415-horoscope-chinois-du-dimanche-26-avril-2020", "urlToImage": null, "publishedAt": "2020-04-26T04:05:02Z", "content": "Découvrez l'horoscope quotidien chinois DR\r\nCôté amour, vous donnerez la priorité à votre vie de famille. Vous voudrez vous sentir proche de vos enfants et de votre partenaire. Pour cela, organisez des sorties en commun. Concernant l'argent et le travail, vot… [+8608 chars]"}, {"source": {"id": null, "name": "Lejdd.fr"}, "author": "Charlotte Langrand", "title": "Philippe Etchebest alerte sur le sort des restaurateurs : \"Nous sommes les globules rouges de l'économie\" - Le Journal du dimanche", "description": "Le chef Philippe Etchebest alerte sur le &quot;cauchemar national&quot; vécu par les restaurateurs. Il propose que les assureurs soient les &quot;collecteurs&quot; et redistributeurs d'une aide financière d'un montant de 14 milliards d'euros pour les professi…", "url": "https://www.lejdd.fr/Societe/philippe-etchebest-alerte-sur-le-sort-des-restaurateurs-nous-sommes-les-globules-rouges-de-leconomie-3964371", "urlToImage": null, "publishedAt": "2020-04-25T20:53:24Z", "content": "Philippe Etchebest, chef du Quatrième Mur à Bordeaux et juré de lémission Top Chef, a participé à la réunion des restaurateurs avec Emmanuel Macron vendredi dernier. Le président de la République a donné un cap, annonçant une nouvelle réunion fin mai pour dét… [+3920 chars]"}, {"source": {"id": null, "name": "Programme-tv.net"}, "author": "Clémence Leroy", "title": "Sylvie Tellier rayonnante en maillot de bain dans son jardin : les internautes charmés (PHOTO) - Télé Loisirs.fr", "description": "Le confinement nous oblige à nous occuper comme on le peut. Ce 25 avril, après avoir fini les devoirs avec ses trois enfants, Sylvie Tellier a posté une photo en famille sur Instagram. Les internautes étaient ravis !", "url": "https://www.programme-tv.net/news/people/253614-sylvie-tellier-rayonnante-en-maillot-de-bain-dans-son-jardin-les-internautes-charmes-photo/", "urlToImage": null, "publishedAt": "2020-04-25T20:27:58Z", "content": "Le confinement nous pousse à voir dans chaque petite chose de la vie une occasion de passer un bon moment. Ce retour aux choses simples, Sylvie Tellier l'a bien compris. Confinée avec ses trois enfants, la présidente de la société Miss Francetente déjà de con… [+1709 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Pourquoi le prince Harry aurait dû revenir à Londres ce week-end - Yahoo Actualités", "description": null, "url": "https://consent.yahoo.com/collectConsent?sessionId=1_cc-session_2b2d8096-9093-40b4-8b46-476afe523bb0&lang=fr-FR&inline=false", "urlToImage": null, "publishedAt": "2020-04-25T19:55:00Z", "content": "Yahoo fait partie de Verizon Media. Cliquez sur J'accepte afin dautoriser Verizon Media et ses partenaires à utiliser des cookies et des technologies similaires pour accéder à votre appareil, utiliser vos données (y compris votre position géographique), compr… [+596 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Mariage de Kate Middleton et William : ce que le marié et son frère Harry ont tenté de cacher - Yahoo Actualités", "description": null, "url": "https://consent.yahoo.com/collectConsent?sessionId=1_cc-session_39903637-2103-49da-8f6f-783b60d25484&lang=fr-FR&inline=false", "urlToImage": null, "publishedAt": "2020-04-25T19:50:00Z", "content": "Yahoo fait partie de Verizon Media. Cliquez sur J'accepte afin dautoriser Verizon Media et ses partenaires à utiliser des cookies et des technologies similaires pour accéder à votre appareil, utiliser vos données (y compris votre position géographique), compr… [+596 chars]"}, {"source": {"id": null, "name": "Melty.fr"}, "author": "Aurore C", "title": "Julien Tanti déprimé par le confinement et le Coronavirus ? Il fait une déclaration inattendue - melty", "description": "Julien Tanti des Marseillais aux Caraïbes serait-il déprimé ? Le candidat star fait une déclaration inattendue...", "url": "https://www.melty.fr/julien-tanti-deprime-par-le-confinement-et-le-coronavirus-il-fait-une-declaration-inattendue-a717489.html", "urlToImage": null, "publishedAt": "2020-04-25T18:45:23Z", "content": "Manon Marsault et Julien Tanti attendent une petite fille, et le couple a partagé le baby bump en passant un touchant message ! Le couple star des Marseillais aux Caraïbes s'est affiché récemment au plus bas sur les réseaux sociaux, Manon Marsault ayant avoué… [+1143 chars]"}, {"source": {"id": null, "name": "Dexerto.fr"}, "author": "Isabelle Thierens", "title": "Un dataminer dévoile comment Epic a dissimulé l'event Travis Scott - Dexerto", "description": "Un dataminer a révélé comment Epic Games avait utilisé des noms de code pour tenter de préserver l'événement Travis Scott.", "url": "https://www.dexerto.fr/fortnite/un-dataminer-devoile-comment-epic-a-dissimule-levent-travis-scott-1256675", "urlToImage": null, "publishedAt": "2020-04-25T18:13:26Z", "content": "Un dataminer sur Fortnite a révélé comment Epic Games avait utilisé des noms de code pour tenter de préserver l'événement Travis Scott et éviter qu'il ne soit gâché par des leaks.\r\nEpic Games n'en est pas à son coup d'essai concernant l'organisation de ce gen… [+2597 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Comment Kanye West est devenu milliardaire... avec Yeezy, sa marque de sneakers - Le Parisien", "description": "Rappeur unanimement salué par la critique parmi les plus gros vendeurs de disques et les plus récompensés, Kanye West ne doit pas son nouveau statut de milli...", "url": "https://www.youtube.com/watch?v=4IS7IfoHPnE", "urlToImage": null, "publishedAt": "2020-04-25T17:39:02Z", "content": null}, {"source": {"id": null, "name": "Programme-television.org"}, "author": null, "title": "REPLAY - N’oubliez pas les paroles (France 2) : qui a remporté les masters 2019 ? - Télé 7 Jours", "description": "Ce samedi 25 avril 2020, France 2 proposait une rediffusion des demi-finales des masters de &quot;N’oubliez pas les paroles&quot;.", "url": "https://www.programme-television.org/news-tv/N-oubliez-pas-les-paroles-France-2-les-demi-finales-des-masters-en-prime-4657941", "urlToImage": null, "publishedAt": "2020-04-25T17:01:00Z", "content": "Ce samedi 25 avril 2020, les téléspectateurs réunis devant France 2 pourront voir ou revoir les demi-finales des masters de Noubliez pas les paroles. En effet, en cette période de confinement, la chaîne du service public a choisi de rediffuser la compétition … [+1047 chars]"}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": "Mary Sohier", "title": "Coronavirus Covid-19 : le groupe Les Goguettes fait le buzz avec sa reprise parodique de \"Vesoul\" de Jacques B - France 3 Régions", "description": "Avec près de 2,5 millions de vues en quelques jours, une reprise parodique de \"Vesoul\" de Jacques Brel cartonne. À l'origine de cette vidéo, le groupe parisien Les Goguettes.", "url": "https://france3-regions.francetvinfo.fr/bourgogne-franche-comte/haute-saone/vesoul/coronavirus-covid-19-groupe-goguettes-fait-buzz-sa-reprise-parodique-vesoul-jacques-brel-1820900.html", "urlToImage": null, "publishedAt": "2020-04-25T16:47:16Z", "content": "Il a du mal à réaliser. \"On ne s'y attendait pas. Cest une très bonne surprise. Ça rencontre un écho que nous n'aurions pas soupçonné\", se réjouit Valentin Vander, chanteur du groupe \"Les Goguettes\". Avec près de 2,5 millions de vues en l'espace de trois jour… [+2687 chars]"}, {"source": {"id": null, "name": "Presse-citron.net"}, "author": "David Laurent", "title": "Prison Break : peut-on encore croire à une saison 6 ? - Presse-citron", "description": "Dominic Purcell s'est exprimé sur le sujet de la saison 6 de Prison Break et cela risque de ne pas plaire à tout le monde.", "url": "https://www.presse-citron.net/prison-break-peut-on-encore-croire-a-une-saison-6/", "urlToImage": null, "publishedAt": "2020-04-25T16:11:34Z", "content": "On se souvient de la surprise générale avec la sortie d’une nouvelle saison de Prison Break en 2017, 8 ans après le dernier épisode de la saga de Michael Scofield (Wentworth Miller) et Lincoln Burrow (Dominic Purcell). Bien sûr, le come-back n’était pas au ni… [+1463 chars]"}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": null, "title": "EN IMAGES : la danseuse et chorégraphe syrienne Yara al-Hasbani danse devant les monuments désertés de Paris - franceinfo", "description": "", "url": "https://www.francetvinfo.fr/culture/spectacles/danse/la-danseuse-et-choregraphe-syrienne-yara-al-hasbani-danse-devant-les-monuments-desertes-de-paris_3934355.html", "urlToImage": null, "publishedAt": "2020-04-25T14:58:34Z", "content": "La danseuse syrienne est installée à Paris depuis 2016.Yara al-Hasbani a déjà dansé sur des places en France, entourée d'une foule de curieux. Mais aujourd'hui, cette danseuse et chorégraphe syrienne de 26 ans a posé seule devant des monuments et musées de Pa… [+2275 chars]"}, {"source": {"id": null, "name": "Sortiraparis.com"}, "author": null, "title": "On a testé Ducasse chez moi, le service de livraison de plats by Alain Ducasse - sortiraparis", "description": "Les sept restaurants parisiens d'Alain Ducasse sont désormais disponibles à la livraison chez vous, grâce au tout nouveau service de livraison \"Ducasse chez moi\". Régalade assurée !", "url": "https://www.sortiraparis.com/hotel-restaurant/restaurant/articles/214959-on-a-teste-ducasse-chez-moi-le-service-de-livraison-de-plats-by-alain-ducasse", "urlToImage": null, "publishedAt": "2020-04-25T13:53:00Z", "content": "Par\r\nManon C.· Photos par\r\nManon C.· Publié le 25 avril 2020 à 15h53\r\n· Mis à jour le 25 avril 2020 à 18h25\r\nLes sept restaurants parisiens d'Alain Ducasse sont désormais disponibles à la livraison chez vous, grâce au tout nouveau service de livraison \"Ducass… [+4727 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "L'émission de cuisine de Cyril Lignac sur M6 va-t-elle continuer ? Jérôme Anthony répond... - RTL - On a tellement de choses à se dire", "description": "Avec 2,5 millions de téléspectateurs quasiment chaque soir, \"Tous en cuisine en direct avec Cyril Lignac\" c'est le carton du moment à la télé... https://www....", "url": "https://www.youtube.com/watch?v=_zTZ2s-0wpI", "urlToImage": null, "publishedAt": "2020-04-25T12:19:09Z", "content": "Avec 2,5 millions de téléspectateurs quasiment chaque soir, \"Tous en cuisine en direct avec Cyril Lignac\" c'est le carton du moment à la télé...https://www.rtl.fr/culture/medias-peo..."}, {"source": {"id": null, "name": "Programme-tv.net"}, "author": "Rime El Himani", "title": "Tout le monde veut prendre sa place : Nagui amusé par la mésaventure d’une candidate tête en l’air (VIDEO) - Télé Loisirs.fr", "description": "Les candidats de Tout le monde veut prendre sa place ont des anecdotes toutes plus drôles les unes que les autres. La preuve, une nouvelle fois, avec Marie-Aline, une participante victime de trous de mémoire.", "url": "https://www.programme-tv.net/news/tv/253605-tout-le-monde-veut-prendre-sa-place-nagui-amuse-par-la-mesaventure-dune-candidate-tete-en-lair-video/", "urlToImage": null, "publishedAt": "2020-04-25T12:11:07Z", "content": "Après Noubliez pas les paroles, cest au tour de Tout le monde veut prendre sa place dêtre rediffusé sur France 2. Depuis le lundi 20 avril, les fidèles du jeu de Nagui peuvent revoir le parcours de la super championne Marie-Christine, qui avait éliminée avec … [+1892 chars]"}, {"source": {"id": null, "name": "Bfmtv.com"}, "author": "BFMTV", "title": "Mort de l'acteur Gene Dynarski, vu dans Seinfeld et Star Trek - BFMTV.COM", "description": "L'acteur, âgé de 87 ans, a également joué dans deux films de Steven Spielberg.", "url": "https://people.bfmtv.com/actualite-people/mort-de-l-acteur-gene-dynarski-vu-dans-seinfeldet-star-trek-1900634.html", "urlToImage": null, "publishedAt": "2020-04-25T11:50:15Z", "content": null}, {"source": {"id": null, "name": "Purepeople.com"}, "author": "Claire Ageef-Legrand", "title": "Jenifer : Qui sont les hommes de sa vie ? - Pure People", "description": "Jenifer est devenue une artiste incontournable de la scène musicale française. Côté vie privée, la chanteuse est maman de deux garçons : Aaron et Joseph. Désormais mariée à Ambroise, la jeune femme a vécu plusieurs histoires d'amour avant de trouver l'homme d…", "url": "https://www.purepeople.com/article/jenifer-qui-sont-les-hommes-de-sa-vie_a380060/1", "urlToImage": null, "publishedAt": "2020-04-25T11:18:00Z", "content": "Révélée dans l'émission Star Academy en 2001, Jenifer est devenue une figure emblématique de la chanson française. Charmeuse et pétillante, la belle brune a rencontré plusieurs fois l'amour tout au long de son parcours dans la musique. Malgré quelques décepti… [+3196 chars]"}, {"source": {"id": null, "name": "Bfmtv.com"}, "author": "BFMTV", "title": "Ces nouveaux romans d'auteurs à succès que vous pourrez (enfin) dévorer après le confinement - BFMTV", "description": "Du dernier livre de Joël Dicker à celui de Guillaume Musso, découvrez les dates auxquelles seront publiés les best-sellers de l'été.", "url": "https://www.bfmtv.com/culture/ces-nouveaux-romans-d-auteurs-a-succes-que-vous-pourrez-enfin-devorer-apres-le-confinement-1900556.html", "urlToImage": null, "publishedAt": "2020-04-25T11:07:43Z", "content": null}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "B.Ch.", "title": "Mick Jagger et Paul McCartney rejouent (pour rire) la guerre entre Beatles et Rolling Stones - 20 Minutes", "description": "Les deux chanteurs se répondent par médias interposés sur la question de la supériorité de leurs groupes respectifs", "url": "https://www.20minutes.fr/arts-stars/culture/2767647-20200425-mick-jagger-paul-mccartney-rejouent-rire-guerre-entre-beatles-rolling-stones", "urlToImage": null, "publishedAt": "2020-04-25T10:51:33Z", "content": "Paul McCartney et Mick Jagger en 2011 à New York Richard Young / Rex Fea/REX/SIPA\r\nPaul McCartney et Mick Jagger relancent \r\n la polémique la plus \r\nvive des dernières décennies : plutôt Beatles ou Rolling Stones? Alors bien sûr, cest pour rire, bien sûr, ils… [+1575 chars]"}, {"source": {"id": null, "name": "Allocine.fr"}, "author": "Mégane Choquet", "title": "Vikings : l'histoire vraie de Floki, le guerrier qui a découvert l'Islande - AlloCiné", "description": "Personnage atypique de Vikings, Floki est connu pour sa conception de bateaux et sa dévotion pour Ragnar. Mais quelle est l'histoire vraie de cette figure nordique ?", "url": "http://www.allocine.fr/article/fichearticle_gen_carticle=18689537.html", "urlToImage": null, "publishedAt": "2020-04-25T09:30:00Z", "content": "Personnage atypique de Vikings, Floki est connu pour sa conception de bateaux et sa dévotion pour Ragnar. Mais quelle est l'histoire vraie de cette figure nordique ?History Channel\r\nAttention, spoilers ! Les paragraphes suivants révèlent des éléments d'intrig… [+2580 chars]"}, {"source": {"id": null, "name": "Zone-turf.fr"}, "author": null, "title": "Quinté plus PMU : Vine Vision se retrouve bien placé - Quinté+ - zone-turf.fr", "description": "Quinté plus PMU : Vine Vision se retrouve bien placé Troisième dans un très bon temps sur le parcours qui nous intéresse, Vine Vision (5) aura notre …", "url": "https://www.zone-turf.fr/quinte/quinte-plus-pmu-vine-vision-se-retrouve-bien-place-104694.html", "urlToImage": null, "publishedAt": "2020-04-25T09:30:00Z", "content": null}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "Jean Saint-Marc", "title": "Coronavirus : Biscottes, sons et dessins… Les archives du confinement sont déjà collectées - 20 Minutes", "description": "Le Mucem et de nombreux services d’archives lancent des collectes d’objets liés au confinement. Après la crise sanitaire, les chercheurs les utiliseront pour analyser ce moment de notre histoire collective", "url": "https://www.20minutes.fr/arts-stars/culture/2767311-20200425-coronavirus-biscottes-sons-dessins-archives-confinement-deja-collectees", "urlToImage": null, "publishedAt": "2020-04-25T09:25:24Z", "content": "Ce puzzle et cette attestation de sortie pourraient rejoindre le fonds du Mucem. J. Saint-Marc / 20 Minutes\r\nQuallez-vous faire de ce magnifique escargot en pâte à sel fabriqué par vos enfants ? Si le confinement vous donne des envies de grand tri de printemp… [+5122 chars]"}, {"source": {"id": null, "name": "Melty.fr"}, "author": "Amandine G", "title": "Touche Pas à Mon Poste : Baptiste Giabiconi, Franck Gastambide, Gradur... Qui est le nouveau chroniqueur annoncé par Cyril Hanouna ? - melty", "description": "Touche pas à mon Poste accueillera de nouveaux chroniqueurs à la rentrée prochaine, et Cyril Hanouna n'a pas hésité à teaser l'identité de l'un d'entre eux.", "url": "https://www.melty.fr/touche-pas-a-mon-poste-baptiste-giabiconi-franck-gastambide-gradur-qui-est-le-nouveau-chroniqueur-annonce-par-cyril-hanouna-a717433.html", "urlToImage": null, "publishedAt": "2020-04-25T09:01:27Z", "content": "Malgré le confinement, c'est officiel, Touche pas à mon Poste rempilera encore pour quelques saisons, comme l'a récemment officialisé Cyril Hanouna ! En plus de toute l'équipe habituelle, l'animateur star de C8 a également teasé l'arrivée de plusieurs nouvell… [+1918 chars]"}, {"source": {"id": null, "name": "Letribunaldunet.fr"}, "author": "https://www.facebook.com/letribunaldunet/, Jeanne", "title": "« Il était insupportable… » : Nathalie Marquay révèle avoir été harcelée par un célèbre homme politique - Tribunal Du Net", "description": "Nathalie Marquay s'est confiée dans un live Instagram ce mercredi 22 avril. Elle confie avoir été harcelée par un homme politique.", "url": "http://www.letribunaldunet.fr/people/insupportable-nathalie-marquay-revele-avoir-harcelee-celebre-homme-politique.html", "urlToImage": null, "publishedAt": "2020-04-25T08:47:06Z", "content": "Dans un live Instagram présenté par Sylvie Tellier, Nathalie Marquay qui était invitée, s’est laissé aller à quelques confidences. Elle a avoué avoir été harcelée pendant plusieurs mois par un célèbre homme politique dont elle souhaite taire le nom.\r\n&gt;&gt;… [+1768 chars]"}, {"source": {"id": null, "name": "Allocine.fr"}, "author": "CTC", "title": "Les séries en mai sur Netflix : The Eddy, Hollywood de Ryan Murphy, la nouvelle comédie de Steve Carell... - AlloCiné", "description": "Un club de jazz en danger dans The Eddy, des acteurs en herbe dans Hollywood, deux veuves en difficulté dans Dead To Me..., AlloCiné vous dit quelles séries arrivent sur Netflix en mai.", "url": "http://www.allocine.fr/article/fichearticle_gen_carticle=18689609.html", "urlToImage": null, "publishedAt": "2020-04-25T07:00:00Z", "content": "Un club de jazz en danger dans The Eddy, des acteurs en herbe dans Hollywood, deux veuves en difficulté dans Dead To Me..., AlloCiné vous dit quelles séries arrivent sur Netflix en mai.\r\nLE 1er MAI : Hollywood\r\nEn attendant le retour de son autre série sur la… [+1598 chars]"}, {"source": {"id": null, "name": "Stars-actu.fr"}, "author": "Gregory S.", "title": "Étoile mystérieuse des « 12 coups de midi » : les deux premiers indices… - Stars Actu", "description": "Étoile mystérieuse des « 12 coups de midi ». Alors qu'on se demande toujours ce qu'il adviendra du jeu quotidien de Jean-Luc Reichmann", "url": "https://www.stars-actu.fr/2020/04/etoile-mysterieuse-des-12-coups-de-midi-les-deux-premiers-indices/", "urlToImage": null, "publishedAt": "2020-04-25T06:46:00Z", "content": "Étoile mystérieuse des « 12 coups de midi ». Alors que des rediffusions du jeu quotidien de Jean-Luc Reichmann devraient prendre le relais à compter du 29 avril 2020,  faute d’émissions inédites, « Les 12 coups de midi » ont encore résonné hier sur TF1. Et c’… [+1655 chars]"}, {"source": {"id": null, "name": "Nicematin.com"}, "author": "La rédaction", "title": "\"C'est une décision lourde à prendre\", l'édition 2020 du Nice Jazz Festival annulée - Nice-Matin", "description": "Le Nice Jazz Festival qui avait accueilli plus de 42.000 spectateurs en 2019 est reportée à l'année prochaine à cause de l'épidémie de coronavirus.", "url": "https://www.nicematin.com/concerts/cest-une-decision-lourde-a-prendre-ledition-2020-du-nice-jazz-festival-annulee-501243", "urlToImage": null, "publishedAt": "2020-04-25T06:05:00Z", "content": "Il se tiendra du 12 au 17 juillet 2021, avec une pause le 14 juillet.\r\n\"C'est une décision lourde à prendre, a expliqué le maire de Nice, Christian Estrosi. Mais les artistes qui étaient programmés pour le Nice Jazz Festival ne sont pas forcément disponibles … [+1054 chars]"}, {"source": {"id": null, "name": "Causeur.fr"}, "author": "Causeur.fr, Xavier Legay", "title": "\"Dérapages\" sur Arte, Cantona contre la \"firme\" - Causeur.fr", "description": "Avec \"Dérapages\", Arte propose un thriller social qui invite à la réflexion sur les dérives du management", "url": "https://www.causeur.fr/derapages-sur-arte-la-face-sombre-du-management-175983", "urlToImage": null, "publishedAt": "2020-04-25T04:00:12Z", "content": "Jusqu’où Eric Cantona est-il prêt à aller pour retrouver un emploi à son âge? Avec Dérapages, Arte nous offre un thriller social qui invite à la réflexion sur les dérives du monde de lentreprise. Réussi\r\nDans cette mini-série, Eric Cantona campe brillamment A… [+5652 chars]"}, {"source": {"id": null, "name": "Journaldesfemmes.fr"}, "author": "Luna Sol", "title": "Horoscope du samedi 25 avril - Journal des femmes", "description": "Découvrez tout de suite ce que les astres vous réservent pour aujourd'hui, grâce aux prévisions personnalisées signe par signe de notre experte de l'horoscope et des planètes.", "url": "https://www.journaldesfemmes.fr/horoscope/zodiaque/2628731-horoscope-du-samedi-25-avril/", "urlToImage": null, "publishedAt": "2020-04-25T01:00:04Z", "content": "Découvrez tout de suite ce que les astres vous réservent pour aujourd'hui, grâce aux prévisions personnalisées signe par signe de notre experte de l'horoscope et des planètes. \r\nL'influence de Pluton vous honore. Votre enfant rencontre un obstacle de taille. … [+6661 chars]"}, {"source": {"id": null, "name": "13or-du-hiphop.fr"}, "author": "estelle", "title": "Jul : les montants des enchères continuent de grimper, le prix pour “My World” est démentiel - 13OR-du-HipHop.fr", "description": "Alors que les enchères de la mise en vente des certifications de Jul vont prendre fin dans 2 jours (ce lundi 27 avril), les montants ne cessent d'augmenter chaque jour et l'enchère du Double disque de platine remis à l'artiste Marseillais pour l'album \"My Wor…", "url": "https://www.13or-du-hiphop.fr/2020/04/25/jul-les-montants-des-encheres-continuent-de-grimper-le-prix-pour-my-world-est-dementiel/", "urlToImage": null, "publishedAt": "2020-04-25T00:46:53Z", "content": "Alors que les enchères de la mise en vente des certifications de Jul vont prendre fin dans 2 jours (ce lundi 27 avril), les montants ne cessent d’augmenter chaque jour et l’enchère du Double disque de platine remis à l’artiste Marseillais pour l’album “My Wor… [+1149 chars]"}, {"source": {"id": null, "name": "Allocine.fr"}, "author": "La Rédaction", "title": "Plus belle la vie du mardi 28 avril 2020 : résumé en avance de l'épisode 4047 [SPOILERS] - AlloCiné", "description": "Dans le prochain épisode de \"Plus belle la vie\"... Alors que Samia se lance dans un nouveau projet, Jimmy Moon soumet ses apprentis à une nouvelle épreuve. De son côté, Irina réussira-t-elle à surmont...", "url": "http://www.allocine.fr/article/fichearticle_gen_carticle=18689077.html", "urlToImage": null, "publishedAt": "2020-04-24T17:45:00Z", "content": "Dans le prochain épisode de \"Plus belle la vie\"... Alors que Samia se lance dans un nouveau projet, Jimmy Moon soumet ses apprentis à une nouvelle épreuve. De son côté, Irina réussira-t-elle à surmonter sa peine ?Capture d'écran/FTV\r\nAttention, les paragraphe… [+1213 chars]"}, {"source": {"id": null, "name": "Parismatch.be"}, "author": "R. P.", "title": "People et royauté Papa comblé Pourquoi Brad Pitt voit du bon dans ce confinement - Paris Match Belgique", "description": "Avant même la propagation du coronavirus, Brad Pitt apparaissait comme un homme nouveau. Après un divorce des plus houleux et avoir tiré un trait sur son…", "url": "https://parismatch.be/actualites/people/393803/pourquoi-brad-pitt-voit-du-bon-dans-ce-confinement", "urlToImage": null, "publishedAt": "2020-04-24T17:31:00Z", "content": "Avant même la propagation du coronavirus, Brad Pitt apparaissait comme un homme nouveau. Après un divorce des plus houleux et avoir tiré un trait sur son penchant pour la bouteille, l’acteur de Once Upon a Time… in Hollywood semblait libéré de ses démons. Et … [+1416 chars]"}, {"source": {"id": null, "name": "Allocine.fr"}, "author": "Thomas Imbert ([Url href='https://twitter.com/Thomas_Theory?lang=fr']@Thomas_Theory[/Url])", "title": "Les 25 meilleures comédies de tous les temps selon les spectateurs AlloCiné - AlloCiné", "description": "De \"La Grande Vadrouille\" à \"La Ruée vers l'or\" en passant par \"Le Dîner de Cons\", retour sur les 25 meilleures comédies de tous les temps selon les spectateurs d'AlloCiné.", "url": "http://www.allocine.fr/diaporamas/cinema/diaporama-18689325/", "urlToImage": null, "publishedAt": "2020-04-24T17:00:00Z", "content": "Contact|Qui sommes-nous| Recrutement|Publicité|CGU|Politique de cookies|Données Personnelles|Revue de presse|Jeux concours|\r\n ©AlloCiné\r\nRetrouvez tous les horaires et infos de votre cinéma sur le numéro AlloCiné : 0 892 892 892 (0,34/minute)"}]}