{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Public.fr"}, "author": "Public", "title": "Loana fait son grand retour sur Instagram après plus de deux mois d’absence - Public", "description": "Depuis le mois de février dernier, Loana n’a plus rien posté sur son compte Instagram, où elle compte plus de 227 000 abonnés et où elle est habituellement très active. De quoi inquiéter ses nombreux followers… Parmi les messages de ses fans on peut lire : « …", "url": "https://www.public.fr/News/Loana-fait-son-grand-retour-sur-Instagram-apres-plus-de-deux-mois-d-absence-1639797", "urlToImage": null, "publishedAt": "2020-04-25T18:19:58Z", "content": "Depuis le mois de février dernier, Loana na plus rien posté sur son compte Instagram, où elle compte plus de 227 000 abonnés et où elle est habituellement très active. De quoi inquiéter ses nombreux followers Parmi les messages de ses fans on peut lire : « ma… [+1429 chars]"}, {"source": {"id": null, "name": "Purepeople.com"}, "author": "Emma Vanpoulle", "title": "Inès (Koh-Lanta) menacée de mort après l'élimination de Sam : \"Calmez-vous !\" - Pure People", "description": "Inès était très remontée suite à la diffusion du dernier épisode de \"Koh-Lanta\", le vendredi 24 avril 2020 sur TF1. Violemment critiquée sur les réseaux sociaux pour avoir contribué à l'élimination de Sam, la jolie brune a pris la parole pour calmer le jeu.", "url": "https://www.purepeople.com/article/ines-koh-lanta-menacee-de-mort-apres-l-elimination-de-sam-calmez-vous_a385745/1", "urlToImage": null, "publishedAt": "2020-04-25T16:24:00Z", "content": "Vendredi 24 avril 2020, c'est l'aventurier Sam qui a été éliminé de Koh-Lanta, contre toute attente. Avec six voix contre lui, le benjamin de la compétition a été contraint de quitter le camp, suscitant alors de nombreuses réactions sur les réseaux sociaux. L… [+2622 chars]"}, {"source": {"id": null, "name": "Purepeople.com"}, "author": "Claire Ageef-Legrand", "title": "Iris Mittenaere titille ses ex (dont Kev Adams ?), en parlant de sa vie intime - Pure People", "description": "Invitée dans le live de Jarry sur Instagram le 23 avril 2020, Iris Mittenaere s'est laissée aller à quelques confidences... très osées sur sa vie intime. Interrogée sur les perfomances sexuelles de Diego et de ses ex, l'ancienne Miss France n'a pas hésité à d…", "url": "https://www.purepeople.com/article/iris-mittenaere-titille-ses-ex-dont-kev-adams-en-parlant-de-sa-vie-intime_a385742/1", "urlToImage": null, "publishedAt": "2020-04-25T15:39:00Z", "content": "Oups ! Pendant un live Instagram avec Jarry le 23 avril 2020, Iris Mittenaere a fait des révélations croustillantes et inattendues qui risquent de déplaire à certains... L'humoriste de 42 ans connu pour son franc parler, n'a pas hésité à questionner son invit… [+1504 chars]"}, {"source": {"id": null, "name": "Ldpeople.com"}, "author": null, "title": "Manon Marsault très mal, \"proche d'être ruinée\" elle s'exprime - LDpeople.com", "description": "Manon Marsault que nous connaissons maintenant sous le nom de Manon Tanti, s'est faite connaître grâce à la télé-réalité. Julien Tanti...", "url": "https://www.ldpeople.com/manon-marsault-tres-mal-proche-etre-ruinee-exprime-64794", "urlToImage": null, "publishedAt": "2020-04-25T15:23:14Z", "content": "Manon Marsault que nous connaissons maintenant sous le nom de Manon Tanti, s’est faite connaître grâce à la télé-réalité. Julien Tanti est son mari, a participé à toutes les saisons de l’émission Les Marseillais, et il rencontre celle qui devient sa femme sur… [+4661 chars]"}, {"source": {"id": null, "name": "Closermag.fr"}, "author": "La rédaction", "title": "Christophe : quel est l'unique objet que son fils Romain a gardé de lui ? - Closer France", "description": "Dans les colonnes de France Dimanche, ce vendredi 24 avril, Romain Duval, fils du chanteur Christophe, révèle quel unique objet son père lui a laissé.", "url": "https://www.closermag.fr/people/christophe-quel-est-l-unique-objet-que-son-fils-romain-a-garde-de-lui-1106260", "urlToImage": null, "publishedAt": "2020-04-25T14:39:23Z", "content": "Décédé le 16 avril dernier, le chanteur Christophe laisse derrière lui deux enfants : Lucie, née en 1971 de sa relation avec Véronique Kan et avec qui il entretenait une très belle relation et Christophe qu'il n'avait pas souhaité reconnaître à sa naissance e… [+1797 chars]"}, {"source": {"id": null, "name": "Programme-tv.net"}, "author": "Rime El Himani", "title": "Miss France 2020 : le règne de Clémence Botino ne sera pas prolongé malgré le confinement - Télé Loisirs.fr", "description": "Voilà une nouvelle qui risque de décevoir les fans de Clémence Botino. Dans un entretien accordé au Républicain Lorrain, Sylvie Tellier a confirmé que le règne de Miss France 2020 ne serait pas prolongé.", "url": "https://www.programme-tv.net/news/people/253606-miss-france-2020-le-regne-de-clemence-botino-ne-sera-pas-prolonge-malgre-le-confinement/", "urlToImage": null, "publishedAt": "2020-04-25T13:04:23Z", "content": "Le 14 décembre 2019, Clémence Botino était élue Miss France 2020. Et le moins que lon puisse dire, cest que son règne est très différent de ce quelle avait pu imaginer. Seulement trois mois après son sacre, la reine de beauté est retournée en Guadeloupe pour … [+1439 chars]"}, {"source": {"id": null, "name": "Nextplz.fr"}, "author": "Lauriane", "title": "Alix et Benjamin Samat (LMAC) n’ont pas rompu à leur retour en France - NextPlz", "description": "Alix et Benjamin Samat, ne sont plus ensemble, mais ils n’ont pas immédiatement rompu après leur retour à Marseille. Alix raconte sa version.", "url": "https://www.nextplz.fr/telerealite/172026-alix-benjamin-samat-lmac-nont-pas-rompu-retour-france", "urlToImage": null, "publishedAt": "2020-04-25T13:03:00Z", "content": "Bien que les deux candidats des Marseillais aux Caraïbes, Alix et Benjamin Samat, ne soient plus ensemble, ils nont pas immédiatement rompu après leur retour à Marseille. Alix a mis les choses au clair sur ce quil sest exactement passé.\r\nLa saison 9 des Marse… [+1691 chars]"}, {"source": {"id": null, "name": "Leparisien.fr"}, "author": null, "title": "VIDÉO. Comment Kanye West est devenu milliardaire... avec Yeezy, sa marque de baskets - Le Parisien", "description": "Kanye West ne doit pas son 1,3 milliard de dollars à sa musique mais à sa marque de baskets Yeezy, selon le magazine Forbes.", "url": "http://www.leparisien.fr/video/video-comment-kanye-west-est-devenu-milliardaire-avec-yeezy-sa-marque-de-baskets-25-04-2020-8305725.php", "urlToImage": null, "publishedAt": "2020-04-25T12:50:00Z", "content": "Rappeur unanimement salué par la critique qui compte parmi les plus gros vendeurs de disques et les artistes plus récompensés, Kanye West est désormais milliardaire. Le magazine Forbes annoncé que le rappeur de Chicago comptait parmi son célèbre classement, g… [+51 chars]"}, {"source": {"id": null, "name": "Public.fr"}, "author": null, "title": "PHOTOS - Matt Pokora et Christina Milian organisent une pool party en plein confinement ! - Public.fr", "description": "Dur, dur le confinement à Los Angeles...", "url": "https://www.public.fr/Toutes-les-photos/PHOTOS-Matt-Pokora-et-Christina-Milian-organisent-une-pool-party-en-plein-confinement-1639787", "urlToImage": null, "publishedAt": "2020-04-25T12:35:00Z", "content": "Est-ce quil est possible de dire que les temps sont durs pour Matt Pokora ? Ces dernières semaines, le chanteur de 34 ans a dû faire le dos rond lorsque la tempête sest abattue sur lui. La pandémie de covid-19 a bouleversé le quotidien de milliards de personn… [+1674 chars]"}, {"source": {"id": null, "name": "Public.fr"}, "author": "Public", "title": "4 mariages pour une lune de miel : un couple se fait lyncher sur les réseaux sociaux... Découvrez pourquoi ! - Public", "description": "Voilà déjà huit ans que nous suivons quotidiennement les aventures des mariées françaises, en quête de la lune de miel de leur rêve. Depuis 2011, TF1 diffuse en effet le programme « Quatre mariages pour une lune de miel », programme qui remporte d’ailleurs un…", "url": "https://www.public.fr/News/4-mariages-pour-une-lune-de-miel-un-couple-se-fait-lyncher-sur-les-reseaux-sociaux-Decouvrez-pourquoi-1639786", "urlToImage": null, "publishedAt": "2020-04-25T12:24:15Z", "content": "Voilà déjà huit ans que nous suivons quotidiennement les aventures des mariées françaises, en quête de la lune de miel de leur rêve. Depuis 2011, TF1 diffuse en effet le programme « Quatre mariages pour une lune de miel », programme qui remporte dailleurs un … [+1881 chars]"}, {"source": {"id": null, "name": "Programme-television.org"}, "author": null, "title": "Véronique Genest : \"Financièrement ça devient compliqué\" ! - Télé 7 Jours", "description": "Confinée à Paris en compagnie de son mari et son fils, Véronique Genest évoque le quotidien difficile des artistes privés de contrats.", "url": "https://www.programme-television.org/news-tv/Veronique-Genest-Financierement-ca-devient-complique-4657946", "urlToImage": null, "publishedAt": "2020-04-25T12:01:00Z", "content": "Pas facile la vie d'artistes ! Confinée chez elle comme de nombreux français, la comédienne Véronique Genest souffre de la situation. Comme de nombreux artistes, elle se retrouve sans contrats. Les sociétés de production et les théâtres étant en effet fermés … [+958 chars]"}, {"source": {"id": null, "name": "13or-du-hiphop.fr"}, "author": "mahokayacan", "title": "Booba s’amuse d’un montage photo délirant de La Fouine en malade du COVID-19 - 13OR-du-HipHop.fr", "description": "En cette période difficile en raison de l'épidémie du Coronavirus qui a causé le confinement d'une grande partie de la population mondiale, Booba a décidé de se mobiliser depuis plusieurs semaines pour faire la prévention de ce virus auprès de son public nota…", "url": "https://www.13or-du-hiphop.fr/2020/04/25/booba-samuse-dun-montage-photo-delirant-de-la-fouine-en-malade-du-coronavirus/", "urlToImage": null, "publishedAt": "2020-04-25T11:36:09Z", "content": "En cette période difficile en raison de l’épidémie du Coronavirus qui a causé le confinement d’une grande partie de la population mondiale, Booba a décidé de se mobiliser depuis plusieurs semaines pour faire la prévention de ce virus auprès de son public nota… [+1067 chars]"}, {"source": {"id": null, "name": "Www.rtl.fr"}, "author": null, "title": "L'émission de cuisine de Cyril Lignac sur M6 va-t-elle continuer ? Jérôme Anthony... - RTL.fr", "description": "VIDÉO - Avec 2,5 millions de téléspectateurs chaque soir, \"Tous en cuisine en direct avec Cyril Lignac\" c'est le carton du moment...", "url": "https://www.rtl.fr/culture/medias-people/l-emission-de-cuisine-de-cyril-lignac-sur-m6-va-t-elle-continuer-jerome-anthony-repond-7800439195", "urlToImage": null, "publishedAt": "2020-04-25T11:26:00Z", "content": "En ces temps de confinement, Jade, Eric Dussart et toute l'équipe de On Refait La Télé vous proposent une émission adaptée à la situation : Chaque samedi de 11h30 à 12h30 en direct sur RTL, nous sommes au téléphone avec différents invités pour parler télé ! \r… [+1556 chars]"}, {"source": {"id": null, "name": "Closermag.fr"}, "author": "Pauline Laforgue", "title": "Kate Middleton : pourquoi elle se charge elle-même des portraits de George, Charlotte et Louis - Closer France", "description": "Le 23 avril dernier, tandis que le prince Louis célébrait son deuxième anniversaire, Kensington Palace a dévoilé d’adorables nouveaux clichés du petit garçon pris pas Kate Middleton. Mais pourquoi la duchesse tient-elle tant à photographier elle-même les port…", "url": "https://www.closermag.fr/royautes/kate-middleton-pourquoi-elle-se-charge-elle-meme-des-portraits-de-george-charlot-1106190", "urlToImage": null, "publishedAt": "2020-04-25T11:13:20Z", "content": "Les photographes font partis de leurs quotidien. A chacune de leurs sorties officielles, les membres de la famille royale sont suivis par des professionnels qui immortalisent leurs faits et gestes, et ce parfois même, jusque dans leur demeure, pour gérer leur… [+1853 chars]"}, {"source": {"id": null, "name": "Bfmtv.com"}, "author": "BFMTV", "title": "Ces nouveaux romans d'auteurs à succès que vous pourrez (enfin) dévorer après le confinement - BFMTV", "description": "Du dernier livre de Joël Dicker à celui de Guillaume Musso, découvrez les dates auxquelles seront publiés les best-sellers de l'été.", "url": "https://www.bfmtv.com/culture/ces-nouveaux-romans-d-auteurs-a-succes-que-vous-pourrez-enfin-devorer-apres-le-confinement-1900556.html", "urlToImage": null, "publishedAt": "2020-04-25T11:07:43Z", "content": null}, {"source": {"id": null, "name": "Programme-television.org"}, "author": null, "title": "Bernard Montiel en confinement à la mer : \"Je ne suis pas venu me planquer\" - Télé 7 Jours", "description": "Depuis le début du confinement le 16 mars dernier, Bernard Montiel, qui intervient régulièrement dans l'émission Touche pas à mon poste de Cyril Hanouna, réside dans sa maison du sud-ouest. Un choix souvent critiqué dont il s'est défendu dans un numéro de Com…", "url": "https://www.programme-television.org/news-tv/Bernard-Montiel-en-confinement-a-la-mer-Je-ne-suis-pas-venu-me-planquer-4657945", "urlToImage": null, "publishedAt": "2020-04-25T11:04:00Z", "content": "Alors que près de 30% des parisiens ont déserté la capitale pour la province à l'annonce du confinement, Bernard Montiel, qui a lui aussi trouvé refuge dans sa maison de Pylat sur mer, est sous le feu des critiques. Beaucoup lui reprochent d'avoir fui Paris. … [+1024 chars]"}, {"source": {"id": null, "name": "Www.rtl.fr"}, "author": null, "title": "Confinement : \"Plank that song challenge\", le challenge pour rire et se muscler - RTL.fr", "description": "Samedi 25 avril, Juliette Dumas vous invite à faire le challenge de la planche, \"Plank that song challenge\" chez les Américains.", "url": "https://www.rtl.fr/culture/arts-spectacles/confinement-plank-that-song-challenge-le-challenge-pour-rire-et-se-muscler-7800441922", "urlToImage": null, "publishedAt": "2020-04-25T10:54:00Z", "content": "Samedi 25 avril, Juliette Dumas, la coach bien être de RTL, vous invite à faire le challenge de la planche. \"Moi je ne suis pas du tout challenges, mais alors celui-là me plait beaucoup, s'amuse-t-elle. Alors je le partage avec vous parce qu'il permet à la fo… [+763 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "B.Ch.", "title": "Mick Jagger et Paul McCartney rejouent (pour rire) la guerre entre Beatles et Rolling Stones - 20 Minutes", "description": "Les deux chanteurs se répondent par médias interposés sur la question de la supériorité de leurs groupes respectifs", "url": "https://www.20minutes.fr/arts-stars/culture/2767647-20200425-mick-jagger-paul-mccartney-rejouent-rire-guerre-entre-beatles-rolling-stones", "urlToImage": null, "publishedAt": "2020-04-25T10:51:33Z", "content": "Paul McCartney et Mick Jagger en 2011 à New York Richard Young / Rex Fea/REX/SIPA\r\nPaul McCartney et Mick Jagger relancent \r\n la polémique la plus \r\nvive des dernières décennies : plutôt Beatles ou Rolling Stones? Alors bien sûr, cest pour rire, bien sûr, ils… [+1575 chars]"}, {"source": {"id": null, "name": "Tirage-gagnant.com"}, "author": "Nicolas Robineau", "title": "Tirage Loto FDJ du samedi 25 avril 2020 : jouer en ligne pour 2 millions d’euros - Tirage Gagnant", "description": "Nouveau jackpot de 2.000.000€ ce samedi 25 avril 2020 au Loto ✅Jouer maintenant en ligne sur Tirage-Gagnant.com", "url": "https://tirage-gagnant.com/46487/loto-samedi-25-avril-2020/", "urlToImage": null, "publishedAt": "2020-04-25T10:33:00Z", "content": "La cagnotte redémarrera à son niveau initial de samedi 25 avril 2020 pour le tirage du Loto, soit un enjeu de 2 millions d’euros. Ce nouveau week-end de confinement vous donnera-t-il le sourire du travail bien fait en remportant un lot aussi important ? Résul… [+2141 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "20 Minutes avec agences", "title": "Jon Cryer revient sur le pétage de plombs de Charlie Sheen et blâme son divorce avec Denise Richards - 20 Minutes", "description": "Quoi qu’il en soit, l’acteur garde de bons souvenirs du tournage de « Mon Oncle Charlie »", "url": "https://www.20minutes.fr/arts-stars/people/2766647-20200425-jon-cryer-revient-petage-plombs-charlie-sheen-blame-divorce-denise-richards", "urlToImage": null, "publishedAt": "2020-04-25T10:27:15Z", "content": "L'acteur Jon Cryer Chris DELMAS / VISUAL Press Agency\r\nJon Cryer, qui incarnait Alan dans Mon Oncle Charlie, déplore toujours le pétage de plombs de \r\nCharlie Sheen qui a conduit à son renvoi. Comme il la expliqué lors de lémission Couch Surfing de \r\nPeople T… [+1560 chars]"}, {"source": {"id": null, "name": "Millenium.org"}, "author": "Zorg", "title": "Fortnite : concert Travis Scott, le papillon de fin d'événement grandit-il ? - Millenium", "description": "A lire sur millenium : Il évoque des souvenirs aux vétérans de Fortnite Battle Royale à la fin de chaque concert. Le Papillon qui clôture le spectacle était déjà apparu par le passé, lors de l'explosion du cube \"Kevin\". Il pourrait s'agir d'un indice sur un c…", "url": "https://www.millenium.org/news/365346.html", "urlToImage": null, "publishedAt": "2020-04-25T10:09:00Z", "content": "A la suite du tout premier concert de Travis Scott sur Fortnite ce vendredi, c'était l'un des éléments qui avait le plus retenu l'attention des connaisseurs du jeu de Epic Games. Le Papillon, entièrement constitué par des fragments de failles, est l'image qui… [+1978 chars]"}, {"source": {"id": null, "name": "Ecranlarge.com"}, "author": "", "title": "Defending Jacob : que vaut ce thriller meurtrier avec un Chris Evans loin des Avengers ? - Dossier Série - ÉcranLarge.com", "description": "Defending Jacob: Alors que l'Avengers Chris Hemsworth joue les durs avec Tyler Rake sur Netflix, son comparse Chris Evans a choisi un chemin glacial et psychologique pour l'après super-héroïsme avec une autre plateforme, Apple", "url": "https://www.ecranlarge.com/series/dossier/1174224-defending-jacob-thriller-meurtrier-avec-chris-evans-avengers-apple-tv", "urlToImage": null, "publishedAt": "2020-04-25T09:37:00Z", "content": "Alors que l'Avengers Chris Hemsworth joue les durs avec Tyler Rake sur Netflix, son comparse Chris Evans a choisi un chemin glacial et psychologique pour l'après super-héroïsme avec une autre plateforme, Apple TV+, et une série : Defending Jacob. La série a d… [+6165 chars]"}, {"source": {"id": null, "name": "Programme-tv.net"}, "author": "Rime El Himani", "title": "Anouchka Delon maman : ses premières confidences depuis la naissance de son bébé - Télé Loisirs.fr", "description": "Deux mois et demi après son accouchement, Anouchka Delon s'est confiée pour la première fois sur son nouveau quotidien de jeune maman auprès de la radio suisse OneFM.", "url": "https://www.programme-tv.net/news/cinema/253601-anouchka-delon-maman-ses-premiere-confidences-depuis-la-naissance-de-son-bebe/", "urlToImage": null, "publishedAt": "2020-04-25T09:32:53Z", "content": "En couple depuis 2010, Anouchka Delon et Julien Dereims ne pourraient pas être plus comblés. En septembre dernier, lactrice de 29 ans révélait attendre un heureux événement en dévoilant une photo de son ventre arrondi sur Instagram. Sept mois plus tard, la fi… [+1703 chars]"}, {"source": {"id": null, "name": "Allocine.fr"}, "author": "Mégane Choquet", "title": "Marvel : nouvelles dates pour les suites de Spider-Man, Doctor Strange et Thor - AlloCiné", "description": "Après les sorties repoussées de Black Widow et The Eternals, d’autres films Marvel voient leur sortie décalée en raison de l’épidémie de coronavirus. Cette décision concerne notamment les films Spider...", "url": "http://www.allocine.fr/article/fichearticle_gen_carticle=18689624.html", "urlToImage": null, "publishedAt": "2020-04-25T09:15:00Z", "content": "Après les sorties repoussées de Black Widow et The Eternals, dautres films Marvel voient leur sortie décalée en raison de lépidémie de coronavirus. Cette décision concerne notamment les films Spider-Man et le sequel de Doctor Strange.Sony Pictures\r\nEn raison … [+1642 chars]"}, {"source": {"id": null, "name": "Letribunaldunet.fr"}, "author": "https://www.facebook.com/letribunaldunet/, Jeanne", "title": "« Il était insupportable… » : Nathalie Marquay révèle avoir été harcelée par un célèbre homme politique - Tribunal Du Net", "description": "Nathalie Marquay s'est confiée dans un live Instagram ce mercredi 22 avril. Elle confie avoir été harcelée par un homme politique.", "url": "http://www.letribunaldunet.fr/people/insupportable-nathalie-marquay-revele-avoir-harcelee-celebre-homme-politique.html", "urlToImage": null, "publishedAt": "2020-04-25T08:47:06Z", "content": "Dans un live Instagram présenté par Sylvie Tellier, Nathalie Marquay qui était invitée, s’est laissé aller à quelques confidences. Elle a avoué avoir été harcelée pendant plusieurs mois par un célèbre homme politique dont elle souhaite taire le nom.\r\n&gt;&gt;… [+1768 chars]"}, {"source": {"id": null, "name": "Programme-tv.net"}, "author": "Rime El Himani", "title": "Hélène Darroze : son tacle bien senti aux chefs qui veulent \"nourrir le buzz\" en période de confinement - Télé Loisirs.fr", "description": "Connue pour son franc parler, Hélène Darroze a dénoncé le comportement de certains chefs cuisiniers, qui profiteraient de la crise sanitaire pour faire parler d'eux dans les médias ou sur les réseaux sociaux.", "url": "https://www.programme-tv.net/news/tv/253599-helene-darroze-son-tacle-bien-senti-aux-chefs-qui-veulent-nourrir-le-buzz-en-periode-de-confinement/", "urlToImage": null, "publishedAt": "2020-04-25T08:31:01Z", "content": "La crise sanitaire actuelle a obligé de nombreux professionnels à arrêter temporairement leur activité. Parmi eux, les restaurateurs qui ont dû fermer leurs établissements, dont le gouvernement évoque une possible réouverture le 15 juin prochain. \"Cest un cau… [+1405 chars]"}, {"source": {"id": null, "name": "Closermag.fr"}, "author": "La rédaction", "title": "Meghan Markle très remontée : dans les coulisses de la première audience qui l'oppose à la presse - Closer France", "description": "Ce vendredi 25 avril se tenait la première audience préliminaire opposant Harry et Meghan et les tabloïds britanniques. Et les avocats de la duchesse n’ont pas mâché leurs mots.", "url": "https://www.closermag.fr/royautes/meghan-markle-tres-remontee-dans-les-coulisses-de-la-premiere-audience-qui-l-opp-1106144", "urlToImage": null, "publishedAt": "2020-04-25T08:16:40Z", "content": "Ce vendredi 25 avril marquait pour Meghan et Harry, le début d'une bataille judiciaire avec les tabloïds britanniques qui leur mènent la vie si dure depuis plusieurs années. Et durant la première audience préliminaire face au groupe Associated Newspapers (édi… [+1687 chars]"}, {"source": {"id": null, "name": "Ozap.com"}, "author": "Florian Guadalupe", "title": "Audiences access 19h : Nagui largement en tête, record pour Cyril Lignac, Camille Combal au plus bas - Ozap", "description": "Les audiences du 19h-20h du vendredi 24 avril 2020.", "url": "https://www.ozap.com/actu/audiences-access-19h-nagui-largement-en-tete-record-pour-cyril-lignac-camille-combal-au-plus-bas/592324", "urlToImage": null, "publishedAt": "2020-04-25T07:26:13Z", "content": "Le leader\r\n\"N'oubliez pas les paroles\" - rediffusion (France 2)* : 3,60 millions (18,6%).\r\nLe jeu de Nagui est toujours aussi en forme avec une rediffusion sur France 2.\r\nLe reste du peloton de tête\r\n\"Le 19/20 national\" (France 3) : 3,08 millions (15,2%).\"Tou… [+702 chars]"}, {"source": {"id": null, "name": "Allocine.fr"}, "author": "CTC", "title": "Les séries en mai sur Netflix : The Eddy, Hollywood de Ryan Murphy, la nouvelle comédie de Steve Carell... - AlloCiné", "description": "Un club de jazz en danger dans The Eddy, des acteurs en herbe dans Hollywood, deux veuves en difficulté dans Dead To Me..., AlloCiné vous dit quelles séries arrivent sur Netflix en mai.", "url": "http://www.allocine.fr/article/fichearticle_gen_carticle=18689609.html", "urlToImage": null, "publishedAt": "2020-04-25T07:00:00Z", "content": "Un club de jazz en danger dans The Eddy, des acteurs en herbe dans Hollywood, deux veuves en difficulté dans Dead To Me..., AlloCiné vous dit quelles séries arrivent sur Netflix en mai.\r\nLE 1er MAI : Hollywood\r\nEn attendant le retour de son autre série sur la… [+1598 chars]"}, {"source": {"id": null, "name": "Sport.fr"}, "author": null, "title": "OM : un célèbre supporter devient chroniqueur dans TPMP, ce n’est pas Momo Henni - Sport.fr", "description": "Fidèle supporter de l’Olympique de Marseille, René Malleville n’a jamais eu la langue dans sa poche. Une attitude qui plaît à la chaîne C8 qui lui propose un poste de chroniqueur. Plusieurs fois invité dans Touche Pas à mon Poste, l’émission présentée chaque …", "url": "https://www.sport.fr/football/om-un-celebre-supporter-devient-chroniqueur-dans-tpmp-ce-nest-pas-momo-henni-683636.shtm", "urlToImage": null, "publishedAt": "2020-04-25T06:51:00Z", "content": "Fidèle supporter de l’Olympique de Marseille, René Malleville n’a jamais eu la langue dans sa poche. Une attitude qui plaît à la chaîne C8 qui lui propose un poste de chroniqueur. \r\nPlusieurs fois invité dans Touche Pas à mon Poste, l’émission présentée chaqu… [+395 chars]"}, {"source": {"id": null, "name": "Stars-actu.fr"}, "author": "Gregory S.", "title": "Étoile mystérieuse des « 12 coups de midi » : les deux premiers indices… - Stars Actu", "description": "Étoile mystérieuse des « 12 coups de midi ». Alors qu'on se demande toujours ce qu'il adviendra du jeu quotidien de Jean-Luc Reichmann", "url": "https://www.stars-actu.fr/2020/04/etoile-mysterieuse-des-12-coups-de-midi-les-deux-premiers-indices/", "urlToImage": null, "publishedAt": "2020-04-25T06:46:00Z", "content": "Étoile mystérieuse des « 12 coups de midi ». Alors que des rediffusions du jeu quotidien de Jean-Luc Reichmann devraient prendre le relais à compter du 29 avril 2020,  faute d’émissions inédites, « Les 12 coups de midi » ont encore résonné hier sur TF1. Et c’… [+1655 chars]"}, {"source": {"id": null, "name": "Nicematin.com"}, "author": "La rédaction", "title": "\"C'est une décision lourde à prendre\", l'édition 2020 du Nice Jazz Festival annulée - Nice-Matin", "description": "Le Nice Jazz Festival qui avait accueilli plus de 42.000 spectateurs en 2019 est reportée à l'année prochaine à cause de l'épidémie de coronavirus.", "url": "https://www.nicematin.com/concerts/cest-une-decision-lourde-a-prendre-ledition-2020-du-nice-jazz-festival-annulee-501243", "urlToImage": null, "publishedAt": "2020-04-25T06:05:00Z", "content": "Il se tiendra du 12 au 17 juillet 2021, avec une pause le 14 juillet.\r\n\"C'est une décision lourde à prendre, a expliqué le maire de Nice, Christian Estrosi. Mais les artistes qui étaient programmés pour le Nice Jazz Festival ne sont pas forcément disponibles … [+1054 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "Arthur RainBot", "title": "Horoscope chinois du Samedi 25 avril 2020 - 20minutes.fr", "description": "Découvrez l’horoscope chinois de 20 Minutes du 25/04/2020", "url": "https://www.20minutes.fr/horoscope-quotidien-chinois/2761047-20200415-horoscope-chinois-du-samedi-25-avril-2020", "urlToImage": null, "publishedAt": "2020-04-25T04:05:02Z", "content": "Découvrez l'horoscope quotidien chinois DR\r\nA propos de l'amour, vos sentiments se renforcent et, comme ils sont partagés, vous pouvez espérer vivre une très belle histoire. Ne craignez pas de vous libérer complètement, vous pourrez avoir confiance en votre p… [+8514 chars]"}, {"source": {"id": null, "name": "Francebleu.fr"}, "author": "Denis Guey", "title": "Indre-et-Loire: à Bourgueil, Jean Carmet aurait eu 100 ans - France Bleu", "description": "L'acteur Jean Carmet est né le 25 avril 1920. Ce samedi 25 avril 2020, il aurait eu 100 ans mais ce 100ème anniversaire ne sera pas fêté comme il se doit.", "url": "https://www.francebleu.fr/infos/medias-people/indre-et-loire-a-bourgueil-jean-carmet-aurait-eu-100-ans-1587666716", "urlToImage": null, "publishedAt": "2020-04-25T04:03:10Z", "content": "Le 25 avril 1920 naissait Jean Carmet à Tours. Cela fait exactement 100 ans. Mais c'est à Bourgueil qu'il a passé son enfance et la mémoire du comédien, décédé le 20 avril 1994, est toujours vivace dans la commune. La maison des vins est sa maison natale, une… [+2788 chars]"}, {"source": {"id": null, "name": "Causeur.fr"}, "author": "Causeur.fr, Xavier Legay", "title": "\"Dérapages\" sur Arte, Cantona contre la \"firme\" - Causeur.fr", "description": "Avec \"Dérapages\", Arte propose un thriller social qui invite à la réflexion sur les dérives du management", "url": "https://www.causeur.fr/derapages-sur-arte-la-face-sombre-du-management-175983", "urlToImage": null, "publishedAt": "2020-04-25T04:00:12Z", "content": "Jusqu’où Eric Cantona est-il prêt à aller pour retrouver un emploi à son âge? Avec Dérapages, Arte nous offre un thriller social qui invite à la réflexion sur les dérives du monde de lentreprise. Réussi\r\nDans cette mini-série, Eric Cantona campe brillamment A… [+5652 chars]"}, {"source": {"id": null, "name": "Huffingtonpost.fr"}, "author": "Poonam Singh Aujla", "title": "\"The Voice\": les KO terminés, quand aura lieu la finale? - Le HuffPost", "description": "Alors que TF1 diffuse ce samedi les derniers KO de la compétition dans l'équipe de Pascal Obispo, le confinement oblige la chaîne à repousser la demi-finale et la finale.", "url": "https://www.huffingtonpost.fr/entry/the-voice-les-ko-termines-quand-aura-lieu-la-finale_fr_5ea1676ac5b6194c7be8dc69", "urlToImage": null, "publishedAt": "2020-04-25T03:35:37Z", "content": "THE VOICE - On ne connaîtra pas tout de suite le nom du gagnant de cette édition 2020 de “The Voice”, successeur de Whitney Marin. L’épidémie de coronavirus et les longues semaines de confinement ont obligé beaucoup de chaînes de télévision à annuler ou repor… [+2690 chars]"}, {"source": {"id": null, "name": "13or-du-hiphop.fr"}, "author": "estelle", "title": "Jul : les montants des enchères continuent de grimper, le prix pour “My World” est démentiel - 13OR-du-HipHop.fr", "description": "Alors que les enchères de la mise en vente des certifications de Jul vont prendre fin dans 2 jours (ce lundi 27 avril), les montants ne cessent d'augmenter chaque jour et l'enchère du Double disque de platine remis à l'artiste Marseillais pour l'album \"My Wor…", "url": "https://www.13or-du-hiphop.fr/2020/04/25/jul-les-montants-des-encheres-continuent-de-grimper-le-prix-pour-my-world-est-dementiel/", "urlToImage": null, "publishedAt": "2020-04-25T00:46:53Z", "content": "Alors que les enchères de la mise en vente des certifications de Jul vont prendre fin dans 2 jours (ce lundi 27 avril), les montants ne cessent d’augmenter chaque jour et l’enchère du Double disque de platine remis à l’artiste Marseillais pour l’album “My Wor… [+1149 chars]"}, {"source": {"id": null, "name": "Public.fr"}, "author": "Public", "title": "Mort de Christophe : voici la seule chose qu'il a légué à Romain, le fils qu'il a eu avec Michèle Torr - Public", "description": "Le chanteur Christophe s’est éteint le 16 avril 2020 des suites d’un long combat contre la maladie. Mort à 74 ans, l’artiste souffrait en effet depuis longtemps d’un emphysème, une maladie pulmonaire chronique. Depuis quelques années, le chanteur Christophe é…", "url": "https://www.public.fr/News/Mort-de-Christophe-voici-la-seule-chose-qu-il-a-legue-a-Romain-le-fils-qu-il-a-eu-avec-Michele-Torr-1639768", "urlToImage": null, "publishedAt": "2020-04-24T22:16:41Z", "content": "Le chanteur Christophe sest éteint le 16 avril 2020 des suites dun long combat contre la maladie. Mort à 74 ans, lartiste souffrait en effet depuis longtemps dun emphysème, une maladie pulmonaire chronique. Depuis quelques années, le chanteur Christophe était… [+1741 chars]"}, {"source": {"id": null, "name": "Leparisien.fr"}, "author": null, "title": "Royaume-Uni : pour les soignants, Captain Tom devient N°1 des ventes de singles à 99 ans - Le Parisien", "description": "Le vétéran, qui a déjà réussi à collecter des millions d’euros, vient de battre un nouveau record en enregistrant « You’ll Never Walk Alone", "url": "http://www.leparisien.fr/societe/coronavirus-pour-les-soignants-captain-tom-devient-n-1-des-ventes-de-singles-a-99-ans-24-04-2020-8305560.php", "urlToImage": null, "publishedAt": "2020-04-24T20:56:00Z", "content": "On n'arrête plus le désormais célèbre « Captain Tom ». On l'avait quitté multipliant les longueurs dans son jardin, du haut de ses 99 ans, appuyé sur son déambulateur, pour recueillir des dons destinés aux soignants engagés dans la lutte contre l'épidémie du … [+2559 chars]"}, {"source": {"id": null, "name": "Ldpeople.com"}, "author": null, "title": "Danse avec les stars: Laurent Ournac raconte des anecdotes choquantes - LDpeople.com", "description": "Danse avec les stars: Le bien connu Tom Delormes (Laurent Ournac) de la série Camping Paradis de TF1, a également tenté l'expérience", "url": "https://www.ldpeople.com/danse-avec-les-stars-laurent-ournac-raconte-anecdotes-choquantes-64754", "urlToImage": null, "publishedAt": "2020-04-24T20:12:07Z", "content": "Danse avec les stars: Le bien connu Tom Delormes de la série Camping Paradis de TF1, a également tenté l’expérience d’animateur. En effet, il a présenté Danse avec les stars aux côtés de Sandrine Quétier de 2015 à 2016. Pour deux saisons entières, il anime l’… [+4444 chars]"}, {"source": {"id": null, "name": "Stars-actu.fr"}, "author": "Bertrand Blanc", "title": "Plus belle la vie en avance : Irina met fin à ses jours ! (vidéo PBLV épisode n°4047) - Stars Actu", "description": "C'est une terrible scène qui vous attend dans quelques jours dans votre série de France 3 \"Plus belle la vie\". En effet, alors qu'Irina a tiré sur Andrès", "url": "https://www.stars-actu.fr/2020/04/plus-belle-la-vie-en-avance-irina-met-fin-a-ses-jours-video-pblv-episode-n4047/", "urlToImage": null, "publishedAt": "2020-04-24T19:31:00Z", "content": "C’est une terrible scène qui vous attend dans quelques jours dans votre série de France 3 « Plus belle la vie ». En effet, alors qu’Irina a tiré sur Andrès sans savoir qu’il s’agissait de son père biologique, elle décide de mettre fin à ses jours !\r\nSeule che… [+803 chars]"}, {"source": {"id": null, "name": "Closermag.fr"}, "author": "P.G.", "title": "Elizabeth II : le prince William balance la passion \"folle\" de sa grand-mère - Closer France", "description": "Le Prince William a confié que sa grand-mère ainsi que son père le Prince Charles étaient \"follement passionnés\" par une activité.", "url": "https://www.closermag.fr/royautes/elizabeth-ii-le-prince-william-balance-la-passion-folle-de-sa-grand-mere-1106128", "urlToImage": null, "publishedAt": "2020-04-24T19:20:00Z", "content": "C'est une activité toute simple, que pratiquent de nombreuses personnes à travers le monde : la marche à pied. Plus qu'une simple nécessité ou une occupation, cette pratique est une véritable passion pour la reine d'Angleterre, a affirmé le prince William. Ch… [+1635 chars]"}, {"source": {"id": null, "name": "Purepeople.com"}, "author": "Emma Vanpoulle", "title": "Laury Thilleman en manque de culottes : son confinement de fortune - Pure People", "description": "À l'occasion de son retour à l'écran ce vendredi 24 avril 2020 pour animer \"Allez viens je t'emmène dans les années 60\", Laury Thilleman a accordé une interview à Télé-Star. En plus d'évoquer l'émission, l'ancienne Miss a parlé de son confinement avec son mar…", "url": "https://www.purepeople.com/article/laury-thilleman-en-manque-de-culottes-son-confinement-de-fortune_a385643/1", "urlToImage": null, "publishedAt": "2020-04-24T18:29:00Z", "content": "Laury Thilleman espère apporter un peu de bonheur ce vendredi 24 avril 2020. Après avoir animé une soirée spéciale années 70, elle est de retour sur France 3 pour danser et faire danser sur les meilleurs sons de la décennie précédente, celle des années 60. Un… [+1712 chars]"}, {"source": {"id": null, "name": "Letelegramme.fr"}, "author": "Le Télégramme", "title": "Céline Dion reporte sa tournée européenne, les Vieilles Charrues l’espèrent en 2021 - Le Télégramme", "description": "La chanteuse canadienne Céline Dion, qui devait notamment se produire aux Vieilles Charrues cet été, a annoncé le report de toutes ses dates prévues en Europe jusqu’en juillet. Le festival espère la faire venir l’été prochain.", "url": "https://www.letelegramme.fr/bretagne/celine-dion-reporte-sa-tournee-europeenne-les-vieilles-charrues-l-esperent-en-2021-24-04-2020-12543773.php", "urlToImage": null, "publishedAt": "2020-04-24T18:08:05Z", "content": "La chanteuse canadienne Céline Dion, qui devait notamment se produire aux Vieilles Charrues cet été, a annoncé le report de toutes ses dates prévues en Europe jusquen juillet. Le festival espère la faire venir lété prochain.\r\nLes fans bretons de Céline Dion, … [+2554 chars]"}, {"source": {"id": null, "name": "Parismatch.com"}, "author": "Paris Match", "title": "La vie avant le confinement : les stars nostalgiques - Paris Match", "description": "Pour beaucoup, le confinement permet de faire du tri et de replonger dans les souvenirs de la vie d'avant... Les célébrités en profitent pour les p...", "url": "https://www.parismatch.com/People/La-vie-avant-le-confinement-les-stars-nostalgiques-1683199", "urlToImage": null, "publishedAt": "2020-04-24T18:02:55Z", "content": "Pour beaucoup, le confinement permet de faire du tri et de replonger dans les souvenirs de la vie d'avant... Les célébrités en profitent pour les partager avec leurs abonnés. Comme le veut la tradition américaine, le jeudi est la journée des souvenirs. Avec l… [+3156 chars]"}, {"source": {"id": null, "name": "Journaldugeek.com"}, "author": "Julie Hay", "title": "Disney+ développe une série Star Wars avec un casting féminin - Journal du geek", "description": "Disney+ va développer une nouvelle série Star Wars, avec un casting féminin et la créatrice de Poupées Russes aux commandes.", "url": "https://www.journaldugeek.com/2020/04/24/disney-serie-star-wars-casting-feminin/", "urlToImage": null, "publishedAt": "2020-04-24T17:57:23Z", "content": "On na pas fini dentendre parler de la galaxie de George Lucas. Disney+ va développer une nouvelle série Star Wars, avec un casting féminin et la créatrice de Poupées Russes aux commandes.Crédits : LucasFilm\r\nLa galaxie Star Wars va encore s’agrandir, à en cro… [+1907 chars]"}, {"source": {"id": null, "name": "Allocine.fr"}, "author": "Thomas Imbert ([Url href='https://twitter.com/Thomas_Theory?lang=fr']@Thomas_Theory[/Url])", "title": "Les 25 meilleures comédies de tous les temps selon les spectateurs AlloCiné - AlloCiné", "description": "De \"La Grande Vadrouille\" à \"La Ruée vers l'or\" en passant par \"Le Dîner de Cons\", retour sur les 25 meilleures comédies de tous les temps selon les spectateurs d'AlloCiné.", "url": "http://www.allocine.fr/diaporamas/cinema/diaporama-18689325/", "urlToImage": null, "publishedAt": "2020-04-24T17:00:00Z", "content": "Contact|Qui sommes-nous| Recrutement|Publicité|CGU|Politique de cookies|Données Personnelles|Revue de presse|Jeux concours|\r\n ©AlloCiné\r\nRetrouvez tous les horaires et infos de votre cinéma sur le numéro AlloCiné : 0 892 892 892 (0,34/minute)"}, {"source": {"id": null, "name": "Programme-tv.net"}, "author": "Sébastien Barké", "title": "Exclu. N'oubliez pas les paroles : quelles émissions France 2 va-t-elle rediffuser après les Masters 2019 ? - Télé Loisirs.fr", "description": "Après avoir rediffusé avec succès les deux semaines de compétition de ses Masters 2019, N'oubliez pas les paroles s'apprête à reproposer aux téléspectateurs de France 2 le parcours d'un chouchou du public…", "url": "https://www.programme-tv.net/news/tv/253578-exclu-noubliez-pas-les-paroles-quelles-emissions-france-2-va-t-elle-rediffuser-apres-les-masters-2019/", "urlToImage": null, "publishedAt": "2020-04-24T16:30:00Z", "content": "Faute d'épisodes inédits au frais, France 2 et Nagui ont fait le choix de proposer aux téléspectateurs de revivre les Masters 2019 de N'oubliez pas les paroles, entre le 13 et le 25 avril 2020. Deux semaines de compétition, marquées par de très jolies audienc… [+1701 chars]"}, {"source": {"id": null, "name": "Bfmtv.com"}, "author": "BFMTV", "title": "« T'as voulu voir le salon », la parodie de Jacques Brel qui cartonne sur YouTube - BFMTV people", "description": "Cette parodie de la chanson de Brel a été vue plus de 2 millions de fois.", "url": "https://people.bfmtv.com/actualite-people/t-as-voulu-voir-le-salon-la-parodie-de-jacques-brel-qui-cartonne-sur-youtube-1900126.html", "urlToImage": null, "publishedAt": "2020-04-24T16:27:02Z", "content": null}, {"source": {"id": null, "name": "Www.rtl.fr"}, "author": null, "title": "VIDÉO - Les Grosses Têtes : Karine Le Marchand s'y connait en femme à barbe - RTL.fr", "description": "REPLAY - Écoutez ou réécoutez l'émission du vendredi 24 avril 2020 avec Laurent Ruquier et ses Grosses Têtes du jour.", "url": "https://www.rtl.fr/culture/medias-people/video-les-grosses-tetes-karine-le-marchand-s-y-connait-en-femme-a-barbe-7800419976", "urlToImage": null, "publishedAt": "2020-04-24T16:05:00Z", "content": "Découvrez Les Grosses Têtes du vendredi 24 avril 2020 ! Laurent Ruquier vous présente le plateau du jour : Une Grosse Tête avec qui on se demande comment on va lui faire porter un masque vu quelle a déjà du mal à porter une culotte : Karine Le Marchand. Une G… [+1840 chars]"}, {"source": {"id": null, "name": "Ecranlarge.com"}, "author": null, "title": "Tyler Rake : critique qui Thor dur - ÉcranLarge.com", "description": "Découvrez la critique du film Tyler Rake de Sam Hargrave, sorti en 2020 - L'avis d'EcranLarge.com", "url": "https://www.ecranlarge.com/films/critique/1174447-tyler-rake-critique-qui-thor-dur", "urlToImage": null, "publishedAt": "2020-04-24T15:58:25Z", "content": "Les films d'action à l'ancienne, basés sur un personnage fort, un concept simple, une mise en scène de l'action réfléchie et des acteurs capables d'assumer la dimension physique de leur rôle, est tristement oublié par le Hollywood des super-héros. Mais il sem… [+4017 chars]"}, {"source": {"id": null, "name": "Konbini.com"}, "author": "Lucille Bion", "title": "Les 5 films incontournables de François Truffaut qu'il faut voir sur Netflix - Konbini France", "description": "Alors que 12 films de Truffaut sont disponibles sur Netflix, voici quelques pistes pour accueillir son œuvre et la comprendre.", "url": "https://www.konbini.com/fr/cinema/les-5-films-incontournables-de-francois-truffaut-quil-faut-voir-sur-netflix/", "urlToImage": null, "publishedAt": "2020-04-24T15:57:49Z", "content": "Netflix a décidé délargir son catalogue en piochant dans luvre de François Truffaut. Grâce à un partenariat signé avec MK2, la plateforme a récupéré 12 films du réalisateur français. \r\nChef de file de la Nouvelle Vague, grand rival de Jean-Luc Godard, critiqu… [+7875 chars]"}, {"source": {"id": null, "name": "Allocine.fr"}, "author": "Julia Fernandez", "title": "Coronavirus et salles de cinéma : les premières mesures envisagées pour la réouverture - AlloCiné", "description": "Alors que la réouverture des salles de cinéma s'envisage suite au discours de Pierre Lescure du jeudi 23 avril, la Fédération nationale des cinémas français (FNCF) fait le point sur les différentes pi...", "url": "http://www.allocine.fr/article/fichearticle_gen_carticle=18689598.html", "urlToImage": null, "publishedAt": "2020-04-24T15:46:00Z", "content": "Alors que la réouverture des salles de cinéma s'envisage suite au discours de Pierre Lescure du jeudi 23 avril, la Fédération nationale des cinémas français (FNCF) fait le point sur les différentes pistes de réflexion en cours.FNCF\r\nSuite à l'intervention du … [+2574 chars]"}, {"source": {"id": null, "name": "Konbini.com"}, "author": "Aurélien Chapuis", "title": "Les Beastie Boys racontent leur amitié dans le docu (hors-norme) de Spike Jonze - Konbini France", "description": "Un docu (vraiment) pas comme les autres.", "url": "https://www.konbini.com/fr/musique/beastie-boys-documentaire-spectacle-spike-jonze/", "urlToImage": null, "publishedAt": "2020-04-24T15:13:28Z", "content": "Il fallait au moins ça. Avec The Beastie Boys Story, Mike D, Ad-Rock et Spike Jonze offrent lhistoire dun groupe mythique qui a changé la musique pour toujours. Et plutôt que de le faire dans un simple documentaire, ils lont transformé en un incroyable specta… [+4647 chars]"}, {"source": {"id": null, "name": "Www.rtl.fr"}, "author": null, "title": "Confinement : les Beatles organisent un karaoké en ligne sur \"Yellow Submarine\" - RTL.fr", "description": "Ringo Starr et Paul McCartney organisent un karaoké sur YouTube samedi à 18h, sur la bande originale du film \"Yellow Submarine\".", "url": "https://www.rtl.fr/culture/musique/confinement-les-beatles-organisent-un-karaoke-en-ligne-sur-yellow-submarine-7800438465", "urlToImage": null, "publishedAt": "2020-04-24T13:29:00Z", "content": "L'évènement est rare, les deux survivants des Beatles Ringo Starr et Paul McCartney ont organisé une diffusion \"Singalong\", une version chantée, du film animée Yellow Submarine qui mettait en scène les 4 garçons dans le vent en 1968. Dès 18h sur YouTube, heur… [+1331 chars]"}, {"source": {"id": null, "name": "Closermag.fr"}, "author": "La rédaction", "title": "Annette Blier : l'épouse du célèbre acteur Bernard Blier est morte à 84 ans - Closer France", "description": "Annette Blier, la deuxième épouse de l'acteur Bernard Blier est morte. Elle était âgée de 84 ans.", "url": "https://www.closermag.fr/people/annette-blier-l-epouse-du-celebre-acteur-bernard-blier-est-morte-a-84-ans-1106072", "urlToImage": null, "publishedAt": "2020-04-24T13:25:20Z", "content": "Triste nouvelle en ce vendredi 24 avril 2020. Annette Blier, l'épouse du célèbre acteur Bernard Blier est morte. Selon les informations de l'AFP (Agence France Presse), cette dernière s'en est allée jeudi 23 avril 2020 à l'EHPAD dans lequel elle résidait à Do… [+1666 chars]"}, {"source": {"id": null, "name": "Ouest-france.fr"}, "author": "avec agence", "title": "« Tout le monde veut prendre sa place ». Marie-Christine, championne du jeu, a reçu des messages de haine - Ouest-France", "description": "À l’occasion de la rediffusion de son extraordinaire parcours dans « Tout le monde veut prendre sa place », Marie-Christine est revenue sur son expérience de participante record du jeu de France 2. Celle qui a été championne pendant huit mois dit avoir gagné …", "url": "https://www.ouest-france.fr/culture/people/tout-le-monde-veut-prendre-sa-place-marie-christine-championne-du-jeu-recu-des-messages-de-haine-6816735", "urlToImage": null, "publishedAt": "2020-04-24T13:11:48Z", "content": "Marie-Christine, la candidate hors-norme de Tout le monde veut prendre sa place, sest confiée sur les huit mois quelle a passés dans le fauteuil de champion du programme de France 2. Ses 217 participations à lémission présentée par Nagui lui ont rapporté 1969… [+1570 chars]"}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": null, "title": "Tom Hanks, guéri du coronavirus, écrit à Corona, un garçon moqué pour son prénom - franceinfo", "description": "", "url": "https://www.francetvinfo.fr/culture/cinema/tom-hanks-gueri-du-coronavirus-ecrit-a-corona-un-garcon-moque-pour-son-prenom_3932575.html", "urlToImage": null, "publishedAt": "2020-04-24T13:11:00Z", "content": "L'acteur de \"Forrest Gump\" s'est adressé à un jeune australien de huit ans, victime de harcèlement pour son nom, Corona. L'acteur américain Tom Hanks, guéri du nouveau coronavirus, ainsi que son épouse Rita Wilson, a adressé une lettre réconfortante à un jeun… [+1584 chars]"}, {"source": {"id": null, "name": "Journaldugeek.com"}, "author": "Julie Hay", "title": "Hunger Games : il y aura un prequel sur la jeunesse du président Snow - Journal du geek", "description": "Le prequel nous plongera dans l'adolescence du tyrannique Président Snow, qui vient d'être choisi pour entraîner la tribu femelle pour les Hunger Games.", "url": "https://www.journaldugeek.com/2020/04/24/hunger-games-prequel-jeunesse-president-snow/", "urlToImage": null, "publishedAt": "2020-04-24T12:57:09Z", "content": "On va revoir le district 12 dans un nouveau long-métrage sur l’univers d’Hunger Games. Le prequel nous plongera dans l’adolescence du tyrannique Président Snow, qui vient d’être choisi pour entraîner la tribu féminine pour les Hunger Games.Crédits : Metropoli… [+2416 chars]"}, {"source": {"id": null, "name": "Lebonbon.fr"}, "author": null, "title": "Alerte Job de rêve : être payé 1 000 $ pour regarder la saga Harry Potter - Le Bonbon", "description": "De quoi mettre du baume au cœur en cette drôle de période.", "url": "https://www.lebonbon.fr/paris/pop-culture/job-regarder-saga-harry-potter/", "urlToImage": null, "publishedAt": "2020-04-24T12:42:40Z", "content": "Parmi les sagas les plus marquantes pour notre génération, celle d’Harry Potter est clairement notre grande préférée. L’univers magique, les personnages attachants, l’histoire prenante et même Celui-dont-on-ne-doit-pas-prononcer-le-nom, on aime absolument tou… [+723 chars]"}, {"source": {"id": null, "name": "Www.lci.fr"}, "author": "Sibylle LAURENT", "title": "Darroze, Sarran, Etchebest... Comment les \"tops chefs\" sont devenus les porte-drapeaux des restaurateurs sinistrés - LCI", "description": "FOCUS - Restaurateurs et hôteliers se sont entretenus ce vendredi matin avec Emmanuel Macron sur la manière dont le secteur de la restauration pourra se relever du confinement. Parmi les convives de cette réunion, de grands chefs étoilés qui sont aussi des en…", "url": "https://www.lci.fr/emploi/coronavirus-helene-darroze-michel-sarran-philippe-etchebest-comment-les-tops-chefs-sont-devenus-les-porte-drapeaux-du-secteur-de-la-restauration-2151916.html", "urlToImage": null, "publishedAt": "2020-04-24T12:05:07Z", "content": "Emploi\r\nFOCUS - Restaurateurs et hôteliers se sont entretenus ce vendredi matin avec Emmanuel Macron sur la manière dont le secteur de la restauration pourra se relever du confinement. Parmi les convives de cette réunion, de grands chefs étoilés qui sont auss… [+7939 chars]"}, {"source": {"id": "blasting-news-br", "name": "Blasting News (BR)"}, "author": "Hugo Louis", "title": "Nabilla et Thomas cohabitent difficilement : 'ça peut péter à tout moment' - Blasting News France", "description": "Nabilla et Thomas Vergara traversent une période bien difficile à cause du confinement. Cependant, ils font tout pour la surmonter.", "url": "https://fr.blastingnews.com/tv-gossip/2020/04/nabilla-et-thomas-au-bord-de-la-rupture-ca-peut-exploser-a-tout-moment-003123543.html", "urlToImage": null, "publishedAt": "2020-04-24T11:52:38Z", "content": "Les mesures de confinement imposées au monde entier sont tout sauf faciles. Néanmoins, pour certains couples, cela semble être plus compliqués que pour d'autres, le couple star de la télé-réalité Nabilla et Thomas Vergara semble être dans cette situation. Dep… [+2688 chars]"}, {"source": {"id": null, "name": "Lesinrocks.com"}, "author": "Service Musiques", "title": "“Goliath” : Woodkid est de retour après sept ans d'absence - Les Inrocks", "description": "Le Français signe son grand retour avec un nouveau titre extrait de son album à venir.", "url": "https://www.lesinrocks.com/2020/04/24/musique/musique/goliath-woodkid-est-de-retour-apres-sept-ans-dabsence/", "urlToImage": null, "publishedAt": "2020-04-24T11:04:01Z", "content": null}, {"source": {"id": null, "name": "Melty.fr"}, "author": "Aurore C", "title": "Carla Moreau (Les Marseillais aux Caraïbes) en larmes sur Snapchat, elle fait des révélations bouleversantes sur son passé - melty", "description": "Carla Moreau des Marseillais aux Caraïbes se confie pour la première fois sur son père et fait des révélations bouleversantes...", "url": "https://www.melty.fr/carla-moreau-les-marseillais-aux-caraibes-en-larmes-sur-snapchat-elle-fait-des-revelations-bouleversantes-sur-son-passe-a717397.html", "urlToImage": null, "publishedAt": "2020-04-24T11:01:36Z", "content": "Après avoir fait des révélations sur Les Marseillais aux Caraïbes, Carla Moreau se confie sur son père, de qui elle n'a jamais parlé sur les réseaux sociaux et s'est affichée très émue ! La candidate que l'on retrouve du lundi au jeudi sur W9 a fait un live s… [+1489 chars]"}, {"source": {"id": null, "name": "Parismatch.be"}, "author": "Rédaction Paris Match Belgique", "title": "Koh-Lanta : Denis Brogniart révèle sa technique infaillible pour jouer avec les nerfs des candidats - Paris Match Belgique", "description": "Pour rendre encore un peu plus spectaculaire son jeu d’aventure, la production de « Koh-Lanta » aime désorienter au maximum les candidats. Denis Brogniart a révélé un petit truc très efficace utilisé lors des tournages.", "url": "https://parismatch.be/culture/medias/393560/koh-lanta-denis-brogniart-revele-sa-technique-infaillible-pour-jouer-avec-les-nerfs-des-candidats", "urlToImage": null, "publishedAt": "2020-04-24T10:28:00Z", "content": "Pour rendre encore un peu plus spectaculaire son jeu d’aventure, la production de « Koh-Lanta » aime désorienter au maximum les candidats. Denis Brogniart a révélé un petit truc très efficace utilisé lors des tournages.\r\nCest à loccasion de son rendez-vous qu… [+1223 chars]"}, {"source": {"id": null, "name": "Programme-tv.net"}, "author": "Camille Paul", "title": "Monica Bellucci : cette décision qu'elle a prise pour le bien de ses filles - Télé Loisirs.fr", "description": "Monica Bellucci a accordé une interview téléphonique au magazine de mode Madame Figaro, au cours de laquelle l'actrice parle de son confinement avec ses filles Deva et Léonie.", "url": "https://www.programme-tv.net/news/cinema/253553-monica-bellucci-cette-decision-quelle-a-prise-pour-le-bien-de-leurs-filles/", "urlToImage": null, "publishedAt": "2020-04-24T10:15:24Z", "content": "L'ancien mannequin Monica Bellucci, confinée depuis le 17 mars, avec ses deux filles Deva et Léonie (respectivement âgées de 15 et 9 ans), a accordé un entretien au téléphone au magazine de mode Madame Figaro. L'artiste de 55 ans y décrit son état d'esprit, e… [+1862 chars]"}, {"source": {"id": null, "name": "Slate.fr"}, "author": "Caroline Ernesty", "title": "«Tiger King», pas un personnage pour rattraper l'autre | Slate.fr - Slate.fr", "description": "Très populaire sur les réseaux, «Au Royaume des Fauves (Tiger King)» est un divertissement précieux en période de confinement.", "url": "http://www.slate.fr/story/189783/culture-docu-serie-netflix-tiger-king-au-royaume-des-fauves", "urlToImage": null, "publishedAt": "2020-04-24T10:03:00Z", "content": "Temps de lecture: 5 min\r\nAttention, cet article comporte des spoilers.\r\nDepuis le 20 mars, et en l'espace de dix jours, plus de 34 millions d'Américain·es ont été captivé·es par les aventures de Joe Exotic et consorts, adeptes des «gros chats» et personnages … [+6573 chars]"}, {"source": {"id": null, "name": "Allocine.fr"}, "author": "CTC", "title": "Les séries sur Netflix du 24 au 30 avril : The Last Kingdom saison 4, le retour de Ricky Gervais, 2 nouveaux teen shows… - AlloCiné", "description": "Découvrez grâce à AlloCiné les séries qui sortiront sur Netflix entre le 24 et 30 avril !", "url": "http://www.allocine.fr/article/fichearticle_gen_carticle=18689576.html", "urlToImage": null, "publishedAt": "2020-04-24T09:07:32Z", "content": "Découvrez grâce à AlloCiné les séries qui sortiront sur Netflix entre le 24 et 30 avril !\r\nAfter Life : La série de Ricky Gervais - le roi de lhumour noir - revient avec une saison 2.\r\nLove 101 : cette série turque suit un groupe d'adolescents marginalisés da… [+857 chars]"}, {"source": {"id": null, "name": "Lesinrocks.com"}, "author": "Franck Vergeade", "title": "Benjamin Biolay sort un tube renversant, “Comment est ta peine ?” - Les Inrocks", "description": "", "url": "https://www.lesinrocks.com/inrocks.tv/benjamin-biolay-sort-un-tube-renversant-comment-est-ta-peine/", "urlToImage": null, "publishedAt": "2020-04-24T09:05:03Z", "content": "Deux mois exactement avant la sortie de son neuvième album, Grand prix, le chanteur déclenche le feu vert du premier single qui l'ouvrira superbement.En un seul tour, Benjamin Biolay réussit à conjuguer ses obsessions musicales, entre Manchester et New York, … [+917 chars]"}, {"source": {"id": null, "name": "Paris-turf.com"}, "author": "Communiqué de France Galop.", "title": "France Galop : Programme des courses en cas de reprise à partir du 11 mai - Paris Turf", "description": "Communiqué de France Galop.", "url": "http://www.paris-turf.com/actualites/france-galop-programme-des-courses-en-cas-de-reprise-a-partir-du-11-mai-253170", "urlToImage": null, "publishedAt": "2020-04-24T06:30:00Z", "content": "Communiqué de France Galop.\r\nDans la perspective d’une reprise de l’activité à huis-clos à partir du lundi 11 mai, France Galop a remodelé son calendrier et son programme sur la période du 11 au 31 mai pour optimiser l’offre disponible, aussi bien à Paris qu’… [+6903 chars]"}]}