{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Melty.fr"}, "author": "Amandine G", "title": "Alix et Benjamin Samat (LMAC) toujours en couple après leur retour à Marseille ? Elle balance tout - melty", "description": "Alix et Benjamin Samat des Marseillais aux Caraïbes n'ont pas rompu tout de suite après leur retour en France, la preuve !", "url": "https://www.melty.fr/alix-et-benjamin-samat-lmac-toujours-en-couple-apres-leur-retour-a-marseille-elle-balance-tout-a717438.html", "urlToImage": null, "publishedAt": "2020-04-25T10:02:52Z", "content": "Depuis l'officialisation de leur rupture, Alix et Benjamin Samat se clashent par réseaux sociaux interposés. Mais si le couple était jusqu'à présent resté plutôt discret sur les véritables raisons de sa rupture, les langues se délient au fur et à mesure de la… [+1636 chars]"}, {"source": {"id": null, "name": "Purepeople.com"}, "author": "Olivia Maunoury", "title": "Anouchka Delon maman : elle se confie enfin après la naissance de son fils - Pure People", "description": "Anouchka Delon est devenue maman pour la première fois il y a deux mois et demi, accueillant un petit garçon avec son compagnon Julien Dereims. Confinés à Genève, en Suisse, avec ses deux hommes, la fille adorée d'Alain Delon s'est confiée pour la première fo…", "url": "https://www.purepeople.com/article/anouchka-delon-maman-elle-se-confie-enfin-apres-la-naissance-de-son-fils_a385700/1", "urlToImage": null, "publishedAt": "2020-04-25T08:23:00Z", "content": "Dans la nuit du 14 au 15 février 2020, Anouchka Delon a connu une expérience inoubliable, celle de donner naissance à son premier enfant. La comédienne de 29 ans a accouché d'un petit garçon à Genève, faisant de son compagnon Julien Dereims le plus heureux de… [+3191 chars]"}, {"source": {"id": null, "name": "Closermag.fr"}, "author": "La rédaction", "title": "Meghan Markle très remontée : dans les coulisses de la première audience qui l'oppose à la presse - Closer France", "description": "Ce vendredi 25 avril se tenait la première audience préliminaire opposant Harry et Meghan et les tabloïds britanniques. Et les avocats de la duchesse n'ont pas mâché leurs mots.", "url": "https://www.closermag.fr/royautes/meghan-markle-tres-remontee-dans-les-coulisses-de-la-premiere-audience-qui-l-opp-1106144", "urlToImage": null, "publishedAt": "2020-04-25T08:16:40Z", "content": "Ce vendredi 25 avril marquait pour Meghan et Harry, le début d'une bataille judiciaire avec les tabloïds britanniques qui leur mènent la vie si dure depuis plusieurs années. Et durant la première audience préliminaire face au groupe Associated Newspapers (édi… [+1687 chars]"}, {"source": {"id": null, "name": "Sortiraparis.com"}, "author": null, "title": "Coronavirus à Paris et Ile-de-France ce samedi 25 avril - sortiraparis", "description": "Découvrez les dernières informations concernant la situation à Paris et en Ile-de-France sur l'épidémie de Covid-19 ce samedi 25 avril. Courses, transports, mesures, distribution de masques, on fait le point. Selon le dernier bilan, on dénombre 1.935 personne…", "url": "https://www.sortiraparis.com/actualites/a-paris/articles/210162-coronavirus-a-paris-et-ile-de-france-ce-samedi-25-avril", "urlToImage": null, "publishedAt": "2020-04-25T08:16:13Z", "content": "Par\r\nMy B.· Photos par\r\nMy B.· Publié le 25 avril 2020 à 09h33\r\n· Mis à jour le 25 avril 2020 à 09h34\r\nDécouvrez les dernières informations concernant la situation à Paris et en Ile-de-France sur l'épidémie de Covid-19 ce samedi 25 avril. Courses, transports,… [+151501 chars]"}, {"source": {"id": null, "name": "Bfmtv.com"}, "author": "BFMTV", "title": "Kanye West est officiellement milliardaire - BFMTV people", "description": "Le célèbre rappeur américain a fait fortune grâce à sa marque de sneakers, les Yeezy, développée en collaboration avec Adidas.", "url": "https://people.bfmtv.com/actualite-people/kanye-west-est-officiellement-milliardaire-1900480.html", "urlToImage": null, "publishedAt": "2020-04-25T08:13:00Z", "content": null}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": "La rédaction du Figaro Voyage", "title": "Vacances 2020 et coronavirus: remboursement, billets d'avion, report de séjour... les réponses des experts à nos lecteurs - Le Figaro", "description": "PRATIQUE. - Avec le Covid-19 les Français qui ont planifié leurs vacances ou les annulent s'inquiètent, et s'interrogent sur les avoirs proposés par les professionnels.", "url": "http://www.lefigaro.fr/voyages/vacances-2020-et-coronavirus-remboursement-billets-d-avion-report-de-sejour-les-reponses-des-experts-a-nos-lecteurs-20200425", "urlToImage": null, "publishedAt": "2020-04-25T08:12:00Z", "content": "Le coronavirus contrarie tous les plans de vacances. En attendant le déconfinement et les perspectives du gouvernement pour la saison d'été 2020, difficile pour les Français de planifier un prochain départ. D'autant que la gestion des séjours, billets d'avion… [+10321 chars]"}, {"source": {"id": null, "name": "Ozap.com"}, "author": "Florian Guadalupe", "title": "Audiences access 19h : Nagui largement en tête, record pour Cyril Lignac, Camille Combal au plus bas - Ozap", "description": "Les audiences du 19h-20h du vendredi 24 avril 2020.", "url": "https://www.ozap.com/actu/audiences-access-19h-nagui-largement-en-tete-record-pour-cyril-lignac-camille-combal-au-plus-bas/592324", "urlToImage": null, "publishedAt": "2020-04-25T07:26:13Z", "content": "Le leader\r\n\"N'oubliez pas les paroles\" - rediffusion (France 2)* : 3,60 millions (18,6%).\r\nLe jeu de Nagui est toujours aussi en forme avec une rediffusion sur France 2.\r\nLe reste du peloton de tête\r\n\"Le 19/20 national\" (France 3) : 3,08 millions (15,2%).\"Tou… [+702 chars]"}, {"source": {"id": null, "name": "Ozap.com"}, "author": "Florian Guadalupe", "title": "Audiences : \"Koh-Lanta\" bon leader, \"Candice Renoir\" en baisse, \"NCIS\" devant France 3 - Ozap", "description": "Les audiences de la soirée du vendredi 24 avril 2020.", "url": "https://www.ozap.com/actu/audiences-koh-lanta-bon-leader-candice-renoir-en-baisse-ncis-devant-france-3/592318", "urlToImage": null, "publishedAt": "2020-04-25T07:13:16Z", "content": "Vendredi soir, TF1 s'est imposée en tête des audiences avec le 9e numéro de \"Koh-Lanta : L'île des héros\". De nouveau écourté en ces temps de crise d'approvisionnement en programmes frais, le jeu d'aventure produit par ALP et animé par Denis Brogniart a rasse… [+2010 chars]"}, {"source": {"id": null, "name": "Stars-actu.fr"}, "author": "Gregory S.", "title": "Étoile mystérieuse des « 12 coups de midi » : les deux premiers indices… - Stars Actu", "description": "Étoile mystérieuse des « 12 coups de midi ». Alors qu'on se demande toujours ce qu'il adviendra du jeu quotidien de Jean-Luc Reichmann", "url": "https://www.stars-actu.fr/2020/04/etoile-mysterieuse-des-12-coups-de-midi-les-deux-premiers-indices/", "urlToImage": null, "publishedAt": "2020-04-25T06:46:00Z", "content": "Étoile mystérieuse des « 12 coups de midi ». Alors que des rediffusions du jeu quotidien de Jean-Luc Reichmann devraient prendre le relais à compter du 29 avril 2020,  faute d’émissions inédites, « Les 12 coups de midi » ont encore résonné hier sur TF1. Et c’… [+1655 chars]"}, {"source": {"id": null, "name": "Allocine.fr"}, "author": "Léa Bodin", "title": "Al Pacino a 80 ans : 5 choses à savoir sur la star du Parrain et de Scarface - AlloCiné", "description": "Aujourd'hui 25 avril, Al Pacino fête ses 80 ans. A cette occasion, retour sur cinq choses que vous ignoriez peut-être sur ce monstre sacré du cinéma hollywoodien.", "url": "http://www.allocine.fr/article/fichearticle_gen_carticle=18689571.html", "urlToImage": null, "publishedAt": "2020-04-25T06:00:00Z", "content": "Aujourd'hui 25 avril, Al Pacino fête ses 80 ans. A cette occasion, retour sur cinq choses que vous ignoriez peut-être sur ce monstre sacré du cinéma hollywoodien.Universal Pictures\r\nC'est un adepte de \"La Méthode\"\r\nAu milieu des années 1960, Al Pacino, alors … [+6255 chars]"}, {"source": {"id": null, "name": "Causeur.fr"}, "author": "Causeur.fr, Xavier Legay", "title": "\"Dérapages\" sur Arte, Cantona contre la \"firme\" - Causeur.fr", "description": "Avec \"Dérapages\", Arte propose un thriller social qui invite à la réflexion sur les dérives du management", "url": "https://www.causeur.fr/derapages-sur-arte-la-face-sombre-du-management-175983", "urlToImage": null, "publishedAt": "2020-04-25T04:00:12Z", "content": "Jusqu’où Eric Cantona est-il prêt à aller pour retrouver un emploi à son âge? Avec Dérapages, Arte nous offre un thriller social qui invite à la réflexion sur les dérives du monde de lentreprise. Réussi\r\nDans cette mini-série, Eric Cantona campe brillamment A… [+5652 chars]"}, {"source": {"id": null, "name": "Journaldesfemmes.fr"}, "author": "Luna Sol", "title": "Horoscope du samedi 25 avril - Journal des femmes", "description": "Découvrez tout de suite ce que les astres vous réservent pour aujourd'hui, grâce aux prévisions personnalisées signe par signe de notre experte de l'horoscope et des planètes.", "url": "https://www.journaldesfemmes.fr/horoscope/zodiaque/2628731-horoscope-du-samedi-25-avril/", "urlToImage": null, "publishedAt": "2020-04-25T01:00:04Z", "content": "Découvrez tout de suite ce que les astres vous réservent pour aujourd'hui, grâce aux prévisions personnalisées signe par signe de notre experte de l'horoscope et des planètes. \r\nL'influence de Pluton vous honore. Votre enfant rencontre un obstacle de taille. … [+6661 chars]"}, {"source": {"id": null, "name": "13or-du-hiphop.fr"}, "author": "estelle", "title": "Jul : les montants des enchères continuent de grimper, le prix pour “My World” est démentiel - 13OR-du-HipHop.fr", "description": "Alors que les enchères de la mise en vente des certifications de Jul vont prendre fin dans 2 jours (ce lundi 27 avril), les montants ne cessent d'augmenter chaque jour et l'enchère du Double disque de platine remis à l'artiste Marseillais pour l'album \"My Wor…", "url": "https://www.13or-du-hiphop.fr/2020/04/25/jul-les-montants-des-encheres-continuent-de-grimper-le-prix-pour-my-world-est-dementiel/", "urlToImage": null, "publishedAt": "2020-04-25T00:46:53Z", "content": "Alors que les enchères de la mise en vente des certifications de Jul vont prendre fin dans 2 jours (ce lundi 27 avril), les montants ne cessent d’augmenter chaque jour et l’enchère du Double disque de platine remis à l’artiste Marseillais pour l’album “My Wor… [+1149 chars]"}, {"source": {"id": null, "name": "Public.fr"}, "author": "Public", "title": "Mort de Christophe : voici la seule chose qu'il a légué à Romain, le fils qu'il a eu avec Michèle Torr - Public", "description": "Le chanteur Christophe s’est éteint le 16 avril 2020 des suites d’un long combat contre la maladie. Mort à 74 ans, l’artiste souffrait en effet depuis longtemps d’un emphysème, une maladie pulmonaire chronique. Depuis quelques années, le chanteur Christophe é…", "url": "https://www.public.fr/News/Mort-de-Christophe-voici-la-seule-chose-qu-il-a-legue-a-Romain-le-fils-qu-il-a-eu-avec-Michele-Torr-1639768", "urlToImage": null, "publishedAt": "2020-04-24T22:16:41Z", "content": "Le chanteur Christophe sest éteint le 16 avril 2020 des suites dun long combat contre la maladie. Mort à 74 ans, lartiste souffrait en effet depuis longtemps dun emphysème, une maladie pulmonaire chronique. Depuis quelques années, le chanteur Christophe était… [+1741 chars]"}, {"source": {"id": null, "name": "Public.fr"}, "author": "Public", "title": "Laeticia Hallyday : sa meilleure amie Hélène Darroze tacle les cuisiniers qui veulent faire du \"buzz\" pendant le confinement - Public", "description": "Depuis le début du confinement, toutes les célébrités sont plus actives que jamais sur les réseaux sociaux. Si certaines se mobilisent pour récolter des fonds pour les soignants, d’autres le font pour la recherche tandis que d’autres rappellent les règles lié…", "url": "https://www.public.fr/News/Laeticia-Hallyday-sa-meilleure-amie-Helene-Darroze-tacle-les-cuisiniers-qui-veulent-faire-du-buzz-pendant-le-confinement-1639755", "urlToImage": null, "publishedAt": "2020-04-24T21:29:59Z", "content": "Depuis le début du confinement, toutes les célébrités sont plus actives que jamais sur les réseaux sociaux. Si certaines se mobilisent pour récolter des fonds pour les soignants, dautres le font pour la recherche tandis que dautres rappellent les règles liées… [+1542 chars]"}, {"source": {"id": null, "name": "Purepeople.com"}, "author": "Oriane Alcarini", "title": "Manu Payet, sa compagne lui coupe les cheveux : un désastre capillaire ! - Pure People", "description": "Manu Payet s'est laissé couper les cheveux par sa compagne Pauline, qui est loin d'obtenir un CAP coiffure. Le jeudi 23 avril 2020, l'acteur a incité ses fans à laisser pousser leurs cheveux plutôt que de succomber aux coupes maison.", "url": "https://www.purepeople.com/article/manu-payet-sa-compagne-lui-coupe-les-cheveux-un-desastre-capillaire_a385586/1", "urlToImage": null, "publishedAt": "2020-04-24T21:26:00Z", "content": "En plein confinement et sans coiffeur, on a encore trop le réflexe de confier nos cheveux à nos proches. Le coup de tondeuse de trop et on se retrouve avec la coupe de Philippe Etchebest pour les trois prochaines semaines. Manu Payet en a visiblement fait la … [+876 chars]"}, {"source": {"id": null, "name": "Barbanews.com"}, "author": null, "title": "Jean-Pierre Pernaut pousse un coup de gueule en direct - Geneviève de Fontenay insultée ! - barbanews", "description": "Pourquoi Jean-Pierre Pernaut a-t-il dérapé ? Le présentateur du JT et chouchou des Français depuis de nombreuses années avait habitué les téléspectateurs à un environnement beaucoup plus calme. Finalement, il...", "url": "https://www.barbanews.com/peoples/jean-pierre-pernaut-pousse-un-coup-de-gueule-en-direct-genevieve-de-fontenay-insultee/", "urlToImage": null, "publishedAt": "2020-04-24T20:22:00Z", "content": "Pourquoi Jean-Pierre Pernaut a-t-il dérapé ? Le présentateur du JT et chouchou des Français depuis de nombreuses années avait habitué les téléspectateurs à un environnement beaucoup plus calme. Finalement, il a montré quil pouvait aussi sénerver dans certains… [+2583 chars]"}, {"source": {"id": null, "name": "Ldpeople.com"}, "author": null, "title": "Danse avec les stars: Laurent Ournac raconte des anecdotes choquantes - LDpeople.com", "description": "Danse avec les stars: Le bien connu Tom Delormes (Laurent Ournac) de la série Camping Paradis de TF1, a également tenté l'expérience", "url": "https://www.ldpeople.com/danse-avec-les-stars-laurent-ournac-raconte-anecdotes-choquantes-64754", "urlToImage": null, "publishedAt": "2020-04-24T20:12:07Z", "content": "Danse avec les stars: Le bien connu Tom Delormes de la série Camping Paradis de TF1, a également tenté l’expérience d’animateur. En effet, il a présenté Danse avec les stars aux côtés de Sandrine Quétier de 2015 à 2016. Pour deux saisons entières, il anime l’… [+4444 chars]"}, {"source": {"id": null, "name": "Programme-tv.net"}, "author": "Emilie FLORES", "title": "Iris Mittenaere fait une remarque sur ses ex et provoque le fou rire de Jarry dans son live Instagram - Télé Loisirs.fr", "description": "Ce vendredi après-midi, dans le live Instagram de Jarry, Iris Mittenaere a décidé de se lâcher et de dévoiler une personnalité que les fans connaissent peu. Amusée par quelques questions coquines, la jeune femme a balancé sur ses ex.", "url": "https://www.programme-tv.net/news/people/253593-iris-mittenaere-fait-une-remarque-sur-ses-ex-et-provoque-le-fou-rire-de-jarry-dans-son-live-instagram/", "urlToImage": null, "publishedAt": "2020-04-24T19:44:04Z", "content": "C'est une petite remarque qui ne fera pas plaisir aux principaux intéressés. Ce vendredi après-midi, Iris Mittenaere, Miss Univers, était l'invitée du live Instagram de Jarry. L'humoriste fait donc partie de ces artistes qui multiplient les lives avec des inv… [+1685 chars]"}, {"source": {"id": null, "name": "Stars-actu.fr"}, "author": "Bertrand Blanc", "title": "Plus belle la vie en avance : Irina met fin à ses jours ! (vidéo PBLV épisode n°4047) - Stars Actu", "description": "C'est une terrible scène qui vous attend dans quelques jours dans votre série de France 3 \"Plus belle la vie\". En effet, alors qu'Irina a tiré sur Andrès", "url": "https://www.stars-actu.fr/2020/04/plus-belle-la-vie-en-avance-irina-met-fin-a-ses-jours-video-pblv-episode-n4047/", "urlToImage": null, "publishedAt": "2020-04-24T19:31:00Z", "content": "C’est une terrible scène qui vous attend dans quelques jours dans votre série de France 3 « Plus belle la vie ». En effet, alors qu’Irina a tiré sur Andrès sans savoir qu’il s’agissait de son père biologique, elle décide de mettre fin à ses jours !\r\nSeule che… [+803 chars]"}, {"source": {"id": null, "name": "Closermag.fr"}, "author": "P.G.", "title": "Elizabeth II : le prince William balance la passion \"folle\" de sa grand-mère - Closer France", "description": "Le Prince William a confié que sa grand-mère ainsi que son père le Prince Charles étaient \"follement passionnés\" par une activité.", "url": "https://www.closermag.fr/royautes/elizabeth-ii-le-prince-william-balance-la-passion-folle-de-sa-grand-mere-1106128", "urlToImage": null, "publishedAt": "2020-04-24T19:20:00Z", "content": "C'est une activité toute simple, que pratiquent de nombreuses personnes à travers le monde : la marche à pied. Plus qu'une simple nécessité ou une occupation, cette pratique est une véritable passion pour la reine d'Angleterre, a affirmé le prince William. Ch… [+1635 chars]"}, {"source": {"id": null, "name": "Programme-tv.net"}, "author": "Marie-Amélie Druesne", "title": "Tous en cuisine avec Cyril Lignac : la recette des cookies aux 2 chocolats - Télé Loisirs.fr", "description": "Qu'à cela ne tienne ce week-end vous allez tester les cookies aux deux chocolats de Cyril Lignac qu'ils a réalisés ce vendredi 24 avril dans Tous en cuisine sur M6. Et bien voici la recette !", "url": "https://www.programme-tv.net/news/tv/253591-tous-en-cuisine-avec-cyril-lignac-la-recette-des-cookies-aux-2-chocolats/", "urlToImage": null, "publishedAt": "2020-04-24T18:05:02Z", "content": "Depuis le début du confinement, tout le monde fait des cookies ! Instagram regorge de photos de ces délicieux gâteaux. Et le chef et pâtissier Cyril Lignacne fait pas exception à la règle ! Ce vendredi 24 avril sur M6, le célèbre cuisinier cuisinait de chez l… [+1778 chars]"}, {"source": {"id": null, "name": "Parismatch.com"}, "author": "Paris Match", "title": "La vie avant le confinement : les stars nostalgiques - Paris Match", "description": "Pour beaucoup, le confinement permet de faire du tri et de replonger dans les souvenirs de la vie d'avant... Les célébrités en profitent pour les p...", "url": "https://www.parismatch.com/People/La-vie-avant-le-confinement-les-stars-nostalgiques-1683199", "urlToImage": null, "publishedAt": "2020-04-24T18:02:55Z", "content": "Pour beaucoup, le confinement permet de faire du tri et de replonger dans les souvenirs de la vie d'avant... Les célébrités en profitent pour les partager avec leurs abonnés. Comme le veut la tradition américaine, le jeudi est la journée des souvenirs. Avec l… [+3156 chars]"}, {"source": {"id": null, "name": "Actu.fr"}, "author": "Simon Louvet", "title": "VIDÉO. \"T'as voulu voir le salon\", la géniale parodie de Jacques Brel en temps de confinement - actu.fr", "description": "La reprise hilarante de la chanson \"Vesoul\" de Jacques Brel par le groupe Les Goguettes fait le tour des réseaux sociaux depuis mardi 21 avril 2020, affolant les compteurs.", "url": "https://actu.fr/ile-de-france/paris_75056/video-tas-voulu-voir-salon-geniale-parodie-jacques-brel-temps-confinement_33240047.html", "urlToImage": null, "publishedAt": "2020-04-24T17:57:35Z", "content": "Les Goguettes, groupe auquel appartient Valentin Vander, ont publié une parodie de la chanson Vesoul de Jacques Brel, détournée sur le confinement. (©Capture d’écran YouTube)\r\nValentin Vander rassure : il va bien, malgré le confinement, et aucun chat n’a été … [+3457 chars]"}, {"source": {"id": null, "name": "Journaldugeek.com"}, "author": "Julie Hay", "title": "Disney+ développe une série Star Wars avec un casting féminin - Journal du geek", "description": "Disney+ va développer une nouvelle série Star Wars, avec un casting féminin et la créatrice de Poupées Russes aux commandes.", "url": "https://www.journaldugeek.com/2020/04/24/disney-serie-star-wars-casting-feminin/", "urlToImage": null, "publishedAt": "2020-04-24T17:57:23Z", "content": "On na pas fini dentendre parler de la galaxie de George Lucas. Disney+ va développer une nouvelle série Star Wars, avec un casting féminin et la créatrice de Poupées Russes aux commandes.Crédits : LucasFilm\r\nLa galaxie Star Wars va encore s’agrandir, à en cro… [+1907 chars]"}, {"source": {"id": null, "name": "Canalturf.com"}, "author": null, "title": "Quinté PMU - Pronostic du PRIX CALIFE DES NOUES 25 avr. 2020 - Canal Turf", "description": "Découvrez le pronostic de la course PRIX CALIFE DES NOUES ainsi que les informations liées au Quinté+ PMU du 25 avr. 2020", "url": "https://www.canalturf.com/pronostics-PMU/2020-04-25/aby-goteborg/207845_prix-calife-des-noues.html", "urlToImage": null, "publishedAt": "2020-04-24T17:47:07Z", "content": "Le pronostic Canalturf.com\r\nQuinté samedi à Aby (Suède) avec une course à l'attelé, sur 3140 mètres, pour 3 à 8 ans ayant gagné au moins 9.950 - Recul de 20 mètres à 35.813, de 40 mètres à 71.625. Trotteur de très grande qualité, qui aligne les victoires, PRO… [+5207 chars]"}, {"source": {"id": null, "name": "Purepeople.com"}, "author": "Olivia Maunoury", "title": "Laure Manaudou et son fils Lou : câlins fous et tendre complicité - Pure People", "description": "Laure Manaudou et son mari Jérémy Frérot ont toujours été très secrets s'agissant de leur vie privée, refusant de divulguer des informations sur ce pan de leur existence. Mais le confinement a littéralement changé la donne. Nouvelle preuve en est avec les mul…", "url": "https://www.purepeople.com/article/laure-manaudou-et-son-fils-lou-calins-fous-et-tendre-complicite_a385598/1", "urlToImage": null, "publishedAt": "2020-04-24T17:32:00Z", "content": "Pour Laure Manaudou, le confinement se vit sur deux thématiques : la famille et le sport. Si on pouvait s'attendre à ce que l'ancienne nageuse de 33 ans montre ses séances d'exercice sur les réseaux sociaux, c'était beaucoup moins sûr pour ce qui concerne sa … [+2041 chars]"}, {"source": {"id": null, "name": "Jeuxvideo.com"}, "author": "Panthaa", "title": "Concerts 3.0 dans Fortnite : Nouvel El Dorado d’Epic Games ? - jeuxvideo.com", "description": "Au lendemain du concert du rappeur Travis Scott, Panthaa revient sur cet événement live, initié dans Fortnite, qui a réuni plus de 12 millions de joueurs lors de sa première représentation. Une nouvelle dynamique qui révèle encore une corde à l'arc d'Epic Gam…", "url": "http://www.jeuxvideo.com/news/1216673/concerts-3-0-dans-fortnite-nouvel-el-dorado-d-epic-games.htm", "urlToImage": null, "publishedAt": "2020-04-24T17:20:00Z", "content": "Au lendemain du concert du rappeur Travis Scott, Panthaa revient sur cet événement live, initié dans Fortnite, qui a réuni plus de 12 millions de joueurs lors de sa première représentation. Une nouvelle dynamique qui révèle encore une corde à l'arc d'Epic Gam… [+5170 chars]"}, {"source": {"id": null, "name": "Allocine.fr"}, "author": "Thomas Imbert ([Url href='https://twitter.com/Thomas_Theory?lang=fr']@Thomas_Theory[/Url])", "title": "Les 25 meilleures comédies de tous les temps selon les spectateurs AlloCiné - AlloCiné", "description": "De \"La Grande Vadrouille\" à \"La Ruée vers l'or\" en passant par \"Le Dîner de Cons\", retour sur les 25 meilleures comédies de tous les temps selon les spectateurs d'AlloCiné.", "url": "http://www.allocine.fr/diaporamas/cinema/diaporama-18689325/", "urlToImage": null, "publishedAt": "2020-04-24T17:00:00Z", "content": "Contact|Qui sommes-nous| Recrutement|Publicité|CGU|Politique de cookies|Données Personnelles|Revue de presse|Jeux concours|\r\n ©AlloCiné\r\nRetrouvez tous les horaires et infos de votre cinéma sur le numéro AlloCiné : 0 892 892 892 (0,34/minute)"}, {"source": {"id": null, "name": "Programme-tv.net"}, "author": "Maxime Riou", "title": "Exclu. Chroniqueurs, nouvelle formule, décor... voici à quoi va ressembler la rentrée de Touche pas à mon post - Télé Loisirs.fr", "description": "A moins de deux mois de la fin de saison, la rentrée de Touche pas à mon poste sur C8 se prépare activement. On vous révèle les premières infos...", "url": "https://www.programme-tv.net/news/tv/253584-exclu-chroniqueurs-nouvelle-formule-decor-voici-a-quoi-va-ressembler-la-rentree-de-touche-pas-a-mon-poste-sur-c8/", "urlToImage": null, "publishedAt": "2020-04-24T17:00:00Z", "content": "Alors que Cyril Hanouna anime depuis le début du confinementCe soir, chez Baba chaque soir sur C8 en direct de son appartement parisien, il prépare également avec attention la rentrée de son émission phare Touche pas à mon poste qui signera sa onzième année. … [+1621 chars]"}, {"source": {"id": null, "name": "Allocine.fr"}, "author": "Thomas Imbert ([Url href='https://twitter.com/Thomas_Theory?lang=fr']@Thomas_Theory[/Url])", "title": "The Mandalorian épisode 7 : 17 détails cachés qu'il ne fallait pas louper - AlloCiné", "description": "Focus sur 17 références à l'univers de Star Wars que vous avez peut-être manqué dans le septième épisode de \"The Mandalorian\", disponible sur Disney+.", "url": "http://www.allocine.fr/diaporamas/series/diaporama-18689395/", "urlToImage": null, "publishedAt": "2020-04-24T17:00:00Z", "content": "Contact|Qui sommes-nous| Recrutement|Publicité|CGU|Politique de cookies|Données Personnelles|Revue de presse|Jeux concours|\r\n ©AlloCiné\r\nRetrouvez tous les horaires et infos de votre cinéma sur le numéro AlloCiné : 0 892 892 892 (0,34/minute)"}, {"source": {"id": null, "name": "Purepeople.com"}, "author": "Thomas Montet", "title": "Michel Polnareff déteste JUL ? Il s'explique, le rappeur lui répond ! - Pure People", "description": "Réputé pour ne pas avoir la langue dans sa poche, le chanteur Michel Polnareff a été interrogé sur ses goûts musicaux actuels. Alors qu'il avait indiqué détester le rappeur marseillais JUL, il a fait machine arrière. L'intéressé lui a répondu.", "url": "https://www.purepeople.com/article/michel-polnareff-deteste-jul-il-s-explique-le-rappeur-lui-repond_a385640/1", "urlToImage": null, "publishedAt": "2020-04-24T16:46:00Z", "content": "Michel Polnareff n'est pas le dernier quand il faut jouer les snipers. Mais quand il se trompe, le chanteur est aussi capable de le reconnaître. Sur son compte Twitter, l'artiste de 75 ans a posté un message afin de présenter ses excuses au rappeur Jul !\r\nMer… [+1554 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Euromillions. Un Irlandais a failli ne jamais empocher les 500 000 € qu’il avait gagnés - Ouest-France", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMijwFodHRwczovL3d3dy5vdWVzdC1mcmFuY2UuZnIvc2FudGUvYWRkaWN0aW9ucy9qZXV4L2V1cm9taWxsaW9ucy11bi1pcmxhbmRhaXMtZmFpbGxpLW5lLWphbWFpcy1lbXBvY2hlci1sZXMtNTAwLTAwMC1ldS1xdS1pbC1hdmFpdC1nYWduZXMtNjgxNjk4NdIBjwFodHRwczovL2FtcC5vdWVzdC1mcmFuY2UuZnIvc2FudGUvYWRkaWN0aW9ucy9qZXV4L2V1cm9taWxsaW9ucy11bi1pcmxhbmRhaXMtZmFpbGxpLW5lLWphbWFpcy1lbXBvY2hlci1sZXMtNTAwLTAwMC1ldS1xdS1pbC1hdmFpdC1nYWduZXMtNjgxNjk4NQ?oc=5", "urlToImage": null, "publishedAt": "2020-04-24T16:40:21Z", "content": null}, {"source": {"id": null, "name": "Closermag.fr"}, "author": "La rédaction", "title": "Kate Middleton : combien coûte sa toute dernière robe à fleurs ? - Closer France", "description": "Pour son apparition à la télévision britannique, Kate Middleton a porté une robe à fleurs au prix très accessible.", "url": "https://www.closermag.fr/mode/kate-middleton-combien-coute-sa-toute-derniere-robe-a-fleurs-1106099", "urlToImage": null, "publishedAt": "2020-04-24T16:36:30Z", "content": "Kate Middleton est toujours au top niveau look ! Et la duchesse de Sussex l'a encore une fois prouvé. En effet, jeudi 23 avril 2020, à l'occasion de son passage à la télévision britannique sur la chaîne BBC One dans l'émission One Big Night In, la compagne du… [+1614 chars]"}, {"source": {"id": null, "name": "Lesinrocks.com"}, "author": "Raphaëlle Berlanda-Beauvallet", "title": "On sait enfin si Mick Jagger est plus Stones que Beatles - Les Inrocks", "description": "Paul McCartney et Mick Jagger se livrent une (fausse) guerre froide sur l'un des grands débats devant l'éternel : plutôt Stones ou Beatles ? Vous n'avez plus qu'à choisir votre camp !", "url": "https://www.lesinrocks.com/2020/04/24/musique/musique/on-sait-enfin-si-mick-jagger-est-plus-stones-que-beatles/", "urlToImage": null, "publishedAt": "2020-04-24T16:26:53Z", "content": "Paul McCartney et Mick Jagger se livrent une (fausse) guerre froide sur l'un des grands débats devant l'éternel : plutôt Stones ou Beatles ? Vous n'avez plus qu'à choisir votre camp !\r\nC'est bien connu : les groupes qui se sont fait connaître à peu près au mê… [+3031 chars]"}, {"source": {"id": null, "name": "Www.rtl.fr"}, "author": null, "title": "VIDÉO - Les Grosses Têtes : Karine Le Marchand s'y connait en femme à barbe - RTL.fr", "description": "REPLAY - Écoutez ou réécoutez l'émission du vendredi 24 avril 2020 avec Laurent Ruquier et ses Grosses Têtes du jour.", "url": "https://www.rtl.fr/culture/medias-people/video-les-grosses-tetes-karine-le-marchand-s-y-connait-en-femme-a-barbe-7800419976", "urlToImage": null, "publishedAt": "2020-04-24T16:05:00Z", "content": "Découvrez Les Grosses Têtes du vendredi 24 avril 2020 ! Laurent Ruquier vous présente le plateau du jour : Une Grosse Tête avec qui on se demande comment on va lui faire porter un masque vu quelle a déjà du mal à porter une culotte : Karine Le Marchand. Une G… [+1840 chars]"}, {"source": {"id": null, "name": "Ecranlarge.com"}, "author": null, "title": "Tyler Rake : critique qui Thor dur - ÉcranLarge.com", "description": "Découvrez la critique du film Tyler Rake de Sam Hargrave, sorti en 2020 - L'avis d'EcranLarge.com", "url": "https://www.ecranlarge.com/films/critique/1174447-tyler-rake-critique-qui-thor-dur", "urlToImage": null, "publishedAt": "2020-04-24T15:58:25Z", "content": "Les films d'action à l'ancienne, basés sur un personnage fort, un concept simple, une mise en scène de l'action réfléchie et des acteurs capables d'assumer la dimension physique de leur rôle, est tristement oublié par le Hollywood des super-héros. Mais il sem… [+4017 chars]"}, {"source": {"id": null, "name": "Leparisien.fr"}, "author": null, "title": "Coldplay, Ed Sheeran, Bruno Mars… Découvrez un festival de concerts inédits - Le Parisien", "description": "Notre site diffuse jusqu’à lundi soir le PlayOn Fest, festival virtuel où 65 stars vont dévoiler des concerts inédits, en soutien à l’Organi", "url": "http://www.leparisien.fr/culture-loisirs/musique/coldplay-ed-sheeran-bruno-mars-decouvrez-un-festival-de-concerts-inedits-24-04-2020-8305380.php", "urlToImage": null, "publishedAt": "2020-04-24T15:58:00Z", "content": "Coldplay, Ed Sheeran, Bruno Mars, David Guetta, Twenty One Pilots, Cardi B, Janelle Monae, Korn, Green Day, Anderson Paak, Royal Blood, The War On Drugs, Charlie Puth, Slipknot L'affiche est prestigieuse et éclectique. Après le festival « One World Together A… [+2308 chars]"}, {"source": {"id": null, "name": "Allocine.fr"}, "author": "Julia Fernandez", "title": "Coronavirus et salles de cinéma : les premières mesures envisagées pour la réouverture - AlloCiné", "description": "Alors que la réouverture des salles de cinéma s'envisage suite au discours de Pierre Lescure du jeudi 23 avril, la Fédération nationale des cinémas français (FNCF) fait le point sur les différentes pi...", "url": "http://www.allocine.fr/article/fichearticle_gen_carticle=18689598.html", "urlToImage": null, "publishedAt": "2020-04-24T15:46:00Z", "content": "Alors que la réouverture des salles de cinéma s'envisage suite au discours de Pierre Lescure du jeudi 23 avril, la Fédération nationale des cinémas français (FNCF) fait le point sur les différentes pistes de réflexion en cours.FNCF\r\nSuite à l'intervention du … [+2574 chars]"}, {"source": {"id": null, "name": "Programme-tv.net"}, "author": "Lisa ETCHEBERRY", "title": "Netflix : séries, films, documentaires… Toutes les nouveautés attendues en mai 2020 sur la plateforme - Télé Loisirs.fr", "description": "De nombreuses nouveautés sont prévues pour ce mois de mai 2020 sur Netflix. Entre autre, la saison 1 de The Eddy, la série de Damien Chazelle, Hollywood, la nouvelle création de Ryan Murphy et côté cinéma, Get Out, signé Jordan Peele ou encore Mission impossi…", "url": "https://www.programme-tv.net/news/evenement/netflix-series-films-et-documentaires-sur-netflix/253583-netflix-series-films-documentaires-toutes-les-nouveautes-attendues-en-mai-2020-sur-la-plateforme/", "urlToImage": null, "publishedAt": "2020-04-24T15:45:00Z", "content": "De nombreuses nouveauté attendent encore les abonnés Netflix pour mai 2020. Lévénement de ce mois ? The Eddy, série musicale et dramatique signée Damien Chazelle (La La Land, Whiplash), et réunissant Tahar Rahim et Leïla Bekhti. Autre moment fort pour les sér… [+8698 chars]"}, {"source": {"id": null, "name": "Public.fr"}, "author": null, "title": "Sylvie Tellier à bout : \"on est pas magiciens\" elle ne supporte plus de faire l’école à ses enfants - Public.fr", "description": "Après bientôt 40 jours de confinement, certains esprits s’échauffent. Et si Sylvie Tellier admet avoir de la chance pour affronter cette situation, tout n’est pas toujours si facile. Surtout concernant ses enfants…", "url": "https://www.public.fr/Toutes-les-photos/Sylvie-Tellier-a-bout-on-est-pas-magiciens-elle-ne-supporte-plus-de-faire-l-ecole-a-ses-enfants-1639721", "urlToImage": null, "publishedAt": "2020-04-24T15:20:00Z", "content": "Beaucoup trop long. J-1 avant les quarante jours de confinement, et pour beaucoup de français, la situation commence à être compliquée. Ne pas avoir de jardin, vivre nombreux en appartement, problèmes financiers, autant dire que ce confinement est pour certai… [+2283 chars]"}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": null, "title": "Coronavirus : Céline Dion reporte le début de sa tournée européenne - franceinfo", "description": "", "url": "https://www.francetvinfo.fr/culture/musique/coronavirus-celine-dion-reporte-le-debut-de-sa-tournee-europeenne_3932695.html", "urlToImage": null, "publishedAt": "2020-04-24T15:12:46Z", "content": "La diva québécoise reporte sine die \"les premiers mois de sa tournée européenne\", du 21 mai au 25 juillet.Céline Dion a reporté vendredi 24 avril  \"les premiers mois de sa tournée européenne\", prévue du 21 mai au 25 juillet, dont six dates à Paris, \"ne sachan… [+1967 chars]"}, {"source": {"id": null, "name": "Programme-tv.net"}, "author": "Emilie FLORES", "title": "Bernard Montiel assume son départ (très critiqué) de Paris à l'annonce du confinement : \"Ils se sont trompés ! - Télé Loisirs.fr", "description": "Un confinement en Nouvelle-Aquitaine qui ne passe pas. L'animateur et chroniqueur Bernard Montiel avait décidé de quitter Paris au début de la crise sanitaire; une attitude qui a agacé de nombreux Français.", "url": "https://www.programme-tv.net/news/people/253577-bernard-montiel-se-defend-davoir-quitte-paris-a-lannonce-du-confinement-je-ne-suis-pas-venu-me-planquer-video/", "urlToImage": null, "publishedAt": "2020-04-24T15:05:00Z", "content": "Les Parisiens pas les bienvenus en Province ? Bernard Montiel fait partie de ces nombreux citadins qui ont décidé de partir dans leur seconde maison, au moment de l'annonce du confinement en mars dernier. Objectif : quitter les villes pour se mettre au vert d… [+2078 chars]"}, {"source": {"id": null, "name": "Www.rtl.fr"}, "author": null, "title": "Confinement : les Beatles organisent un karaoké en ligne sur \"Yellow Submarine\" - RTL.fr", "description": "Ringo Starr et Paul McCartney organisent un karaoké sur YouTube samedi à 18h, sur la bande originale du film \"Yellow Submarine\".", "url": "https://www.rtl.fr/culture/musique/confinement-les-beatles-organisent-un-karaoke-en-ligne-sur-yellow-submarine-7800438465", "urlToImage": null, "publishedAt": "2020-04-24T13:29:00Z", "content": "L'évènement est rare, les deux survivants des Beatles Ringo Starr et Paul McCartney ont organisé une diffusion \"Singalong\", une version chantée, du film animée Yellow Submarine qui mettait en scène les 4 garçons dans le vent en 1968. Dès 18h sur YouTube, heur… [+1331 chars]"}, {"source": {"id": null, "name": "Closermag.fr"}, "author": "La rédaction", "title": "Annette Blier : l'épouse du célèbre acteur Bernard Blier est morte à 84 ans - Closer France", "description": "Annette Blier, la deuxième épouse de l’acteur Bernard Blier est morte. Elle était âgée de 84 ans.", "url": "https://www.closermag.fr/people/annette-blier-l-epouse-du-celebre-acteur-bernard-blier-est-morte-a-84-ans-1106072", "urlToImage": null, "publishedAt": "2020-04-24T13:25:20Z", "content": "Triste nouvelle en ce vendredi 24 avril 2020. Annette Blier, l'épouse du célèbre acteur Bernard Blier est morte. Selon les informations de l'AFP (Agence France Presse), cette dernière s'en est allée jeudi 23 avril 2020 à l'EHPAD dans lequel elle résidait à Do… [+1666 chars]"}, {"source": {"id": null, "name": "Closermag.fr"}, "author": "P.G.", "title": "Monica Bellucci : pourquoi elle ne s'est pas confinée en Italie - Closer France", "description": "L’actrice italienne n’est pas confinée en Italie mais au Pays Basque français. Et ce, pour une raison bien particulière : ses filles.", "url": "https://www.closermag.fr/people/monica-bellucci-pourquoi-elle-ne-s-est-pas-confinee-en-italie-1106064", "urlToImage": null, "publishedAt": "2020-04-24T13:21:45Z", "content": "Comme des milliards de personnes dans le monde, les plus grandes stars n'échappent pas au confinement imposé suite à l'épidémie de coronavirus. Et pour Monica Bellucci, cette période est particulière puisque l'actrice italienne n'est pas confinée dans son pay… [+1670 chars]"}, {"source": {"id": null, "name": "Lesinrocks.com"}, "author": "Raphaëlle Berlanda-Beauvallet", "title": "“Maison”, le nouvel EP de Roméo Elvis, est là ! - Les Inrocks", "description": "Le disque succède au premier album solo du rappeur, Chocolat (2019).", "url": "https://www.lesinrocks.com/2020/04/24/musique/musique/maison-le-nouvel-ep-de-romeo-elvis-est-la/", "urlToImage": null, "publishedAt": "2020-04-24T13:15:52Z", "content": "Le disque succède au premier album solo du rappeur, Chocolat (2019).\r\nIl l'avait annoncé la semaine dernière, et le voici: Maison, nouvel EP de Roméo Elvis au nom très confinement-compatible, est disponible sur les plateformes. Une version vinyle sera en vent… [+607 chars]"}, {"source": {"id": null, "name": "Parismatch.com"}, "author": "Paris Match", "title": "Le mea culpa de Christophe Barbier après ses propos sur deux interprètes en \"surpoids\" - Paris Match", "description": "Christophe Barbier a présenté vendredi ses excuses à deux interprètes de la langue des signes de la Direction générale de la Santé qu'il avait clas...", "url": "https://www.parismatch.com/Culture/Medias/Le-mea-culpa-de-Christophe-Barbier-apres-ses-propos-sur-deux-interpretes-en-surpoids-1683194", "urlToImage": null, "publishedAt": "2020-04-24T13:13:27Z", "content": "Christophe Barbier a présenté vendredi ses excuses à deux interprètes de la langue des signes de la Direction générale de la Santé qu'il avait classées dans la catégorie des personnes en surpoids et donc fragiles face au coronavirus.  Christophe Barbier a pré… [+1857 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "« Tout le monde veut prendre sa place ». Marie-Christine, championne du jeu, a reçu des messages de haine - Ouest-France", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMikwFodHRwczovL3d3dy5vdWVzdC1mcmFuY2UuZnIvY3VsdHVyZS9wZW9wbGUvdG91dC1sZS1tb25kZS12ZXV0LXByZW5kcmUtc2EtcGxhY2UtbWFyaWUtY2hyaXN0aW5lLWNoYW1waW9ubmUtZHUtamV1LXJlY3UtZGVzLW1lc3NhZ2VzLWRlLWhhaW5lLTY4MTY3MzXSAZMBaHR0cHM6Ly9hbXAub3Vlc3QtZnJhbmNlLmZyL2N1bHR1cmUvcGVvcGxlL3RvdXQtbGUtbW9uZGUtdmV1dC1wcmVuZHJlLXNhLXBsYWNlLW1hcmllLWNocmlzdGluZS1jaGFtcGlvbm5lLWR1LWpldS1yZWN1LWRlcy1tZXNzYWdlcy1kZS1oYWluZS02ODE2NzM1?oc=5", "urlToImage": null, "publishedAt": "2020-04-24T13:11:48Z", "content": null}, {"source": {"id": null, "name": "Telerama.fr"}, "author": "Mathilde Blottière", "title": "Truffaut, Resnais, Lynch, Dolan : pourquoi Netflix est devenu cinéphile - Télérama.fr", "description": "En partenariat avec MK2, Netflix France met à disposition de ses 7 millions d’abonnés des grands classiques, dont douze films de François Truffaut dès ce 24 avril 2020. Une prise de prestige… ou un changement stratégique de la plateforme jusqu’ici peu portée …", "url": "https://www.telerama.fr/television/truffaut,-resnais,-lynch,-dolan-pourquoi-netflix-est-devenu-cinephile,n6631120.php", "urlToImage": null, "publishedAt": "2020-04-24T13:00:00Z", "content": "En partenariat avec MK2, Netflix France met à disposition de ses 7 millions dabonnés des grands classiques, dont douze films de François Truffaut dès ce 24 avril 2020. Une prise de prestige ou un changement stratégique de la plateforme jusquici peu portée sur… [+8429 chars]"}, {"source": {"id": null, "name": "Lebonbon.fr"}, "author": null, "title": "Alerte Job de rêve : être payé 1 000 $ pour regarder la saga Harry Potter - Le Bonbon", "description": "De quoi mettre du baume au cœur en cette drôle de période.", "url": "https://www.lebonbon.fr/paris/pop-culture/job-regarder-saga-harry-potter/", "urlToImage": null, "publishedAt": "2020-04-24T12:42:40Z", "content": "Parmi les sagas les plus marquantes pour notre génération, celle d’Harry Potter est clairement notre grande préférée. L’univers magique, les personnages attachants, l’histoire prenante et même Celui-dont-on-ne-doit-pas-prononcer-le-nom, on aime absolument tou… [+723 chars]"}, {"source": {"id": null, "name": "Parismatch.be"}, "author": "Rédaction Paris Match Belgique", "title": "Tom Hanks : Son beau geste pour Corona, un garçon de 8 ans harcelé à cause de son prénom - Paris Match Belgique", "description": "L’acteur a écrit une lettre de soutien au jeune garçon. Il lui a aussi offert une machine à écrire de la marque… Corona.", "url": "https://parismatch.be/actualites/393607/tom-hanks-son-beau-geste-pour-corona-un-garcon-de-8-ans-harcele-a-cause-de-son-prenom", "urlToImage": null, "publishedAt": "2020-04-24T12:30:00Z", "content": "Tom Hanks a envoyé une lettre de soutien et un cadeau à Corona, un jeune Australien harcelé à cause de son prénom. L’enfant de huit ans, qui a subi de nombreuses brimades à l’école, avait écrit à la star et à son épouse Rita Wilson, qui ont passé deux semaine… [+1505 chars]"}, {"source": {"id": null, "name": "Leparisien.fr"}, "author": null, "title": "Coronavirus : le comédien Claude Evrard s’est éteint - Le Parisien", "description": "Âgé de 86 ans, il avait formé un tandem prolifique avec Philippe Avron, décédé en 2010.", "url": "http://www.leparisien.fr/culture-loisirs/coronavirus-le-comedien-claude-evrard-s-est-eteint-24-04-2020-8304954.php", "urlToImage": null, "publishedAt": "2020-04-24T11:18:00Z", "content": "Le comédien et homme de théâtre Claude Evrard est décédé lundi à l'âge de 86 ans. Sa famille, qui a publié un avis dans le carnet du quotidien Le Monde jeudi, a précisé à l'AFP qu'il était décédé des suites du coronavirus, à Clamart (Hauts-de-Seine).\r\nNé Clau… [+1011 chars]"}, {"source": {"id": null, "name": "Lesinrocks.com"}, "author": "Service Musiques", "title": "“Goliath” : Woodkid est de retour après sept ans d'absence - Les Inrocks", "description": "Le Français signe son grand retour avec un nouveau titre extrait de son album à venir.", "url": "https://www.lesinrocks.com/2020/04/24/musique/musique/goliath-woodkid-est-de-retour-apres-sept-ans-dabsence/", "urlToImage": null, "publishedAt": "2020-04-24T11:04:01Z", "content": null}, {"source": {"id": null, "name": "Letribunaldunet.fr"}, "author": "https://www.facebook.com/letribunaldunet/, Tom", "title": "Netflix : Ces codes qui vont vous permettre d'accéder à tous les films cachés sur la plateforme - Tribunal Du Net", "description": "Il existe une multitude de sous-catégories cachées par Netflix. Pour les trouver il suffit de rentrer ces codes depuis votre ordinateur.", "url": "http://www.letribunaldunet.fr/series/codes-films-caches-netflix.html", "urlToImage": null, "publishedAt": "2020-04-24T10:30:21Z", "content": "Plus d’un mois que la France est en confinement, et vous pensez avoir vu tous les programmes proposés par Netflix ? Ou alors, comme nous vous passez parfois une heure à chercher un film, LE bon film, pour finalement s’endormir au bout de quelques minutes. Tou… [+4966 chars]"}, {"source": {"id": null, "name": "Parismatch.be"}, "author": "Rédaction Paris Match Belgique", "title": "Koh-Lanta : Denis Brogniart révèle sa technique infaillible pour jouer avec les nerfs des candidats - Paris Match Belgique", "description": "Pour rendre encore un peu plus spectaculaire son jeu d’aventure, la production de « Koh-Lanta » aime désorienter au maximum les candidats. Denis Brogniart a révélé un petit truc très efficace utilisé lors des tournages.", "url": "https://parismatch.be/culture/medias/393560/koh-lanta-denis-brogniart-revele-sa-technique-infaillible-pour-jouer-avec-les-nerfs-des-candidats", "urlToImage": null, "publishedAt": "2020-04-24T10:28:00Z", "content": "Pour rendre encore un peu plus spectaculaire son jeu d’aventure, la production de « Koh-Lanta » aime désorienter au maximum les candidats. Denis Brogniart a révélé un petit truc très efficace utilisé lors des tournages.\r\nCest à loccasion de son rendez-vous qu… [+1223 chars]"}, {"source": {"id": null, "name": "Slate.fr"}, "author": "Caroline Ernesty", "title": "«Tiger King», pas un personnage pour rattraper l'autre | Slate.fr - Slate.fr", "description": "Très populaire sur les réseaux, «Au Royaume des Fauves (Tiger King)» est un divertissement précieux en période de confinement.", "url": "http://www.slate.fr/story/189783/culture-docu-serie-netflix-tiger-king-au-royaume-des-fauves", "urlToImage": null, "publishedAt": "2020-04-24T10:03:00Z", "content": "Temps de lecture: 5 min\r\nAttention, cet article comporte des spoilers.\r\nDepuis le 20 mars, et en l'espace de dix jours, plus de 34 millions d'Américain·es ont été captivé·es par les aventures de Joe Exotic et consorts, adeptes des «gros chats» et personnages … [+6573 chars]"}, {"source": {"id": null, "name": "Lesinrocks.com"}, "author": "Franck Vergeade", "title": "Benjamin Biolay sort un tube renversant, “Comment est ta peine ?” - Les Inrocks", "description": "", "url": "https://www.lesinrocks.com/inrocks.tv/benjamin-biolay-sort-un-tube-renversant-comment-est-ta-peine/", "urlToImage": null, "publishedAt": "2020-04-24T09:05:03Z", "content": "Deux mois exactement avant la sortie de son neuvième album, Grand prix, le chanteur déclenche le feu vert du premier single qui l'ouvrira superbement.En un seul tour, Benjamin Biolay réussit à conjuguer ses obsessions musicales, entre Manchester et New York, … [+917 chars]"}, {"source": {"id": null, "name": "Purepeople.com"}, "author": "Olivia Maunoury", "title": "Laeticia Hallyday tente une chorégraphie avec sa fille Joy, qui la surpasse - Pure People", "description": "Jade et Joy, les deux filles de Laeticia Hallyday sont des adeptes de l'application TikTok sur laquelle elles proposent régulièrement des chorégraphies. Le 23 avril 2020, Joy avait une partenaire inédite, sa maman.", "url": "https://www.purepeople.com/article/laeticia-hallyday-tente-une-choregraphie-avec-sa-fille-joy-qui-la-surpasse_a385535/1", "urlToImage": null, "publishedAt": "2020-04-24T09:01:00Z", "content": "L'application TikTok a plus que jamais le vent en poupe avec le confinement. De nombreuses stars se sont créées des comptes ces derniers temps, à l'instar de M. Pokora et sa compagne Christina Milian. TikTok est l'occasion de faire passer le temps en cette pé… [+1926 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "L.Be.", "title": "Coronavirus : Dadju récolte 200.000 euros pour l’Unicef et la Fondation Hôpitaux de France - 20 Minutes", "description": "Le rappeur a animé mercredi soir un show de quatre heures pour venir en aide aux soignants", "url": "https://www.20minutes.fr/arts-stars/culture/2766983-20200424-coronavirus-dadju-recolte-200000-euros-unicef-fondation-hopitaux-france", "urlToImage": null, "publishedAt": "2020-04-24T08:46:09Z", "content": "Le rappeur Dadju. Lionel Guericolas/MPP/SIPA\r\nDadju a animé mercredi soir un show de quatre heures pour venir en aide aux soignants dans la lutte contre le Covid-19. Lartiste a organisé dès 21 heures un live sur  \r\nInstagram. Il en a profité pour lancer un ap… [+1032 chars]"}, {"source": {"id": null, "name": "Allocine.fr"}, "author": "[Url href='https://twitter.com/J_M_Renault']Jean-Maxime RENAULT (@J_M_Renault)[/url]", "title": "Defending Jacob (Apple TV+) : que vaut l'intense série judiciaire avec Chris Evans (Captain America) ? - AlloCiné", "description": "Chris Evans incarne un père torturé face à son enfant accusé de meurtre dans la mini-série Apple TV+ \"Defending Jacob\" disponible ce vendredi 22 avril.", "url": "http://www.allocine.fr/article/fichearticle_gen_carticle=18689506.html", "urlToImage": null, "publishedAt": "2020-04-24T06:49:00Z", "content": "Chris Evans incarne un père torturé face à son enfant accusé de meurtre dans la mini-série Apple TV+ \"Defending Jacob\" disponible ce vendredi 22 avril.\r\nLe fils d'un procureur d'une petite ville du Massachusetts est accusé de meurtre. Alors qu'il tente d'inno… [+3393 chars]"}, {"source": {"id": null, "name": "Paris-turf.com"}, "author": "Communiqué de France Galop.", "title": "France Galop : Programme des courses en cas de reprise à partir du 11 mai - Paris Turf", "description": "Communiqué de France Galop.", "url": "http://www.paris-turf.com/actualites/france-galop-programme-des-courses-en-cas-de-reprise-a-partir-du-11-mai-253170", "urlToImage": null, "publishedAt": "2020-04-24T06:30:00Z", "content": "Communiqué de France Galop.\r\nDans la perspective d’une reprise de l’activité à huis-clos à partir du lundi 11 mai, France Galop a remodelé son calendrier et son programme sur la période du 11 au 31 mai pour optimiser l’offre disponible, aussi bien à Paris qu’… [+6903 chars]"}, {"source": {"id": null, "name": "France.tv"}, "author": null, "title": "Replay Basique, le concert - Bilal Hassani - france.tv", "description": "Avec son titre \"Roi\", le jeune Bilal Hassani a conquis le coeur des Français via les plateformes Internet. En 2019, à seulement 20 ans, il a été désigné pour participer au Concours Eurovision de la chanson, où il a fini seizième. Son premier album, \"Kingdom\",…", "url": "https://www.france.tv/france-2/basique-le-concert/1398835-bilal-hassani.html", "urlToImage": null, "publishedAt": "2020-04-24T04:02:15Z", "content": "diffusé le ven. 24.04.20 à 23h44 \r\n disponible jusqu'au 02.05.20 \r\nchanson française - 76 min - tous publics"}, {"source": {"id": null, "name": "Public.fr"}, "author": "Public", "title": "\"On s'aimait beaucoup\" : Nathalie Marquay dit la vérité sur sa relation avec Jacques Chirac... - Public", "description": "Depuis le début de la crise sanitaire, Sylvie Tellier a pris une belle initiative pour distraire ses abonnés. Elle avait expliqué le 23 mars dernier : \"Les miss s’invitent chez vous ! Dés demain à 17h30 je recevrai une Miss France sans fard et sans filtre pou…", "url": "https://www.public.fr/News/On-s-aimait-beaucoup-Nathalie-Marquay-dit-la-verite-sur-sa-relation-avec-Jacques-Chirac-1639627", "urlToImage": null, "publishedAt": "2020-04-23T19:27:23Z", "content": "Depuis le début de la crise sanitaire, Sylvie Tellier a pris une belle initiative pour distraire ses abonnés. Elle avait expliqué le 23 mars dernier : \"Les miss sinvitent chez vous ! Dés demain à 17h30 je recevrai une Miss France sans fard et sans filtre pour… [+2363 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Meghan Markle et Harry barricadés à Los Angeles : paranoïa et spleen au programme - Yahoo Actualités", "description": null, "url": "https://consent.yahoo.com/collectConsent?sessionId=1_cc-session_1c70f8a6-0587-4471-a68a-c69f2efc27d1&lang=fr-FR&inline=false", "urlToImage": null, "publishedAt": "2020-04-23T16:06:00Z", "content": "Yahoo fait partie de Verizon Media. Cliquez sur J'accepte afin dautoriser Verizon Media et ses partenaires à utiliser des cookies et des technologies similaires pour accéder à votre appareil, utiliser vos données (y compris votre position géographique), compr… [+596 chars]"}, {"source": {"id": null, "name": "Huffingtonpost.fr"}, "author": "Khalil Kajehi", "title": "Musso, Minier, Dicker... Les romans de l'été de retour en librairie à partir du 20 mai - Le HuffPost", "description": "Les best-sellers de l’été, dont la publication avait été reportée en raison de l’épidémie de coronavirus, seront disponibles en librairie après la fin du confinement.", "url": "https://www.huffingtonpost.fr/entry/musso-minier-les-romans-de-lete-de-retour-en-librairie-a-partir-du-20-mai_fr_5ea18dd3c5b69150246e6f02", "urlToImage": null, "publishedAt": "2020-04-23T13:32:53Z", "content": "CULTURE - “Cette fois ça y est chers lecteurs, le compte à rebours est lancé: La Vallée, que vous êtes nombreux à attendre, sera en librairie le 20 mai”, a annoncé jeudi Bernard Minier, un des auteurs majeurs du thriller français, sur son compte twitter.\r\nPub… [+1941 chars]"}, {"source": {"id": null, "name": "Purepeople.com"}, "author": "Olivia Maunoury", "title": "Christophe, sa fille Lucie arrivée trop tard : récit des ultimes jours - Pure People", "description": "\"Paris Match\" consacre sa Une du 23 avril 2020 à Christophe, décédé le 16 avril 2020 à l'âge de 74 ans. Dans le long sujet qu'il lui consacre, l'hebdomadaire revient en détails sur les derniers jours de l'interprète de \"Paradis Perdus\", \"Aline\" ou encore \"Les…", "url": "https://www.purepeople.com/article/christophe-sa-fille-lucie-arrivee-trop-tard-recit-des-ultimes-jours_a385373/1", "urlToImage": null, "publishedAt": "2020-04-23T12:16:00Z", "content": "La menace d'une crise sanitaire de très grande ampleur en France se profilait déjà le 12 mars 2020, lorsque Christophe s'est rendu sur le plateau de Taratata, à la Plaine-Saint-Denis, pour enregistrer sa reprise de Daisy avec Laetitia Casta, qui figure sur so… [+3894 chars]"}, {"source": {"id": null, "name": "Programme-tv.net"}, "author": "Elise COMTE", "title": "Vianney : les deux bonnes nouvelles qui vont ravir ses fans ! (VIDEOS) - Télé Loisirs.fr", "description": "Vianney annonce non pas une, mais deux bonnes nouvelles à ses fans !", "url": "https://www.programme-tv.net/news/musique/253492-vianney-les-deux-bonnes-nouvelles-qui-vont-ravir-ses-fans-videos/", "urlToImage": null, "publishedAt": "2020-04-23T12:07:32Z", "content": "Révélé en 2014 par son tube Pas là,Vianney a conquis les foules à une vitesse fulgurante, récoltant rapidement deux Victoires de la musique et trouvant facilement sa place dans la chanson française, au point de signer l'hymne des Enfoirés, On trace. Il avait … [+1996 chars]"}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": null, "title": "Covid-19 : \"Pata Pata\", le tube planétaire de Miriam Makeba ressort avec des paroles anticoronavirus - Franceinfo", "description": "", "url": "https://www.francetvinfo.fr/monde/afrique/cameroun/covid-19-pata-pata-le-tube-planetaire-de-miriam-makeba-ressort-avec-des-paroles-anticoronavirus_3930523.html", "urlToImage": null, "publishedAt": "2020-04-23T11:41:47Z", "content": "C'est la chanteuse béninoise Angélique Kidjo qui interprète la nouvelle version de \"Pata Pata\" dans le but d'encourager les gestes barrières sur tout le continent africain.\r\nLa chanson de renommée mondiale Pata Pata, tube de danse sud-africain sorti en 1967, … [+2391 chars]"}, {"source": {"id": null, "name": "Melty.fr"}, "author": "Clémence Taquet", "title": "Tom Holland (Avengers Endgame) fou d'une actrice de séries plus jeune, voici celle qui le faisait craquer - melty", "description": "Plus jeune, Tom Holland était complètement fou d'une actrice de séries et voici de qui il s'agit.", "url": "https://www.melty.fr/tom-holland-avengers-endgame-fou-d-une-actrice-de-series-plus-jeune-voici-celle-qui-le-faisait-craquer-a717280.html", "urlToImage": null, "publishedAt": "2020-04-23T11:31:46Z", "content": "Alors que nous vous révélions l'identité de l'actrice de la franchise Avengers Endgame pour laquelle Tom Holland craque, sachez que l'interprète de Spider-Man a eu un autre celebrity crush lorsqu'il était plus jeune et cette star en question peut se vanter d'… [+1032 chars]"}]}