{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Public.fr"}, "author": "Public", "title": "Mort de Christophe : voici la seule chose qu'il a légué à Romain, le fils qu'il a eu avec Michèle Torr - Public", "description": "Le chanteur Christophe s’est éteint le 16 avril 2020 des suites d’un long combat contre la maladie. Mort à 74 ans, l’artiste souffrait en effet depuis longtemps d’un emphysème, une maladie pulmonaire chronique. Depuis quelques années, le chanteur Christophe é…", "url": "https://www.public.fr/News/Mort-de-Christophe-voici-la-seule-chose-qu-il-a-legue-a-Romain-le-fils-qu-il-a-eu-avec-Michele-Torr-1639768", "urlToImage": null, "publishedAt": "2020-04-24T22:16:41Z", "content": "Le chanteur Christophe sest éteint le 16 avril 2020 des suites dun long combat contre la maladie. Mort à 74 ans, lartiste souffrait en effet depuis longtemps dun emphysème, une maladie pulmonaire chronique. Depuis quelques années, le chanteur Christophe était… [+1741 chars]"}, {"source": {"id": null, "name": "Public.fr"}, "author": "Public", "title": "Laeticia Hallyday : sa meilleure amie Hélène Darroze tacle les cuisiniers qui veulent faire du \"buzz\" pendant le confinement - Public", "description": "Depuis le début du confinement, toutes les célébrités sont plus actives que jamais sur les réseaux sociaux. Si certaines se mobilisent pour récolter des fonds pour les soignants, d’autres le font pour la recherche tandis que d’autres rappellent les règles lié…", "url": "https://www.public.fr/News/Laeticia-Hallyday-sa-meilleure-amie-Helene-Darroze-tacle-les-cuisiniers-qui-veulent-faire-du-buzz-pendant-le-confinement-1639755", "urlToImage": null, "publishedAt": "2020-04-24T21:29:59Z", "content": "Depuis le début du confinement, toutes les célébrités sont plus actives que jamais sur les réseaux sociaux. Si certaines se mobilisent pour récolter des fonds pour les soignants, dautres le font pour la recherche tandis que dautres rappellent les règles liées… [+1542 chars]"}, {"source": {"id": null, "name": "Sofoot.com"}, "author": "", "title": "Les notes de l'épisode 9 de Koh Lanta / France / Koh Lanta / J9 / SOFOOT.com - SO FOOT", "description": "Il ne faudra pas s'étonner quand on retrouvera Sam en 2030 sur Faites Entrer l'Accusé.", "url": "https://www.sofoot.com/les-notes-de-l-episode-9-de-koh-lanta-482653.html", "urlToImage": null, "publishedAt": "2020-04-24T21:20:00Z", "content": "Avec Sam qui peut glisser sur Faites Entrer l'Accusé et Inès sur Les Marseillais, Koh Lanta a assuré le casting de toutes les émissions françaises pour les mois à venir. Ça, c'est sport.\r\nLes notes de l'épisode 9 de Koh LantaLa tribu réunifiée\r\nx012345678910\r… [+3686 chars]"}, {"source": {"id": null, "name": "Offside.fr"}, "author": null, "title": "Jean Luc Reichmann arrêté par les gendarmes, leur demande complètement folle - Actualités Offside", "description": "Jean Luc Reichmann: L'émission des 12 coups de midi continue de diffuser des épisodes inédits jusqu'à la fin du mois. Nous avons donc...", "url": "https://www.offside.fr/jean-luc-reichmann-arrete-gendarmes-demande-completement-folle/", "urlToImage": null, "publishedAt": "2020-04-24T21:04:22Z", "content": "Jean-Luc Reichmann: L’émission des 12 coups de midi continue de diffuser des épisodes inédits jusqu’à la fin du mois. Nous avons donc eu le plaisir de regarder Jean-Luc Reichmann animer le show comme il sait si bien le faire. Mais, comme lui, nous avons été t… [+5703 chars]"}, {"source": {"id": null, "name": "Ldpeople.com"}, "author": null, "title": "Danse avec les stars: Laurent Ournac raconte des anecdotes choquantes - LDpeople.com", "description": "Danse avec les stars: Le bien connu Tom Delormes (Laurent Ournac) de la série Camping Paradis de TF1, a également tenté l'expérience", "url": "https://www.ldpeople.com/danse-avec-les-stars-laurent-ournac-raconte-anecdotes-choquantes-64754", "urlToImage": null, "publishedAt": "2020-04-24T20:12:07Z", "content": "Danse avec les stars: Le bien connu Tom Delormes de la série Camping Paradis de TF1, a également tenté l’expérience d’animateur. En effet, il a présenté Danse avec les stars aux côtés de Sandrine Quétier de 2015 à 2016. Pour deux saisons entières, il anime l’… [+4444 chars]"}, {"source": {"id": null, "name": "Stars-actu.fr"}, "author": "Bertrand Blanc", "title": "Plus belle la vie en avance : Irina met fin à ses jours ! (vidéo PBLV épisode n°4047) - Stars Actu", "description": "C'est une terrible scène qui vous attend dans quelques jours dans votre série de France 3 \"Plus belle la vie\". En effet, alors qu'Irina a tiré sur Andrès", "url": "https://www.stars-actu.fr/2020/04/plus-belle-la-vie-en-avance-irina-met-fin-a-ses-jours-video-pblv-episode-n4047/", "urlToImage": null, "publishedAt": "2020-04-24T19:31:00Z", "content": "C’est une terrible scène qui vous attend dans quelques jours dans votre série de France 3 « Plus belle la vie ». En effet, alors qu’Irina a tiré sur Andrès sans savoir qu’il s’agissait de son père biologique, elle décide de mettre fin à ses jours !\r\nSeule che… [+803 chars]"}, {"source": {"id": null, "name": "Melty.fr"}, "author": "Amandine G", "title": "Alix et Benjamin Samat (LMAC) toujours en couple après leur retour à Marseille ? Elle balance tout - melty", "description": "Alix et Benjamin Samat des Marseillais aux Caraïbes n'ont pas rompu tout de suite après leur retour en France, la preuve !", "url": "https://www.melty.fr/alix-et-benjamin-samat-lmac-toujours-en-couple-apres-leur-retour-a-marseille-elle-balance-tout-a717438.html", "urlToImage": null, "publishedAt": "2020-04-24T19:03:26Z", "content": "Depuis l'officialisation de leur rupture, Alix et Benjamin Samat se clashent par réseaux sociaux interposés. Mais si le couple était jusqu'à présent resté plutôt discret sur les véritables raisons de sa rupture, les langues se délient au fur et à mesure de la… [+1636 chars]"}, {"source": {"id": null, "name": "Nextplz.fr"}, "author": "Liva", "title": "Greg (LMAC) : Sa transformation physique choque les internautes - NextPlz", "description": "Greg des Marseillais aux Caraïbes s’est métamorphosé physiquement et les internautes sont choqués. On va en savoir plus dans cet article. Greg reprend le Greg des Marseillais aux Caraïbes s’est métamorphosé physiquement et les internautes sont choqués. On va …", "url": "https://www.nextplz.fr/telerealite/171956-greg-lmac-sa-transformation-physique-choque-les-internautes", "urlToImage": null, "publishedAt": "2020-04-24T18:26:00Z", "content": "Greg des Marseillais aux Caraïbes sest métamorphosé physiquement et les internautes sont choqués. On va en savoir plus dans cet article.\r\nGreg reprend le cours de sa vie\r\nIl y a peu de temps, on a pensé que Greg avait toujours des sentiments pour Maeva Ghenna… [+1463 chars]"}, {"source": {"id": null, "name": "Lindependant.fr"}, "author": "Nicolas Monnet", "title": "\"On a du mal à comprendre tout ça !\" : le coup de gueule de Jean-Pierre Pernaut contre le gouvernement en plei - L'Indépendant", "description": "Le présentateur vedette de TF1 s'est emporté contre le gouvernement ce vendredi 24 avril pendant le JT de 13 heures.", "url": "https://www.lindependant.fr/2020/04/24/on-a-du-mal-a-comprendre-tout-ca-le-coup-de-gueule-de-jean-pierre-pernaut-contre-le-gouvernement-en-plein-jt,8861532.php", "urlToImage": null, "publishedAt": "2020-04-24T18:20:00Z", "content": "Le présentateur vedette de TF1 s'est emporté contre le gouvernement ce vendredi 24 avril pendant le JT de 13 heures.Jean-Pierre Pernaut en a gros. Et il le dit. Le présentateur historique du JT de 13 heures de TF1 qui a décidé de ne plus venir sur son plateau… [+1385 chars]"}, {"source": {"id": null, "name": "Programme-tv.net"}, "author": "Marie-Amélie Druesne", "title": "Tous en cuisine avec Cyril Lignac : la recette des cookies aux 2 chocolats - Télé Loisirs.fr", "description": "Qu'à cela ne tienne ce week-end vous allez tester les cookies aux deux chocolats de Cyril Lignac qu'ils a réalisés ce vendredi 24 avril dans Tous en cuisine sur M6. Et bien voici la recette !", "url": "https://www.programme-tv.net/news/tv/253591-tous-en-cuisine-avec-cyril-lignac-la-recette-des-cookies-aux-2-chocolats/", "urlToImage": null, "publishedAt": "2020-04-24T18:05:02Z", "content": "Depuis le début du confinement, tout le monde fait des cookies ! Instagram regorge de photos de ces délicieux gâteaux. Et le chef et pâtissier Cyril Lignacne fait pas exception à la règle ! Ce vendredi 24 avril sur M6, le célèbre cuisinier cuisinait de chez l… [+1778 chars]"}, {"source": {"id": null, "name": "Actu.fr"}, "author": "Simon Louvet", "title": "VIDÉO. \"T'as voulu voir le salon\", la géniale parodie de Jacques Brel en temps de confinement - actu.fr", "description": "La reprise hilarante de la chanson \"Vesoul\" de Jacques Brel par le groupe Les Goguettes fait le tour des réseaux sociaux depuis mardi 21 avril 2020, affolant les compteurs.", "url": "https://actu.fr/ile-de-france/paris_75056/video-tas-voulu-voir-salon-geniale-parodie-jacques-brel-temps-confinement_33240047.html", "urlToImage": null, "publishedAt": "2020-04-24T17:57:35Z", "content": "Les Goguettes, groupe auquel appartient Valentin Vander, ont publié une parodie de la chanson Vesoul de Jacques Brel, détournée sur le confinement. (©Capture d’écran YouTube)\r\nValentin Vander rassure : il va bien, malgré le confinement, et aucun chat n’a été … [+3457 chars]"}, {"source": {"id": null, "name": "Parismatch.be"}, "author": "R. P.", "title": "People et royauté Papa comblé Pourquoi Brad Pitt voit du bon dans ce confinement - Paris Match Belgique", "description": "Avant même la propagation du coronavirus, Brad Pitt apparaissait comme un homme nouveau. Après un divorce des plus houleux et avoir tiré un trait sur son…", "url": "https://parismatch.be/actualites/people/393803/pourquoi-brad-pitt-voit-du-bon-dans-ce-confinement", "urlToImage": null, "publishedAt": "2020-04-24T17:31:00Z", "content": "Avant même la propagation du coronavirus, Brad Pitt apparaissait comme un homme nouveau. Après un divorce des plus houleux et avoir tiré un trait sur son penchant pour la bouteille, l’acteur de Once Upon a Time… in Hollywood semblait libéré de ses démons. Et … [+1416 chars]"}, {"source": {"id": null, "name": "Purepeople.com"}, "author": "Igor Tony N'Kodia", "title": "Kylie Jenner : Soirée Fortnite pour Stormi et son papa Travis Scott - Pure People", "description": "Pour fêter le lancement de son personnage dans Fortnite, Travis Scott a joué quelques heures en direct et était connecté avec des millions de fans. Sa fille Stormi a pris les commandes en s'emparant de la manette de Playstation.", "url": "https://www.purepeople.com/article/kylie-jenner-soiree-fortnite-pour-stormi-et-son-papa-travis-scott_a385634/1", "urlToImage": null, "publishedAt": "2020-04-24T17:03:00Z", "content": "Le coronavirus et le confinement privent les stars de sortie ! Elles communiquent avec le reste du monde grâce aux réseaux sociaux... et aux jeux vidéo. La fille de Kylie Jenner s'y est mise, sous l'oeil bienveillant de son papa Travis Scott.\r\nÀ défaut de pou… [+633 chars]"}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": "Le Figaro avec AFP", "title": "De Banksy à Invader, durant le confinement le street art trouve un second souffle en ligne - Le Figaro", "description": null, "url": "http://www.lefigaro.fr/arts-expositions/de-banksy-a-invader-durant-le-confinement-le-street-art-trouve-un-second-souffle-en-ligne-20200424", "urlToImage": null, "publishedAt": "2020-04-24T16:54:00Z", "content": "Ils ont d'ordinaire pour terrain de jeu les murs des grandes villes. Confinement oblige, c'est via les réseaux sociaux que les street artistes communiquent et font part de leurs préoccupations, en pleine épidémie de coronavirus.\r\n«J'ai réalisé cette mosaïque … [+3762 chars]"}, {"source": {"id": null, "name": "Purepeople.com"}, "author": "Thomas Montet", "title": "Michel Polnareff déteste JUL ? Il s'explique, le rappeur lui répond ! - Pure People", "description": "Réputé pour ne pas avoir la langue dans sa poche, le chanteur Michel Polnareff a été interrogé sur ses goûts musicaux actuels. Alors qu'il avait indiqué détester le rappeur marseillais JUL, il a fait machine arrière. L'intéressé lui a répondu.", "url": "https://www.purepeople.com/article/michel-polnareff-deteste-jul-il-s-explique-le-rappeur-lui-repond_a385640/1", "urlToImage": null, "publishedAt": "2020-04-24T16:46:00Z", "content": "Michel Polnareff n'est pas le dernier quand il faut jouer les snipers. Mais quand il se trompe, le chanteur est aussi capable de le reconnaître. Sur son compte Twitter, l'artiste de 75 ans a posté un message afin de présenter ses excuses au rappeur Jul !\r\nMer… [+1554 chars]"}, {"source": {"id": null, "name": "Purepeople.com"}, "author": "Marine Corviole", "title": "Meghan Markle \"désarmante\" : la créatrice de sa robe de mariée se confie - Pure People", "description": "Cette robe de mariée a sans conteste marqué l'histoire de la maison Givenchy : pour son mariage avec le prince Harry en mai 2018, Meghan Markle a fait appel aux talents de Clare Waight Keller. Alors qu'un nouveau chapitre s'ouvre pour la créatrice, elle se co…", "url": "https://www.purepeople.com/article/meghan-markle-desarmante-la-creatrice-de-sa-robe-de-mariee-se-confie_a385637/1", "urlToImage": null, "publishedAt": "2020-04-24T16:15:00Z", "content": "Près de deux ans après le mariage royal du prince Harry et Meghan Markle, la créatrice Clare Waight Keller est revenue sur la conception de la fameuse robe de mariée Givenchy portée par la duchesse de Sussex à Windsor. Alors qu'elle s'apprête à quitter la mai… [+1079 chars]"}, {"source": {"id": null, "name": "Www.rtl.fr"}, "author": null, "title": "VIDÉO - Les Grosses Têtes : Karine Le Marchand s'y connait en femme à barbe - RTL.fr", "description": "REPLAY - Écoutez ou réécoutez l'émission du vendredi 24 avril 2020 avec Laurent Ruquier et ses Grosses Têtes du jour.", "url": "https://www.rtl.fr/culture/medias-people/video-les-grosses-tetes-karine-le-marchand-s-y-connait-en-femme-a-barbe-7800419976", "urlToImage": null, "publishedAt": "2020-04-24T16:05:00Z", "content": "Découvrez Les Grosses Têtes du vendredi 24 avril 2020 ! Laurent Ruquier vous présente le plateau du jour : Une Grosse Tête avec qui on se demande comment on va lui faire porter un masque vu quelle a déjà du mal à porter une culotte : Karine Le Marchand. Une G… [+1840 chars]"}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": "Christine Haas", "title": "Découvrez votre horoscope gratuit de la semaine du 26 avril au 2 mai 2020 par Christine Haas - Le Figaro", "description": "Voici votre horoscope, signe par signe, décan par décan. L’astrologue vous livre ses prévisions en amour, richesse, travail, famille et santé pour la semaine prochaine.", "url": "https://tvmag.lefigaro.fr/programme-tv/decouvrez-votre-horoscope-gratuit-de-la-semaine-du-26-avril-au-2-mai-2020-par-christine-haas_4c177f22-7eea-11ea-8857-f4a363340587/", "urlToImage": null, "publishedAt": "2020-04-24T16:00:03Z", "content": "Voici votre horoscope, signe par signe, décan par décan. Lastrologue vous livre ses prévisions en amour, richesse, travail, famille et santé pour la semaine prochaine.Bélier20 mars-20 avrilVie sociale Cest maintenant au tour du 3e décan de recevoir les influx… [+5379 chars]"}, {"source": {"id": null, "name": "Allocine.fr"}, "author": "Julia Fernandez", "title": "Coronavirus et salles de cinéma : les premières mesures envisagées pour la réouverture - AlloCiné", "description": "Alors que la réouverture des salles de cinéma s'envisage suite au discours de Pierre Lescure du jeudi 23 avril, la Fédération nationale des cinémas français (FNCF) fait le point sur les différentes pi...", "url": "http://www.allocine.fr/article/fichearticle_gen_carticle=18689598.html", "urlToImage": null, "publishedAt": "2020-04-24T15:46:00Z", "content": "Alors que la réouverture des salles de cinéma s'envisage suite au discours de Pierre Lescure du jeudi 23 avril, la Fédération nationale des cinémas français (FNCF) fait le point sur les différentes pistes de réflexion en cours.FNCF\r\nSuite à l'intervention du … [+2574 chars]"}, {"source": {"id": null, "name": "Programme-tv.net"}, "author": "Lisa ETCHEBERRY", "title": "Netflix : séries, films, documentaires… Toutes les nouveautés attendues en mai 2020 sur la plateforme - Télé Loisirs.fr", "description": "De nombreuses nouveautés sont prévues pour ce mois de mai 2020 sur Netflix. Entre autre, la saison 1 de The Eddy, la série de Damien Chazelle, Hollywood, la nouvelle création de Ryan Murphy et côté cinéma, Get Out, signé Jordan Peele ou encore Mission impossi…", "url": "https://www.programme-tv.net/news/evenement/netflix-series-films-et-documentaires-sur-netflix/253583-netflix-series-films-documentaires-toutes-les-nouveautes-attendues-en-mai-2020-sur-la-plateforme/", "urlToImage": null, "publishedAt": "2020-04-24T15:45:00Z", "content": "De nombreuses nouveauté attendent encore les abonnés Netflix pour mai 2020. Lévénement de ce mois ? The Eddy, série musicale et dramatique signée Damien Chazelle (La La Land, Whiplash), et réunissant Tahar Rahim et Leïla Bekhti. Autre moment fort pour les sér… [+8698 chars]"}, {"source": {"id": null, "name": "Clubpoker.net"}, "author": "SuperCaddy", "title": "Poker Express et Dans la tête d'un pro : Winamax débarque sur M6 et W9 - Club Poker", "description": "Dans la tête d'un pro n'avait jamais eu les honneurs d'une diffusion à la télévision. Cet écueil sera corrigé dans la nuit de samedi à dimanche sur W9, avec en guise de galop d'essai un épisode consacré à Patrick Bruel. Mais ce n'est pas tout puisque notre Po…", "url": "https://www.clubpoker.net/poker-express-tete-d-pro-winamax-debarque-m6-w9/n-15272", "urlToImage": null, "publishedAt": "2020-04-24T14:53:00Z", "content": "Vous l'avez connu tout petit dans les confins du Zoo sur le forum, puis à la tête de la Minute FU au micro de Club Poker. De La Maison du Bluff (en tant que coach) jusqu'à Top of the Pok ou au Winamax Stream Gang, PonceP a depuis parcouru un sacré bout de che… [+1143 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "20 Minutes avec AFP", "title": "Coronavirus : Céline Dion reporte sine die le début de sa tournée européenne - 20 Minutes", "description": "En France, Céline Dion avait six dates à Paris La Défense Arena, entre le 26 juin et le 4 juillet", "url": "https://www.20minutes.fr/arts-stars/culture/2767175-20200424-coronavirus-celine-dion-reporte-sine-die-debut-tournee-europeenne", "urlToImage": null, "publishedAt": "2020-04-24T14:33:56Z", "content": "La chanteuse Céline Dion Laurence Labat/Starface\r\nCéline Dion reporte sine die « les premiers mois de sa tournée européenne », du 21 mai au 25 juillet, dont six dates prévues à \r\nParis, « ne sachant pas quand les choses reviendront à la normale » en raison de… [+1865 chars]"}, {"source": {"id": null, "name": "Lanouvellerepublique.fr"}, "author": "", "title": "Confiné en Indre-et-Loire, Mick Jagger sort un nouveau titre - la Nouvelle République", "description": "", "url": "https://www.lanouvellerepublique.fr/indre-et-loire/commune/poce-sur-cisse/confine-en-indre-et-loire-mick-jagger-sort-un-nouveau-titre", "urlToImage": null, "publishedAt": "2020-04-24T13:25:18Z", "content": null}, {"source": {"id": null, "name": "Closermag.fr"}, "author": "P.G.", "title": "Monica Bellucci : pourquoi elle ne s'est pas confinée en Italie - Closer France", "description": "L'actrice italienne n'est pas confinée en Italie mais au Pays Basque français. Et ce, pour une raison bien particulière : ses filles.", "url": "https://www.closermag.fr/people/monica-bellucci-pourquoi-elle-ne-s-est-pas-confinee-en-italie-1106064", "urlToImage": null, "publishedAt": "2020-04-24T13:21:45Z", "content": "Comme des milliards de personnes dans le monde, les plus grandes stars n'échappent pas au confinement imposé suite à l'épidémie de coronavirus. Et pour Monica Bellucci, cette période est particulière puisque l'actrice italienne n'est pas confinée dans son pay… [+1670 chars]"}, {"source": {"id": null, "name": "Lefigaro.fr"}, "author": "Emilie Geffray", "title": "Christophe Barbier présente ses excuses après ses propos sur «deux dames en surpoids» - Le Figaro", "description": "VIDÉO - L’éditorialiste politique de BFMTV a fait un parallèle entre les personnes en surpoids jugées fragiles et les deux interprètes en langue des signes présentes aux côtés du professeur Salomon, lors des points presse du directeur général de la Santé.", "url": "https://tvmag.lefigaro.fr/programme-tv/christophe-barbier-presente-ses-excuses-apres-ses-propos-sur-deux-dames-en-surpoids_55e48df0-8620-11ea-b0b7-ac58f2163138/", "urlToImage": null, "publishedAt": "2020-04-24T13:19:45Z", "content": "VIDÉO - Léditorialiste politique de BFMTV a fait un parallèle entre les personnes en surpoids jugées fragiles et les deux interprètes en langue des signes présentes aux côtés du professeur Salomon, lors des points presse du directeur général de la Santé.Les p… [+2397 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "« Tout le monde veut prendre sa place ». Marie-Christine, championne du jeu, a reçu des messages de haine - Ouest-France", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMikwFodHRwczovL3d3dy5vdWVzdC1mcmFuY2UuZnIvY3VsdHVyZS9wZW9wbGUvdG91dC1sZS1tb25kZS12ZXV0LXByZW5kcmUtc2EtcGxhY2UtbWFyaWUtY2hyaXN0aW5lLWNoYW1waW9ubmUtZHUtamV1LXJlY3UtZGVzLW1lc3NhZ2VzLWRlLWhhaW5lLTY4MTY3MzXSAZMBaHR0cHM6Ly9hbXAub3Vlc3QtZnJhbmNlLmZyL2N1bHR1cmUvcGVvcGxlL3RvdXQtbGUtbW9uZGUtdmV1dC1wcmVuZHJlLXNhLXBsYWNlLW1hcmllLWNocmlzdGluZS1jaGFtcGlvbm5lLWR1LWpldS1yZWN1LWRlcy1tZXNzYWdlcy1kZS1oYWluZS02ODE2NzM1?oc=5", "urlToImage": null, "publishedAt": "2020-04-24T13:11:48Z", "content": null}, {"source": {"id": null, "name": "Barbanews.com"}, "author": null, "title": "Kim Kardashian - La star affole à nouveau Instagram ! - barbanews", "description": "Kim Kardashian a visiblement décidé d’offrir du bon temps à ses followers durant le confinement et ces derniers ne vont pas s’en plaindre ! Dernièrement, l’épouse de Kanye West s’est...", "url": "https://www.barbanews.com/peoples/kim-kardashian-la-star-affole-a-nouveau-instagram/", "urlToImage": null, "publishedAt": "2020-04-24T13:09:00Z", "content": "Kim Kardashian a visiblement décidé d’offrir du bon temps à ses followers durant le confinement et ces derniers ne vont pas s’en plaindre !\r\nDernièrement, l’épouse de Kanye West s’est affichée affriolante sur son compte Instagram, de quoi faire grimper la tem… [+3086 chars]"}, {"source": {"id": null, "name": "Journaldesfemmes.fr"}, "author": "Salomé Gegout", "title": "Christophe, mort du coronavirus ? Sa fille Lucie, privée d'adieux - Journal des Femmes", "description": "Christophe est-il réellement mort des suites d'un emphysème pulmonaire ? Selon Paris Match, le chanteur aurait  succombé au coronavirus, quelques minutes avant que sa fille Lucie ne se rende à son chevet. Silence et secrets.", "url": "https://www.journaldesfemmes.fr/people/magazine/2632967-christophe-mort-coronavirus-sa-fille-lucie-adieu/", "urlToImage": null, "publishedAt": "2020-04-24T13:02:36Z", "content": "Christophe est-il réellement mort des suites d'un emphysème pulmonaire ? Selon Paris Match, le chanteur aurait succombé au coronavirus, quelques minutes avant que sa fille Lucie ne se rende à son chevet. Silence et secrets. Christophe est-il décédé des suites… [+2482 chars]"}, {"source": {"id": null, "name": "Telerama.fr"}, "author": "Mathilde Blottière", "title": "Truffaut, Resnais, Lynch, Dolan : pourquoi Netflix est devenu cinéphile - Télérama.fr", "description": "En partenariat avec MK2, Netflix France met à disposition de ses 7 millions d’abonnés des grands classiques, dont douze films de François Truffaut dès ce 24 avril 2020. Une prise de prestige… ou un changement stratégique de la plateforme jusqu’ici peu portée …", "url": "https://www.telerama.fr/television/truffaut,-resnais,-lynch,-dolan-pourquoi-netflix-est-devenu-cinephile,n6631120.php", "urlToImage": null, "publishedAt": "2020-04-24T13:00:00Z", "content": "En partenariat avec MK2, Netflix France met à disposition de ses 7 millions dabonnés des grands classiques, dont douze films de François Truffaut dès ce 24 avril 2020. Une prise de prestige ou un changement stratégique de la plateforme jusquici peu portée sur… [+8429 chars]"}, {"source": {"id": null, "name": "Lebonbon.fr"}, "author": null, "title": "Alerte Job de rêve : être payé 1 000 $ pour regarder la saga Harry Potter - Le Bonbon", "description": "De quoi mettre du baume au cœur en cette drôle de période.", "url": "https://www.lebonbon.fr/paris/pop-culture/job-regarder-saga-harry-potter/", "urlToImage": null, "publishedAt": "2020-04-24T12:42:40Z", "content": "Parmi les sagas les plus marquantes pour notre génération, celle d’Harry Potter est clairement notre grande préférée. L’univers magique, les personnages attachants, l’histoire prenante et même Celui-dont-on-ne-doit-pas-prononcer-le-nom, on aime absolument tou… [+723 chars]"}, {"source": {"id": null, "name": "Parismatch.be"}, "author": "Rédaction Paris Match Belgique", "title": "Tom Hanks : Son beau geste pour Corona, un garçon de 8 ans harcelé à cause de son prénom - Paris Match Belgique", "description": "L’acteur a écrit une lettre de soutien au jeune garçon. Il lui a aussi offert une machine à écrire de la marque… Corona.", "url": "https://parismatch.be/actualites/393607/tom-hanks-son-beau-geste-pour-corona-un-garcon-de-8-ans-harcele-a-cause-de-son-prenom", "urlToImage": null, "publishedAt": "2020-04-24T12:30:00Z", "content": "Tom Hanks a envoyé une lettre de soutien et un cadeau à Corona, un jeune Australien harcelé à cause de son prénom. L’enfant de huit ans, qui a subi de nombreuses brimades à l’école, avait écrit à la star et à son épouse Rita Wilson, qui ont passé deux semaine… [+1505 chars]"}, {"source": {"id": null, "name": "Purepeople.com"}, "author": "Yohann Turi", "title": "Annette Blier : L'épouse de Bernard Blier morte à 84 ans, le Covid-19 suspecté - Pure People", "description": "Les versions divergent. Le jeudi 23 avril 2020, Annette Blier est morte à l'âge de 84 ans. Si certains évoquent le coronavirus, l'hôpital qui l'a prise en charge avant sa disparition ne confirme pas ce diagnostic...", "url": "https://www.purepeople.com/article/annette-blier-l-epouse-de-bernard-blier-morte-a-84-ans-le-covid-19-suspecte_a385544/1", "urlToImage": null, "publishedAt": "2020-04-24T11:21:00Z", "content": "La liste des victimes ne cesse de s'allonger : Annette Blier, la seconde épouse de l'acteur Bernard Blier, est morte à l'âge de 84 ans à Pontarlier, dans le Doubs. La nouvelle nous vient de l'AFP l'Agence-France Presse , qui a reçu confirmation de cette tragé… [+1445 chars]"}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": null, "title": "Coronavirus : la Japan Expo reportée du 15 au 18 juillet 2021, annoncent les organisateurs - franceinfo", "description": "", "url": "https://www.francetvinfo.fr/sante/maladie/coronavirus/coronavirus-la-japan-expo-reportee-du-15-au-18-juillet-2021-annoncent-les-organisateurs_3932425.html", "urlToImage": null, "publishedAt": "2020-04-24T11:06:40Z", "content": "Mi-avril l'annulation de l'édition de 2020 avait été annoncée en raison de l'épidémie de coronavirus\r\nLa 21 édition de Japan Expo, le plus important festival européen dédié à la culture japonaise qui se tient tous les ans au parc des expositions de Villepinte… [+1565 chars]"}, {"source": {"id": null, "name": "Lesinrocks.com"}, "author": "Service Musiques", "title": "“Goliath” : Woodkid est de retour après sept ans d'absence - Les Inrocks", "description": "Le Français signe son grand retour avec un nouveau titre extrait de son album à venir.", "url": "https://www.lesinrocks.com/2020/04/24/musique/musique/goliath-woodkid-est-de-retour-apres-sept-ans-dabsence/", "urlToImage": null, "publishedAt": "2020-04-24T11:04:01Z", "content": null}, {"source": {"id": null, "name": "Presse-citron.net"}, "author": "Louise Millon", "title": "Netflix, Disney+… Quels sont les 7 séries et films à voir ce week-end ? - Presse-citron", "description": "Netflix fait évoluer son catalogue assez régulièrement, ce qui est moins le cas de Disney+. Pour autant, il y a des films et des séries de choix sur les deux plateformes de streaming. Voici notre sélection du week-end.", "url": "https://www.presse-citron.net/netflix-disney-quels-sont-les-7-series-et-films-a-voir-ce-week-end/", "urlToImage": null, "publishedAt": "2020-04-24T10:56:59Z", "content": "Si Netflix a pour habitude d’accueillir régulièrement des nouveautés, c’est moins le cas de la plateforme de streaming Disney. Toutefois, nous avons décidé de compléter notre habituelle liste du vendredi en vous proposant des films et des séries que vous pour… [+3242 chars]"}, {"source": {"id": null, "name": "Purepeople.com"}, "author": "Marine Corviole", "title": "Kate Middleton confinée avec style : nouvelle robe fleurie, et accessible ! - Pure People", "description": "La duchesse de Cambridge se révèle être une adepte des robes fleuries mi-longues. Dernier exemple en date ce jeudi à la télévision britannique : Kate Middleton est apparue radieuse avec mari et enfants pour applaudir le personnel soignant.", "url": "https://www.purepeople.com/article/kate-middleton-confinee-avec-style-nouvelle-robe-fleurie-et-accessible_a385550/1", "urlToImage": null, "publishedAt": "2020-04-24T10:30:00Z", "content": "Bien qu'elle soit confinée chez elle, dans sa maison de campagne du Norfolk, Kate Middleton reste une source d'inspiration mode. Le 23 avril 2020, la duchesse de Cambridge a fait une apparition remarquée à la télévision, dans l'émission spéciale One Big Night… [+909 chars]"}, {"source": {"id": null, "name": "Parismatch.be"}, "author": "Rédaction Paris Match Belgique", "title": "Koh-Lanta : Denis Brogniart révèle sa technique infaillible pour jouer avec les nerfs des candidats - Paris Match Belgique", "description": "Pour rendre encore un peu plus spectaculaire son jeu d’aventure, la production de « Koh-Lanta » aime désorienter au maximum les candidats. Denis Brogniart a révélé un petit truc très efficace utilisé lors des tournages.", "url": "https://parismatch.be/culture/medias/393560/koh-lanta-denis-brogniart-revele-sa-technique-infaillible-pour-jouer-avec-les-nerfs-des-candidats", "urlToImage": null, "publishedAt": "2020-04-24T10:28:00Z", "content": "Pour rendre encore un peu plus spectaculaire son jeu d’aventure, la production de « Koh-Lanta » aime désorienter au maximum les candidats. Denis Brogniart a révélé un petit truc très efficace utilisé lors des tournages.\r\nCest à loccasion de son rendez-vous qu… [+1223 chars]"}, {"source": {"id": null, "name": "Parismatch.com"}, "author": "Paris Match", "title": "Chris Hemsworth raconte sa rencontre avec son idole Brad Pitt - Paris Match", "description": "Le confinement permet à certains de se remémorer d'agréables souvenirs. Celui de Chris Hemsworth, c'est son incroyable rencontre avec Brad Pitt.&nb...", "url": "https://www.parismatch.com/People/Chris-Hemsworth-raconte-sa-rencontre-avec-son-idole-Brad-Pitt-1683157", "urlToImage": null, "publishedAt": "2020-04-24T10:24:13Z", "content": "Le confinement permet à certains de se remémorer d'agréables souvenirs. Celui de Chris Hemsworth, c'est son incroyable rencontre avec Brad Pitt.  Chris Hemsworth a réalisé le rêve de nombreuses personnes : rencontrer Brad Pitt. Dans une interview accordée au … [+1484 chars]"}, {"source": {"id": null, "name": "Programme-television.org"}, "author": null, "title": "Ellen Pompeo (Grey’s Anatomy) s’explique après ses propos polémiques sur Harvey Weinstein - Télé 7 Jours", "description": "L'actrice a souhaité mettre les choses au clair après que ses propos polémiques sur Harvey Weinstein aient refait surface.", "url": "https://www.programme-television.org/news-tv/Ellen-Pompeo-Grey-s-Anatomy-s-explique-apres-ses-propos-polemiques-sur-Harvey-Weinstein-4657892", "urlToImage": null, "publishedAt": "2020-04-24T10:24:00Z", "content": "Bad buzz pour Ellen Pompeo. Un extrait d'une conférence qui s'est tenue en juillet 2018 a refait surface ces derniers jours sur les réseaux sociaux : on peut notamment voir l'actrice de Grey's Anatomy expliquer à propos d'Harvey Weinstein et de ses accusatric… [+2030 chars]"}, {"source": {"id": null, "name": "Letelegramme.fr"}, "author": "Le Télégramme", "title": "« Pardon à mes amis bretons » : Jean-Michel Jarre s’excuse - Le Télégramme", "description": "Jean-Michel Jarre s’est excusé, ce jeudi, pour les propos qu’il avait tenus sur la Bretagne. Le compositeur avait alors regretté que son ami Christophe soit mort « au fin fond de la Bretagne ».", "url": "https://www.letelegramme.fr/bretagne/pardon-a-mes-amis-bretons-jean-michel-jarre-s-excuse-24-04-2020-12543393.php", "urlToImage": null, "publishedAt": "2020-04-24T10:13:11Z", "content": null}, {"source": {"id": null, "name": "Slate.fr"}, "author": "Caroline Ernesty", "title": "«Tiger King», pas un personnage pour rattraper l'autre | Slate.fr - Slate.fr", "description": "Très populaire sur les réseaux, «Au Royaume des Fauves (Tiger King)» est un divertissement précieux en période de confinement.", "url": "http://www.slate.fr/story/189783/culture-docu-serie-netflix-tiger-king-au-royaume-des-fauves", "urlToImage": null, "publishedAt": "2020-04-24T10:03:00Z", "content": "Temps de lecture: 5 min\r\nAttention, cet article comporte des spoilers.\r\nDepuis le 20 mars, et en l'espace de dix jours, plus de 34 millions d'Américain·es ont été captivé·es par les aventures de Joe Exotic et consorts, adeptes des «gros chats» et personnages … [+6573 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "EuroMillions FDJ : comment jouer en ligne pour 25 millions d’euros ce vendredi ? - Ouest-France", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMieWh0dHBzOi8vd3d3Lm91ZXN0LWZyYW5jZS5mci9zaG9wcGluZy9ldXJvbWlsbGlvbnMtZmRqLWNvbW1lbnQtam91ZXItZW4tbGlnbmUtcG91ci0yNS1taWxsaW9ucy1kLWV1cm9zLWNlLXZlbmRyZWRpLTY4MTY2NDLSAXlodHRwczovL2FtcC5vdWVzdC1mcmFuY2UuZnIvc2hvcHBpbmcvZXVyb21pbGxpb25zLWZkai1jb21tZW50LWpvdWVyLWVuLWxpZ25lLXBvdXItMjUtbWlsbGlvbnMtZC1ldXJvcy1jZS12ZW5kcmVkaS02ODE2NjQy?oc=5", "urlToImage": null, "publishedAt": "2020-04-24T09:35:00Z", "content": null}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": null, "title": "Ecoutez le premier extrait du nouvel album de Benjamin Biolay : \"Comment est ta peine ?\" - franceinfo", "description": "", "url": "https://www.francetvinfo.fr/culture/musique/chanson-francaise/ecoutez-le-premier-extrait-du-nouvel-album-de-benjamin-biolay-comment-est-ta-peine_3932261.html", "urlToImage": null, "publishedAt": "2020-04-24T09:22:32Z", "content": "Le chanteur français sortira son nouvel album, \"Grand Prix\", le 26 juin. Après Home, un album en duo avec Chiara Mastroianni, et la musique du film Clara et moi, Benjamin Biolay sort son neuvième album solo Grand Prix le 26 juin, dont il dévoile vendredi 24 a… [+1708 chars]"}, {"source": {"id": null, "name": "Ozap.com"}, "author": "Florian Guadalupe", "title": "\"Touche pas à mon poste\" renouvelé pour \"au moins deux à trois saisons\" sur C8 - Ozap", "description": "Toutefois, l'émission ne reviendra pas avant la rentrée.", "url": "https://www.ozap.com/actu/-touche-pas-a-mon-poste-renouvele-pour-au-moins-deux-a-trois-saisons-sur-c8/592279", "urlToImage": null, "publishedAt": "2020-04-24T09:11:06Z", "content": "\"TPMP\" n'est pas près de s'arrêter. Hier soir, dans \"Ce soir chez Baba\" sur C8, Cyril Hanouna a fait de nombreuses révélations concernant l'avenir de sa quotidienne spéciale confinement après le 11 mai prochain et de son programme phare \"Touche pas à mon post… [+1753 chars]"}, {"source": {"id": null, "name": "Allocine.fr"}, "author": "CTC", "title": "Les séries sur Netflix du 24 au 30 avril : The Last Kingdom saison 4, le retour de Ricky Gervais, 2 nouveaux teen shows… - AlloCiné", "description": "Découvrez grâce à AlloCiné les séries qui sortiront sur Netflix entre le 24 et 30 avril !", "url": "http://www.allocine.fr/article/fichearticle_gen_carticle=18689576.html", "urlToImage": null, "publishedAt": "2020-04-24T09:07:32Z", "content": "Découvrez grâce à AlloCiné les séries qui sortiront sur Netflix entre le 24 et 30 avril !\r\nAfter Life : La série de Ricky Gervais - le roi de lhumour noir - revient avec une saison 2.\r\nLove 101 : cette série turque suit un groupe d'adolescents marginalisés da… [+857 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "L.Be.", "title": "Coronavirus : Dadju récolte 200.000 euros pour l’Unicef et la Fondation Hôpitaux de France - 20 Minutes", "description": "Le rappeur a animé mercredi soir un show de quatre heures pour venir en aide aux soignants", "url": "https://www.20minutes.fr/arts-stars/culture/2766983-20200424-coronavirus-dadju-recolte-200000-euros-unicef-fondation-hopitaux-france", "urlToImage": null, "publishedAt": "2020-04-24T08:46:09Z", "content": "Le rappeur Dadju. Lionel Guericolas/MPP/SIPA\r\nDadju a animé mercredi soir un show de quatre heures pour venir en aide aux soignants dans la lutte contre le Covid-19. Lartiste a organisé dès 21 heures un live sur  \r\nInstagram. Il en a profité pour lancer un ap… [+1032 chars]"}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": null, "title": "Les Beatles invitent le monde entier à un karaoké géant sur \"Yellow Submarine\" samedi 25 avril - franceinfo", "description": "", "url": "https://www.francetvinfo.fr/culture/musique/the-beatles/les-beatles-invitent-le-monde-entier-a-un-karaoke-geant-sur-yellow-submarine-samedi-25-avril_3930949.html", "urlToImage": null, "publishedAt": "2020-04-24T08:41:48Z", "content": "Et si l'on chantait tous ensemble \"All You Need Is Love\" des Beatles en regardant le film \"Yellow Submarine\" diffusé pour l'occasion en version karaoké ? C'est ce que propose Ringo Starr au monde entier.Les Beatles (en tout cas ses deux survivants Paul McCart… [+3079 chars]"}, {"source": {"id": null, "name": "Bfmtv.com"}, "author": "BFMTV", "title": "Jean-Paul Rouve et Olivier Baroux contraints de réécrire Les Tuche 4 à cause du coronavirus - BFMTV people", "description": "Olivier Baroux et Jean-Paul Rouve ont été obligés de réécrire les scènes des Tuche 4 qui leur restaient à tourner afin de respecter les mesures de distanciation sociale.", "url": "https://people.bfmtv.com/cinema/jean-paul-rouve-et-olivier-baroux-contraints-de-reecrire-les-tuche-4-a-cause-du-coronavirus-1899848.html", "urlToImage": null, "publishedAt": "2020-04-24T08:32:04Z", "content": null}, {"source": {"id": null, "name": "Parismatch.be"}, "author": "Rédaction Paris Match Belgique", "title": "Roméo Elvis justifie son clash avec Cauet : « J'ai vu quelqu'un agresser ma petite soeur » - Paris Match Belgique", "description": "En duplex dans « Clique » sur Canal+ ce jeudi, Roméo Elvis est revenu sur son gros clash avec Cauet, qui tirait à boulets rouges sur sa soeur Angèle.", "url": "https://parismatch.be/actualites/people/393571/romeo-elvis-justifie-son-clash-avec-cauet-jai-vu-quelquun-agresser-ma-petite-soeur", "urlToImage": null, "publishedAt": "2020-04-24T08:32:00Z", "content": "En duplex dans « Clique » sur Canal+ ce jeudi, Roméo Elvis est revenu sur son gros clash avec Cauet, qui tirait à boulets rouges sur sa soeur Angèle.\r\nDepuis plusieurs mois, Cauet aime s’en prendre à Angèle lors de ses émissions radio. Premier acte sur NRJ qu… [+1976 chars]"}, {"source": {"id": null, "name": "Ozap.com"}, "author": "Kevin Boucher", "title": "Audiences : La \"7e Compagnie\" leader sur TF1, \"Why Women Kill\" en baisse, gros carton pour Arte avec Eric Cantona - Ozap", "description": "Les audiences de la soirée du jeudi 23 avril 2020.", "url": "https://www.ozap.com/actu/audiences-la-7e-compagnie-leader-sur-tf1-why-women-kill-en-baisse-gros-carton-pour-arte-avec-eric-cantona/592276", "urlToImage": null, "publishedAt": "2020-04-24T07:05:25Z", "content": "Jeudi soir, TF1 s'est hissée en tête des audiences avec la comédie française en rediffusion \"La 7e compagnie au clair de lune\". Ce long métrage de Robert Lamoureux avec Jean Lefebvre, Pierre Mondy et Henri Guybet a réuni 6,44 millions de cinéphiles jusqu'à 22… [+2396 chars]"}, {"source": {"id": null, "name": "Allocine.fr"}, "author": "[Url href='https://twitter.com/J_M_Renault']Jean-Maxime RENAULT (@J_M_Renault)[/url]", "title": "Defending Jacob (Apple TV+) : que vaut l'intense série judiciaire avec Chris Evans (Captain America) ? - AlloCiné", "description": "Chris Evans incarne un père torturé face à son enfant accusé de meurtre dans la mini-série Apple TV+ \"Defending Jacob\" disponible ce vendredi 22 avril.", "url": "http://www.allocine.fr/article/fichearticle_gen_carticle=18689506.html", "urlToImage": null, "publishedAt": "2020-04-24T06:49:00Z", "content": "Chris Evans incarne un père torturé face à son enfant accusé de meurtre dans la mini-série Apple TV+ \"Defending Jacob\" disponible ce vendredi 22 avril.\r\nLe fils d'un procureur d'une petite ville du Massachusetts est accusé de meurtre. Alors qu'il tente d'inno… [+3393 chars]"}, {"source": {"id": null, "name": "Lepopulaire.fr"}, "author": "Centre France", "title": "Le nouveau single des Trois Cafés Gourmands, enregistré à Brive, sort ce vendredi - lepopulaire.fr", "description": "L’album ne sortira qu’à l’automne. Mais pour faire patienter les fans, les « Trois Cafés Gourmands » lancent ce vendredi le single.", "url": "https://www.lepopulaire.fr/brive-la-gaillarde-19100/loisirs/le-nouveau-single-des-trois-cafes-gourmands-enregistre-a-brive-sort-ce-vendredi_13781705/", "urlToImage": null, "publishedAt": "2020-04-24T04:54:00Z", "content": "Cest à Brive, au studio de Jean-Jacques Dumas, quont été immortalisés les quatorze chapitres du deuxième album des Trois Cafés Gourmands.\r\nLe disque ne sortira quà lautomne. Mais dès aujourdhui sera diffusé sur les ondes « Comme des enfants » qui est lun des … [+1511 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "Arthur RainBot", "title": "Horoscope chinois du Vendredi 24 avril 2020 - 20minutes.fr", "description": "Découvrez l’horoscope chinois de 20 Minutes du 24/04/2020", "url": "https://www.20minutes.fr/horoscope-quotidien-chinois/2760967-20200415-horoscope-chinois-du-vendredi-24-avril-2020", "urlToImage": null, "publishedAt": "2020-04-24T04:05:02Z", "content": "Découvrez l'horoscope quotidien chinois DR\r\nCôté amour, le secteur du couple sera placé sous le signe de l'harmonie et de la compréhension mutuelle. Le climat astral devrait favoriser vos amours. Célibataire, vous manquerez de réalisme. En effet, en plaçant l… [+9779 chars]"}, {"source": {"id": null, "name": "Tomsguide.fr"}, "author": null, "title": "Thor: Love and Thunder accueille Zappa, un personnage encore inconnu - Tom's Guide", "description": "Le film Thor: Love and Thunder accueillera un tout nouveau personnage nommé Zappa. Il s'agirait d’un adolescent afro-américain, qui n’existe à priori ni dans le MCU, ni dans les comics.", "url": "https://www.tomsguide.fr/thor-love-and-thunder-accueille-zappa-un-personnage-encore-inconnu/", "urlToImage": null, "publishedAt": "2020-04-24T03:01:00Z", "content": "Le film Thor: Love and Thunder accueillera un tout nouveau personnage nommé Zappa. Il s’agirait dun adolescent afro-américain, qui nexiste à priori ni dans le MCU, ni dans les comics.Selon des sources du site The Illuminerdi, les studios Marvel seraient à la … [+2339 chars]"}, {"source": {"id": null, "name": "Barbanews.com"}, "author": null, "title": "INÉDIT : Vanessa Paradis se livre comme jamais sur sa vie privée ! Photos et vidéos ! - barbanews", "description": "De nombreuses personnes n’ont pas la chance d’être confinées avec leurs proches. Avec sa vie professionnelle et tous ses déplacements, ça aurait également pu être le cas de Vanessa Paradis....", "url": "https://www.barbanews.com/peoples/inedit-vanessa-paradis-se-livre-comme-jamais-sur-sa-vie-privee-photos-et-videos/", "urlToImage": null, "publishedAt": "2020-04-23T19:51:00Z", "content": "De nombreuses personnes nont pas la chance dêtre confinées avec leurs proches. Avec sa vie professionnelle et tous ses déplacements, ça aurait également pu être le cas de Vanessa Paradis. Heureusement pour elle, la star est confinée avec ses enfants, Lily-Ros… [+2656 chars]"}, {"source": {"id": null, "name": "Public.fr"}, "author": "Public", "title": "\"On s'aimait beaucoup\" : Nathalie Marquay dit la vérité sur sa relation avec Jacques Chirac... - Public", "description": "Depuis le début de la crise sanitaire, Sylvie Tellier a pris une belle initiative pour distraire ses abonnés. Elle avait expliqué le 23 mars dernier : \"Les miss s’invitent chez vous ! Dés demain à 17h30 je recevrai une Miss France sans fard et sans filtre pou…", "url": "https://www.public.fr/News/On-s-aimait-beaucoup-Nathalie-Marquay-dit-la-verite-sur-sa-relation-avec-Jacques-Chirac-1639627", "urlToImage": null, "publishedAt": "2020-04-23T19:27:23Z", "content": "Depuis le début de la crise sanitaire, Sylvie Tellier a pris une belle initiative pour distraire ses abonnés. Elle avait expliqué le 23 mars dernier : \"Les miss sinvitent chez vous ! Dés demain à 17h30 je recevrai une Miss France sans fard et sans filtre pour… [+2363 chars]"}, {"source": {"id": null, "name": "Closermag.fr"}, "author": "Mélody Husson Garnier", "title": "Katy Perry enceinte : ces révélations préoccupantes sur son couple avec Orlando Bloom - Closer France", "description": "D'ici quelques mois, Katy Perry et Orlando Bloom vont donner naissance à leur premier enfant. Seulement ces derniers temps, le couple des deux tourtereaux battrait de l'aile...", "url": "https://www.closermag.fr/people/katy-perry-enceinte-ces-revelations-preoccupantes-sur-son-couple-avec-orlando-bl-1105947", "urlToImage": null, "publishedAt": "2020-04-23T17:42:35Z", "content": "\"Hot N Cold\", ces quelques mots chantés par Katy Perry dans sa célèbre chanson de 2008 font désormais état de son couple. La chanteuse américaine est en couple avec Orlando Bloom ; tous les deux sont fiancés depuis février 2019. Les tourtereaux attendent leur… [+1598 chars]"}, {"source": {"id": null, "name": "Programme-tv.net"}, "author": "Vincent Labille", "title": "Déconfinement : Philippe Etchebest pointe \"les contradictions\" du gouvernement sur les mesures prises (VIDEO) - Télé Loisirs.fr", "description": "En duplex de Punchline ce jeudi soir, Philippe Etchebest a estimé que les nombreuses mesures qui vont permettre le déconfinement sont parfois \"contradictoires.\" Il s'en est expliqué.", "url": "https://www.programme-tv.net/news/tv/253517-deconfinement-philippe-etchebest-pointe-les-contradictions-du-gouvernement-sur-les-mesures-prises-video/", "urlToImage": null, "publishedAt": "2020-04-23T17:03:46Z", "content": "À un peu plus de deux semaines du déconfinement, les choses commencent enfin à se préciser. Emmanuel Macron a tranché ce jeudi après-midi, via un communiqué fixant les grands axes et les principales mesures qui entreront en vigueur dès le 11 mai. Reste un \"gr… [+1963 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "C.R.", "title": "« Westworld » : Une saison 4 officiellement commandée par HBO - 20minutes.fr", "description": "« Westworld » saison 4, c’est officiel ! La série HBO créée par Jonathan Nolan et Lisa Joy se poursuivra au-delà des épisodes actuellement diffusés", "url": "https://www.20minutes.fr/arts-stars/serie/2766655-20200423-westworld-saison-4-officiellement-commandee-hbo", "urlToImage": null, "publishedAt": "2020-04-23T16:27:35Z", "content": "« Westworld » connaîtra une saison 4, et potentiellement plus ! © 2018 Home Box Office, Inc. All rights reserved\r\nLe suspense nétait pas insoutenable, mais voilà les fans rassurés. Alors que la saison 3 a été lancée au mois de mars, Westworld voit déjà son fu… [+1086 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "F.R.", "title": "Coronavirus : Orelsan vend ses disques d’or aux enchères pour la bonne cause - 20 Minutes", "description": "Le rappeur emboîte le pas à Jul en mettant à son tour en vente plusieurs disques d'or, de platine et de diamant au profit de la Fondation des hôpitaux de France", "url": "https://www.20minutes.fr/arts-stars/culture/2766627-20200423-coronavirus-orelsan-vend-disques-or-encheres-bonne-cause", "urlToImage": null, "publishedAt": "2020-04-23T16:20:41Z", "content": "Orelsan à Paris, en octobre 2019. FRANCOIS GUILLOT / AFP\r\nLa semaine dernière Jul mettait en vente aux enchères une trentaine de disques dor, de platine et de diamant au profit du Fonds daide durgence de la Fondation des hôpitaux de France. Dans la foulée plu… [+969 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Meghan Markle et Harry barricadés à Los Angeles : paranoïa et spleen au programme - Yahoo Actualités", "description": null, "url": "https://consent.yahoo.com/collectConsent?sessionId=1_cc-session_1c70f8a6-0587-4471-a68a-c69f2efc27d1&lang=fr-FR&inline=false", "urlToImage": null, "publishedAt": "2020-04-23T16:06:00Z", "content": "Yahoo fait partie de Verizon Media. Cliquez sur J'accepte afin dautoriser Verizon Media et ses partenaires à utiliser des cookies et des technologies similaires pour accéder à votre appareil, utiliser vos données (y compris votre position géographique), compr… [+596 chars]"}, {"source": {"id": null, "name": "20minutes.fr"}, "author": "20 Minutes avec agences", "title": "Halle Berry raconte comment Pierce Brosnan lui a sauvé la vie sur le tournage de « Meurs un Autre Jour » - 20 Minutes", "description": "L’actrice était en train de s’étouffer avec une figue", "url": "https://www.20minutes.fr/arts-stars/people/2766479-20200423-halle-berry-raconte-comment-pierce-brosnan-sauve-vie-tournage-meurs-autre-jour", "urlToImage": null, "publishedAt": "2020-04-23T15:52:50Z", "content": "L'actrice Halle Berry Jay L. Clendenin/Los Angeles Times/Polaris/Starface\r\nHalle Berry aurait bien pu ne pas survivre au tournage de Meurs un Autre Jour. Lors dune des scènes du film de 2002, lactrice devait se montrer sexy et séduire \r\nJames Bond à laide dun… [+864 chars]"}, {"source": {"id": "le-monde", "name": "Le Monde"}, "author": "Renaud Machart", "title": "« Dérapages » avec Eric Cantona : un jeu de rôle en entreprise tourne à la manipulation sociale - Le Monde", "description": "Adaptée par Pierre Lemaître de son propre roman « Cadres noirs », la nouvelle mini-série d’Arte vaut pour le jeu de ses acteurs.", "url": "https://www.lemonde.fr/culture/article/2020/04/23/derapages-un-jeu-de-role-en-entreprise-tourne-a-la-manipulation-sociale_6037554_3246.html", "urlToImage": null, "publishedAt": "2020-04-23T15:00:11Z", "content": "Eric Cantona (Alain Delambre) dans la série « Dérapages »,  de Ziad Doueiri. STÉPHANIE BRANCHU/ARTE\r\nARTE - JEUDI 23 AVRIL À 20 H 55 - MINISÉRIE\r\nAlain Delambre (Eric Cantona) a « plus de 50 ans, moins de 60 », âge critique pour retrouver du boulot, surtout q… [+2568 chars]"}, {"source": {"id": null, "name": "Huffingtonpost.fr"}, "author": "Khalil Kajehi", "title": "Musso, Minier, Dicker... Les romans de l'été de retour en librairie à partir du 20 mai - Le HuffPost", "description": "Les best-sellers de l’été, dont la publication avait été reportée en raison de l’épidémie de coronavirus, seront disponibles en librairie après la fin du confinement.", "url": "https://www.huffingtonpost.fr/entry/musso-minier-les-romans-de-lete-de-retour-en-librairie-a-partir-du-20-mai_fr_5ea18dd3c5b69150246e6f02", "urlToImage": null, "publishedAt": "2020-04-23T13:32:53Z", "content": "CULTURE - “Cette fois ça y est chers lecteurs, le compte à rebours est lancé: La Vallée, que vous êtes nombreux à attendre, sera en librairie le 20 mai”, a annoncé jeudi Bernard Minier, un des auteurs majeurs du thriller français, sur son compte twitter.\r\nPub… [+1941 chars]"}, {"source": {"id": null, "name": "Programme-tv.net"}, "author": "Elise COMTE", "title": "Vianney : les deux bonnes nouvelles qui vont ravir ses fans ! (VIDEOS) - Télé Loisirs.fr", "description": "Vianney annonce non pas une, mais deux bonnes nouvelles à ses fans !", "url": "https://www.programme-tv.net/news/musique/253492-vianney-les-deux-bonnes-nouvelles-qui-vont-ravir-ses-fans-videos/", "urlToImage": null, "publishedAt": "2020-04-23T12:07:32Z", "content": "Révélé en 2014 par son tube Pas là,Vianney a conquis les foules à une vitesse fulgurante, récoltant rapidement deux Victoires de la musique et trouvant facilement sa place dans la chanson française, au point de signer l'hymne des Enfoirés, On trace. Il avait … [+1996 chars]"}, {"source": {"id": null, "name": "Francetvinfo.fr"}, "author": null, "title": "Covid-19 : \"Pata Pata\", le tube planétaire de Miriam Makeba ressort avec des paroles anticoronavirus - Franceinfo", "description": "", "url": "https://www.francetvinfo.fr/monde/afrique/cameroun/covid-19-pata-pata-le-tube-planetaire-de-miriam-makeba-ressort-avec-des-paroles-anticoronavirus_3930523.html", "urlToImage": null, "publishedAt": "2020-04-23T11:41:47Z", "content": "C'est la chanteuse béninoise Angélique Kidjo qui interprète la nouvelle version de \"Pata Pata\" dans le but d'encourager les gestes barrières sur tout le continent africain.\r\nLa chanson de renommée mondiale Pata Pata, tube de danse sud-africain sorti en 1967, … [+2391 chars]"}, {"source": {"id": null, "name": "Lesinrocks.com"}, "author": "Rémi Boiteux", "title": "Fiona Apple ou l'intime odyssée - Les Inrocks", "description": "On en “pince” terriblement pour le cinquième album - en 25 ans de carrière - de Fiona Apple. Un disque phénoménal qui concasse les genres, coupe les barrières, tord les idées préconçues. Ou quand une longue attente est récompensée par un possible jalon dans l…", "url": "https://www.lesinrocks.com/2020/04/23/musique/musique/fiona-apple-ou-lintime-odyssee/", "urlToImage": null, "publishedAt": "2020-04-23T10:58:34Z", "content": "On en pince terriblement pour le cinquième album - en 25 ans de carrière - deFiona Apple. Un disque phénoménal qui concasse les genres, coupe les barrières, tord les idées préconçues. Ou quand une longue attente est récompensée par un possible jalon dans lhis… [+2155 chars]"}, {"source": {"id": null, "name": "Closermag.fr"}, "author": "La rédaction", "title": "Iris Mittenaere : cette heureuse nouvelle qui lui redonne le sourire pendant le confinement - Closer France", "description": "Bonne et grande nouvelle pour Iris Mittenaere et son chérie Diego El Glaoui puisque sa soeur attend un heureux événement.", "url": "https://www.closermag.fr/people/iris-mittenaere-cette-heureuse-nouvelle-qui-lui-redonne-le-sourire-pendant-le-co-1105841", "urlToImage": null, "publishedAt": "2020-04-23T10:40:38Z", "content": "La famille d'Iris Mittenaere va s'agrandir ! Et oui : alors que le confinement imposé par la pandémie du coronavirus n'est pas tous les jours facile à vivre pour la reine de beauté, une heureuse nouvelle est tombée. Kenza El Glaoui, la soeur de son chéri Dieg… [+1584 chars]"}, {"source": {"id": null, "name": "Jeuxactu.com"}, "author": null, "title": "Star Wars : John Boyega et et Daisy Ridley balancent sur la toxicité des fans ! - FilmsActu", "description": "Alors que Star Wars 9 L'Ascension de Skywalker est désormais disponible en VOD, Daisy Ridley et John Boyega se lâchent... sur les fans et les réseaux sociaux !", "url": "https://cinema.jeuxactu.com/news-cinema-star-wars-john-boyega-et-et-daisy-ridley-balancent-sur-la-toxicite-des-fans-33035.htm", "urlToImage": null, "publishedAt": "2020-04-23T09:13:01Z", "content": "Films Actu - Toute l'actualité du film : Cinéma, DVD, Blu-Ray et Série TV. Critique de films, trailer, bande annonce, sorties vidéo, streaming &amp; fonds d'écran\r\n © 2007-2020 Filmsactu .com. Tous droits réservés. Reproduction interdite sans autorisation. \r\n… [+83 chars]"}, {"source": {"id": null, "name": "Public.fr"}, "author": null, "title": "Clémence Botino (Miss France) : son frère s'affiche torse nu sur Instagram et il est... CA-NON ! - Public.fr", "description": "Miss France 2020 a dévoilé, sur son compte Instagram, des photos de son frère, Lucas, torse nu... et nombreux sont les internautes à avoir craqué pour le jeune homme !", "url": "https://www.public.fr/Toutes-les-photos/Clemence-Botino-Miss-France-son-frere-s-affiche-torse-nu-sur-Instagram-et-il-est-CA-NON-1639564", "urlToImage": null, "publishedAt": "2020-04-23T07:15:00Z", "content": "Comme tous les Français, Clémence Botino est elle aussi confinée. D'ailleurs, Miss France a décidé de se réfugier chez ses parents, en Guadeloupe. \"J'étais partie là-bas pour passer quelques jours en famille quand le président de la République a annoncé le co… [+1183 chars]"}]}