{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Joshua Jones", "title": "WWE chief Vince McMahon claims Brock Lesnar is the reason why Raw’s ratings are in freefall - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/11472291/wwe-vince-mcmahon-brock-lesnar-raw-ratings-drop/", "urlToImage": null, "publishedAt": "2020-04-25T18:44:48Z", "content": "VINCE McMAHON claims Brock Lesnar is the reason for the dramatic fall in WWE Raw's ratings.\r\nViewing figures released on Thursday showed a 16 per cent drop off for one of WWE's flagship programmes.\r\n Vince McMahon has blamed WWE Raw's viewing figures falling … [+2189 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Peter Andre mocks wife Emily's unusual method as she battles hayfever on day off - Mirror Online", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiUmh0dHBzOi8vd3d3Lm1pcnJvci5jby51ay8zYW0vY2VsZWJyaXR5LW5ld3MvcGV0ZXItYW5kcmUtbW9ja3Mtd2lmZS1lbWlseXMtMjE5MjUxMzfSAVZodHRwczovL3d3dy5taXJyb3IuY28udWsvM2FtL2NlbGVicml0eS1uZXdzL3BldGVyLWFuZHJlLW1vY2tzLXdpZmUtZW1pbHlzLTIxOTI1MTM3LmFtcA?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T18:39:43Z", "content": null}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Rose Hill", "title": "Coronavirus: Sky News presenter breaks down as she reads out names of those who've died - Mirror Online", "description": "Sky News journalist Kimberley Leonard was forced to pause as she became tearful while reporting on the 20,319 deaths from covid-19 in the UK", "url": "https://www.mirror.co.uk/tv/tv-news/sky-news-presenter-breaks-down-21926415", "urlToImage": null, "publishedAt": "2020-04-25T18:37:34Z", "content": "A presenter broke down in tears live during a Sky News broadcast while reporting on the 20,319 deaths from coronavirus in the UK. \r\nSpeaking about the covid-19 pandemic on the channel earlier today, journalist Kimberley Leonard spoke about a handful of the pe… [+1655 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Lewis Knight", "title": "Prince William has unexpected issue with watching Tiger King on Netflix - Mirror Online", "description": "Prince William, Duke of Cambridge, took part in The Big Night In last night and told Stephen Fry just why he won't be watching Netflix docuseries Tiger King", "url": "https://www.mirror.co.uk/tv/tv-news/prince-william-unexpected-issue-watching-21921161", "urlToImage": null, "publishedAt": "2020-04-25T18:37:22Z", "content": "Prince William has delivered a hilarious reason for not watching hit Netflix series Tiger King.\r\n The Duke of Cambridge, 37, appeared on the BBC charity event The Big Night In which aimed to raise fund for front line workers. \r\nIn all, the effort amassed a wh… [+2312 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Laura Fox Rebecca Davison for MailOnline", "title": "Coronation Street's Bill Roache celebrates his 88th birthday in lockdown - Daily Mail", "description": "The veteran soap actor was surprised with gifts at his Wilmslow home by his daughter Verity, 39, and son James, 34, in snaps posted on the soap's official Twitter account on Saturday.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8256761/Coronation-Streets-Bill-Roache-celebrates-88th-birthday-lockdown.html", "urlToImage": null, "publishedAt": "2020-04-25T17:03:57Z", "content": "Coronation Street William Roache celebrated his 88th birthday at his home on Saturday, as filming for the soap continues be at a standstill.\r\nThe veteran soap actor was surprised with gifts at his Wilmslow home by his daughter Verity, 39, and son James, 34, i… [+6910 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Nika Shakhnazarova", "title": "Stacey Solomon hints fourth pregnancy is imminent as she swoons over Joe Swash - Mirror Online", "description": "Stacey Solomon, 30,felt herself falling for her man all over again as she watched him vacuumtheir artificial lawn at their Essex pad", "url": "https://www.mirror.co.uk/3am/celebrity-news/stacey-solomon-hints-fourth-pregnancy-21925985", "urlToImage": null, "publishedAt": "2020-04-25T16:39:48Z", "content": "Stacey Solomon has hinted a fourth pregnancy is imminent as she remains in lockdown with longtime love Joe Swash. \r\nThe mum-of-three, 30, felt herself falling for her man all over again as she watched him vacuum their artificial lawn at their Essex pad.\r\nSwoo… [+2344 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Kyle O'Sullivan", "title": "Gogglebox slammed for denying 'breaking' lockdown rules despite 'clear breaches' - Mirror Online", "description": "Gogglebox viewers have blasted Channel 4's 'patronising' message of reassurance as Izzi and Ellie Warner and the Siddiqui brothers move houses amid the coronavirus pandemic", "url": "https://www.mirror.co.uk/tv/tv-news/gogglebox-slammed-denying-breaking-lockdown-21923892", "urlToImage": null, "publishedAt": "2020-04-25T16:15:23Z", "content": "Gogglebox has been slammed for denying they are 'breaking' lockdown rules.\r\nOutraged viewers have blasted Channel 4 for their message of reassurance before tonight's programme aired.\r\nThe announcer said: \"Dont worry. Everyone on Gogglebox is following social … [+3936 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Jessica Gibb | Digital Assistant Showbiz Editor | Jessica.Gibb@the-sun.co.uk", "title": "Britain’s Got Talent’s Declan Donnelly pushes daughter Isla on her bike as he enjoys daily exercise with wife - The Sun", "description": "", "url": "http://www.thesun.co.uk/tvandshowbiz/11479077/britains-got-talent-declan-donnelly-pushes-daughter-isla/", "urlToImage": null, "publishedAt": "2020-04-25T16:03:36Z", "content": "DEC Donnelly was happily on dad duty today as he took his daughter Isla out for a stroll in the sunshine.\r\nThe Britain's Got Talent host pushed the one-year-old in her bike while chatting to wife Ali Astall.\r\n Dec Donnelly pushes his daughter Isla on their da… [+1857 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Captain Tom tops the charts at the age of 99 - BBC News - BBC News", "description": "Captain Tom Moore has become the oldest artist to reach the top spot of BBC Radio 1's The Official Chart. His rendition of You’ll Never Walk Alone is the fas...", "url": "https://www.youtube.com/watch?v=xM_S7qaYDiU", "urlToImage": null, "publishedAt": "2020-04-25T15:53:55Z", "content": "Captain Tom Moore has become the oldest artist to reach the top spot of BBC Radio 1's The Official Chart.\r\nHis rendition of Youll Never Walk Alone is the fastest-selling single of 2020, with 82,000 copies and proceeds going to the NHS Charities Together fund.… [+202 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Laura Fox For Mailonline", "title": "Lauren Goodger enjoys a socially distanced chat with her female pal in Epping Forest - Daily Mail", "description": "The ex-TOWIE star, 33, highlighted her toned physique as she ran into a female pal during the walk in Epping Forest on Wednesday, and chatted to her while adhering to social distancing rules.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8256447/Lauren-Goodger-enjoys-socially-distanced-chat-female-pal-Epping-Forest.html", "urlToImage": null, "publishedAt": "2020-04-25T15:32:36Z", "content": "Lauren Goodger was once again displaying her amazing curves in tight black sportswear on Wednesday as she embarked on her daily exercise in Epping Forest.\r\nThe ex-TOWIE star, 33, highlighted her toned physique as she ran into a female pal during the walk.\r\nDu… [+5498 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Seamus Duff", "title": "Inside billionaire Kylie Jenner's new $36 million seven bedroom home - Mirror Online", "description": "The price tag of $36 million will be but a drop in the ocean for billionaire Kylie Jenner – however it is believed she managed to haggle down the asking price from $55 million", "url": "https://www.mirror.co.uk/3am/celebrity-news/inside-billionaire-kylie-jenners-new-21924615", "urlToImage": null, "publishedAt": "2020-04-25T15:15:21Z", "content": "Kylie Jenner has spent a fortune snapping up a new mansion at the cost of $36 million which is small change to the self made billionaire.\r\nThe 22-year-old Keeping Up With The Kardashians star is said to have plashed the equivalent of £30 million on a new pad … [+3120 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Etienne Fermie", "title": "Mike Tyson admits his tigers could have come from convicted Netflix star Joe Exotic as he hails ‘ingenious m - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/11470033/mike-tyson-tigers-joe-exotic/", "urlToImage": null, "publishedAt": "2020-04-25T14:37:29Z", "content": "MIKE TYSON has admitted that his tigers may have come from jailed Netflix star Joe Exotic.\r\nThe boxing legend was renowned for owning the big cats at the height of his success in the 1990s.\r\n Tyson was renowned for keeping big cats as pets at the height of hi… [+2292 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Lucy Needham", "title": "Richard Sanders dead: Former Radio 4 presenter dies from coronavirus at 62 - Mirror Online", "description": "BBC Radio 4's Charlotte Smith announced the news to listeners on her show today", "url": "https://www.mirror.co.uk/3am/celebrity-news/breaking-richard-sanders-dead-ex-21925652", "urlToImage": null, "publishedAt": "2020-04-25T14:19:31Z", "content": "Former Radio 4 presenter Richard Sanders has died from coronavirus at the age of 62.\r\nThe former host of Farming Today contracted the deadly bug while in hospital, the show's current anchor Charlotte Smith told listeners today.\r\nAnnouncing the news, Charlotte… [+789 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Roxy Simons For Mailonline", "title": "Jeff Goldblum is BLASTED by RuPaul's Drag Race viewers for being 'anti-Muslim' - Daily Mail", "description": "The actor, 67, was a guest judge on Friday's edition of the show, and had asked drag queen Jackie Cox about her Stars And Stripes runway look which saw her wear a star-spangled hijab.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8256341/Jeff-Goldblum-BLASTED-RuPauls-Drag-Race-viewers-anti-Muslim.html", "urlToImage": null, "publishedAt": "2020-04-25T14:12:48Z", "content": "Jeff Goldblum has been hit by criticism from fans for being 'anti-Muslim' after his appearance on RuPaul's Drag Race.\r\nThe actor, 67, was a guest judge on Friday's edition of the show, and had asked drag queen Jackie Cox about her Stars And Stripes runway loo… [+4345 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Rianne Addo James Gant For Mailonline", "title": "The Rolling Stones land their first ever Number One on iTunes with 'Living in a Ghost Town' - Daily Mail", "description": "The single 'Living In A Ghost Town' - the British band's first for eight years - beat stars including Travis Scott, The Weeknd and Drake to reach the pinnacle.", "url": "https://www.dailymail.co.uk/news/article-8256265/The-Rolling-Stones-land-Number-One-iTunes-Living-Ghost-Town.html", "urlToImage": null, "publishedAt": "2020-04-25T13:57:17Z", "content": "The Rolling Stones have rocketed to the top of the iTunes chart more than 40 years after their last number one hit.\r\nThe single 'Living In A Ghost Town' - the band's first for eight years - beat stars including Travis Scott, The Weeknd and Drake to the peak o… [+7004 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "PA Media", "title": "Kanye West now worth $1.3bn, Forbes reports - The Guardian", "description": "Rapper took umbrage at omission from magazine’s annual list of billionaires and sent financial records", "url": "https://www.theguardian.com/music/2020/apr/25/kanye-west-now-worth-1-3bn-forbes-reports-billionaire", "urlToImage": null, "publishedAt": "2020-04-25T13:55:01Z", "content": "Kanye West is officially a billionaire, according to Forbes.\r\nThe magazine says the rapper and fashion designer, who has long coveted the status, gave it a glimpse into his personal finances, which led it to value his net worth at $1.3bn (£1.04bn).\r\nThat incl… [+1803 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Laura Fox For Mailonline", "title": "Amanda Holden flaunts her toned physique as she embarks on her daily exercise with her dog Rudie - Daily Mail", "description": "The Britain's Got Talent judge, 49, opted for a simple grey vest and matching leggins as she listened to music during her walk in the sunshine on Monday.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8256125/Amanda-Holden-flaunts-toned-physique-embarks-daily-exercise-dog-Rudie.html", "urlToImage": null, "publishedAt": "2020-04-25T13:27:38Z", "content": "She's been keeping fans up-to-date with her daily antics during lockdown.\r\nAnd Amanda Holden was proudly flaunting her svelte physique in tight grey sportswear as she embarked on her daily exercise with her pet dog Rudie on Monday.\r\nThe Britain's Got Talent j… [+2182 chars]"}, {"source": {"id": null, "name": "Indy100.com"}, "author": "Greg Evans", "title": "Trump is tweeting about professional wrestling just a day after US death toll surpasses 50,000 - indy100", "description": "", "url": "https://www.indy100.com/article/trump-coronavirus-wrestling-wwe-triple-h-twitter-9483866", "urlToImage": null, "publishedAt": "2020-04-25T13:27:20Z", "content": "On Friday, it was confirmed that more than 52,000 Americans had died from coronavirus, considerably more than any other nation in the world. On Saturday, Donald Trump tweeted about professional wrestling. \r\nNo, this isn't what Donald Trump calls 'fake news' b… [+1196 chars]"}, {"source": {"id": null, "name": "Examinerlive.co.uk"}, "author": "Zoe Forsey, Nisha Mal", "title": "The Queen uses her handbag to send secret signals to her staff - MyLondon", "description": "At events Her Majesty also uses her wedding ring to send signals to her staff", "url": "https://www.examinerlive.co.uk/news/uk-world-news/queen-uses-handbag-send-secret-18150315", "urlToImage": null, "publishedAt": "2020-04-25T13:18:00Z", "content": "The Queen sends secret signals to her staff members, to let them know when she is ready to leave an event or, when she wishes to end a conversation with someone.\r\nShe uses the little tricks to communicate with her staff, and let them know when they may need t… [+1399 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Holly Christodoulou", "title": "TV host John Stapleton pays emotional tribute after death of wife and ex-Watchdog presenter Lynn Faulds Wood - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11478707/lynn-faulds-wood-death-husband-tribute/", "urlToImage": null, "publishedAt": "2020-04-25T13:17:28Z", "content": "HEARTBROKEN journalist John Stapleton has paid tribute to his \"wonderful\" wife Lynn Faulds Wood after she died from a stroke.\r\nThe ex-BBC watchdog host, 72, tragically passed away surrounded by her family yesterday.\r\n TV presenter and cancer campaigner Lynn F… [+4490 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Rachel Cooke", "title": "'People fell under its spell': Shelley Klein on growing up in one of Britain's finest modernist houses - The Guardian", "description": "Textile designer Bernat Klein found solace in High Sunderland, his minimal 1950s house in the Scottish Borders. In her memoir, his daughter recalls returning to her childhood home", "url": "https://www.theguardian.com/artanddesign/2020/apr/25/people-fell-under-its-spell-shelley-klein-on-growing-up-in-one-of-britains-finest-modernist-houses", "urlToImage": null, "publishedAt": "2020-04-25T13:03:59Z", "content": "In December 2009, Shelley Klein left her home in the fishing village of Port Isaac, Cornwall, and set off for the house in the Scottish Borders where she had grown up. The 450-mile journey was ostensibly the result of her recent decision to move in with her e… [+13977 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "FIRST LOOK: Fayth Ifil gives a POWERFUL performance | BGT 2020 - Britain's Got Talent", "description": "See more from Britain's Got Talent at http://itv.com/talent Watch Britain's Got Talent: Unseen on the ITV HUB: https://bit.ly/2RreDOp Fayth Iful raised the b...", "url": "https://www.youtube.com/watch?v=FKCiZEbfLuc", "urlToImage": null, "publishedAt": "2020-04-25T13:01:50Z", "content": "See more from Britain's Got Talent at http://itv.com/talentWatch Britain's Got Talent: Unseen on the ITV HUB: https://bit.ly/2RreDOp\r\nFayth Iful raised the bar for all singers on Britain's Got Talent when she performed her sensational version of Tina Turner's… [+293 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Saturday Sessions: The Killers perform \"Blowback\" - CBS This Morning", "description": "Superstar band The Killers is performing for this week’s Saturday Sessions. The platinum-selling group from Las Vegas made their debut with their 2004 album ...", "url": "https://www.youtube.com/watch?v=e7M87Q77Ufc", "urlToImage": null, "publishedAt": "2020-04-25T12:56:02Z", "content": "Sign in to report inappropriate content.\r\nSign in"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "First edition of Roald Dahl book Gremlins up for auction - BBC South East Wales", "description": "A rare first edition of The Gremlins, which includes a personal note, is up for auction.", "url": "https://www.bbc.co.uk/news/uk-wales-52425960", "urlToImage": null, "publishedAt": "2020-04-25T12:50:39Z", "content": "Image copyrightHansons Auctioneers\r\nA rare first edition of Roald Dahl's book, The Gremlins, is due to go under the hammer in an online auction.\r\nIt includes a personal note given to Dahl's Second World War RAF comrade Wing Commander John Alexander which sugg… [+1685 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Roisin O'Connor", "title": "GMB host Kate Garraway says past few weeks have been 'hardest of my life' as husband battles coronavirus - The Independent", "description": "TV host has been playing music to her husband Derek Draper, who remains critically ill", "url": "https://www.independent.co.uk/arts-entertainment/tv/news/coronavirus-kate-garraway-husband-hospital-nhs-a9483776.html", "urlToImage": null, "publishedAt": "2020-04-25T12:39:20Z", "content": "Kate Garraway has shared a moving post about experiencing the hardest time of her life, as her husband, author and former lobbyist Derek Draper, remains in a critical condition from coronavirus.\r\nThe Good Morning Britain star wrote an article for her blog, Cl… [+1464 chars]"}, {"source": {"id": null, "name": "Whatculture.com"}, "author": "James Metcalfe", "title": "10 Most Underrated Horror Movie Sequels EVER - WhatCulture", "description": "Don't expect to see Halloween: Resurrection make the cut.", "url": "https://whatculture.com/film/10-most-underrated-horror-movie-sequels-ever", "urlToImage": null, "publishedAt": "2020-04-25T12:25:10Z", "content": "No genre of film does a sequel quite like the world of horror. From the heyday of the slasher subculture, the emergence of Scream-influenced parodies, to the modern day popularity of found footage and supernatural scares, if there's a popular franchise to mil… [+867 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Alessandra Scotto di Santolo", "title": "Kate Middleton’s trick to keep children at bay during lockdown - Express", "description": "Kate Middleton, the Duchess Of Cambridge, revealed that she tricked her children to continue doing school homework during the Easter holidays but Prince George might have sussed his mother's ploy.", "url": "https://www.express.co.uk/news/royal/1273770/kate-middleton-kate-middleton-news-duchess-of-cambridge-prince-william-royal-family", "urlToImage": null, "publishedAt": "2020-04-25T11:50:08Z", "content": null}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Lucy Needham, Charlotte Hadfield", "title": "Christine McGuinness proudly says she's 12 years sober with teenage throwback pic - Liverpool Echo", "description": "The 32-year-old looks completely different in a photo she shared on social media", "url": "https://www.liverpoolecho.co.uk/news/liverpool-news/christine-mcguinness-proudly-says-shes-18149518", "urlToImage": null, "publishedAt": "2020-04-25T11:48:54Z", "content": "Christine McGuiness has revealed that she's been sober for 12 years as she shared an unrecognisable photo of herself.\r\nThe 32-year-old, who is married to Paddy McGuiness, made the announcement on her Instagram page, alongside a photo of her teenage self holdi… [+2466 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Amalie Henden", "title": "Queen heartbreak: The real reason Prince Philip prefers to be away from Queen - Express", "description": "QUEEN ELIZABETH II and Prince Philip are currently isolating at Windsor Castle due to the coronavirus outbreak, but the Duke of Edinburgh usually prefers to spend his time elsewhere.", "url": "https://www.express.co.uk/news/royal/1273762/Queen-Elizabeth-II-news-relationship-Prince-Philip-lockdown-Royal-Family-news", "urlToImage": null, "publishedAt": "2020-04-25T10:51:01Z", "content": null}, {"source": {"id": null, "name": "Digitalspy.com"}, "author": "Joe Anderton", "title": "The Chase viewers baffled as Bradley Walsh awards 'incorrect' answer - digitalspy.com", "description": "Was the contestant actually right?", "url": "https://www.digitalspy.com/tv/a32275203/the-chase-bradley-walsh-awards-incorrect-answer/", "urlToImage": null, "publishedAt": "2020-04-25T10:34:00Z", "content": "We don't know if you've ever trawled The Chasehashtag on Twitter, but viewers of the ITV quiz show take it very seriously.\r\nCase in point, during yesterday's (April 25) episode, a young girl named Aislinn began her Cash Builder round with the question 'which … [+1746 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Brogan-Leigh Hurst", "title": "Demi Lovato describes social distancing as 'luxurious' and likens it to rehab - Mirror Online", "description": "Demi Lovato says she enjoys staying indoors and compared lockdown to her recent rehab stint following a near-fatal overdose in 2018", "url": "https://www.mirror.co.uk/3am/celebrity-news/demi-lovato-describes-social-distancing-21924694", "urlToImage": null, "publishedAt": "2020-04-25T10:33:43Z", "content": "Demi Lovato has compared social distancing to rehab and described staying at home as \"luxurious\". \r\nThe pop star, 27, admitted that social distancing hasn't been too much of a challenge for her as she likened it to her stint in rehab following a near-fatal ov… [+2489 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Rishma Dosani", "title": "Lord Of The Rings star Bruce Allpress dies aged 89 - Metro.co.uk", "description": "RIP.", "url": "https://metro.co.uk/2020/04/25/lord-rings-star-bruce-allpress-dies-aged-89-12608382/", "urlToImage": null, "publishedAt": "2020-04-25T10:05:07Z", "content": "Lord Of The Rings star Bruce Allpress has died, aged 89\r\nBruce Allpress has died, aged 89.\r\nThe actor, most known for his role in Lord Of The Rings, passed away in New Zealand on Thursday.\r\nA statement from his family, shared with Stuff.co.nz said he had died… [+2113 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Katie Fitzpatrick", "title": "Corrie fans left feeling sick by vile scene with Geoff - Manchester Evening News", "description": "A shocking diagnosis for the grandmother on Coronation Street", "url": "https://www.manchestereveningnews.co.uk/news/tv/coronation-street-last-night-geoff-18148589", "urlToImage": null, "publishedAt": "2020-04-25T08:39:35Z", "content": "Corrie viewers were horrified to see abuser Geoff Metcalfe leading his wife upstairs at the end of Friday's episode.\r\nFans have had enough of Yasmeen being pushed around by her bullying and manipulative husband, and they were sickened to see him cosying up to… [+2709 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Coronavirus: Top stories this morning - BBC Breakfast | BBC - BBC", "description": "Subscribe and 🔔 to OFFICIAL BBC YouTube 👉 https://bit.ly/2IXqEIn Stream original BBC programmes FIRST on BBC iPlayer 👉 https://bbc.in/2J18jYJ 🔘 Subscribe and...", "url": "https://www.youtube.com/watch?v=m4O-PBa-P2I", "urlToImage": null, "publishedAt": "2020-04-25T08:03:11Z", "content": null}, {"source": {"id": null, "name": "Nme.com"}, "author": null, "title": "Post Malone’s Nirvana tribute livestream sounded like a wild and heavy garage band in rehearsal - NME Live", "description": "With Blink-182's Travis Barker on drums and the approval of Courtney Love and Krist Novoselić, this COVID-19 charity gig rocked and raised funds", "url": "https://www.nme.com/reviews/live/post-malone-nirvana-tribute-livestream-travis-barker-covid-19-coronavirus-2653588", "urlToImage": null, "publishedAt": "2020-04-25T07:50:45Z", "content": "The atmosphere at Post Malones Nirvana tribute livestream is a far cry from that of his mammoth stadium shows; it’s more like sitting around in a garage with your mates band rehearsing. The YouTube gig isn’t polished but that wasnt the point: it’s intimate, l… [+3555 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Sophie Roberts, Kelly-Ann Mills", "title": "Tattoo addict model, 24, shares jaw-dropping photo of how she looked before inkings - Mirror Online", "description": "Australian model Amber Luke has spent more than £20,000 on over 100 tattoos and piercings, as well as changing her eye colour. She boasts thousands of followers who adore her body art", "url": "https://www.mirror.co.uk/news/weird-news/tattoo-addict-model-24-shares-21915331", "urlToImage": null, "publishedAt": "2020-04-25T07:45:20Z", "content": "A model who shot to fame when she started sharing photos of her intricate body art has shocked people with her latest image.\r\nAmber Luke, who has spent more than £20,000 on her tattoos, has posted images when her skin was clear, before she began the inkwork.\r… [+2291 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Martin Chilton", "title": "‘I don’t believe in God – I believe in Al Pacino’: How one of our greatest living actors kicked his boozy, brawling ways - The Independent", "description": "As the star of ‘Scarface’ and ‘The Godfather’ turns 80, Martin Chilton looks back at his drunken early years and his ascent to Oscar-winning glory", "url": "https://www.independent.co.uk/arts-entertainment/films/features/al-pacino-interview-godfather-serpico-scarface-alcohol-career-best-movies-a9481701.html", "urlToImage": null, "publishedAt": "2020-04-25T07:06:06Z", "content": "Al Pacino spent much of the Seventies in a drunken haze. The Oscar-winning star of the Godfather trilogy, Serpico, Scarface and Scent of a Woman has been teetotal for more than four decades now, and is about to soberly celebrate his 80th birthday. But he dran… [+28283 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Manon Dark", "title": "Meghan Markle could face father in court as family tensions boil over - Express", "description": "MEGHAN MARKLE could face her father, Thomas Markle, in court over a dispute fuelled by an article published in the Mail on Sunday.", "url": "https://www.express.co.uk/news/royal/1273682/Meghan-Markle-royal-news-court-mail-on-sunday-sue-father-Thomas-Markle", "urlToImage": null, "publishedAt": "2020-04-25T04:53:13Z", "content": null}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Seamus Duff", "title": "Will and Grace ends on sour note as show makers admit cast backstage 'squabble' - Mirror Online", "description": "The rumours that show stars Debra Messing and Megan Mullaly had an epic behind-the-scenes fall out were all but confirmed by show creators David Kohan and Max Mutchnick", "url": "https://www.mirror.co.uk/tv/tv-news/grace-ends-sour-note-show-21924530", "urlToImage": null, "publishedAt": "2020-04-25T03:07:52Z", "content": "Long running comedy Will and Grace has come to a bitter end as two of the top cast had a fall out, show creators admitted.\r\n The hit US sitcom has run for 22-years and more than 240 episodes with eight seasons running between between 1998 and 2006 before the … [+2207 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Bethany Minelle", "title": "Coronavirus: Portrait Artist Of The Year on Sky Arts gets lockdown makeover - Sky News", "description": "Budding artists can paint celebrity sitters from their homes and Portrait Artist Of The Week will be selected on Instagram.", "url": "https://news.sky.com/story/coronavirus-portrait-artist-of-the-year-gets-a-lockdown-makeover-11978371", "urlToImage": null, "publishedAt": "2020-04-25T02:16:34Z", "content": null}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Shannon Power", "title": "Kate Garraway having ‘hardest time of her life’ as she discusses husband Derek’s critical condition fighting c - The Sun", "description": "", "url": "http://www.thesun.co.uk/tvandshowbiz/11475998/kate-garraway-husband-coronavirus/", "urlToImage": null, "publishedAt": "2020-04-25T01:59:01Z", "content": "KATE Garraway has told fans she is going through the \"hardest\" time in her life as her husband Derek Draper is in a critical condition fighting coronavirus.\r\nThe Good Morning Britain presenter opened up about her struggles on her personal blog.\r\n Kate Garrawa… [+2846 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Daniel Pateman", "title": "How to watch RuPaul’s Secret Celebrity Drag Race: stream the new show online from anywhere - TechRadar", "description": "Celebs sissy that walk for surprise four-part series", "url": "https://www.techradar.com/news/how-to-watch-rupauls-secret-celebrity-drag-race-stream-the-new-show-online-from-anywhere", "urlToImage": null, "publishedAt": "2020-04-25T01:31:10Z", "content": "The library has re-opened and its time to get back to werk. Not IRL, of course, but for Drag Race fans Mother Ru brings great news: a top secret, four-episode incarnation of Drag Race in which famous celebrities sashay down the runway. Its just what we need r… [+4552 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Sam Baker For Mailonline", "title": "Princess Eugenie and husband Jack Brooksbank celebrate their 10th anniversary with Instagram snap - Daily Mail", "description": "Princess Eugenie took to Instagram to celebrate her anniversary with husband Jack Brookshank by posting a loved-up picture. In the post the tenth-in-line said her and her husband were lucky to be together.", "url": "https://www.dailymail.co.uk/news/article-8255567/Princess-Eugenie-husband-Jack-Brooksbank-celebrate-10th-anniversary-Instagram-snap.html", "urlToImage": null, "publishedAt": "2020-04-25T00:51:50Z", "content": "Princess Eugenie took to Instagram to celebrate her anniversary with husband Jack Brookshank by posting a loved-up picture.\r\nThe 30-year-old married her husband on October 12 2018 but the couple met when Princess Eugenie was skiing in Verbier, Switzerland, an… [+4055 chars]"}, {"source": {"id": null, "name": "Digitalspy.com"}, "author": "Justin Harp", "title": "Two Spider-Man movies and Thor Love and Thunder delayed - digitalspy.com", "description": "Doctor Strange in the Multiverse of Madness is moving, too.", "url": "https://www.digitalspy.com/movies/a32273576/spider-man-3-thor-doctor-strange-delayed/", "urlToImage": null, "publishedAt": "2020-04-25T00:50:00Z", "content": "Marvel release dates are in flux once again thanks to coronavirus.\r\nThe latest in the game of superhero musical chairs came on Friday (April 24) when Sony announced that it was officially delaying the release dates of two upcoming Spider-Man movies.\r\nNow, Spi… [+1728 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Sara-Aisha Kent", "title": "Watchdog's Lynn Faulds Wood bravely beat cancer twice before tragic death from stroke - Mirror Online", "description": "Former Watchdog host Lynn Faulds Wood, who died today at the age of 72 from a \"massive\" stroke, beat both skin and bowel cancer before her death", "url": "https://www.mirror.co.uk/3am/celebrity-news/watchdogs-lynn-faulds-wood-bravely-21923092", "urlToImage": null, "publishedAt": "2020-04-25T00:18:38Z", "content": "Lynn Faulds Wood sadly died at the age of 72 from a stroke today. \r\nThe former Watchdog presenter battled cancer twice before she died and used her experience to help others who were diagnosed with the disease.\r\nShe bravely got through a diagnosis of skin can… [+2892 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Eurovision Again: Why fans of the song contest get together every Saturday - BBC News", "description": "Fans of the song contest are re-watching old competitions as \"a distraction from all the bad stuff\".", "url": "https://www.bbc.com/news/newsbeat-52381023", "urlToImage": null, "publishedAt": "2020-04-24T23:41:36Z", "content": "Image copyrightGetty Images\r\nIn the absence of this year's Eurovision Song Contest, cancelled because of the coronavirus pandemic, fans are reliving old competitions every Saturday night.\r\nEurovision Again - watched in sync at 8pm British time on YouTube - co… [+3683 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Frank Skinner: Will Gompertz reviews the comedian's poetry podcast on Absolute Radio ★★★★☆ - BBC News", "description": "It's a simple idea presented by someone who brings insight to an art form that is enjoying a resurgence.", "url": "https://www.bbc.co.uk/news/entertainment-arts-52403782", "urlToImage": null, "publishedAt": "2020-04-24T23:22:37Z", "content": "Odd combinations have long been a staple of the entertainment industry. For those old enough to have seen it (still available on YouTube), who can forget Prince Edward's cringe-inducing toe-dip into television production with the culture-clash that was It's A… [+9011 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Kathryn Ingate", "title": "Piers Morgan: GMB host issues apology to Ofcom after hitting back at 2,000 complaints - Express", "description": "PIERS MORGAN has issued an apology to Ofcom on Twitter after hitting back at complaints that were sent to the broadcasting regulator following his interviews with MPs on Good Morning Britain.", "url": "https://www.express.co.uk/celebrity-news/1273604/Piers-Morgan-Twitter-apology-ofcom-complaints-Good-Morning-Britain-news-latest", "urlToImage": null, "publishedAt": "2020-04-24T19:15:13Z", "content": null}, {"source": {"id": null, "name": "Somersetlive.co.uk"}, "author": "Rod Minchin, Jack Colwill", "title": "Eddie Large: Children and Syd Little attend comedian's funeral as mourners line streets in Somerset - Somerset Live", "description": "The much-loved comedian was laid to rest today with just ten family and friends in attendance", "url": "https://www.somersetlive.co.uk/news/somerset-news/eddie-large-children-funeral-portishead-4077800", "urlToImage": null, "publishedAt": "2020-04-24T19:09:08Z", "content": "Hundreds of mourners have lined the streets to pay their respects to comedy great Eddie Large as his funeral took place in Portishead.\r\nMembers of the public carefully followed social distancing guidelines to applaud as the hearse carrying the comedians coffi… [+1389 chars]"}, {"source": {"id": null, "name": "Denofgeek.com"}, "author": null, "title": "Netflix’s Extraction Director Breaks Down That One-Take Action Sequence - Den of Geek UK", "description": "Director Sam Hargrave walks us through the stunning 11-minute scene at the heart of Extraction.", "url": "https://www.denofgeek.com/movies/netflix-extraction-one-take-action-sequence/", "urlToImage": null, "publishedAt": "2020-04-24T18:53:00Z", "content": "Hargrave adds, A lot of times, and in this case, it comes down to perspective: how you photograph it and how you present the action to the audience. We’re obviously not the first ones to have done an extended take. 1917 came out, and we did a long thing in At… [+2213 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Helena Vesty", "title": "The Bolton key workers who made it into Peter Kay's Amarillo video - Manchester Evening News", "description": "The famous video was recreated 15 years after it was first released", "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/peter-kay-amarillo-bolton-workers-18145560", "urlToImage": null, "publishedAt": "2020-04-24T18:08:27Z", "content": "From his back garden in Bolton, Peter Kay revealed his recreation of his Amarillo video live on the BBC's Big Night In on Thursday evening - and Bolton's key workers made an appearance. \r\nThe charity single was released in 2005 for Comic Relief and the music … [+2709 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Joe Brophy", "title": "Dwayne ‘The Rock’ Johnson congratulates ‘kindred spirit’ Triple H for 25 years in WWE in heartfelt message - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/11474011/dwayne-johnson-the-rock-congratulates-triple-h-wwe/", "urlToImage": null, "publishedAt": "2020-04-24T17:58:42Z", "content": "DWAYNE 'The Rock' Johnson has congratulated \"kindred spirit\" Triple H for his illustrious 25 years in WWE by sending a heartfelt video message.\r\nThe Brahma Bull and the Game became two of the biggest wrestlers in the world working under Vince McMahon in the c… [+3821 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Phoebe Waller-Bridge's hilariously X-RATED wall art revealed! | The Graham Norton Show - BBC - BBC", "description": "Subscribe and 🔔 to OFFICIAL BBC YouTube 👉 https://bit.ly/2IXqEIn Stream original BBC programmes FIRST on BBC iPlayer 👉 https://bbc.in/2J18jYJ Graham Norton i...", "url": "https://www.youtube.com/watch?v=hSwK3Kxghj0", "urlToImage": null, "publishedAt": "2020-04-24T17:00:32Z", "content": "Subscribe and to OFFICIAL BBC YouTube https://bit.ly/2IXqEInStream original BBC programmes FIRST on BBC iPlayer https://bbc.in/2J18jYJ\r\nGraham Norton is horrified by some of Phoebe Waller-Bridge's rather unusual art.\r\nGraham is joined in his virtual studio by… [+729 chars]"}, {"source": {"id": null, "name": "Officialcharts.com"}, "author": null, "title": "Live Lounge Allstars charity single enters Top 5 just hours after release - Official Charts Company", "description": "Some of the biggest names in music teamed up for the cover of the Foo Fighters hit.", "url": "https://www.officialcharts.com/chart-news/bbc-radio-1s-live-lounge-allstars-charity-single-times-like-these-enters-top-5-just-hours-after-its-release__29567/", "urlToImage": null, "publishedAt": "2020-04-24T16:23:42Z", "content": "BBC Radio 1's Stay Home Live Lounge charity single is off to an incredible start on the Official Single, landing in the Top 5 debut with just 12 hours' worth of sales.\r\nThe song by the Live Lounge Allstars - made up of 23 of the biggest names in music includi… [+935 chars]"}, {"source": {"id": null, "name": "Nme.com"}, "author": null, "title": "The Killers tell us about their epic new single ‘Fire In Bone’ and rescheduled UK and Ireland tour dates - NME Live", "description": "The Killers have shared their new single 'Fire & Bone', as well as announcing details of their postponed UK and Ireland stadium tour dates.", "url": "https://www.nme.com/news/music/the-killers-uk-stadium-tour-2021-postponed-new-single-fire-bone-imploding-mirage-2652738", "urlToImage": null, "publishedAt": "2020-04-24T16:20:42Z", "content": "The Killers have shared their new single ‘Fire In Bone’, as well as delaying their album release date announcing details of their postponed UK and Ireland stadium tour dates. Check out the track and the new dates below.\r\nFollowing on from lead single ‘Caution… [+3567 chars]"}, {"source": {"id": null, "name": "Givemesport.com"}, "author": "Matthew Lee", "title": "Travis Scott performs live to over 12m people in record-breaking Fortnite concert - GIVEMESPORT", "description": "Travis Scott performs live to over 12m people in record-breaking Fortnite concert", "url": "https://www.givemesport.com/1564673-travis-scott-performs-live-to-over-12m-people-in-recordbreaking-fortnite-concert", "urlToImage": null, "publishedAt": "2020-04-24T16:18:29Z", "content": "Popular musician Travis Scott has found a new way to keep his followers entertained - performing live to over 12 million people on the video game Fortnite.\r\nThe music industry is one of a number of sectors suffering as a result of the coronavirus pandemic.\r\nL… [+1570 chars]"}, {"source": {"id": null, "name": "Thetimes.co.uk"}, "author": "Hugo Rifkind", "title": "Gangs of London review — you'll need the patience and stomach for gore, but I love it - The Times", "description": "Gangs of London(Sky Atlantic)After Life(Netflix)Celebrity SAS: Who Dares Wins(Channel 4)They don’t quite have all the gangs of London in Gangs of London. No sign as yet, for example, of the north", "url": "https://www.thetimes.co.uk/article/gangs-of-london-review-youll-need-the-patience-and-stomach-for-gore-but-i-love-it-cw23hljkh", "urlToImage": null, "publishedAt": "2020-04-24T16:00:00Z", "content": "Gangs of London(Sky Atlantic)After Life(Netflix)Celebrity SAS: Who Dares Wins(Channel 4)\r\nThey dont quite have all the gangs of London in Gangs of London. No sign as yet, for example, of the north London middle-class parents gang. You want to see some of thos… [+443 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "James Whitbrook", "title": "Watch the Stars of Doctor Who Spend Time Together (Remotely) - Gizmodo", "description": "Last night in the UK, the BBC and charities Comic Relief and Children in Need hosted a special fundraising event called The Big Night In to raise money for UK healthcare workers currently on the front lines of the country’s response to the coronavirus pandemi…", "url": "https://io9.gizmodo.com/watch-the-stars-of-doctor-who-spend-time-together-remo-1843043506", "urlToImage": null, "publishedAt": "2020-04-24T15:15:00Z", "content": "Last night in the UK, the BBC and charities Comic Relief and Children in Need hosted a special fundraising event called The Big Night In to raise money for UK healthcare workers currently on the front lines of the countrys response to the coronavirus pandemic… [+1259 chars]"}, {"source": {"id": null, "name": "Indy100.com"}, "author": "Joanna Taylor", "title": "Tom Hanks wrote a letter to a boy named Corona who was being bullied and it's perfect - indy100", "description": "", "url": "https://www.indy100.com/article/tom-hanks-typewriter-young-fan-corona-australia-9482646", "urlToImage": null, "publishedAt": "2020-04-24T15:01:29Z", "content": "People are obsessed with \"hero\" Tom Hanks's heartwarming gesture to an eight-year-old boy being bullied because his name is Corona. \r\nCorona De Vries, who lives on Australia's Gold Coast, wrote to Tom Hanks and his wife Rita Wilson in early April to wish them… [+1923 chars]"}, {"source": {"id": null, "name": "Thenational.scot"}, "author": "Emer O'Toole", "title": "TRNSMT forced to issue clarification after blaming Nicola Sturgeon for cancellation - The National", "description": "ORGANISERS of Scottish music festival TRNSMT have been forced to issue a clarification after their original statement about cancelling the event…", "url": "https://www.thenational.scot/news/18403899.trnsmt-issues-clarification-blaming-nicola-sturgeon-cancellation/", "urlToImage": null, "publishedAt": "2020-04-24T14:05:40Z", "content": "ORGANISERS of Scottish music festival TRNSMT have been forced to issue a clarification after their original statement about cancelling the event appeared to blame Nicola Sturgeon. \r\nBosses said in a statement this morning that \"due to the comments made by the… [+2577 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nEd Power", "title": "After The Big Night In, does Little Britain deserve a Netflix comeback? - Telegraph.co.uk", "description": "Matt Lucas and David Walliams brought Little Britain back for The Big Night In. Ed Power asks if the sketch comedy show could survive today", "url": "https://www.telegraph.co.uk/tv/2020/04/24/big-night-does-little-britain-deserve-netflix-comeback/", "urlToImage": null, "publishedAt": "2020-04-24T13:38:00Z", "content": "The real question, of course, is whether Little Britain has a future outside the novel environment of a pandemic telethon? Williams and Lucas retired their gonzo double-act after a 2009 Comic Relief special. But by that point the original series was already p… [+1054 chars]"}, {"source": {"id": null, "name": "Bristolpost.co.uk"}, "author": "Conor Gogarty", "title": "Statement issued on whether Bristol Banksy piece's new face mask will be removed - Bristol Post", "description": "The site is a specially protected \"character building\"", "url": "https://www.bristolpost.co.uk/news/bristol-news/banksy-harbourside-face-mask-coronavirus-4072489", "urlToImage": null, "publishedAt": "2020-04-24T13:06:59Z", "content": "The new face mask on Banksy's famous Girl with a Pierced Eardrum graffiti seems set to stay.\r\nThe Bristolian guerilla artist's parody of Johannes Vermeer's Girl with a Pearl Earring painting first appeared on the side of an Albion Docks building at Bristol Ha… [+1776 chars]"}, {"source": {"id": null, "name": "Whats-on-netflix.com"}, "author": "Jacob Robinson", "title": "What’s New on Netflix UK: April 24th, 2020 - What's on Netflix", "description": "There are 6 excellent new additions to be enjoyed on Netflix UK today. If you're looking for laughs, action-fu", "url": "https://www.whats-on-netflix.com/whats-new/uk/whats-new-on-netflix-uk-april-24th-2020/", "urlToImage": null, "publishedAt": "2020-04-24T12:28:00Z", "content": "After Life season 2 is now available to stream on Netflix UK\r\nThere are 6 excellent new additions to be enjoyed on Netflix UK today. If you’re looking for laughs, action-fueled drama, or some feel-good fun, there’s something for everyone on Netflix UK for Apr… [+2661 chars]"}, {"source": {"id": null, "name": "Nme.com"}, "author": null, "title": "Ricky Gervais hits out at celebrities for viral 'Imagine' singing video: “It was an awful rendition” - NME Live", "description": "Ricky Gervais has shared his opinions on the viral video that showed a host of celebrities performing a cover of John Lennon’s Imagine.", "url": "https://www.nme.com/news/tv/ricky-gervais-hits-out-at-celebrities-for-viral-imagine-singing-video-it-was-an-awful-rendition-2653204", "urlToImage": null, "publishedAt": "2020-04-24T12:17:14Z", "content": "Ricky Gervais has shared his opinion on the viral video that showed a host of celebrities performing a cover of John Lennons ‘Imagine’.\r\nLast month, Wonder Woman star Gal Gadot led a star-studded rendition of the iconic song as coronavirus spread across the g… [+1593 chars]"}, {"source": {"id": null, "name": "Indy100.com"}, "author": "Greg Evans", "title": "Prince Charles and Camilla clapping for carers might be the most awkward thing you'll see today - indy100", "description": "", "url": "https://www.indy100.com/article/prince-charles-camilla-clap-for-our-carers-coronavirus-nhs-9481651", "urlToImage": null, "publishedAt": "2020-04-24T10:25:45Z", "content": "Clapping for health care workers every Thursday evening has now become as fine a British tradition as the Sunday roast or forgetting to put the bins out. \r\nThe initiative which started around the start of lockdown aims to show appreciation to the NHS and care… [+1817 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: 'We're giving our tour buses to the NHS' - BBC News", "description": "Buses which are usually home to rock stars are now giving frontline workers a place to rest.", "url": "https://www.bbc.com/news/newsbeat-52410888", "urlToImage": null, "publishedAt": "2020-04-24T10:18:06Z", "content": "Image copyrightVans For BandsImage caption\r\n Buses have been deployed all over the UK including this one at The Whittington NHS Trust in London\r\nMusic fans won't need reminding there are no live gigs happening at the moment.\r\nAs well as empty venues and festi… [+4092 chars]"}, {"source": {"id": null, "name": "Theguardian.commusic"}, "author": "Ben Beaumont-Thomas", "title": "Taylor Swift disowns new live album, calling it 'shameless greed' - The Guardian", "description": "Singer complains of ‘tasteless’ release amid coronavirus crisis by former label Big Machine, owned by frequent adversary Scooter Braun", "url": "https://amp.theguardian.commusic/2020/apr/24/taylor-swift-disowns-new-live-album-scooter-braun-big-machine", "urlToImage": null, "publishedAt": "2020-04-24T09:49:00Z", "content": "Taylor Swift has disowned a new live album released under her name, calling it tasteless and shameless greed amid the coronavirus outbreak.\r\nThe album, Live from Clear Channel Stripped 2008, was recorded when Swift was 18, around the release of her Grammy-win… [+1225 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "George Griffiths", "title": "Parks and Recreation cast returning for coronavirus one-off special - Metro.co.uk", "description": "Hint: she's got a ring binder for everything.", "url": "https://metro.co.uk/2020/04/24/parks-recreation-cast-reuniting-special-one-off-episode-show-us-lesley-knope-deals-coronavirus-12602798/", "urlToImage": null, "publishedAt": "2020-04-24T06:51:19Z", "content": "Lesley Knope is back to save us all from coronavirus (Picture: NBC)\r\nThe cast of Parks and Recreation will be reuniting for a special one-off episode of the beloved sitcom. \r\nLuckily, this will show us how everyones favourite politician, Lesley Knope (Amy Poe… [+2249 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Alexandra Rucki", "title": "Beyonce donates $6m to coronavirus relief effort in US cities - Manchester Evening News", "description": "Money will be going to frontline workers and people affected by the pandemic", "url": "https://www.manchestereveningnews.co.uk/news/world-news/beyonce-coronavirus-donations-usa-twitter-18142005", "urlToImage": null, "publishedAt": "2020-04-24T06:44:43Z", "content": "Beyonce has joined forced with Twitter CEO Jack Dorsey to donate six million dollars (£4.9 million) to the coronavirus relief effort.\r\nThe pop singer's BeyGood foundation announced the donation on Thursday, with the money going to frontline workers and people… [+1223 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nHarry Mount", "title": "How the Queen comes into her own during a crisis - Telegraph.co.uk", "description": "Why do we turn to the Queen during crises – and how does she know instinctively what to say? In the week she turns 94, Harry Mount reports", "url": "https://www.telegraph.co.uk/royal-family/0/queen-comes-crisis/", "urlToImage": null, "publishedAt": "2020-04-24T06:00:00Z", "content": "After thanking NHS workers, she turned to the majority of us, trapped at home, and subtly backed the Governments message that we should stay there. By thanking us for staying at home unlike the Governments irritating Americanism, asking us to stay home she ev… [+2382 chars]"}]}