{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Www.geo.tv"}, "author": "Web Desk", "title": "Avengers: Endgame directors discuss future with MCU - Geo News", "description": "Anthony Russo and Joe Russo are currently working on Netflix film 'Extraction'", "url": "https://www.geo.tv/latest/284769-avengers-endgame-directors-discuss-future-with-mcu", "urlToImage": null, "publishedAt": "2020-04-25T00:21:30Z", "content": "Anthony Russo and Joe Russo are currently working on Netflix film 'Extraction'\r\nAnthony Russo and Joe Russo, the iconic directors behind \"Avengers: Endgame\", \"Infinity War\" and Captain America films, recently discussed their future with the Marvel Cinematic U… [+1230 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Danielle Cinone", "title": "Tiger King Joe Exotic ‘brutally gunned down HUNDREDS of caged tigers for greed,’ zoo manager says - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11477233/tiger-king-joe-exotic-killed-caged-tigers/", "urlToImage": null, "publishedAt": "2020-04-25T00:19:50Z", "content": "TIGER King Joe Exotic brutally gunned down hundreds of caged tigers to satisfy his own greed, an ex employee has claimed.\r\nZoo workers are accusing Joe Exotic - the star of the controversial Netflix show Tiger King: Murder, Mayhem and Madness - of being a hea… [+3039 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Frank Skinner: Will Gompertz reviews the comedian's poetry podcast on Absolute Radio ★★★★☆ - BBC News", "description": "It's a simple idea presented by someone who brings insight to an art form that is enjoying a resurgence.", "url": "https://www.bbc.co.uk/news/entertainment-arts-52403782", "urlToImage": null, "publishedAt": "2020-04-24T23:50:21Z", "content": "Odd combinations have long been a staple of the entertainment industry. For those old enough to have seen it (still available on YouTube), who can forget Prince Edward's cringe-inducing toe-dip into television production with the culture-clash that was It's A… [+9008 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "The celebrities striking the right note by spreading comfort and joy - BBC News", "description": "Not all stars have come off well, but some are providing positivity, humour and a human touch.", "url": "https://www.bbc.com/news/entertainment-arts-52379807", "urlToImage": null, "publishedAt": "2020-04-24T23:44:28Z", "content": "Image copyrightYOUTUBE/INSTAGRAMImage caption\r\n Left-right: John Krasinski, Sophie Ellis-Bextor and Miley Cyrus\r\nWith tours, TV shows and film shoots shut down, the coronavirus pandemic has left celebrities with little to do but go on social media and show us… [+6151 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Lewis Knight", "title": "Piers Morgan apologises to Ofcom after being hit with over 2,000 complaints - Mirror Online", "description": "Good Morning Britain presenter Piers Morgan has taken to Twitter to apologise to Ofcom after many complained to the broadcasting regulator over his interview styles", "url": "https://www.mirror.co.uk/tv/tv-news/piers-morgan-apologises-ofcom-after-21921946", "urlToImage": null, "publishedAt": "2020-04-24T23:30:54Z", "content": "Television journalist Piers Morgan has apologised after fans complained to Ofcom about his behaviour. \r\n The Good Morning Britain presenter, 55, was the subject of more than 2,000 complaints to the broadcasting regulator due to his intense interviews with MPs… [+2419 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Rachael Ellenbogen", "title": "Seinfeld actor Gene Dynarski dead at 86 - The Sun", "description": "", "url": "http://www.thesun.co.uk/tvandshowbiz/11476549/seinfeld-actor-gene-dynarski-dead-86/", "urlToImage": null, "publishedAt": "2020-04-24T23:05:10Z", "content": "GENE Dynarski, an actor known for his portrayal of Izzy Mandelbaum Jr. on the popular sitcom Seinfeld, has reportedly died.\r\nHe was 86 and passed away at a rehabilitation center in Studio City.\r\n Gene Dynarski, who appeared on Star Trek: The Original Series a… [+2019 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Sara-Aisha Kent", "title": "Watchdog's Lynn Faulds Wood bravely beat cancer twice before tragic death from stroke - Mirror Online", "description": "Former Watchdog host Lynn Faulds Wood, who died today at the age of 72 from a \"massive\" stroke, beat both skin and bowel cancer before her death", "url": "https://www.mirror.co.uk/3am/celebrity-news/watchdogs-lynn-faulds-wood-bravely-21923092", "urlToImage": null, "publishedAt": "2020-04-24T22:44:05Z", "content": "Lynn Faulds Wood sadly died at the age of 72 from a stroke today. \r\nThe former Watchdog presenter battled cancer twice before she died and used her experience to help others who were diagnosed with the disease.\r\nShe bravely got through a diagnosis of skin can… [+2892 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By George Stark For Dailymail.com", "title": "Will & Grace stars Debra Messing and Megan Mullally's rumored feud gets addressed - Daily Mail", "description": "Will & Grace creators David Kohan and Max Mutchnick have added fuel to the rumours the co-stars Debra Messing and Meghan Mullally have harbored a secret feud with each other.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8255239/Will-Grace-stars-Debra-Messing-Megan-Mullallys-rumored-feud-gets-addressed.html", "urlToImage": null, "publishedAt": "2020-04-24T22:32:15Z", "content": "Will &amp; Grace creators David Kohan and Max Mutchnick have added fuel to the rumours the co-stars Debra Messing, 51, and Megan Mullally, 61, have harbored a secret feud with each other.\r\nKohan and Mutchnick were asked about the alleged clash in a recent Q&a… [+2240 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Joshua Jones", "title": "WWE boss Vince McMahon claims Brock Lesnar is the reason Raw’s ratings are in freefall - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/11472291/wwe-vince-mcmahon-brock-lesnar-raw-ratings/", "urlToImage": null, "publishedAt": "2020-04-24T22:24:39Z", "content": "VINCE McMAHON believes Brock Lesnar is the reason for the dramatic fall in WWE Raw's ratings.\r\nViewing figures released on Thursday showed a 16 per cent drop off for one of WWE's flagship programmes.\r\n Vince McMahon has blamed WWE Raw's viewing figures fallin… [+2191 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Lewis Knight", "title": "Prince William has unexpected issue with watching Tiger King on Netflix - Mirror Online", "description": "Prince William, Duke of Cambridge, took part in The Big Night In last night and told Stephen Fry just why he won't be watching Netflix docuseries Tiger King", "url": "https://www.mirror.co.uk/tv/tv-news/prince-william-unexpected-issue-watching-21921161", "urlToImage": null, "publishedAt": "2020-04-24T22:24:27Z", "content": "Prince William has delivered a hilarious reason for not watching hit Netflix series Tiger King.\r\n The Duke of Cambridge, 37, appeared on the BBC charity event The Big Night In which aimed to raise fund for front line workers. \r\nIn all, the effort amassed a wh… [+2312 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Sky", "title": "Eddie Large: Well-wishers applaud hearse before comedy legend's funeral - Sky News", "description": "Video posted online showed well-wishers following social distancing guidelines as the vehicle set off for the service.", "url": "https://news.sky.com/story/eddie-large-well-wishers-applaud-hearse-before-comedy-legends-funeral-11978486", "urlToImage": null, "publishedAt": "2020-04-24T21:58:19Z", "content": null}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Luke Hawker", "title": "Kate and William honour Anzac Day and share resources to celebrate ‘in spirit’ - Express", "description": "KATE, the Duchess of Cambridge and Prince William have paid tribute all the fallen Australian and New Zealand military personnel who lost their life during conflicts around the world for Anzac Day", "url": "https://www.express.co.uk/news/royal/1273651/kate-middleton-news-latest-prince-william-anzac-day-celebrations-australia-new-zealand", "urlToImage": null, "publishedAt": "2020-04-24T21:48:07Z", "content": null}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Matthew Dresch", "title": "Captain Tom Moore 'on honours shortlist' after raising millions for NHS heroes - Mirror Online", "description": "Captain Tom Moore is expected to be nominated for a CBE after he completed 100 laps of his garden, raising a staggering £28 million for the NHS amid the coronavirus crisis", "url": "https://www.mirror.co.uk/news/uk-news/captain-tom-moore-set-honours-21923913", "urlToImage": null, "publishedAt": "2020-04-24T21:15:46Z", "content": "Captain Tom Moore is on the honours shortlist after being nominated by thousands of people, according to a report.\r\n The 99-year-old veteran has raised more than £28million for brave NHS heroes after completing 100 laps of his garden, and is the oldest person… [+1500 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Jamie Downham", "title": "Gogglebox star Amy Tapper calls for bigger airline and theme park seats for plus-sized people - The Sun", "description": "", "url": "http://www.thesun.co.uk/tvandshowbiz/11473851/gogglebox-amy-tapper-airline-theme-park-seats/", "urlToImage": null, "publishedAt": "2020-04-24T21:00:20Z", "content": "GOGGLEBOX'S Amy Tapper has said theme parks and aeroplanes should have bigger seats for plus-sized customers, saying: \"People shouldn't be embarrassed.\"\r\nThe 20-year-old Channel 4 star spoke about how she was shut out of a Harry Potter ride with her dad Jonat… [+2831 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Olivia Wheeler For Mailonline", "title": "Inside Robbie Williams and Ayda Field's lavish £26m LA mansion with 22 bathrooms - Daily Mail", "description": "The Let Me Entertain You hitmaker, 46, took to Instagram on Friday to strip down to his boxers as he showed off his toned inked torso in a cheeky snap. He penned: 'Informal Friday x.'", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8253327/Inside-Robbie-Williams-Ayda-Fields-lavish-26m-LA-mansion-22-bathrooms.html", "urlToImage": null, "publishedAt": "2020-04-24T20:53:31Z", "content": "They have an impressive property portfolio with the couple dividing their time between their £17.5million west London home, sprawling £26m Beverly Hills mansion and £15.9million Malibu abode. \r\nAnd Robbie Williams and Ayda Field have been self-isolating at th… [+7143 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Heidi Parker For Dailymail.com", "title": "Chernobyl Diaries actor Dimitri Diatchenko is found dead inside his Florida residence - Daily Mail", "description": "The actor had not been heard from for several days so on Wednesday his family asked police to do a wellness check, according to a Friday report from TMZ . The site had talked to his brother.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8254859/Chernobyl-Diaries-actor-Dimitri-Diatchenko-dead-inside-Florida-residence.html", "urlToImage": null, "publishedAt": "2020-04-24T20:50:26Z", "content": "Dimitri Diatchenko was found dead at age 52 inside his Florida residence.\r\nThe actor had not been heard from for several days so on Wednesday his family asked police to do a wellness check, according to a Friday report from TMZ. The site claims to have talked… [+2740 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Kyle O'Sullivan", "title": "Coronation Street's Geoff rapes helpless Yasmeen in sick 'love doctor' twist - Mirror Online", "description": "Corrie viewers watched in horror as twisted Geoff Metcalfe n led his wife upstairs despite her protests after grinding her down to nothing", "url": "https://www.mirror.co.uk/tv/tv-news/coronation-streets-geoff-rapes-helpless-21923291", "urlToImage": null, "publishedAt": "2020-04-24T20:46:02Z", "content": "Geoff Metcalfe went to rape helpless Yasmeen Nazir in another sickening twist at the end of Friday night's Coronation Street. \r\nSome disgusted Corrie fans are refusing to watch any more of the hard-hitting domestic abuse storyline, which is importantly highli… [+4593 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Christopher Bucktin", "title": "Trophy hunter who shot giraffe taunts Ricky Gervais saying she's 'proud' of sick new vid - Mirror Online", "description": "Tess Talley, 38, has shared a video of her killing a giraffe in South Africa following a backlash led by Ricky Gervais and other animal lovers for posing next to the dead animal in a picture", "url": "https://www.mirror.co.uk/news/uk-news/trophy-hunter-who-shot-giraffe-21923288", "urlToImage": null, "publishedAt": "2020-04-24T20:45:08Z", "content": "An American big game hunter has enraged animal lovers by ­posting a video online of her slaughtering a giraffe.\r\nTess Talley, 38, killed the majestic creature in South Africa three years ago and claims she has only shared the video now because other hunters h… [+7166 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Andy Rudd, Vicki Newman", "title": "Kate Garraway opens up about 'hardest' time of her life as Derek remains critical - Mirror Online", "description": "The Good Morning Britain presenter sent out a heartfelt thanks to her fans who have offered her support and the NHS staff risking their lives to care for her husband", "url": "https://www.mirror.co.uk/3am/celebrity-news/kate-garraway-opens-up-hardest-21923220", "urlToImage": null, "publishedAt": "2020-04-24T20:33:32Z", "content": "Kate Garraway has opened up about going through the \"hardest\" time of her life as her husband Derek Draper remains in a deeply critical condition. \r\n The Good Morning Britain presenter's husband is in hospital battling coronavirus. \r\nKate, 52, has told fans t… [+1783 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Vicki Newman", "title": "Holly Willoughby unveils weekend plans to get smashed on Phillip Schofield's wine - Mirror Online", "description": "The This Morning star posed up with two boxes of best pal Phil's new supermarket wine - and it looks like she's got big plans for the weekend", "url": "https://www.mirror.co.uk/3am/celebrity-news/holly-willoughby-unveils-weekend-plans-21922714", "urlToImage": null, "publishedAt": "2020-04-24T20:33:21Z", "content": "Holly Willoughby looks set for a pretty epic weekend thanks to her best pal Phillip Schofield. \r\n The This Morning presenter, 39, took to Instagram to unveil her plans as she posed up with two boxes of Phil's new supermarket wine. \r\nHolly expressed her sadnes… [+2105 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Martha Cliff", "title": "The Queen makes awkward blunder calling Prince Louis her seventh great-grandson on his birthday when he’s her - The Sun", "description": "", "url": "http://www.thesun.co.uk/fabulous/11464973/queen-error-prince-louis-birthday-message/", "urlToImage": null, "publishedAt": "2020-04-24T20:14:05Z", "content": "PRINCE Louis is celebrating his second birthday today, and the royal family have been showering the tot with birthday wishes.\r\nBut there was a rather awkward blunder in the Queens birthday message to her great-grandson.\r\nThere was an awkward blunder in the Qu… [+3008 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Ellie Phillips For Mailonline", "title": "Susannah Constantine shares first full family photograph EVER taken to celebrate silver wedding - Daily Mail", "description": "The TV personality, 57, took to Instagram on Thursday, where she posted the snap of herself with her husband and their three children Cece, Esme and Joe", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8254371/Susannah-Constantine-shares-family-photograph-taken-celebrate-silver-wedding.html", "urlToImage": null, "publishedAt": "2020-04-24T20:12:55Z", "content": "They married in 1995 and went on to have three children together.\r\nAnd, Susannah Constantine, 57, shared a family photograph to Instagram for first the time EVER on Thursday, to celebrate her silver wedding anniversary with husband Sten Bertelsen.\r\nThe TV per… [+2004 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Jessica Green For Mailonline", "title": "Duchess of Cornwall admits she 'really misses' her grandchildren - Daily Mail", "description": "The Duchess of Cornwall's comments came in a call from her Birkhall home to an elderly user of the Silver Line, a 24-hour helpline for older people feeling lonely or in need of support,", "url": "https://www.dailymail.co.uk/femail/article-8254005/Duchess-Cornwall-admits-really-misses-grandchildren.html", "urlToImage": null, "publishedAt": "2020-04-24T19:07:53Z", "content": "The Duchess of Cornwall has confessed to missing her grandchildren during the coronavirus lockdown but has been enjoying spending time outside in the garden.\r\nCamilla's comments came in a call to an elderly user of the Silver Line, a 24-hour helpline for olde… [+4500 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "BBC News", "title": "Coronavirus: Eddie Large funeral held in Bristol - BBC News", "description": "Syd Little pays tribute to his comedy partner and \"best friend\" Eddie Large at a ceremony in Bristol.", "url": "https://www.bbc.com/news/uk-england-somerset-52410413", "urlToImage": null, "publishedAt": "2020-04-24T18:55:00Z", "content": "We use cookies to give you the best online experience. Please let us know if you agree to all of these cookies.\r\nImage caption\r\n Syd Little and his wife Sheree were among just 10 family and close friends allowed to attend the service\r\nComedian Syd Little has … [+1792 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Eve Wagstaff", "title": "Inside Vicar of Dibley star Dawn French’s jaw-dropping £3m Cornwall castle with 30 rooms and sea views - The Sun", "description": "", "url": "http://www.thesun.co.uk/tvandshowbiz/11473354/inside-dawn-frenchs-jaw-dropping-3m-cornwall-castle/", "urlToImage": null, "publishedAt": "2020-04-24T18:14:19Z", "content": "DAWN French lives in a jaw-dropping £3m Cornwall called Point Neptune that has 30 rooms and incredible sea views.\r\nThe Vicar of Dibley star lives in the coastal mansion with her daughter Billie and second husband, Mark Bignell.\r\n Dawn's home is on the coast o… [+3733 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Sabah Choudhry, podcast producer", "title": "Coronavirus: Fatboy Slim on swapping Ibiza for isolation amid lockdown - Sky News", "description": "Norman Cook tells In This Together he thinks parties and raves will be the last thing to escape from lockdown.", "url": "https://news.sky.com/story/coronavirus-fatboy-slim-on-swapping-ibiza-for-isolation-amid-lockdown-11978349", "urlToImage": null, "publishedAt": "2020-04-24T18:05:07Z", "content": null}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Dave Gonzales", "title": "Darth Maul survived The Phantom Menace and thrived on The Clone Wars - Polygon", "description": "Star Wars: The Clone Wars, Rebels, and Star Wars comics were ready for a big surprise in 2018’s Solo: A Star Wars Story. But as the Disney Plus series wraps up, it’s important to remember where Maul came from — and where he’s yet to go.", "url": "https://www.polygon.com/2018/5/25/17393680/darth-maul-lives-clone-wars-rebels-solo", "urlToImage": null, "publishedAt": "2020-04-24T17:48:52Z", "content": "With Darth Maul back at the center of Disney Plus final season of The Clone Wars, and facing none other than Ahsoka Tano in the penultimate episode The Phantom Apprentice, were re-upping this look back at the former Sith warriors rise to prominence after bein… [+10887 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": null, "title": "Kramer v Kramer? Meghan and Harry's case was more like a battle of the middle managers - Telegraph.co.uk", "description": "Anyone hoping for the drama of Kramer vs Kramer - or even a touch of Perry Mason - would have been left disappointed by the opening arguments in HRH the Duchess of Sussex vs Associated Newspapers.", "url": "https://www.telegraph.co.uk/royal-family/2020/04/24/kramer-v-kramer-meghan-harrys-case-like-battle-middle-managers/", "urlToImage": null, "publishedAt": "2020-04-24T17:43:00Z", "content": "Anyone hoping for the drama of Kramer vs Kramer - or even a touch of Perry Mason - would have been left disappointed by the opening arguments in HRH the Duchess of Sussex vs Associated Newspapers.\r\nCoronavirus has taken its toll on many sectors but reducing t… [+1065 chars]"}, {"source": {"id": null, "name": "Whatculture.com"}, "author": "Dan Struthers", "title": "10 Greatest Ever Tom Hanks Movie Performances - WhatCulture", "description": "His career is like a box of chocolates, you never know what you're gonna get...", "url": "https://whatculture.com/film/10-greatest-ever-tom-hanks-movie-performances", "urlToImage": null, "publishedAt": "2020-04-24T17:32:13Z", "content": "Tom Hanks, or America's Dad as he is affectionately known, has had an incredible career spanning 40 years and has grossed over $11 billion at the box office with his blockbuster films. Looking back at his films it is no wonder he is likened to a father - a co… [+757 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Monica Greep For Mailonline", "title": "Gangs of London leaves viewers gripped but insist violence is not for the faint hearted - Daily Mail", "description": "New Sky Atlantic drama Gangs of London left viewers gripped with it's 'increible' fight scenes, but insisted the 'brutal' violence of the show left them wincing at the graphic scenes", "url": "https://www.dailymail.co.uk/femail/article-8253529/Gangs-London-leaves-viewers-gripped-insist-violence-not-faint-hearted.html", "urlToImage": null, "publishedAt": "2020-04-24T17:21:21Z", "content": "A gorey new TV show about warring gangs in London opened last night with dramatic scenes that saw a character being set alight while being dangled off a building within the first few minutes. \r\nThe new drama, written by Gareth Evans, started on Sky Atlantic l… [+4713 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Phoebe Waller-Bridge's hilariously X-RATED wall art revealed! | The Graham Norton Show - BBC - BBC", "description": "Subscribe and 🔔 to OFFICIAL BBC YouTube 👉 https://bit.ly/2IXqEIn Stream original BBC programmes FIRST on BBC iPlayer 👉 https://bbc.in/2J18jYJ Graham Norton i...", "url": "https://www.youtube.com/watch?v=hSwK3Kxghj0", "urlToImage": null, "publishedAt": "2020-04-24T17:00:32Z", "content": "Subscribe and to OFFICIAL BBC YouTube https://bit.ly/2IXqEInStream original BBC programmes FIRST on BBC iPlayer https://bbc.in/2J18jYJ\r\nGraham Norton is horrified by some of Phoebe Waller-Bridge's rather unusual art.\r\nGraham is joined in his virtual studio by… [+729 chars]"}, {"source": {"id": null, "name": "Birminghammail.co.uk"}, "author": "Jane Tyler", "title": "Residents who recreated Peter Kay's Amarillo video told: 'Keep the noise down' - Birmingham Live", "description": "Residents in the Warwickshire village have been having a dance and sing in the street every day during lockdown - but someone complained", "url": "https://www.birminghammail.co.uk/news/midlands-news/residents-who-recreated-peter-kays-18143353", "urlToImage": null, "publishedAt": "2020-04-24T16:51:56Z", "content": "Residents who have been keeping their spirits up during lockdown with a daily sing-song in their street have been told to \"keep the noise down\".\r\nFamilies who live in the Warwickshire village of Tysoe have been leaving their homes and going out into the road … [+2032 chars]"}, {"source": {"id": null, "name": "Whatculture.com"}, "author": "Josh Wilding", "title": "10 Game-Changing New Characters Coming To DCEU - WhatCulture", "description": "The DC Extended is entering a new era, and these characters could change EVERYTHING.", "url": "https://whatculture.com/film/10-game-changing-new-characters-coming-to-dceu", "urlToImage": null, "publishedAt": "2020-04-24T16:51:42Z", "content": "The DC Extended Universe (which, believe it or not, remains the only name for a franchise without an official title) has been completely reshaped by Warner Bros. since Zack Snyder's films failed to resonate with audiences. What was once a dark and brooding wo… [+1052 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Martina Bet", "title": "Royal outrage: How US President shocked the Queen Mother with kiss on the lips - Express", "description": "THE QUEEN MOTHER was left in shock when former US President Jimmy Carter greeted her with a kiss on the lips in 1977, unearthed reports reveal.", "url": "https://www.express.co.uk/news/royal/1273552/royal-news-queen-mother-us-president-jimmy-carter-kiss-spt", "urlToImage": null, "publishedAt": "2020-04-24T16:33:22Z", "content": null}, {"source": {"id": null, "name": "Ultimate-guitar.com"}, "author": "jomatami", "title": "Mick Jagger Reacts to Paul McCartney Saying The Beatles Were Better Than The Rolling Stones, Explains 'Big Difference' - Ultimate-Guitar.Com", "description": "The singer also touches on Pink Floyd and Led Zeppelin.", "url": "https://www.ultimate-guitar.com/news/general_music_news/mick_jagger_reacts_to_paul_mccartney_saying_the_beatles_were_better_than_the_rolling_stones_explains_big_difference.html", "urlToImage": null, "publishedAt": "2020-04-24T16:31:54Z", "content": null}, {"source": {"id": null, "name": "Digitalspy.com"}, "author": "Abby Robinson", "title": "Normal People is a masterclass in nudity on screen - digitalspy.com", "description": "Sally Rooney's best-selling novel has been given the TV treatment.", "url": "https://www.digitalspy.com/tv/a32253270/normal-people-review-nudity/", "urlToImage": null, "publishedAt": "2020-04-24T16:01:00Z", "content": "Sally Rooney's hand is felt throughout Normal People, the BBC Three and Hulu co-production based on her critically acclaimed novel of the same name. The characters move and breathe as they do in all 266 pages of the book, the story of Marianne (Daisy Edgar-Jo… [+8712 chars]"}, {"source": {"id": null, "name": "Digitalspy.com"}, "author": "Laura Jane Turner", "title": "After Life season 2 ending explained - it had to end that way, according to Ricky Gervais - digitalspy.com", "description": "And what it could mean for season 3...", "url": "https://www.digitalspy.com/tv/a32235764/after-life-season-2-ending-explained-netflix/", "urlToImage": null, "publishedAt": "2020-04-24T16:00:00Z", "content": "After Life season two spoilers follow, including its ending. \r\nWell, there you have it. By now, if you're reading this article, you have come to the end of After Life's second season – and if you haven't quite finished, you should probably do so before readin… [+4565 chars]"}, {"source": {"id": null, "name": "Indy100.com"}, "author": "Joanna Taylor", "title": "Tom Hanks wrote a letter to a boy named Corona who was being bullied and it's perfect - indy100", "description": "", "url": "https://www.indy100.com/article/tom-hanks-typewriter-young-fan-corona-australia-9482646", "urlToImage": null, "publishedAt": "2020-04-24T15:01:29Z", "content": "People are obsessed with \"hero\" Tom Hanks's heartwarming gesture to an eight-year-old boy being bullied because his name is Corona. \r\nCorona De Vries, who lives on Australia's Gold Coast, wrote to Tom Hanks and his wife Rita Wilson in early April to wish them… [+1923 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "George Simpson", "title": "Queen’s Brian May announces special LIVE lockdown party THIS weekend with Kings Daughters - Express", "description": "QUEEN guitarist Brian May has announced a special live lockdown launch party with Kings Daughters this weekend.", "url": "https://www.express.co.uk/entertainment/music/1273488/Queen-Brian-May-Instagram-live-lockdown-launch-party-Kings-Daughters", "urlToImage": null, "publishedAt": "2020-04-24T14:21:48Z", "content": null}, {"source": {"id": null, "name": "Thenational.scot"}, "author": "Emer O'Toole", "title": "TRNSMT forced to issue clarification after blaming Nicola Sturgeon for cancellation - The National", "description": "ORGANISERS of Scottish music festival TRNSMT have been forced to issue a clarification after their original statement about cancelling the event…", "url": "https://www.thenational.scot/news/18403899.trnsmt-issues-clarification-blaming-nicola-sturgeon-cancellation/", "urlToImage": null, "publishedAt": "2020-04-24T14:05:40Z", "content": "ORGANISERS of Scottish music festival TRNSMT have been forced to issue a clarification after their original statement about cancelling the event appeared to blame Nicola Sturgeon. \r\nBosses said in a statement this morning that \"due to the comments made by the… [+2577 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Annie Lord", "title": "Ricky Gervais calls Gal Gadot’s ‘Imagine’ video an ‘awful rendition’ - The Independent", "description": "‘They might have been doing it for good reasons, to help these normal nobodies’", "url": "https://www.independent.co.uk/arts-entertainment/tv/news/ricky-gervais-gal-gadot-imagine-john-lennon-awful-viral-video-coronavirus-a9482296.html", "urlToImage": null, "publishedAt": "2020-04-24T13:54:36Z", "content": "Ricky Gervais has criticised the viral video that saw Gal Gadot lead a host of celebrities to perform a cover of John Lennons Imagine.\r\nIn a video posted to Instagram, the Wonder Woman actor began singing Lennons iconic track, before the likes of Will Ferrell… [+1012 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Ellie Kirwin-Jones", "title": "Liam Payne: Cheryl's ex makes 'tough call' for son Bear 'It's the most difficult thing' - Express.co.uk", "description": "LIAM PAYNE, Cheryl's ex-boyfriend and former One Direction singer, has opened up on the 'tough call' he had to make for his son Bear during the nationwide coronavirus lockdown.", "url": "https://www.express.co.uk/celebrity-news/1273481/Cheryl-ex-Liam-Payne-son-Bear-lockdown-news-latest-update", "urlToImage": null, "publishedAt": "2020-04-24T13:42:00Z", "content": null}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "George Simpson", "title": "Pink Floyd Live At Pompeii concert released for one day only – WATCH - Express", "description": "PINK FLOYD Live At Pompeii concert has been shared by the band for fans in lockdown today.", "url": "https://www.express.co.uk/entertainment/music/1273454/Pink-Floyd-Live-at-Pompeii-concert-YouTube", "urlToImage": null, "publishedAt": "2020-04-24T13:12:36Z", "content": null}, {"source": {"id": null, "name": "Theguardian.comgames"}, "author": "Keith Stuart", "title": "More than 12m players watch Travis Scott concert in Fortnite - The Guardian", "description": "The US rapper performed inside the popular Battle Royale game with a visually astonishing set, and has announced more dates", "url": "https://amp.theguardian.comgames/2020/apr/24/travis-scott-concert-fortnite-more-than-12m-players-watch", "urlToImage": null, "publishedAt": "2020-04-24T13:00:53Z", "content": "The live music event of the year may just have taken place, unaffected by the global lockdown and within a video game. On Thursday, US rapper Travis Scott performed a live set inside the online shooter Fortnite and more than 12m players took part in the spect… [+1976 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Experience stepping out on to the Britain's Got Talent stage in 360 with Ant and Dec | BGT 2020 - Britain's Got Talent", "description": "See more from Britain's Got Talent at http://itv.com/talent Watch Britain's Got Talent: Unseen on the ITV HUB: https://bit.ly/2RreDOp Ever wondered what it's...", "url": "https://www.youtube.com/watch?v=9RC5wm5vgSQ", "urlToImage": null, "publishedAt": "2020-04-24T12:05:05Z", "content": null}, {"source": {"id": null, "name": "Digitalspy.com"}, "author": "Charley Ross", "title": "Little Britain's Big Night In sketch criticised over 'racist' bat-eating joke - digitalspy.com", "description": "A comedy misfire...", "url": "https://www.digitalspy.com/tv/a32263270/little-britain-big-night-in-bat-joke/", "urlToImage": null, "publishedAt": "2020-04-24T12:03:00Z", "content": "Little Britain returned to our screens on Thursday (April 23) as stars David Walliams and Matt Lucas performed various sketches for BBC's Big Night In telethon. Although, elements have been accused of being insensitive by those watching at home.\r\nWalliams and… [+2564 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Adam Miller", "title": "The Grand Tour Madagascar special: Jeremy Clarkson probes producer - Metro.co.uk", "description": "The Grand Tour fans need answers!", "url": "https://metro.co.uk/2020/04/24/jeremy-clarkson-promises-grand-tour-madagascar-special-announcement-coming-kept-dark-12604355/", "urlToImage": null, "publishedAt": "2020-04-24T11:17:28Z", "content": "To view this video please enable JavaScript, and consider upgrading to a web\r\nbrowser that\r\nsupports HTML5\r\nvideo\r\nJeremy Clarkson has vowed to give us an update on The Grand Tour Madagascar special tonight after fans have been waiting for the next instalment… [+1855 chars]"}, {"source": {"id": null, "name": "Entertainmentdaily.co.uk"}, "author": "Rebecca Carter", "title": "Viewers angry with ITV as it issues statement about Gordon, Gino and Fred: Road Trip - Entertainment Daily", "description": "They want more episodes next time", "url": "https://www.entertainmentdaily.co.uk/tv/viewers-angry-with-itv-as-it-issues-statement-about-gordon-gino-and-fred-road-trip/", "urlToImage": null, "publishedAt": "2020-04-24T11:11:18Z", "content": "Viewers are gutted Gordon Ramsay, Gino D'Acampo and Fred Sirieix's latest ITV Road Trip series has come to an end.\r\nThe fourth and final episode of their American Road Trip aired last night (April 24) as they travelled around Texas.\r\nEven though the series ha… [+2573 chars]"}, {"source": {"id": null, "name": "Indy100.com"}, "author": "Greg Evans", "title": "Prince Charles and Camilla clapping for carers might be the most awkward thing you'll see today - indy100", "description": "", "url": "https://www.indy100.com/article/prince-charles-camilla-clap-for-our-carers-coronavirus-nhs-9481651", "urlToImage": null, "publishedAt": "2020-04-24T10:25:45Z", "content": "Clapping for health care workers every Thursday evening has now become as fine a British tradition as the Sunday roast or forgetting to put the bins out. \r\nThe initiative which started around the start of lockdown aims to show appreciation to the NHS and care… [+1817 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: 'We're giving our tour buses to the NHS' - BBC News", "description": "Buses which are usually home to rock stars are now giving frontline workers a place to rest.", "url": "https://www.bbc.co.uk/news/newsbeat-52410888", "urlToImage": null, "publishedAt": "2020-04-24T10:18:06Z", "content": "Image copyrightVans For BandsImage caption\r\n Buses have been deployed all over the UK including this one at The Whittington NHS Trust in London\r\nMusic fans won't need reminding there are no live gigs happening at the moment.\r\nAs well as empty venues and festi… [+4092 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Joanne Kavanagh", "title": "Who sings the Times Like These cover from Live Lounge? All the artists on the Foo Fighters song - The Sun", "description": "", "url": "http://www.thesun.co.uk/tvandshowbiz/11469609/times-like-these-cover-live-lounge/", "urlToImage": null, "publishedAt": "2020-04-24T10:02:18Z", "content": "DUA Lipa and Dave Grohl led the stars singing It's Times Like These for BBC's The Big Night In.\r\nWe take a look at who else was involved in this charity cover of the Foo Fighters classic.\r\n Dua Lipa and Dave Grohl led the stars singing It's Times Like These f… [+2301 chars]"}, {"source": {"id": null, "name": "Theguardian.commusic"}, "author": "Ben Beaumont-Thomas", "title": "Taylor Swift disowns new live album, calling it 'shameless greed' - The Guardian", "description": "Singer complains of ‘tasteless’ release amid coronavirus crisis by former label Big Machine, owned by frequent adversary Scooter Braun", "url": "https://amp.theguardian.commusic/2020/apr/24/taylor-swift-disowns-new-live-album-scooter-braun-big-machine", "urlToImage": null, "publishedAt": "2020-04-24T09:49:00Z", "content": "Taylor Swift has disowned a new live album released under her name, calling it tasteless and shameless greed amid the coronavirus outbreak.\r\nThe album, Live from Clear Channel Stripped 2008, was recorded when Swift was 18, around the release of her Grammy-win… [+1225 chars]"}, {"source": {"id": null, "name": "Nme.com"}, "author": null, "title": "‘Breaking Bad’ creator Vince Gilligan “embarrassed” over not wanting Lalo in ‘Better Call Saul’ - NME Live", "description": "Breaking Bad creator Vince Gilligan has said that he did not want Lalo to appear in Better Call Saul at first - but he is glad to have been proven wrong now.", "url": "https://www.nme.com/news/tv/breaking-bad-better-call-saul-vince-gilligan-lalo-2652496", "urlToImage": null, "publishedAt": "2020-04-24T09:18:57Z", "content": "Breaking Bad creator Vince Gilligan has said that he did not want Lalo to appear in Better Call Saul at first – but he is glad to have been proven wrong now.\r\nThe new beloved villain Lalo Salamanca (Tony Dalton), a character who was mentioned by Saul in a qui… [+1249 chars]"}, {"source": {"id": null, "name": "Theguardian.commusic"}, "author": "Ben Beaumont-Thomas", "title": "Beyoncé gives $6m to coronavirus relief, including mental health causes - The Guardian", "description": "Pop star unites with Twitter founder Jack Dorsey to support charities working with ‘communities of colour’", "url": "https://amp.theguardian.commusic/2020/apr/24/beyonce-gives-6m-dollars-to-coronavirus-relief-mental-health-jack-dorsey", "urlToImage": null, "publishedAt": "2020-04-24T08:23:53Z", "content": "Beyoncé has announced a donation of $6m for mental health and other initiatives during the coronavirus outbreak.\r\nThe singer teamed up with Twitter founder Jack Dorseys relief fund #startsmall to make the donation to the National Alliance in Mental Health, Un… [+1551 chars]"}, {"source": {"id": null, "name": "Gazettelive.co.uk"}, "author": "Naomi Corrigan", "title": "The Killers announce new Riverside Stadium date after confirming postponement - Gazette Live", "description": "The Hot Fuss hitmakers said all UK and Ireland gigs will not go ahead this year due to to Covid-19.", "url": "https://www.gazettelive.co.uk/whats-on/killers-confirm-postponement-riverside-stadium-18142318", "urlToImage": null, "publishedAt": "2020-04-24T08:02:08Z", "content": "The Killers have confirmed their sell-out Riverside Stadium concert will be postponed until 2021.\r\nIn a Tweet, the US rockers said they are not cancelling, and the show will instead go ahead on Thursday, June 10, 2021.\r\n The scheduled Middlesbrough show on Ju… [+2010 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Molli Mitchell", "title": "Lucifer: Top 5 shows to watch if you like Lucifer - Express.co.uk", "description": "LUCIFER season 5 has been pushed back till Summer 2020 much to fans disappointment. However, there are many other shows out there that Lucifer fans can enjoy as they wait for the first eight episodes of the new series.", "url": "https://www.express.co.uk/showbiz/tv-radio/1272881/Lucifer-best-shows-to-watch-like-Lucifer-similar-series", "urlToImage": null, "publishedAt": "2020-04-24T07:21:00Z", "content": null}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "George Griffiths", "title": "Parks and Recreation cast returning for coronavirus one-off special - Metro.co.uk", "description": "Hint: she's got a ring binder for everything.", "url": "https://metro.co.uk/2020/04/24/parks-recreation-cast-reuniting-special-one-off-episode-show-us-lesley-knope-deals-coronavirus-12602798/", "urlToImage": null, "publishedAt": "2020-04-24T06:51:19Z", "content": "Lesley Knope is back to save us all from coronavirus (Picture: NBC)\r\nThe cast of Parks and Recreation will be reuniting for a special one-off episode of the beloved sitcom. \r\nLuckily, this will show us how everyones favourite politician, Lesley Knope (Amy Poe… [+2249 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Brian Viner For The Daily Mail", "title": "Chris Hemsworth goes from Marvel hero to killing machine: BRIAN VINER reviews Extraction - Daily Mail", "description": "Brian Viner reviews the new Netflix film Extraction starring Chris Hemsworth playing a former 'special ops' soldier, a veteran of the war in Afghanistan, now working as a freelance troubleshooter.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8251899/Chris-Hemsworth-goes-Marvel-hero-killing-machine-BRIAN-VINER-reviews-Extraction.html", "urlToImage": null, "publishedAt": "2020-04-24T06:44:15Z", "content": "Extraction (Netflix, 15)\r\nVerdict: Violent and derivative\r\nRating: \r\nExtraction. It seems fitting that a film that sounds like a dental training video should set your teeth on edge.\r\nIt stars Chris Hemsworth as that staple character of modern action movies, t… [+7767 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Seamus Duff", "title": "Line of Duty star frustrated to see Peaky Blinders role halted by coronavirus - Mirror Online", "description": "Stephen Graham – who starred in season five of Line of Duty – has been signed up to season six of Peaky Blinders, but filming for the show has been disrupted by the COVID-19 outbreak", "url": "https://www.mirror.co.uk/tv/tv-news/line-duty-star-frustrated-see-21918565", "urlToImage": null, "publishedAt": "2020-04-24T03:13:03Z", "content": "Line of Duty star Stephen Graham has discussed his joy and frustration at being signed to join the cast of Peaky Blinders.\r\nThe 46-year-old actor played D.S. John Corbett in the fifth season of the BBCs hugely popular cop drama Line of Duty in 2019 and is thr… [+2428 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "James Laird", "title": "How to watch We're Here: stream the new show with RuPaul's Drag Race stars online anywhere - TechRadar", "description": "Shangela, Bob, and Eureka are shaking up small towns", "url": "https://www.techradar.com/news/how-to-watch-were-here-stream-the-new-show-from-the-rupauls-drag-race-stars-online-anywhere", "urlToImage": null, "publishedAt": "2020-04-24T02:31:16Z", "content": "In its 11 years on air, RuPaul's Drag Race has blazed a trail for drag culture. Now, a new reality TV series featuring three of the show's best-loved alums promises an even more dramatic sashay into mainstream America's consciousness. Read on to find out how … [+3429 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Rachel Mcgrath For Dailymail.com", "title": "Elton John postpones next leg of Farewell Yellow Brick Road Tour during COVID-19 pandemic - Daily Mail", "description": "'This tough decision has been made with the continued safety and well-being of his fans... and with the concern that these gatherings continue to risk accelerating the spread of the Coronavirus,' he said.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8251573/Elton-John-postpones-leg-Farewell-Yellow-Brick-Road-Tour-COVID-19-pandemic.html", "urlToImage": null, "publishedAt": "2020-04-24T01:19:52Z", "content": "The end of the New Zealand and Australia leg of his farewell tour in February was marred by his ill health.\r\nAnd now Elton John, 73, has announced he is unable to go ahead with the next leg in the United States due to the coronavirus pandemic.\r\nIn an announce… [+3846 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Grace MacRae", "title": "Prince Charles gives hopeful glimpse into the world after coronavirus pandemic ends - Express", "description": "IN a rare new message, Prince Charles shared how he thought the world has changed and will continue to as a result of the coronavirus.", "url": "https://www.express.co.uk/news/royal/1273206/prince-charles-royal-family-coronavirus-future-lockdown-exit-nhs-latest-news-covid-19", "urlToImage": null, "publishedAt": "2020-04-24T00:38:44Z", "content": null}, {"source": {"id": null, "name": "Digitalspy.com"}, "author": "Justin Harp", "title": "BBC's star-studded Big Night In telethon raises £27m - digitalspy.com", "description": "Peter Kay, Gary Barlow and Strictly Come Dancing rallied the country.", "url": "https://www.digitalspy.com/tv/reality-tv/a32256317/big-night-in-grand-total-bbc/", "urlToImage": null, "publishedAt": "2020-04-23T21:35:00Z", "content": "Comic Relief and Children in Need's Big Night In has been a smashing success on BBC One.\r\nMany of the nation's biggest comedy stars came together – virtually, of course – on Thursday night (April 23) to rally the country to raise money for those impacted by C… [+2530 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Lewis Knight", "title": "Too Hot To Handle star Harry Jowsey spills details on sex act with Francesca - Mirror Online", "description": "Netflix has found a reality TV hit in the form Too Hot To Handle and tall Aussie Harry Jowsey had quite the impact on Francesca Farago", "url": "https://www.mirror.co.uk/tv/tv-news/hot-handle-star-harry-jowsey-21915347", "urlToImage": null, "publishedAt": "2020-04-23T19:31:00Z", "content": "One of the stars of Too Hot To Handle has spilt details on a now infamous sexual encounter he had on the show.\r\nTall Aussie model Harry Jowsey, 23, failed to stick to the celibacy rules on a number of occasions across the Netflix show's run.\r\nOne of the most … [+2019 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Rebecca Lewis", "title": "Holly Willoughby shares rare snap with son Chester, 5, as they model charity T-shirt to support the NHS - The Sun", "description": "", "url": "http://www.thesun.co.uk/tvandshowbiz/11464901/holly-willoughby-shares-rare-snap-chester-support-the-nhs/", "urlToImage": null, "publishedAt": "2020-04-23T16:57:41Z", "content": "HOLLY Willoughby has shared a rare picture of youngest son Chester as the pair model a new charity T-shirt aimed at supporting NHS key workers.\r\nThe This Morning presenter took to Instagram to reveal the rainbow designs which will be sold in Marks and Spencer… [+2376 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Verity Sulway", "title": "Piers Morgan jokes he will remove son from his will if social media taunts continue - Mirror Online", "description": "Piers Morgan revealed he was considering cutting his son Spencer out of his will for taunting him on social media for saying he would head to the pub after lockdown before seeing his sons", "url": "https://www.mirror.co.uk/tv/tv-news/piers-morgan-jokes-remove-son-21912539", "urlToImage": null, "publishedAt": "2020-04-23T15:54:30Z", "content": "Piers Morgan said today he was considering removing his son Spencer from his will if he carries on taunting his dad on social media. \r\n Good Morning Britain hosts Piers and Susanna Reid were talking about phoning your friends and family during the coronavirus… [+1818 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Survivor of Covid-19 has Emotional Reunion with His Family | Good Morning Britain - Good Morning Britain", "description": "Subscribe now for more! http://bit.ly/1NbomQa A father from Gloucestershire who thought he was going to die in hospital after he contracted Covid-19 has been...", "url": "https://www.youtube.com/watch?v=CAXgoeBc4S8", "urlToImage": null, "publishedAt": "2020-04-23T15:51:07Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Female Star Wars TV Series Coming! - WhatCulture", "description": "Todays news brought to you by Ash Millman, Adam Clery and Kirsten Ria. For more awesome content, check out: http://whatculture.com/ Follow us on Facebook at:...", "url": "https://www.youtube.com/watch?v=6a0gMHDlhvg", "urlToImage": null, "publishedAt": "2020-04-23T14:00:22Z", "content": null}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Shakespeare Quiz : It's the Bard's birthday but just how much do you know about him? - CBBC Newsround", "description": "It's world famous playwright William Shakespeare's official birthday on 23 April. Try our tricky quizzes to mark the occasion!", "url": "https://www.bbc.co.uk/newsround/52396271", "urlToImage": null, "publishedAt": "2020-04-23T11:19:45Z", "content": "It's world-famous English playwright William Shakespeare's official birthday on 23 April. \r\nHe is considered by many to be one of the world's greatest writers.\r\nShakespeare was born in 1564 in Stratford-upon-Avon in England.\r\nHe became famous for his plays, s… [+789 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Chris Wiegand", "title": "Danny Boyle's Frankenstein reanimated for National Theatre streaming service - The Guardian", "description": "Hit 2011 show joins Antony and Cleopatra, starring Ralph Fiennes and Sophie Okonedo, in being broadcast as part of free scheme", "url": "https://www.theguardian.com/stage/2020/apr/23/danny-boyles-frankenstein-and-antony-and-cleopatra", "urlToImage": null, "publishedAt": "2020-04-23T08:27:59Z", "content": "The National Theatres celebrated productions of Frankenstein, directed by Danny Boyle, and Antony and Cleopatra, starring Ralph Fiennes and Sophie Okonedo, are to be streamed for free as part of its National Theatre at Home initiative.\r\nNick Dears adaptation … [+1900 chars]"}]}