{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Raven Saunt For Mailonline", "title": "Laurence Fox reveals he considered taking his own life after his divorce from Billie Piper - Daily Mail", "description": "The actor, 41, said that the split from the Doctor Who star was so difficult he couldn't see 'the point in being alive'.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8259493/Laurence-Fox-reveals-considered-taking-life-divorce-Billie-Piper.html", "urlToImage": null, "publishedAt": "2020-04-27T02:08:23Z", "content": "Laurence Fox has spoken out on the effect his divorce from ex wife Billie Piper had on his mental health.\r\nThe actor, 41, has revealed that he considered taking his own life after the split in 2016, after nine years of marriage to the former pop star.\r\nLauren… [+3260 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Nika Shakhnazarova", "title": "Adam, Scott and Ryan Thomas confront absent dad in new documentary - Mirror Online", "description": "The three brothers grew up in Manchester knowing very little about their soul singer dad Dougie’s Indian heritage", "url": "https://www.mirror.co.uk/tv/tv-news/adam-scott-ryan-thomas-confront-21930424", "urlToImage": null, "publishedAt": "2020-04-27T01:43:10Z", "content": "Adam Thomas got the chance to confront his absent father in his new ITV documentary with brothers Ryan and Scott. \r\nThe three brothers grew up in Manchester knowing very little about their soul singer dad Dougies Indian heritage.\r\nAnd Ryan, 35, says meeting l… [+2344 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Nika Shakhnazarova", "title": "Holly Willoughby sheds glam TV image as she stuns fans with make-up free selfie - Mirror Online", "description": "Holly Willoughby shed her typically glamorous TV image as she wowed her legion of fans with make-up free selfie", "url": "https://www.mirror.co.uk/3am/celebrity-news/holly-willoughby-sheds-glam-tv-21929577", "urlToImage": null, "publishedAt": "2020-04-27T01:43:06Z", "content": "Holly Willoughby has ditched her make-up in lockdown as she decided to get her hands dirty in the garden. \r\nThis Morning presenter Holly, 39, looked fresh-faced as she tackled the weeds and leaves before planting potatoes in her yard over the weekend.\r\nFans l… [+2085 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Captain Tom Moore gets Royal Mail birthday postmark - BBC News", "description": "Royal Mail says it is \"honoured\" to commemorate the war veteran, who has raised £29m for the NHS.", "url": "https://www.bbc.co.uk/news/uk-england-beds-bucks-herts-52433007", "urlToImage": null, "publishedAt": "2020-04-27T01:32:17Z", "content": "Media captionWatch as Capt Tom Moore completes his 100th lap\r\nThe 99-year-old war veteran who has raised £29m for the NHS by walking laps of his garden has been honoured with a special postmark.\r\nRoyal Mail will stamp all letters with the message to celebrate… [+2155 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Sam Elliott", "title": "BGT fans furious to discover Simon Cowell's Golden Buzzer act is West End star - Mirror Online", "description": "Fayth Ifil played a young Tina Turner in the London stage show - and viewers weren't thrilled producers failed to mention this as she wowed with the diva's smash hit Rolling on a River", "url": "https://www.mirror.co.uk/3am/celebrity-news/annoyed-bgt-fans-discover-simon-21928903", "urlToImage": null, "publishedAt": "2020-04-27T00:57:35Z", "content": "Ticked-off Britain's Got Talent viewers are asking questions after discovering Simon Cowell's golden buzzer act is already a West End star. \r\nCute 12-year-old Fayth Ifil is into the show's semi-finals after winning the judges' hearts with her incredible vocal… [+1985 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Nicola Methven", "title": "Stars of The Bill reunite to celebrate first series made available for fans - Mirror Online", "description": "The original cast from 1984, including Trudie Goodwin, Chris Ellison and Eric Richard were reunited by video chat said they had fond memories of filming the show 35 years ago", "url": "https://www.mirror.co.uk/tv/tv-news/stars-bill-reunite-celebrate-first-21930687", "urlToImage": null, "publishedAt": "2020-04-27T00:38:45Z", "content": "Stars of The Bill were back on the beat as the original cast from 1983 were reunited via video to celebrate the first series of the ITV drama being made available to fans.\r\nTrudie Goodwin, who played WPC June Ackland, said the early instalments look very diff… [+6886 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Joanna Crawley For Mailonline", "title": "Sarah-Jane Mee, 41, reveals she is planning a home birth with fiancé by her side - Daily Mail", "description": "Sarah-Jane Mee has spoken out on her change in birth plan amid the covid-19 pandemic.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8259465/Sarah-Jane-Mee-41-reveals-planning-home-birth-fianc-side.html", "urlToImage": null, "publishedAt": "2020-04-27T00:27:10Z", "content": "Sarah-Jane Mee has spoken out on her change in birth plan amid the covid-19 pandemic.\r\nThe Sky News host, who is 28 weeks pregnant, has revealed she is now planning to give birth to her first child at home, to ensure that her fiancé Ben Richardson can be by h… [+2737 chars]"}, {"source": {"id": null, "name": "Nme.com"}, "author": null, "title": "Idris Elba’s Netflix sitcom ‘Turn Up Charlie’ reportedly cancelled after one season - NME Live", "description": "Turn Up Charlie, the Netflix sitcom created by and starring Idris Elba, has been cancelled after just one season, according to reports.", "url": "https://www.nme.com/news/tv/idris-elbas-netflix-sitcom-turn-up-charlie-reportedly-cancelled-after-one-season-2654020", "urlToImage": null, "publishedAt": "2020-04-26T23:39:36Z", "content": "Turn Up Charlie, the Netflix sitcom created by and starring Idris Elba, has been cancelled after just one season, according to reports.\r\nThe show sees Elba playing a one hit wonder 1990s DJ who reluctantly becomes a nanny, and premiered in March 2019.\r\nAccord… [+1261 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Gruffalo artist Axel Sheffler: 'This was something I could do to help' - BBC News", "description": "Axel Sheffler has rushed to publish a book which explains the coronavirus pandemic to children.", "url": "https://www.bbc.com/news/entertainment-arts-52414701", "urlToImage": null, "publishedAt": "2020-04-26T23:14:17Z", "content": "Image copyrightAxel SchefflerImage caption\r\n Axel Sheffler is well known for his illustrations in Julia Donaldson's The Gruafflo\r\n\"I don't feel like I'm very good at drawing real people in the real world\" says a wistful Axel Sheffler.\r\nThe illustrator is famo… [+2748 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Joshua Jones", "title": "WWE chief Vince McMahon claims Brock Lesnar is the reason Raw’s ratings are plummeting - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/11472291/wwe-vince-mcmahon-brock-lesnar-raw/", "urlToImage": null, "publishedAt": "2020-04-26T22:35:07Z", "content": "VINCE McMAHON claims Brock Lesnar is the reason for the dramatic fall in WWE Raw's ratings.\r\nViewing figures released on Thursday showed a 16 per cent drop off for one of WWE's flagship programmes.\r\n Vince McMahon has blamed WWE Raw's viewing figures falling … [+2082 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Rose Hill", "title": "Masked Singer judges stunned after discovering identity of mystery celebs on lockdown special - Mirror Online", "description": "Presenter Joel Dommett was joined by Masked Singer judges Davina McCall and Jonathan Ross as they were tasked with guessing the celebrities masked by emojis", "url": "https://www.mirror.co.uk/tv/tv-news/masked-singer-judges-stunned-after-21930552", "urlToImage": null, "publishedAt": "2020-04-26T22:31:54Z", "content": "The Masked Singer returned tonight in a rather unusual way as Joel Dommett aired a lockdown special from his own home.\r\nThe presenter was joined by judges Davina McCall and Jonathan Ross as they were tasked with guessing the celebrities masked by emojis.\r\nFir… [+1759 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Seamus Duff", "title": "Tiger King star Carole Baskin's husband 'strangled and thrown from plane' - Mirror Online", "description": "The lawyer of Carole's ex-husband Don Lewis, who went missing on 18 August 1997 aged 59, has shared his shocking theory that Don was murdered above the skies and his body dumped in the Gulf of Mexico", "url": "https://www.mirror.co.uk/3am/celebrity-news/tiger-king-star-carole-baskins-21927770", "urlToImage": null, "publishedAt": "2020-04-26T22:26:34Z", "content": "Tiger King star Carole Baskins missing husband was strangled and thrown from a plane, his lawyer has claimed in an astonishing interview.\r\nNetflix fans have been gripped by the hit documentary series Tiger King which focused on the rise and fall of zoo owner … [+3548 chars]"}, {"source": {"id": null, "name": "Digitalspy.com"}, "author": "Chris Edwards", "title": "Gemma Collins makes royal family blunder in new show Diva On Lockdown - digitalspy.com", "description": "\"Honestly crying at Gemma Collins.\"", "url": "https://www.digitalspy.com/tv/reality-tv/a32281363/gemma-collins-prince-charles-diva-on-lockdown/", "urlToImage": null, "publishedAt": "2020-04-26T21:59:00Z", "content": "Gemma Collins is ensuring she's staying in the public eye during this moment of international crisis with her new show Diva On Lockdown – and her fans were left laughing uncontrollably tonight (April 26) when she somehow managed to mispronounce Prince Charles… [+1474 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By William Cole For Mailonline", "title": "Jamie Oliver plans six-figure revamp at his £6million home a year after restaurant chain collapsed - Daily Mail", "description": "The celebrity chef, 44, is applying to add new automatic gates, a new drive and to upgrade the oak-panelled library at 16th Century Spains Hall in Finchingfield, Essex.", "url": "https://www.dailymail.co.uk/news/article-8258871/Jamie-Oliver-plans-six-figure-revamp-6million-home-year-restaurant-chain-collapsed.html", "urlToImage": null, "publishedAt": "2020-04-26T21:30:56Z", "content": "Jamie Oliver has lodged plans for a major refurbishment at his £6million countryside home less than a year after his restaurant chain collapsed.\r\nThe celebrity chef, 44, is applying to add new automatic gates, a new drive and to upgrade the property's oak-pan… [+2435 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Raven Saunt For Mailonline", "title": "Duncan Bannatyne praises NHS staff as he announces the birth of his granddaughter - Daily Mail", "description": "The entrepreneur, 71, took to Twitter to praise frontline staff at the Royal Infirmary of Edinburgh.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8258941/Duncan-Bannatyne-praises-NHS-staff-announces-birth-granddaughter.html", "urlToImage": null, "publishedAt": "2020-04-26T21:15:57Z", "content": "He recently hit out at mega-rich stars including Victoria Beckham and Sir Richard Branson for seeking millions of pounds from the taxpayer to bail out their failing companies.\r\nBut Duncan Bannatyne put the drama aside to praise NHS staff at the Royal Infirmar… [+3911 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Katie Begley", "title": "Michelle Keegan becomes victim of sex attack as Erin in hit show Brassic - Mirror Online", "description": "EXCLUSIVE: The former Coronation Street star has gone from Our Girl to power girl and shows her full emotional range in new show Brassic, with a touch of girl power...", "url": "https://www.mirror.co.uk/tv/michelle-keegan-not-just-eye-21926514", "urlToImage": null, "publishedAt": "2020-04-26T20:57:01Z", "content": "Our Girl star Michelle Keegan slips out of her army uniform and into a slinky eye-popping lycra outfit to celebrate her return to blockbuster dark comedy Brassic.\r\nShes back in her role as cash-strapped single mum Erin for the second outing of the highly accl… [+5635 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Christine Rendon For Dailymail.com", "title": "Kate Beckinsale 'calls the police after encounter with her alleged stalker at her home in Brentwood' - Daily Mail", "description": "At least four police men were seen outside of Kate's house in Brentwood on Saturday. Authorities were pictured rummaging through a backpack placed outside of the house.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8258593/Kate-Beckinsale-calls-police-encounter-alleged-stalker-home-Brentwood.html", "urlToImage": null, "publishedAt": "2020-04-26T20:51:47Z", "content": "Police were seen outside of Kate Beckinsale's home after the actress had an encounter with an alleged stalker.  \r\nFour police men were seen outside of Kate's house in Brentwood on Saturday.\r\nAuthorities were pictured rummaging through a backpack placed outsid… [+2405 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Rianne Addo For Mailonline", "title": "Strictly's Michelle Visage brands Jessie J a 'cold person' after their first meeting - Daily Mail", "description": "In a new interview, the RuPaul's Drag Race judge, 51, claimed she was left disappointed when she  met the singer, 32, during a promotional tour in Australia.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8258955/Strictlys-Michelle-Visage-brands-Jessie-J-cold-person-meeting.html", "urlToImage": null, "publishedAt": "2020-04-26T20:42:15Z", "content": "Strictly Come Dancing 2019 contestant Michelle Visage has slammed Jessie J in a candid new interview.\r\nThe RuPaul's Drag Race judge, 51, claimed she was left disappointed when she met the singer, 32, during a promotional tour in Australia.\r\nBranding the music… [+2952 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Rianne Addo For Mailonline", "title": "Jessie J sparks reconciliation rumours with on-off beau Channing Tatum - Daily Mail", "description": "The singer, 32, marked the screen star's 40th birthday with a sweet Instagram message on Sunday, despite claims they called it quits for a second time earlier this month.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8259031/Jessie-J-sparks-reconciliation-rumours-beau-Channing-Tatum.html", "urlToImage": null, "publishedAt": "2020-04-26T20:32:32Z", "content": "Jessie J has sparked rumours she's back with her on-off boyfriend, actor Channing Tatum.\r\nThe singer, 32, marked the screen star's 40th birthday with a sweet Instagram message on Sunday, despite claims they called it quits for a second time earlier this month… [+4171 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Rebecca Perring", "title": "Meghan Markle and Harry 'will have another baby very soon for Archie to have sibling' - Express", "description": "MEGHAN MARKLE and Prince Harry will have a new royal baby 'very soon' as Prince Harry wants a sibling for their son Archie Harrison, it has been claimed.", "url": "https://www.express.co.uk/news/royal/1274136/meghan-markle-news-meghan-markle-pregnant-royal-baby-news-prince-harry-archie-harrison", "urlToImage": null, "publishedAt": "2020-04-26T20:14:36Z", "content": null}, {"source": {"id": null, "name": "Nme.com"}, "author": null, "title": "Brad Pitt dismantles Donald Trump’s COVID-19 misinformation as Dr. Anthony Fauci on ‘SNL’ - NME Live", "description": "Brad Pitt appeared on last night's 'At Home' edition of Saturday Night Live, playing one of the USA's most prominent scientists leading the country's effort against coronavirus.", "url": "https://www.nme.com/news/tv/brad-pitt-dismantles-donald-trumps-covid-19-misinformation-as-dr-anthony-fauci-on-snl-2654030", "urlToImage": null, "publishedAt": "2020-04-26T20:06:59Z", "content": "Brad Pitt appeared on last night’s ‘At Home’ edition of Saturday Night Live, playing one of the USA’s most prominent scientists leading the country’s effort against coronavirus.\r\nPitt opened the show as Dr. Anthony Fauci, director of the USAs National Institu… [+1624 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Mary Gallagher", "title": "Stacey Solomon hits back at vile troll as she reveals cruel messages calling her ‘ugly’ and ‘a freak’ - The Sun", "description": "", "url": "http://www.thesun.co.uk/tvandshowbiz/11485276/stacey-solomon-hits-back-trolls-messages/", "urlToImage": null, "publishedAt": "2020-04-26T20:05:48Z", "content": "STACEY Solomon revealed she's received cruel messages from vile trolls calling her \"ugly\" and \"a freak\" - as she hit back on Instagram.\r\nThe telly favourite and mum-of-three took to Instagram to show fans the abuse she gets from nasty trolls.\r\nStacey grabbed … [+2437 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Sean O'Grady", "title": "ITV's sleuth drama Van Der Valk is woefully miscast – review - The Independent", "description": "The Dutch capital is captured here in all its tawdry beauty, but plot contrivances and a distracting lead make this Seventies re-hash a hard sell", "url": "https://www.independent.co.uk/arts-entertainment/tv/reviews/van-der-valk-itv-review-marc-warren-remake-a9482466.html", "urlToImage": null, "publishedAt": "2020-04-26T20:04:11Z", "content": "Im not sure what ITV wanted from its (sort-of) new crime series, Van Der Valk. Some of the audience will remember the first series from 1972 with some fondness. The instrumental theme tune (Eye Level) was an unlikely chart hit, a European-set detective show w… [+2927 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": null, "title": "Why the winners of Race Across the World have decided to give away their prize money - Telegraph.co.uk", "description": null, "url": "https://www.telegraph.co.uk/travel/news/race-across-the-world-winners/", "urlToImage": null, "publishedAt": "2020-04-26T20:02:00Z", "content": "Hours and hours spent on long-haul buses are the best way to experience a countrys beating heart.\r\nThis is the verdict of the winners of BBC series Race Across the World, which came to a crescendo on Sunday night; the show saw teams compete to reach Ushuaia, … [+3320 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Jess Flaherty, Nisha Mal", "title": "What all the families on Gogglebox get up to when they're not filming - Plymouth Live", "description": "From a dancer to a former model, this is what the stars get up to when they're not on screen", "url": "https://www.liverpoolecho.co.uk/news/tv/families-starring-gogglebox-what-actually-18140451", "urlToImage": null, "publishedAt": "2020-04-26T20:01:00Z", "content": "Gogglebox viewers have seen many families and couples appear on the show over the years.\r\nMany of which have left fans in hysterics thanks to their witty remarks and TV commentary skills.\r\nScarlett Moffat made her name on Gogglebox and has gone on to turn her… [+7766 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Raven Saunt For Mailonline", "title": "Gordon Ramsay poses with one-year-old son Oscar after extensive bike ride - Daily Mail", "description": "The chef, 53, completed yet another cycle route on Sunday which he celebrated with a post on Instagram.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8258815/Gordon-Ramsay-poses-one-year-old-son-Oscar-extensive-bike-ride.html", "urlToImage": null, "publishedAt": "2020-04-26T19:50:38Z", "content": "He recently risked the wrath of his neighbours after heading out on a 22-mile bike ride from his second home amid the coronavirus lockdown.\r\nBut Gordon Ramsay was undeterred as he completed yet another extensive cycle route on Sunday which he celebrated with … [+4806 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Brendan McFadden", "title": "Elizabeth Hurley's lookalike son Damian stuns fans as he's spitting image of granny - Mirror Online", "description": "Damian, 18, highlighted how he just looks like his grandmother Angela when he shared a snap of them together on her 80th birthday", "url": "https://www.mirror.co.uk/3am/celebrity-news/elizabeth-hurleys-lookalike-son-damian-21929883", "urlToImage": null, "publishedAt": "2020-04-26T19:45:00Z", "content": "It turned out Elizabeth Hurley's lookalike son Damian also looked like his grandmother.\r\nHer son, 18, has often been described as his mum's lookalike but he has now highlighted how he's also the spitting image of his granny.\r\nDamian and Angela looked like so … [+2116 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Abbie Bray", "title": "Naga Munchetty receives support as BBC viewer criticises her for wearing 'heels' - Metro.co.uk", "description": "Naga had the best response!", "url": "https://metro.co.uk/2020/04/26/naga-munchetty-receives-support-fans-bbc-viewer-criticises-wearing-high-heels-12610456/", "urlToImage": null, "publishedAt": "2020-04-26T19:09:20Z", "content": "A host of famous faces stepped in to defend Nagas choice of shoes (Picture: David Fisher/REX)\r\nNaga Munchetty has hit back at one BBC News viewer after he commented on her choice of footwear.\r\nThe BBC Breakfast presenter responded to one viewer who opened a d… [+2316 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Mary Gallagher", "title": "Dancing On Ice pro Alexander Demetriou announces separation from wife Carlotta after he is linked to Maura - The Sun", "description": "", "url": "http://www.thesun.co.uk/tvandshowbiz/11484897/dancing-on-ice-star-carlotta-husband-alexander-separate-maura-higgins/", "urlToImage": null, "publishedAt": "2020-04-26T18:50:13Z", "content": "DANCING On Ice pro Alexander Demetriou has announced he's separated from wife Carlotta Edwards after he was linked to Irish beauty Maura Higgins on the ITV show.\r\nCarlotta's husband Alexander shared a statement on Instagram today that confirmed the news after… [+3495 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Christine Rendon Heather Waugh For Dailymail.com", "title": "Kristin Cavallari announces she and Jay Cutler are to divorce after 10 years together - Daily Mail", "description": "The reality star made the shock announcement on Sunday, writing on Instagram that the couple have decided to get a divorce after 10 years and three children together.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8258853/Kristin-Cavallari-announces-Jay-Cutler-divorce-10-years-together.html", "urlToImage": null, "publishedAt": "2020-04-26T18:35:09Z", "content": "Kristin Cavallari has split from husband Jay Cutler.\r\nThe reality star, 33, made the shock announcement on Sunday, writing on Instagram that the couple have decided to get a divorce after 10 years and three children together. \r\nShe wrote: 'With great sadness,… [+4766 chars]"}, {"source": {"id": null, "name": "Itv.com"}, "author": null, "title": "Daughter of world record breaker Jack Reynolds has paid tribute to 'unforgettable' 108-year-old - ITV News", "description": "The daughter of the world record breaker Jack Reynolds has paid tribute to her 'unforgettable' father, after he passed away at the age of 108.", "url": "https://www.itv.com/news/calendar/2020-04-26/daughter-of-world-record-breaker-jack-reynolds-has-paid-tribute-to-unforgettable-108-year-old/", "urlToImage": null, "publishedAt": "2020-04-26T17:44:00Z", "content": null}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Les Steed", "title": "Tom Hanks’ blood to be used for coronavirus vaccine research - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11483361/tom-hanks-blood-used-cornavirus-vaccine-research/", "urlToImage": null, "publishedAt": "2020-04-26T17:41:51Z", "content": "TOM Hanks and his wife Rita Wilson are donating their blood for vaccine research following their recovery from coronavirus.\r\nTwo-time Oscar winner Hanks was one of the first celebrities to contract coronavirus, announcing it March 11 while they were filming i… [+1955 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Ed McConnell", "title": "Pub beer gardens should reopen if Brits social distance, says government adviser - Mirror Online", "description": "Government adviser Professor Robert Dingwall has said Brits should be allowed to go back to boozing in pub beer gardens if they are able to follow coronavirus social distancing rules", "url": "https://www.mirror.co.uk/news/uk-news/pub-beer-gardens-should-reopen-21929622", "urlToImage": null, "publishedAt": "2020-04-26T17:32:13Z", "content": "Brits should be able to go back to boozing in pub beer gardens, according to one government advisor.\r\nProfessor Robert Dingwall, who sits on the New and Emerging Respiratory Virus Threats Advisory Group, said if landlords are prepared to accept responsibility… [+1663 chars]"}, {"source": {"id": null, "name": "Digitalspy.com"}, "author": "Charley Ross", "title": "Tom Holland's performance in new movie Cherry is \"Oscar-worthy\", according to Joe Russo - digitalspy.com", "description": "\"He is shredding himself, physically and emotionally.\"", "url": "https://www.digitalspy.com/movies/a32280113/tom-holland-cherry-oscar-worthy-joe-russo/", "urlToImage": null, "publishedAt": "2020-04-26T17:22:00Z", "content": "Marvel star Tom Holland sure has broken out of the Spidey web and is beginning to make Hollywood his own. \r\nEven though he still has the third Spider-Man film to come, Holland is also starring in a shedload of new exciting movies, including (but not limited t… [+2257 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Gerrard Kaonga", "title": "The REAL reason Prince Harry opens up about mental health struggles and William doesn't - Express", "description": "PRINCE HARRY and Prince William have both championed the importance of mental health but an expert has exposed the reason the Duke of Sussex opens up more about his own struggles.", "url": "https://www.express.co.uk/news/royal/1274066/Prince-Harry-News-Prince-William-mental-health-update-latest-Royal-family", "urlToImage": null, "publishedAt": "2020-04-26T17:13:05Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "OMG! MAGIC man Sean Heydon WOWS with TIME TRAVELLING trick! | BGT: UNSEEN - Britain's Got Talent", "description": "Ever fancied going back in time? Magician Sean Heydon has just the trick... Taking card tricks to a whole new dimension (and time zone!), watch as he leaves ...", "url": "https://www.youtube.com/watch?v=qNJJrxaEDKA", "urlToImage": null, "publishedAt": "2020-04-26T17:00:17Z", "content": null}, {"source": {"id": null, "name": "Theguardian.comtv-and-radio"}, "author": "Anthony Hayward", "title": "Lynn Faulds Wood obituary - The Guardian", "description": "Presenter of BBC TV’s consumer rights show Watchdog who went on to become a campaigner for bowel cancer patients", "url": "https://amp.theguardian.comtv-and-radio/2020/apr/26/lynn-faulds-wood-obituary", "urlToImage": null, "publishedAt": "2020-04-26T16:57:59Z", "content": "Lynn Faulds Wood, who has died of a stroke aged 72, was a journalist whose warm personality and relentless campaigning made her popular on screen as a consumer champion over three decades in breakfast television and as a presenter of Watchdog.\r\nBy the time sh… [+5484 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nJessica Carpani", "title": "Royal fears as Duke and Duchess of Sussex cooperate with journalists on new biography - Telegraph.co.uk", "description": "The book is provisionally titled 'Thoroughly Modern Royals: The Real World Of Harry And Meghan'", "url": "https://www.telegraph.co.uk/news/2020/04/26/royal-fears-duke-duchess-sussex-cooperate-journalists-new-biography/", "urlToImage": null, "publishedAt": "2020-04-26T16:30:00Z", "content": "The couple, who have since moved to California with their 11-month-old son Archie, were said to have given an interview for the book, jointly written by Omid Scobie and Carolyn Durand, according to The Mail on Sunday.\r\nBut sources close to the Sussexes stress… [+1779 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Jack Newman For Mailonline", "title": "Sam Smith admits they freaked out about being single in lockdown and wants to date an older man - Daily Mail", "description": "The singer's last serious relationship was with Brandon Flynn, 26, in 2018, and the star revealed they immediately turned to dating apps when the restrictions were imposed.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8258427/Sam-Smith-admits-freaked-single-lockdown-wants-date-older-man.html", "urlToImage": null, "publishedAt": "2020-04-26T16:23:35Z", "content": "Sam Smith has admitted they freaked out about being single when the coronavirus lockdown started in the UK.\r\nThe singer's last serious relationship was with Brandon Flynn, 26, in 2018, and the star revealed they immediately turned to dating apps when the rest… [+2790 chars]"}, {"source": {"id": null, "name": "Cosmopolitan.com"}, "author": "Alanna Lauren Greco", "title": "The Queen and Prince Philip Are Self-Isolating with 22 Staff Members at Windsor Castle - Cosmopolitan.com", "description": "Cool-cool-cool.", "url": "https://www.cosmopolitan.com/entertainment/celebs/a32280194/queen-self-isolating-with-22-staff-members-windsor-castle/", "urlToImage": null, "publishedAt": "2020-04-26T16:17:00Z", "content": "<ul><li>Queen Elizabeth and Prince Philip are self-isolating with many members of the Queen's senior staff at Windsor Castle. </li><li>The staff isn't allowed to see their family while quarantining with the Queen. </li></ul><ol></ol>\r\nAre you struggling with … [+1406 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Monique Friedlander For Daily Mail Australia", "title": "Westworld's Thandie Newton admits she's shocked at her late-career boost - Daily Mail", "description": "After spending two decades  in the acting game, Thandie Newton is finally enjoying the kind of career boost she expected to have in her twenties.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8257587/Westworlds-Thandie-Newton-admits-shes-shocked-late-career-boost.html", "urlToImage": null, "publishedAt": "2020-04-26T16:14:10Z", "content": "After spending two decades in the acting game, Thandie Newton is finally enjoying the kind of career boost she expected to have in her twenties.\r\nThe 47-year-old actress has become a household name thanks to the success of HBO's sci-fi drama Westworld, with h… [+2315 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Jon Boon", "title": "Mike Tyson’s three wives including one he caught having sex with Brad Pitt, one who is a doctor and ex-con K - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/11472016/mike-tyson-wife-brad-pitt/", "urlToImage": null, "publishedAt": "2020-04-26T15:27:17Z", "content": "BOXING legend Mike Tyson is the most settled he's ever been.\r\nAnd that could be because of the influence of his new wife, Lakiha Spicer.\r\n Mike Tyson has married three different women in his lifetimeCredit: New York Daily News - Getty\r\nTyson's first wife Robi… [+5436 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Tilly Pearce", "title": "Ricky Gervais explains After Life 2's heartbreaking final scene - Metro.co.uk", "description": "***Warning: After Life spoilers ahead***", "url": "https://metro.co.uk/2020/04/26/ricky-gervais-explains-life-2s-heartbreaking-final-scene-means-tonys-future-12612311/", "urlToImage": null, "publishedAt": "2020-04-26T14:39:38Z", "content": "Ricky explained the heartbreaking final scene of After Life season 2 (Picture: Netflix)\r\n*** Warning: After Life season 2 spoilers ahead *** \r\nRicky Gervais has opened up about the final scene of After Life 2, and what that means for Tony going forward. \r\nThe… [+3716 chars]"}, {"source": {"id": null, "name": "Standard.co.uk"}, "author": "Ewan Somerville", "title": "Chelsea Flower Show unveils online displays and exhibitions after event cancelled - Evening Standard", "description": "", "url": "https://www.standard.co.uk/news/london/chelsea-flower-show-online-event-rhs-a4424306.html", "urlToImage": null, "publishedAt": "2020-04-26T14:26:17Z", "content": "The Chelsea Flower Show is moving online with a series of virtual exhibitions after it was cancelled. \r\nThe Royal Horticultural Society (RHS) said this summer would mark its first ever virtual version of the event at Royal Hospital Chelsea, London. \r\nThe show… [+1722 chars]"}, {"source": {"id": null, "name": "Digitalspy.com"}, "author": "Susannah Alexander", "title": "Star Wars artist shares alternate Rise of Skywalker Dark Rey look - digitalspy.com", "description": "Rey could have looked even more ruthless when she showed her dark side.", "url": "https://www.digitalspy.com/movies/a32279666/star-wars-dark-rey-alternate-concept-art/", "urlToImage": null, "publishedAt": "2020-04-26T14:00:00Z", "content": "Star Wars: Rise of Skywalker contained a number of moments that completely split fan opinion, from that Rey and Kylo Ren kiss to the decision to sideline Rose Tico after her introduction in The Last Jedi.\r\nAnother plot element that some fans questioned was th… [+1936 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Why Infinity War And Endgame Did Not Feature The Eternals - CBR", "description": "Why Weren’t the Eternals in the Infinity Saga, SUBSCRIBE NOW to CBR! Click here: http://bit.ly/Subscribe-to-CBR As much as we love major Marvel Cinematic Uni...", "url": "https://www.youtube.com/watch?v=FCnEZ4vhPmc", "urlToImage": null, "publishedAt": "2020-04-26T13:45:00Z", "content": null}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Tim Ashley", "title": "The Metropolitan Opera’s At-Home Gala review – thrilling singing, live from the stars’ living-rooms - The Guardian", "description": "This technically remarkable event offered performances from more than 40 of the Met’s regular singers – as well as an irresistible peek into their homes", "url": "https://www.theguardian.com/music/2020/apr/26/the-metropolitan-opera-at-home-gala-review", "urlToImage": null, "publishedAt": "2020-04-26T13:42:54Z", "content": "In many ways, it was quite extraordinary. Streamed on its website, the Metropolitan Operas At-Home Gala, featured more than 40 of the houses regular singers, most of whom performed live via Skype live from their living rooms and studies, or indeed, in the cas… [+2629 chars]"}, {"source": {"id": null, "name": "Ringsidenews.com"}, "author": "H Jenkins", "title": "Clear Betting Favorite To Win Men's Money In The Bank Match - Ringside News", "description": "WWE is holding a very different kind of Money In The Bank pay-per-view this year. Since they can't have the event in Baltimore in front of screaming fans", "url": "https://www.ringsidenews.com/2020/04/26/clear-betting-favorite-to-win-mens-money-in-the-bank-match/", "urlToImage": null, "publishedAt": "2020-04-26T13:11:00Z", "content": "WWE is holding a very different kind of Money In The Bank pay-per-view this year. Since they can’t have the event in Baltimore in front of screaming fans like they wanted, the company is holding the big ladder matches on the roof of their Stamford headquarter… [+1089 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Removed: article - The Guardian", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMid2h0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS93b3JsZC8yMDIwL2Fwci8yNi91ay1jb3VsZC1iZWNvbWUtY3VsdHVyYWwtd2FzdGVsYW5kLWR1ZS10by1jb3JvbmF2aXJ1cy1zYXktbGVhZGluZy1hcnRpc3Rz0gF3aHR0cHM6Ly9hbXAudGhlZ3VhcmRpYW4uY29tL3dvcmxkLzIwMjAvYXByLzI2L3VrLWNvdWxkLWJlY29tZS1jdWx0dXJhbC13YXN0ZWxhbmQtZHVlLXRvLWNvcm9uYXZpcnVzLXNheS1sZWFkaW5nLWFydGlzdHM?oc=5", "urlToImage": null, "publishedAt": "2020-04-26T12:08:00Z", "content": null}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Emily Hennings", "title": "Britain's Got Talent fans baffled as show thrown into chaos in Ant and Dec blunder - Express", "description": "BRITAIN'S GOT TALENT continued last night with Simon Cowell, David Walliams, Alesha Dixon, and Amanda Holden. But, one act on the ITV reality programme threw the show into chaos when he didn't know who the hosts were.", "url": "https://www.express.co.uk/showbiz/tv-radio/1274023/britains-got-talent-chaos-ant-dec-singer-Bhim-Niroula-blunder-mistake-itv-video", "urlToImage": null, "publishedAt": "2020-04-26T11:51:29Z", "content": null}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Per Olov Enquist: Swedish author dies at the age of 85 - BBC News", "description": "He penned more than 20 novels, plays and essays which won a number of awards at home and abroad.", "url": "https://www.bbc.com/news/world-europe-52432215", "urlToImage": null, "publishedAt": "2020-04-26T11:03:13Z", "content": "Image copyrightGetty ImagesImage caption\r\n Per Olov Enquist at his home in Stockholm in 2011\r\nOne of Sweden's best-known authors, Per Olov Enquist, has died aged 85.\r\nHis career spanned more than half a century, and his work won acclaim not just in his native… [+911 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "BBC News", "title": "Coronavirus: Naomi Campbell and African artists entertain fans online - BBC News", "description": "Big-name celebrities and artists have been going online to entertain their fans during the pandemic.", "url": "https://www.bbc.co.uk/news/av/world-africa-52417537/coronavirus-naomi-campbell-and-african-artists-entertain-fans-online", "urlToImage": null, "publishedAt": "2020-04-26T10:51:25Z", "content": null}, {"source": {"id": null, "name": "Nme.com"}, "author": null, "title": "Jeff Goldblum faces backlash for Islam comments on RuPaul’s Drag Race - NME Live", "description": "Jeff Goldblum has faced backlash from viewers of RuPaul's Drag Race after his comments on Islam's treatment of women and LGBTQ+ people", "url": "https://www.nme.com/news/tv/jeff-goldblum-faces-backlash-for-islam-comments-on-rupauls-drag-race-2653984", "urlToImage": null, "publishedAt": "2020-04-26T10:47:21Z", "content": "Jeff Goldblum has faced backlash from viewers of RuPaul‘s Drag Race after his comments on Islam.\r\nAppearing as a guest judge, he asked one contestant Jackie Cox, who is of Iranian ancestry, about Islam’s treatment of women and the LGBTQ+ community.\r\nIm here, … [+3954 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Alicia Adejobi", "title": "Chris Pratt and Katherine Schwarzenegger enjoy bike ride amid ‘pregnancy’ - Metro.co.uk", "description": "The couple are said to be expecting their first child.", "url": "https://metro.co.uk/2020/04/26/chris-pratt-katherine-schwarzenegger-break-isolation-enjoy-bike-ride-amid-pregnancy-claims-12611312/", "urlToImage": null, "publishedAt": "2020-04-26T09:15:48Z", "content": "Chris Pratt and Katherine Schwarzenegger stepped out for fresh air this weekend (Picture: Mega)\r\nChris Pratt and Katherine Schwarzenegger made sure to keep up with their fitness this weekend with a bike ride, amid reports they are expecting their first child … [+2646 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Robert Webb", "title": "'They were literally about to turn me off and on again': Robert Webb on his brush with mortality - The Guardian", "description": "A routine medical brought life-changing news for the comedian and author. And the curious thing was he’d predicted it in his new novel", "url": "https://www.theguardian.com/books/2020/apr/26/they-were-literally-about-to-turn-me-off-and-on-again-robert-webb-on-his-brush-with-mortality", "urlToImage": null, "publishedAt": "2020-04-26T09:00:55Z", "content": "There are moments when your life changes over the length of a single word. For example, you might remember that particular time you heard the word pregnant. Or maybe divorce or congratulations or guilty. And maybe you remember the silence that followed and ho… [+8084 chars]"}, {"source": {"id": null, "name": "Nme.com"}, "author": null, "title": "Phoebe Waller-Bridge has the ‘Fleabag’ wall of penises in her house - NME Live", "description": "Phoebe Waller-Bridge, creator and star of the hit sitcom Fleabag has revealed that she keeps the show's 'wall of penises' in her house.", "url": "https://www.nme.com/news/tv/phoebe-waller-bridge-has-the-fleabag-wall-of-penises-in-her-house-2653954", "urlToImage": null, "publishedAt": "2020-04-26T08:41:29Z", "content": "Phoebe Waller-Bridge, creator and star of the hit sitcom Fleabag has revealed that she keeps the show’s ‘wall of penises’ in her house.\r\nAppearing on The Graham Norton Show from home, the writer and actor showed viewers how she keeps the prop by her front doo… [+1201 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Euan Ferguson", "title": "The week in TV: After Life; Gangs of London; Emergence; Have I Got News for You – and more - The Guardian", "description": "Ricky Gervais’s After Life struggles second time round, as 21st-century London’s answer to Peaky Blinders gets off to a flying, if violent, start", "url": "https://www.theguardian.com/tv-and-radio/2020/apr/26/the-week-in-tv-after-life-gangs-of-london-emergence-have-i-got-news-for-you-and-more", "urlToImage": null, "publishedAt": "2020-04-26T08:31:06Z", "content": "After Life (Netflix)Gangs of London (Sky Atlantic)Emergence (Fox)Twin (BBC Four) | iPlayerThe Graham Norton Show (BBC One) | iPlayerThe Mash Report (BBC Two) | iPlayerHave I Got News for You (BBC One) | iPlayer\r\nRicky Gervais is, take your pick, ever reinvent… [+6803 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Katie Fitzpatrick", "title": "Teetotal Christine McGuinness says she's been thinking about alcohol in lockdown after 12 years sober - Manchester Evening News", "description": "The mum-of-three hasn't had a drink in more than 12 years", "url": "https://www.manchestereveningnews.co.uk/news/showbiz-news/teetotal-christine-mcguinness-says-shes-18150469", "urlToImage": null, "publishedAt": "2020-04-26T08:20:10Z", "content": "Reality star mum Christine McGuinness has revealed that she's been thinking about alcohol in lockdown after going more than 12 years without a drink.\r\nThe mother-of-three opened up to her followers on Instagram, saying she'd been casting her mind back her fav… [+2375 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Fay Watson", "title": "Normal People: Daisy Edgar-Jones stars in trailer for new series - Express", "description": "NORMAL PEOPLE is the much-anticipated adaptation of Sally Rooney's novel. Here's what Express.co.uk thought of the new series.", "url": "https://www.express.co.uk/showbiz/tv-radio/1273629/Normal-People-review-series-BBC-Three-Hulu-Sally-Rooney-Paul-Mescal-Daisy-Edgar-Jones", "urlToImage": null, "publishedAt": "2020-04-26T08:02:54Z", "content": null}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Alicia Adejobi", "title": "Love Island’s Molly-Mae Hague complains about ‘captivity’ in plush flat - Metro.co.uk", "description": "She moved into the Manchester pad with boyfriend Tommy Fury last week.", "url": "https://metro.co.uk/2020/04/26/love-islands-molly-mae-hague-complains-lockdown-captivity-luxury-flat-sauna-12611096/", "urlToImage": null, "publishedAt": "2020-04-26T07:58:50Z", "content": "Molly-Mae Hague says living in her plush flat is like absolute captivity (Picture: Molly-Mae Hague, Instagram)\r\nLove Island star Molly-Mae Hague has compared living in her stunning apartment, which boasts a private sauna, to absolute captivity during the lock… [+2349 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Nosheen Iqbal", "title": "Pranks, skits and dancing… welcome to the TikTok house - The Guardian", "description": "Six of generation Z’s star performers are living under the the same roof to create content for their 15 million followers", "url": "https://www.theguardian.com/technology/2020/apr/26/tiktok-house-stars-move-in-together", "urlToImage": null, "publishedAt": "2020-04-26T07:17:00Z", "content": "Imagine a cross between Love Island and Big Brother and you would be part way to understanding the hype behind Britains first TikTok house.\r\nLaunched online last week, Bytehouse has bundled six of the nations biggest TikTok stars to live together in a house i… [+3096 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Katie Price sexually assaulted during terrifying South Africa carjacking - Yahoo News UK", "description": null, "url": "https://consent.yahoo.com/collectConsent?sessionId=1_cc-session_ad7aa7f9-e415-4daf-b783-cd2df862c080&lang=en-GB&inline=false", "urlToImage": null, "publishedAt": "2020-04-26T06:57:07Z", "content": "Yahoo is part of Verizon Media. Click 'I agree' to allow Verizon Media and our partners to use cookies and similar technologies to access your device and use your data (including location) to understand your interests, and provide and measure personalised ads… [+344 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nNick Allen", "title": "Kanye West is a billionaire, says Forbes, after row over rapper's wealth - Telegraph.co.uk", "description": "West disputes the 1.3 billion valuation and says he is worth much more", "url": "https://www.telegraph.co.uk/news/2020/04/26/kanye-west-billionaire-says-forbes-row-rappers-wealth/", "urlToImage": null, "publishedAt": "2020-04-26T00:19:00Z", "content": "Kanye West, the mercurial rapper and fashion mogul, has officially gained the status of \"billionaire\" following a long and acrimonious dispute over his wealth with Forbes magazine.\r\nThe feud began after the august financial publication featured West, 42, on i… [+695 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Hannah Hope", "title": "Strictly’s Katya Jones ‘deeply embarrassed’ after X-rated photos of her leak online - The Sun", "description": "", "url": "http://www.thesun.co.uk/tvandshowbiz/11481566/katya-jones-naked-pictures-hacked/", "urlToImage": null, "publishedAt": "2020-04-25T22:35:04Z", "content": "STRICTLY Come Dancing star Katya Jones has been left with fresh turmoil after X-rated photos of her were leaked online.\r\nThe stunning Russian professional dancer, 30, has told friends she is deeply embarrassed and regrets taking the sexy snaps as they were ne… [+2626 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Lily Waddell", "title": "Mike Tyson admits Tiger King's Joe Exotic could have sold him big cats as pets - Irish Mirror", "description": "Mike Tyson confessed he could have got his tigers indirectly from Tiger King star Joe Exotic in the early 1990s", "url": "https://www.mirror.co.uk/3am/celebrity-news/mike-tyson-admits-tiger-kings-21927371", "urlToImage": null, "publishedAt": "2020-04-25T21:35:00Z", "content": "Mike Tyson admitted he could have got his big cats from Tiger King star Joe Exotic.\r\nThe boxing champion, 53, splashed out his cash on three Bengal tigers as house pets at his home.\r\nTyson confessed he could have got his tigers from now-jailed zoo operator Jo… [+1739 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Sophie McCoid, Zoe Forsey", "title": "Queen's secret signals for when she wants to leave conversations - Liverpool Echo", "description": "Her Majesty has a few tricks to communicate with staff", "url": "https://www.liverpoolecho.co.uk/news/uk-world-news/queens-secret-signals-wants-leave-18151647", "urlToImage": null, "publishedAt": "2020-04-25T19:33:47Z", "content": "The Queen has spoken to millions of people during her lifetime and has come up with ways to communicate with her staff during events, it has been claimed.\r\nHer Majesty is used to small talk, but when she's finished talking to someone and would like to leave s… [+2198 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Eurovision Song Contest 2007 - Grand Final - Full Show - Eurovision Song Contest", "description": "The Final of the 52nd Eurovision Song Contest took place in Helsinki, Finland, at the Hartwall Arena. For the occasion, the venue was referred to as the Hels...", "url": "https://www.youtube.com/watch?v=wuvUVAJuhbA", "urlToImage": null, "publishedAt": "2020-04-25T18:58:11Z", "content": null}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Isla Williams", "title": "Timothée Chalamet and Lily-Rose Depp 'split' after a year of dating - Metro.co.uk", "description": "Say it isn't so.", "url": "https://metro.co.uk/2020/04/25/timothee-chalamet-lily-rose-depp-split-year-dating-12610064/", "urlToImage": null, "publishedAt": "2020-04-25T17:43:22Z", "content": "The two are said to have split after more than a year of dating (Picture: FilmMagic/Backgrid)\r\nTimothee Chalamet and Lily-Rose Depp have reportedly split after more than a year of dating.\r\nThe couple have recently called it quits on their romance, according t… [+2247 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Mick Jagger responds to Paul McCartney's claims The Beatles were better than The Rolling Stones - Yahoo News UK", "description": null, "url": "https://consent.yahoo.com/collectConsent?sessionId=1_cc-session_31bf4dca-b274-43e4-bf41-ca81ecb34a22&lang=en-GB&inline=false", "urlToImage": null, "publishedAt": "2020-04-25T12:18:00Z", "content": "Yahoo is part of Verizon Media. Click 'I agree' to allow Verizon Media and our partners to use cookies and similar technologies to access your device and use your data (including location) to understand your interests, and provide and measure personalised ads… [+344 chars]"}, {"source": {"id": null, "name": "Entertainmentdaily.co.uk"}, "author": "Entertainment Daily", "title": "Coronation Street villain Geoff forces Yasmeen into sex in sickening scenes - Entertainment Daily", "description": "There's no low to which he won't stoop", "url": "https://www.entertainmentdaily.co.uk/soaps/coronation-street-villain-geoff-forces-yasmeen-into-sex-in-sickening-scenes/", "urlToImage": null, "publishedAt": "2020-04-25T09:43:52Z", "content": "Coronation Street fans are devastated and sickened by Geoff Metcalfe forcing wife Yasmeen to have sex.\r\nEvil Geoff coerced Yasmeen into satisfying his sick demands despite her being clearly unwell and unwilling.\r\nCoronation Street villain Geoff forced Yasmeen… [+2276 chars]"}]}