{"status": "ok", "totalResults": 69, "articles": [{"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Brogan-Leigh Hurst", "title": "Pregnant Rochelle Humes cries as she 'struggles to cope' with intense morning sickness - Mirror Online", "description": "Rochelle Humes opened up about the struggles of her third pregnancy as she locked herself away to cry", "url": "https://www.mirror.co.uk/3am/celebrity-news/pregnant-rochelle-humes-cries-struggles-21928001", "urlToImage": null, "publishedAt": "2020-04-26T12:48:37Z", "content": "Rochelle Humes has admitted she locked herself away to cry as she struggled to cope with the side effects of her third pregnancy. \r\n The TV presenter, who is expecting a third child with husband Marvin, posted a gorgeous snap on Instagram yesterday and told f… [+1906 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Emily Webber James Robinson for MailOnline", "title": "Duchess of Cambridge was 'moved to tears' by stories of frontline staff - Daily Mail", "description": "The Duchess of Cambridge was 'moved to tears' by the sacrifices of frontline workers, leading the royal couple to launc their mental health support service 'Our Frontline' last week.", "url": "https://www.dailymail.co.uk/femail/article-8258309/Duchess-Cambridge-moved-tears-stories-frontline-staff.html", "urlToImage": null, "publishedAt": "2020-04-26T12:42:17Z", "content": "The Duchess of Cambridge was 'moved to tears' by the sacrifices of frontline workers, leading the royal couple to launc their mental health support service 'Our Frontline' last week. \r\nKate Middleton, 38, has played a 'pivotal' role in setting up the new init… [+5064 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Rose Hill", "title": "Coronavirus: Sky News presenter breaks down as she reads out names of those who've died - Mirror Online", "description": "Sky News journalist Kimberley Leonard was forced to pause as she became tearful while reporting on the 20,319 deaths from covid-19 in the UK", "url": "https://www.mirror.co.uk/tv/tv-news/sky-news-presenter-breaks-down-21926415", "urlToImage": null, "publishedAt": "2020-04-26T11:54:59Z", "content": "A presenter broke down in tears live during a Sky News broadcast while reporting on the 20,319 deaths from coronavirus in the UK. \r\nSpeaking about the covid-19 pandemic on the channel earlier today, journalist Kimberley Leonard spoke about a handful of the pe… [+1655 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Claire Toureille For Mailonline", "title": "The Queen will video call Princess Charlotte on her fifth birthday next Saturday - Daily Mail", "description": "Princess Charlotte is set to spend her fifth birthday in isolation with her parents and brothers at Anmer Hall. A source told the Sun the young royal would also video call her great-grandmother the Queen.", "url": "https://www.dailymail.co.uk/femail/article-8258167/The-Queen-video-call-Princess-Charlotte-fifth-birthday-Saturday.html", "urlToImage": null, "publishedAt": "2020-04-26T11:43:02Z", "content": "Princess Charlotte will spend her fifth birthday in isolation next Saturday, but will enjoy a video call with the royal family, a source has claimed. \r\nThe daughter of the Duke and Duchess of Cambridge, who is currently isolating in Norfolk with her family, i… [+3938 chars]"}, {"source": {"id": null, "name": "Standard.co.uk"}, "author": "Ewan Somerville", "title": "Harry and Meghan 'help journalists write bombshell new biography' that risks opening new royal wounds - Evening Standard", "description": "", "url": "https://www.standard.co.uk/news/uk/prince-harry-meghan-markle-biography-sussexes-a4424291.html", "urlToImage": null, "publishedAt": "2020-04-26T11:03:34Z", "content": "Harry and Meghan are set to release an explosive biography that could further pull apart a wounded Royal Family, it has been claimed. \r\nThe Duke and Duchess of Sussex have chosen two \"favourable\" journalists to write a glowing account of their blossoming roma… [+6237 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Sean O'grady For Mailonline", "title": "Molly-Mae Hague likens apartment living in lockdown to 'absolute captivity' - Daily Mail", "description": "The Love Island star, 20, is quarantining with boyfriend Tommy Fury, also 20, in the couple's swanky apartment which features a built-in sauna.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8258165/Molly-Mae-Hague-likens-apartment-living-lockdown-absolute-captivity.html", "urlToImage": null, "publishedAt": "2020-04-26T10:58:06Z", "content": "Celebrities have regularly taken to social media during the coronavirus lockdown to document some of the mundane realities of everyday life.\r\nHowever, public sympathy for the stars - many of them multi-millionaires - has been in short supply as Brits across t… [+4472 chars]"}, {"source": {"id": null, "name": "Nme.com"}, "author": null, "title": "Jeff Goldblum faces backlash for Islam comments on RuPaul’s Drag Race - NME Live", "description": "Jeff Goldblum has faced backlash from viewers of RuPaul's Drag Race after his comments on Islam's treatment of women and LGBTQ+ people", "url": "https://www.nme.com/news/tv/jeff-goldblum-faces-backlash-for-islam-comments-on-rupauls-drag-race-2653984", "urlToImage": null, "publishedAt": "2020-04-26T10:47:21Z", "content": "Jeff Goldblum has faced backlash from viewers of RuPaul‘s Drag Race after his comments on Islam.\r\nAppearing as a guest judge, he asked one contestant Jackie Cox, who is of Iranian ancestry, about Islam’s treatment of women and the LGBTQ+ community.\r\nIm here, … [+3954 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Lucy Needham", "title": "The Masked Singer returns tonight with new celebs and disguises in lockdown special - Mirror Online", "description": "The singing contest had been a huge hit for ITV when it broadcast in January and a second instalment has come sooner than fans thought", "url": "https://www.mirror.co.uk/tv/tv-news/masked-singer-returns-tonight-new-21928242", "urlToImage": null, "publishedAt": "2020-04-26T10:35:36Z", "content": "The Masked Singer is set to make a return for a lockdown special with host Joel Dommett at the helm.\r\nThe singing contest, which sees a group of celebs performing in elaborate disguises, had been a huge hit for ITV earlier this year.\r\nPresenter Joel sparked a… [+1897 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Sam Elliott", "title": "Piers Morgan flirts with Love Island's Lucie Donlan following Donald Trump heartache - Mirror Online", "description": "The Good Morning Britain host turned his attentio to the stunning ex-Islander with a cheeky Instagram message", "url": "https://www.mirror.co.uk/3am/celebrity-news/piers-morgan-flirts-love-islands-21928043", "urlToImage": null, "publishedAt": "2020-04-26T10:26:50Z", "content": "Piers Morgan is helping get over his social media shunning by President Trump by flirting outrageously with Love Island babe Lucie Donlan.\r\nThe 55-year-old left a cheeky comment on the ITV2 star's latest sizzling bikini post.\r\nThe Good Morning Britain present… [+2291 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Isabella Nikolic For Mailonline", "title": "Dancing On Ice star Carlotta Edwards' marriage rift 'came as a shock' - Daily Mail", "description": "Carlotta Edwards, 30, and Alex Demetriou, 28, are taking a break after he became very close with Love Island's Maura Higgins, 29, when she appeared on Dancing on Ice.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8258045/Dancing-Ice-star-Carlotta-Edwards-marriage-rift-came-shock.html", "urlToImage": null, "publishedAt": "2020-04-26T10:17:46Z", "content": "The marriage rift between Dancing on Ice stars Carlotta Edwards and Alex Demetriou over Maura Higgins came as a shock to her family, a source has revealed.\r\nCarlotta and Alex are taking a break after he became very close with the Love Island star who he was p… [+2298 chars]"}, {"source": {"id": null, "name": "Entertainmentdaily.co.uk"}, "author": "Entertainment Daily", "title": "Coronation Street's Simon Gregson stuns fans with bald head transformation - Entertainment Daily", "description": "He's taken full advantage of the soap's shutdown", "url": "https://www.entertainmentdaily.co.uk/soaps/coronation-street-simon-gregson-bald-head/", "urlToImage": null, "publishedAt": "2020-04-26T10:15:18Z", "content": "Simon Gregson has stunned Coronation Street fans with his bald lockdown transformation.\r\nThe Steve McDonald actor took part in the Corrie singalong with Matt Lucas for his Baked Potato song where he revealed his new look.\r\nHe had shaved his hair completely of… [+2179 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Ellie May Donohoe For Mailonline", "title": "Strictly Come Dancing professionals 'fight for a pay rise' after their tours are cancelled - Daily Mail", "description": "Strictly Come Dancing's professional dancers are reportedly fighting for a pay rise from the show after their extra income earned from tours is lost amid the coronavirus pandemic.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8258067/Strictly-Come-Dancing-professionals-fight-pay-rise-tours-cancelled.html", "urlToImage": null, "publishedAt": "2020-04-26T10:06:31Z", "content": "Strictly Come Dancing's professional dancers are reportedly fighting for a pay rise from the show after their extra income earned from tours is lost amid the coronavirus pandemic.  \r\nThis comes after it was reported that show bookers are able to 'double' what… [+3324 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Sam Wolfson", "title": "For my next trick: Dynamo's mission to bring back magic - The Guardian", "description": "In a world of deepfakes and augmented reality has magic lost its power to thrill? The performer Dynamo says we need it now more than ever", "url": "https://www.theguardian.com/culture/2020/apr/26/for-my-next-trick-dynamo-mission-to-bring-back-magic", "urlToImage": null, "publishedAt": "2020-04-26T10:01:06Z", "content": "Midnight in Tokyo. Im standing in a narrow alleyway behind one of the hostess clubs in the capitals red-light district. A large screen displays live updates of the gender balance inside, currently: ladies 113, men 87. Just around the corner is a famous hangou… [+12510 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Annie Lord", "title": "Laurence Fox reveals brother-in-law Richard Ayoade's furious reaction to Question Time race row - The Independent", "description": "The ‘IT Crowd’ star did not agree with Fox’s comments on ‘Question Time’ and ignored Fox’s pleas to support him on social media", "url": "https://www.independent.co.uk/arts-entertainment/tv/news/lawrence-fox-richard-ayoade-racism-row-question-time-meghan-markle-a9484406.html", "urlToImage": null, "publishedAt": "2020-04-26T09:53:03Z", "content": "Laurence Fox has revealed how his brother-in-law, the comedian, writer and actor Richard Ayoade, reacted after his notorious appearance on BBCs Question Time. \r\nDuring his appearance on the political chat show, Fox accused a woman of colour of racism after sh… [+1410 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Sean O'grady For Mailonline", "title": "Feud between Oasis and Blur started after Damon Albarn slept with Liam's girlfriend - Daily Mail", "description": "According to The Sun, Noel claimed a lot of drugs were involved: 'Liam and Damon were s****ing the same bird and there was a lot of cocaine involved. That's where the germ of it grew from.'", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8258033/Feud-Oasis-Blur-started-Damon-Albarn-slept-Liams-girlfriend.html", "urlToImage": null, "publishedAt": "2020-04-26T09:17:39Z", "content": "The feud between Oasis and Blue was due to Damon Albarn sleeping with a woman Liam Gallagher was dating at the time, his brother Noel has claimed.\r\nNoel, 52, revealed the infamous chart battle between the two rock groups kicked off after Liam, 47, found out B… [+2877 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Robert Webb", "title": "'They were literally about to turn me off and on again': Robert Webb on his brush with mortality - The Guardian", "description": "A routine medical brought life-changing news for the comedian and author. And the curious thing was he’d predicted it in his new novel", "url": "https://www.theguardian.com/books/2020/apr/26/they-were-literally-about-to-turn-me-off-and-on-again-robert-webb-on-his-brush-with-mortality", "urlToImage": null, "publishedAt": "2020-04-26T09:00:55Z", "content": "There are moments when your life changes over the length of a single word. For example, you might remember that particular time you heard the word pregnant. Or maybe divorce or congratulations or guilty. And maybe you remember the silence that followed and ho… [+8084 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "BBC News", "title": "Sally Rooney's novel Normal People adapted for TV - BBC News", "description": "On location in Dublin with the stars of Normal People Paul Mescal and Daisy Edgar-Jones.", "url": "https://www.bbc.com/news/av/entertainment-arts-52315624/sally-rooney-s-novel-normal-people-adapted-for-tv", "urlToImage": null, "publishedAt": "2020-04-26T08:46:43Z", "content": null}, {"source": {"id": null, "name": "Nme.com"}, "author": null, "title": "Phoebe Waller-Bridge has the ‘Fleabag’ wall of penises in her house - NME Live", "description": "Phoebe Waller-Bridge, creator and star of the hit sitcom Fleabag has revealed that she keeps the show's 'wall of penises' in her house.", "url": "https://www.nme.com/news/tv/phoebe-waller-bridge-has-the-fleabag-wall-of-penises-in-her-house-2653954", "urlToImage": null, "publishedAt": "2020-04-26T08:41:29Z", "content": "Phoebe Waller-Bridge, creator and star of the hit sitcom Fleabag has revealed that she keeps the show’s ‘wall of penises’ in her house.\r\nAppearing on The Graham Norton Show from home, the writer and actor showed viewers how she keeps the prop by her front doo… [+1201 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Lucy Middleton", "title": "Exhausted mum 'named and shamed' for sleeping through Clap for Carers - Metro.co.uk", "description": "Neighbours told her that if she can't 'spend one minute' showing appreciation, then she 'doesn't deserve to use the NHS'.", "url": "https://metro.co.uk/2020/04/26/exhausted-mum-named-shamed-sleeping-clap-carers-12611114/", "urlToImage": null, "publishedAt": "2020-04-26T08:38:34Z", "content": "Clap for Carers takes place every Thursday (Picture: Rex Features)\r\nA tired mum who accidentally missed Thursdays Clap for Carers was left devastated after her neighbours named and shamed her online.\r\nThe woman said she had suffered a rough night with her you… [+2402 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Euan Ferguson", "title": "The week in TV: After Life; Gangs of London; Emergence; Have I Got News for You – and more - The Guardian", "description": "Ricky Gervais’s After Life struggles second time round, as 21st-century London’s answer to Peaky Blinders gets off to a flying, if violent, start", "url": "https://www.theguardian.com/tv-and-radio/2020/apr/26/the-week-in-tv-after-life-gangs-of-london-emergence-have-i-got-news-for-you-and-more", "urlToImage": null, "publishedAt": "2020-04-26T08:31:06Z", "content": "After Life (Netflix)Gangs of London (Sky Atlantic)Emergence (Fox)Twin (BBC Four) | iPlayerThe Graham Norton Show (BBC One) | iPlayerThe Mash Report (BBC Two) | iPlayerHave I Got News for You (BBC One) | iPlayer\r\nRicky Gervais is, take your pick, ever reinvent… [+6803 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Michelle Marshall", "title": "Dan Walker: BBC Breakfast star honours late colleague in heartfelt tribute 'Much love' - Express", "description": "DAN WALKER - a presenter on BBC Breakfast alongside Louise Minchin - took to Twitter and offered a heartfelt tribute to former BBC Watchdog host Lynn Faulds Woods following the news of her death this week.", "url": "https://www.express.co.uk/celebrity-news/1273971/dan-walker-bbc-breakfast-lynn-faulds-wood-dead-stroke-twitter-latest-news-updates", "urlToImage": null, "publishedAt": "2020-04-26T08:27:34Z", "content": null}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Joshua Fox For Daily Mail Australia", "title": "First Dates Australia star star suffers huge wardrobe malfunction and flashes match - Daily Mail", "description": "First Dates Australia endured one of its most awkward moments last week.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8257827/First-Dates-Australia-star-star-suffers-huge-wardrobe-malfunction-flashes-match.html", "urlToImage": null, "publishedAt": "2020-04-26T08:24:17Z", "content": "First Dates Australia endured one of its most awkward moments last week.\r\nAs the show returned to Channel Seven, Brittany McQuade, 23, suffered a wardrobe malfunction and accidentally flashed her date, teacher James Alexander, 27. \r\n'Oh my god, I can see her … [+2749 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Katie Fitzpatrick", "title": "Teetotal Christine McGuinness says she's been thinking about alcohol in lockdown after 12 years sober - Manchester Evening News", "description": "The mum-of-three hasn't had a drink in more than 12 years", "url": "https://www.manchestereveningnews.co.uk/news/showbiz-news/teetotal-christine-mcguinness-says-shes-18150469", "urlToImage": null, "publishedAt": "2020-04-26T08:20:10Z", "content": "Reality star mum Christine McGuinness has revealed that she's been thinking about alcohol in lockdown after going more than 12 years without a drink.\r\nThe mother-of-three opened up to her followers on Instagram, saying she'd been casting her mind back her fav… [+2375 chars]"}, {"source": {"id": null, "name": "Digitalspy.com"}, "author": "Susannah Alexander", "title": "Former Strictly pro Kevin Clifton has an 'unexpected' new project - digitalspy.com", "description": "Lockdown has given him a brand new passion.", "url": "https://www.digitalspy.com/tv/reality-tv/a32278646/strictly-come-dancing-kevin-clifton-new-project/", "urlToImage": null, "publishedAt": "2020-04-26T08:13:00Z", "content": "Strictly Come Dancing is losing professional dancer Kevin Clifton from this year's series after he quit to explore new projects but the BBC show's loss may be theatre's gain, as the dancer has revealed that he's found an unexpected new calling.\r\nSpeaking on t… [+2547 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Jill Robinson", "title": "Britain’s Got Talent fans freak out as magician Kevin Quantum has brush with death when terrifying fire stunt - The Sun", "description": "", "url": "http://www.thesun.co.uk/tvandshowbiz/11480164/britains-got-talent-magician-kevin-quantum-fire-stunt-goes-wrong/", "urlToImage": null, "publishedAt": "2020-04-26T07:57:39Z", "content": "BRITAIN'S Got Talent fans freaked out tonight as magician Kevin Quantum had a brush with death when his terrifying fire stunt went wrong.\r\nThe contestant attempted to walk through a giant harmonic pendulum of fiery cannonballs with a bag over his head so he c… [+1959 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Olivia Petter", "title": "Rowena Chiu: ‘The Harvey Weinstein survivors we know about are the tip of the iceberg’ - The Independent", "description": "The former assistant to the jailed producer talks to Olivia Petter about her attempted rape allegation against Harvey Weinstein, why his lawyers must be held to account, and the damaging myths we attach to rape survivors and perpetrators", "url": "https://www.independent.co.uk/arts-entertainment/tv/features/rowena-chiu-interview-harvey-weinstein-donna-rotunno-zelda-perkins-documentary-a9482581.html", "urlToImage": null, "publishedAt": "2020-04-26T07:24:14Z", "content": "Rowena Chiu does not want you to call her brave. Im grateful when people say it, but at the same time, I cant help but worry its an indictment of sexual assault survivors who have chosen to stay silent, she says over Zoom from her home in California. Do they … [+10698 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Clémence Michallon", "title": "SNL at Home: Brad Pitt destroys Trump with Dr Anthony Fauci impersonation - The Independent", "description": "Fauci has been a leading member of Trump's coronavirus task force", "url": "https://www.independent.co.uk/arts-entertainment/tv/news/snl-at-home-brad-pitt-anthony-fauci-coronavirus-trump-miley-cyrus-a9484296.html", "urlToImage": null, "publishedAt": "2020-04-26T07:22:10Z", "content": "Brad Pitt surprised SNL viewers on Saturday (25 April) when he made his first appearance as Dr Anthony Fauci.\r\nSaturday Night Live was returning for a second at-home episode after a first instalment two weeks prior.\r\nFauci has been a leading member of Donald … [+1569 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Seamus Duff", "title": "Tiger King star Carole Baskin's husband 'strangled and thrown from plane' - Mirror Online", "description": "The lawyer of Carole's ex-husband Don Lewis, who went missing on 18 August 1997 aged 59, has shared his shocking theory that Don was murdered above the skies and his body dumped in the Gulf of Mexico", "url": "https://www.mirror.co.uk/3am/celebrity-news/tiger-king-star-carole-baskins-21927770", "urlToImage": null, "publishedAt": "2020-04-26T07:21:32Z", "content": "Tiger King star Carole Baskins missing husband was strangled and thrown from a plane, his lawyer has claimed in an astonishing interview.\r\nNetflix fans have been gripped by the hit documentary series Tiger King which focused on the rise and fall of zoo owner … [+3548 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Sirin Kale", "title": "How coronavirus helped TikTok find its voice - The Guardian", "description": "The video-sharing app’s blend of memes, jokes and skits have been a surprise lockdown hit – but teen users are worried it will lose its cool", "url": "https://www.theguardian.com/technology/2020/apr/26/how-coronavirus-helped-tiktok-find-its-voice", "urlToImage": null, "publishedAt": "2020-04-26T07:00:00Z", "content": null}, {"source": {"id": null, "name": "Digitalspy.com"}, "author": "Ian Sandwell", "title": "Extraction director explains ambiguous ending to Netflix movie - digitalspy.com", "description": "\"Different people view the film in different ways.\"", "url": "https://www.digitalspy.com/movies/a32266319/extraction-ending-sam-hargrave-netflix/", "urlToImage": null, "publishedAt": "2020-04-26T07:00:00Z", "content": "Extraction spoilers follow.\r\nExtraction, starring Chris Hemsworth, arrived on Netflix on Friday (April 24) and left viewers with a major question over its ending.\r\nThe movie sees Hemsworth play mercenary Tyler Rake who undertakes a dangerous mission to rescue… [+1995 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Katie Price sexually assaulted during terrifying South Africa carjacking - Yahoo News UK", "description": null, "url": "https://consent.yahoo.com/collectConsent?sessionId=1_cc-session_bc0c949f-ac27-4d84-9acc-272cf84255e4&lang=en-GB&inline=false", "urlToImage": null, "publishedAt": "2020-04-26T06:53:06Z", "content": "To give you a better overall experience, we want to provide relevant ads that are more useful to you. For example, when you search for a film, we use your search information and location to show the most relevant cinemas near you. We also use this information… [+258 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Nicole Chenoweth", "title": "Arnold Schwarzenegger goes on a bike ride with son David Baena as daughter Katherine and Chris Pratt reveal - The Sun", "description": "", "url": "http://www.thesun.co.uk/tvandshowbiz/11482856/arnold-schwarzenegger-bike-ride-david-baena-katherine-pregnancy/", "urlToImage": null, "publishedAt": "2020-04-26T05:59:04Z", "content": "ARNOLD Schwarzenegger covered up with a face mask during a bike ride with his son David Baena on Friday in Santa Monica, California.\r\nThe 22-year-old opted to go on the outing with no protective gear as his dad, 72, wore a mask that read well be back - a refe… [+3597 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "BBC News", "title": "Coronavirus: Naomi Campbell and African artists entertain fans online - BBC News", "description": "Big-name celebrities and artists have been going online to entertain their fans during the pandemic.", "url": "https://www.bbc.co.uk/news/av/world-africa-52417537/coronavirus-naomi-campbell-and-african-artists-entertain-fans-online", "urlToImage": null, "publishedAt": "2020-04-26T05:44:51Z", "content": null}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Seamus Duff", "title": "Daisy Lowe dumps boyfriend Jack Peñate because she 'didn't see a future' with him - Mirror Online", "description": "The model reportedly called time on her romance with Torn on the Platform singer Jack after realising they were better at being friends rather than boyfriend and girlfriend", "url": "https://www.mirror.co.uk/3am/celebrity-news/daisy-lowe-dumps-boyfriend-jack-21927909", "urlToImage": null, "publishedAt": "2020-04-26T05:04:32Z", "content": "Daisy Lowe has ditched her musician boyfriend Jack Peñate after failing to see a future with the guitar strumming hunk, according to a new report. \r\nThe 31-year-old model is believed to have dumped 35-year-old Torn on the Platform singer Jack before escaping … [+1894 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Seamus Duff", "title": "Joey Essex's girlfriend dumped him over his wild 24-hour night out with Rita Ora - Mirror Online", "description": "Joey's now ex-girlfriend Lorena Medina has revealed they engaged in a blazing row after paparazzi snapped the TOWIE star heading to Rita's house following a late night out", "url": "https://www.mirror.co.uk/3am/celebrity-news/joey-essexs-girlfriend-dumped-him-21927897", "urlToImage": null, "publishedAt": "2020-04-26T04:58:14Z", "content": "Joey Essexs partying ways caught up with him in the shape of being dumped by his stunning girlfriend Lorena Medina and all because he spent a wild night out with pop babe Rita Ora.\r\nThe 29-year-old former The Only Way Is Essex star has been thrown back on the… [+2201 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Seamus Duff", "title": "Price is Right announcer hospitalised following three heart attacks - Mirror Online", "description": "George Gray complained of chest pain and weakness in his arms before suffering three huge heart attacks, but is now recovering after his wife helped rush him to hospital", "url": "https://www.mirror.co.uk/3am/celebrity-news/price-right-announcer-hospitalised-following-21927829", "urlToImage": null, "publishedAt": "2020-04-26T02:39:33Z", "content": "Longtime The Price Is Right announcer George Gray has been hospitalised after suffering multiple heart attacks.\r\nThe 53-year-old game show personality has been the voice of Americas long-running The Price Is Right since 2011. \r\n George was rushed to hospital … [+2048 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Seamus Duff", "title": "Terminally ill ex-CBBC star fears she won't live to see family due to lockdown - Mirror Online", "description": "Chelsie Whibley, 28, suffers from cystic fibrosis and is isolating indefinitely while the coronavirus pandemic continues and fears she is losing precious time to spend with her family", "url": "https://www.mirror.co.uk/3am/celebrity-news/terminally-ill-ex-cbbc-star-21927795", "urlToImage": null, "publishedAt": "2020-04-26T01:56:02Z", "content": "Former CBBC star Chelsie Whibley fears she might not live to see her family again as she battles a terminal illness during the coronavirus pandemic. \r\n The 28-year-old former actress suffers from cystic fibrosis a condition that causes sticky mucus to build u… [+2949 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nNick Allen", "title": "Kanye West is a billionaire, says Forbes, after row over rapper's wealth - Telegraph.co.uk", "description": "West disputes the 1.3 billion valuation and says he is worth much more", "url": "https://www.telegraph.co.uk/news/2020/04/26/kanye-west-billionaire-says-forbes-row-rappers-wealth/", "urlToImage": null, "publishedAt": "2020-04-26T00:19:00Z", "content": "Kanye West, the mercurial rapper and fashion mogul, has officially gained the status of \"billionaire\" following a long and acrimonious dispute over his wealth with Forbes magazine.\r\nThe feud began after the august financial publication featured West, 42, on i… [+695 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Katie Hind For The Mail On Sunday", "title": "Victoria Beckham unrepentant for spending taxpayer cash on furloughed staff and thinks she's victim - Daily Mail", "description": "Last Sunday was the third and final day of Victoria Beckham's extended 46th birthday celebrations. Already she had enjoyed a 'virtual' party hosted by a celebrity DJ friend and broadcast on Instagram.", "url": "https://www.dailymail.co.uk/news/article-8257253/Victoria-Beckham-unrepentant-spending-taxpayer-cash-furloughed-staff-thinks-shes-victim.html", "urlToImage": null, "publishedAt": "2020-04-25T23:56:39Z", "content": "Last Sunday was the third and final day of Victoria Beckham's extended 46th birthday celebrations. \r\nAlready she had enjoyed a 'virtual' party hosted by a celebrity DJ friend and broadcast on Instagram, and had a chocolate cake which she had also proudly disp… [+9917 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Jill Robinson", "title": "Michelle Keegan’s Brassic character becomes victim of a sex attack as creator insists actress isn’t just ‘eye - The Sun", "description": "", "url": "http://www.thesun.co.uk/tvandshowbiz/11482023/michelle-keegan-brassic-sex-attack-series-2/", "urlToImage": null, "publishedAt": "2020-04-25T23:35:41Z", "content": "MICHELLE Keegan's Brassic character becomes victim of a sex attack in series two - as the show's creator insists the actress isn't just 'eye candy'.\r\nThe 32-year-old plays single mum Erin in the hit Sky One dark comedy, which returns for a second season next … [+2168 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Shannon Power", "title": "Inside Kylie Jenner’s new $36M ‘resort-style’ compound featuring movie theater, huge pool and FOUR guest house - The Sun", "description": "", "url": "http://www.thesun.co.uk/tvandshowbiz/11480980/kylie-jenner-new-resort-style-compound/", "urlToImage": null, "publishedAt": "2020-04-25T20:53:12Z", "content": "KYLIE Jenner has apparently forked out the big bucks on yet another LA property, this time to the tune of $36.5mil.\r\nThe 22-year-old splashed out on \"one of the most private and secured properties on the market today\" according to realtors.\r\n Kylie's latest r… [+2924 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Frederica Miller", "title": "Princess Beatrice snub: Princess Eugenie and mum Fergie team up for project without Bea - Express.co.uk", "description": "PRINCESS BEATRICE is spending lockdown with her fiancé Edoardo Mapelli Mozzi while the rest of the York Family are at the Royal Lodge. Here's how Bea is missing out as her mum Sarah Ferguson and sister Princess Eugenie team up for a new project.", "url": "https://www.express.co.uk/news/royal/1273887/princess-beatrice-snub-news-princess-eugenie-sarah-ferguson-latest", "urlToImage": null, "publishedAt": "2020-04-25T19:59:00Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Simon's GOLDEN BUZZER: Fayth Ifil is ROLLIN' all the way to the Semi-Finals! | BGT 2020 - Britain's Got Talent", "description": "See more from Britain's Got Talent at http://itv.com/talent Watch Britain's Got Talent: Unseen on the ITV HUB: https://bit.ly/2RreDOp Simon thinks a star is ...", "url": "https://www.youtube.com/watch?v=aii62acsp_E", "urlToImage": null, "publishedAt": "2020-04-25T19:42:20Z", "content": null}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Sophie McCoid, Zoe Forsey", "title": "Queen's secret signals for when she wants to leave conversations - Liverpool Echo", "description": "Her Majesty has a few tricks to communicate with staff", "url": "https://www.liverpoolecho.co.uk/news/uk-world-news/queens-secret-signals-wants-leave-18151647", "urlToImage": null, "publishedAt": "2020-04-25T19:33:47Z", "content": "The Queen has spoken to millions of people during her lifetime and has come up with ways to communicate with her staff during events, it has been claimed.\r\nHer Majesty is used to small talk, but when she's finished talking to someone and would like to leave s… [+2198 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Eurovision Song Contest 2007 - Grand Final - Full Show - Eurovision Song Contest", "description": "The Final of the 52nd Eurovision Song Contest took place in Helsinki, Finland, at the Hartwall Arena. For the occasion, the venue was referred to as the Hels...", "url": "https://www.youtube.com/watch?v=wuvUVAJuhbA", "urlToImage": null, "publishedAt": "2020-04-25T18:58:11Z", "content": null}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Liam Martin", "title": "PS Plus May 2020 free PS4 games latest: The NEW PlayStation Plus games coming soon - Express", "description": "PLAYSTATION Plus subscribers are waiting for Sony to officially unveil the free PS4 games for May 2020.", "url": "https://www.express.co.uk/entertainment/gaming/1273793/PS-Plus-May-2020-free-PS4-games-latest-NEW-PlayStation-Plus-predictions", "urlToImage": null, "publishedAt": "2020-04-25T18:43:00Z", "content": null}, {"source": {"id": null, "name": "Heart.co.uk"}, "author": "Heart", "title": "The Chase fans left stunned as Dark Destroyer gets 'year 4 maths question' wrong - Heart", "description": "Bradley Walsh was left in stitches after Shaun Wallace made the quiz blunder – but can you get the question right?", "url": "https://www.heart.co.uk/showbiz/tv-movies/the-chase-dark-destroyer-maths-question-wrong/", "urlToImage": null, "publishedAt": "2020-04-25T18:27:15Z", "content": "25 April 2020, 17:02\r\nShaun shocked fans after faltering on an easy maths question.\r\nPicture: \r\nITV / Twitter\r\nBradley Walsh was left in stitches after Shaun Wallace made the quiz blunder but can you get the question right? \r\nThe Chase fans were left astonish… [+2501 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Isla Williams", "title": "Timothée Chalamet and Lily-Rose Depp 'split' after a year of dating - Metro.co.uk", "description": "Say it isn't so.", "url": "https://metro.co.uk/2020/04/25/timothee-chalamet-lily-rose-depp-split-year-dating-12610064/", "urlToImage": null, "publishedAt": "2020-04-25T17:43:22Z", "content": "The two are said to have split after more than a year of dating (Picture: FilmMagic/Backgrid)\r\nTimothee Chalamet and Lily-Rose Depp have reportedly split after more than a year of dating.\r\nThe couple have recently called it quits on their romance, according t… [+2247 chars]"}, {"source": {"id": null, "name": "Digitalspy.com"}, "author": "Dan Seddon", "title": "Spider-Man star is hosting Marvel-themed Instagram quiz - digitalspy.com", "description": "Get involved via Instagram next week.", "url": "https://www.digitalspy.com/movies/a32276017/spider-man-tom-holland-marvel-virtual-quiz/", "urlToImage": null, "publishedAt": "2020-04-25T16:49:00Z", "content": "Spider-Manactor Tom Holland will be hosting a Marvel-themed quiz on Instagram during the coronavirus lockdown.\r\nIn conjunction with The Brothers Trust, which was set up by Holland's family to support various charities, this virtual quiz will take place next W… [+1432 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Ellie Kirwin-Jones", "title": "Carol Vorderman breaks down after Captain Tom Moore announcement: 'I'm in floods now' - Express", "description": "CAROL VORDERMAN, the former Countdown presenter, broke down into tears after Captain Tom Moore and Michael Ball's track You'll Never Walk Alone reached number one in the charts as she admitted she was 'in floods'.", "url": "https://www.express.co.uk/celebrity-news/1273841/Carol-Vorderman-Countdown-Captain-Tom-Moore-tears-BBC-news-latest-update", "urlToImage": null, "publishedAt": "2020-04-25T16:38:36Z", "content": null}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Katie Fitzpatrick", "title": "Corrie icon William Roache amazes fans by looking ageless as he celebrates his 88th birthday - Manchester Evening News", "description": "The Coronation Street legend looks 'forever young'", "url": "https://www.manchestereveningnews.co.uk/news/showbiz-news/corrie-icon-william-roache-amazes-18151042", "urlToImage": null, "publishedAt": "2020-04-25T16:25:59Z", "content": "Corrie legend William Roache has been celebrating his 88th birthday in lockdown with his family.\r\n The actor, who plays Coronation Street patriarch Ken Barlow, looked like he was having a great time in snaps shared by the soap to mark the occasion. \r\nThe phot… [+1672 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Dave Fraser", "title": "Donald Trump tweet hails ‘total winner’ Triple H as WWE legend celebrates 25th anniversary on Smackdown - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/wwe/11479403/wwe-triple-h-25th-anniversary-trump/", "urlToImage": null, "publishedAt": "2020-04-25T16:20:36Z", "content": "TRIPLE H celebrated the 25th anniversary of his time in WWE on Friday night - with US president Donald Trump calling him a \"total winner\".\r\n\"The Game\" has been one of the most-influential and well-known wrestlers for a quarter of a century now.\r\n Donald Trump… [+2570 chars]"}, {"source": {"id": null, "name": "Nme.com"}, "author": null, "title": "Watch The Killers debut new song ‘Blowback’ and cover Tom Petty’s ‘The Waiting’ - NME Live", "description": "The Killers have debuted another new song from their forthcoming album ‘Imploding The Mirage’ - click here to listen to 'Blowback'.", "url": "https://www.nme.com/news/music/watch-the-killers-debut-new-song-blowback-and-cover-tom-pettys-the-waiting-2653845", "urlToImage": null, "publishedAt": "2020-04-25T16:13:05Z", "content": "The Killers have debuted another new song from their forthcoming album Imploding The Mirage.\r\nThe band’s frontman Brandon Flowers and Ronnie Vannucci Jr. appeared on CBS This Morning today (April 25) for the shows recurring Saturday Sessions segment. While on… [+1292 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Chris Slater", "title": "John Stapleton pays emotional tribute to wife Lynn Faulds Wood after death of ex-BBC presenter - Manchester Evening News", "description": "Former Watchdog presenter Lynn died on Friday aged 72 after suffering a 'massive stroke'", "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/john-stapleton-pays-emotional-tribute-18149970", "urlToImage": null, "publishedAt": "2020-04-25T12:53:57Z", "content": "Mancunian former TV star John Stapleton has thanked fans for their support following the death of his wife Lynn Faulds Wood.\r\nFormer Watchdog presenter Lynn died on Friday aged 72 after suffering a 'massive stroke'.\r\nIt has been reported she fell ill just mom… [+3057 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Roisin O'Connor", "title": "GMB host Kate Garraway says past few weeks have been 'hardest of my life' as husband battles coronavirus - The Independent", "description": "TV host has been playing music to her husband Derek Draper, who remains critically ill", "url": "https://www.independent.co.uk/arts-entertainment/tv/news/coronavirus-kate-garraway-husband-hospital-nhs-a9483776.html", "urlToImage": null, "publishedAt": "2020-04-25T12:39:20Z", "content": "Kate Garraway has shared a moving post about experiencing the hardest time of her life, as her husband, author and former lobbyist Derek Draper, remains in a critical condition from coronavirus.\r\nThe Good Morning Britain star wrote an article for her blog, Cl… [+1464 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Roisin O'Connor", "title": "The debate between who's better – The Rolling Stones or The Beatles – rages on - The Independent", "description": "Mick Jagger and Sir Paul McCartney made playful digs at one another in recent interviews", "url": "https://www.independent.co.uk/arts-entertainment/music/news/rolling-stones-beatles-better-debate-best-album-song-a9483681.html", "urlToImage": null, "publishedAt": "2020-04-25T10:32:57Z", "content": "Some things never change: The battle as to which band is better, The Beatles or The Stones, is still going.\r\nThe latest instalment in the 60-year debate is between Mick Jagger and Sir Paul McCartney, both of whom have always claimed their band is the best of … [+2078 chars]"}, {"source": {"id": null, "name": "Entertainmentdaily.co.uk"}, "author": "Entertainment Daily", "title": "Coronation Street villain Geoff forces Yasmeen into sex in sickening scenes - Entertainment Daily", "description": "There's no low to which he won't stoop", "url": "https://www.entertainmentdaily.co.uk/soaps/coronation-street-villain-geoff-forces-yasmeen-into-sex-in-sickening-scenes/", "urlToImage": null, "publishedAt": "2020-04-25T09:43:52Z", "content": "Coronation Street fans are devastated and sickened by Geoff Metcalfe forcing wife Yasmeen to have sex.\r\nEvil Geoff coerced Yasmeen into satisfying his sick demands despite her being clearly unwell and unwilling.\r\nCoronation Street villain Geoff forced Yasmeen… [+2276 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Emer Scully For Mailonline", "title": "The Queen's life in lockdown: Her Majesty has been cloistered in her private apartments at Windsor - Daily Mail", "description": "Queen Elizabeth, 94, has been isolating with Prince Phillip, 98, since March 19 - despite her husband usually preferring to spend his time at Wood Farm on their Sandringham estate in Norfolk.", "url": "https://www.dailymail.co.uk/news/article-8255523/The-Queens-life-lockdown-Majesty-cloistered-private-apartments-Windsor.html", "urlToImage": null, "publishedAt": "2020-04-25T05:37:34Z", "content": "The Queen is living in her private apartments at Windsor Castle with around a dozen members of staff wait on her during lockdown, it has been revealed\r\nQueen Elizabeth, 94, has been isolating with Prince Phillip, 98, since March 19 - despite her husband usual… [+9584 chars]"}, {"source": {"id": null, "name": "Digitalspy.com"}, "author": "Chris Edwards", "title": "Mission Impossible 7 and 8 have both been delayed - digitalspy.com", "description": "We kinda saw it coming, tbh.", "url": "https://www.digitalspy.com/movies/a32273079/mission-impossible-7-8-delayed/", "urlToImage": null, "publishedAt": "2020-04-24T23:58:00Z", "content": "Mission: Impossible7 and 8 have been delayed as Paramount makes several changes to its release schedule. \r\nThe seventh instalment of the Tom Cruise-led franchise was originally set to hit cinemas on July 23 next year, but will now arrive on November 19, 2021.… [+2159 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Niamh Cavanagh", "title": "Neighbours’ daily ‘Is This The Way To Amarillo?’ march gets green light after council rejects lockdown compl - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11475218/neighbours-daily-amarillo-march-green-council-lockdown/", "urlToImage": null, "publishedAt": "2020-04-24T20:44:53Z", "content": "A NEIGHBOURHOOD in Warwickshire has been given the green light for their daily \"Is This The Way To Amarillo?\" march after the council rejected one resident's lockdown complaint. \r\nThe residents of Tysoe village recreate Peter Kay's classic Amarillo video on t… [+3267 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nTelegraph Obituaries", "title": "Lynn Faulds Wood, fearless consumer champion who was the first co-presenter of Watchdog – obituary - Telegraph.co.uk", "description": "She became a familiar face on television exposing everything from faulty household products to fly-by-night conmen", "url": "https://www.telegraph.co.uk/obituaries/2020/04/24/lynn-faulds-wood-fearless-consumer-champion-first-co-presenter/", "urlToImage": null, "publishedAt": "2020-04-24T17:45:00Z", "content": "From 2003 to 2009, Lynne Faulds Wood returned to breakfast television, as Consumer Champion on GMTV. In 2006 she joined Esther Rantzen on the BBC consumer series Old Dogs, New Tricks, then in 2014 she and Sophie Raworth presented Watchdog Test House.\r\nShe was… [+848 chars]"}, {"source": {"id": null, "name": "Harpersbazaar.com"}, "author": "Amy Mackelden", "title": "Prince William Jokes About Tiger King During Big Night In on BBC - HarpersBAZAAR.com", "description": "The only game of thrones I want to see.", "url": "https://www.harpersbazaar.com/celebrity/latest/a32267031/prince-william-tiger-king-joke-big-night-in-video/", "urlToImage": null, "publishedAt": "2020-04-24T16:49:00Z", "content": "<ul><li>Prince William appeared on Comic Relief and BBC's Big Night In last night.</li><li>William made a joke about Tiger King when host Stephen Fry asked if he'd watched the popular Netflix show.</li><li>The Cambridges also participated in Clap for Carers t… [+1442 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Martina Bet", "title": "Royal outrage: How US President shocked the Queen Mother with kiss on the lips - Express", "description": "THE QUEEN MOTHER was left in shock when former US President Jimmy Carter greeted her with a kiss on the lips in 1977, unearthed reports reveal.", "url": "https://www.express.co.uk/news/royal/1273552/royal-news-queen-mother-us-president-jimmy-carter-kiss-spt", "urlToImage": null, "publishedAt": "2020-04-24T16:33:22Z", "content": null}, {"source": {"id": null, "name": "Officialcharts.com"}, "author": null, "title": "Live Lounge Allstars charity single enters Top 5 just hours after release - Official Charts Company", "description": "Some of the biggest names in music teamed up for the cover of the Foo Fighters hit.", "url": "https://www.officialcharts.com/chart-news/bbc-radio-1s-live-lounge-allstars-charity-single-times-like-these-enters-top-5-just-hours-after-its-release__29567/", "urlToImage": null, "publishedAt": "2020-04-24T16:23:42Z", "content": "BBC Radio 1's Stay Home Live Lounge charity single is off to an incredible start on the Official Single, landing in the Top 5 debut with just 12 hours' worth of sales.\r\nThe song by the Live Lounge Allstars - made up of 23 of the biggest names in music includi… [+935 chars]"}, {"source": {"id": null, "name": "Givemesport.com"}, "author": "Matthew Lee", "title": "Travis Scott performs live to over 12m people in record-breaking Fortnite concert - GIVEMESPORT", "description": "Travis Scott performs live to over 12m people in record-breaking Fortnite concert", "url": "https://www.givemesport.com/1564673-travis-scott-performs-live-to-over-12m-people-in-recordbreaking-fortnite-concert", "urlToImage": null, "publishedAt": "2020-04-24T16:18:29Z", "content": "Popular musician Travis Scott has found a new way to keep his followers entertained - performing live to over 12 million people on the video game Fortnite.\r\nThe music industry is one of a number of sectors suffering as a result of the coronavirus pandemic.\r\nL… [+1570 chars]"}, {"source": {"id": null, "name": "Digitalspy.com"}, "author": "Laura Jane Turner", "title": "After Life season 2 ending explained - it had to end that way, according to Ricky Gervais - digitalspy.com", "description": "And what it could mean for season 3...", "url": "https://www.digitalspy.com/tv/a32235764/after-life-season-2-ending-explained-netflix/", "urlToImage": null, "publishedAt": "2020-04-24T16:00:00Z", "content": "After Life season two spoilers follow, including its ending. \r\nWell, there you have it. By now, if you're reading this article, you have come to the end of After Life's second season – and if you haven't quite finished, you should probably do so before readin… [+4565 chars]"}, {"source": {"id": null, "name": "Thetimes.co.uk"}, "author": "Kieran Andrews", "title": "Coronavirus in Scotland: Festival takes a pop at Sturgeon - The Times", "description": "Scotland’s Trnsmt music festival has been branded irresponsible after appearing to blame Nicola Sturgeon for its cancellation.The event at Glasgow Green was due to take place from July 10-12", "url": "https://www.thetimes.co.uk/article/coronavirus-in-scotland-irresponsible-trnsmt-music-festival-organisers-blame-nicola-sturgeon-for-cancellation-mzqttgks3", "urlToImage": null, "publishedAt": "2020-04-24T16:00:00Z", "content": "Scotlands Trnsmt music festival has been branded irresponsible after appearing to blame Nicola Sturgeon for its cancellation.\r\nThe event at Glasgow Green was due to take place from July 10-12, headlined by Lewis Capaldi and Liam Gallagher.\r\nOrganisers today a… [+475 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "James Whitbrook", "title": "Watch the Stars of Doctor Who Spend Time Together (Remotely) - Gizmodo", "description": "Last night in the UK, the BBC and charities Comic Relief and Children in Need hosted a special fundraising event called The Big Night In to raise money for UK healthcare workers currently on the front lines of the country’s response to the coronavirus pandemi…", "url": "https://io9.gizmodo.com/watch-the-stars-of-doctor-who-spend-time-together-remo-1843043506", "urlToImage": null, "publishedAt": "2020-04-24T15:15:00Z", "content": "Last night in the UK, the BBC and charities Comic Relief and Children in Need hosted a special fundraising event called The Big Night In to raise money for UK healthcare workers currently on the front lines of the countrys response to the coronavirus pandemic… [+1259 chars]"}, {"source": {"id": null, "name": "Indy100.com"}, "author": "Joanna Taylor", "title": "Tom Hanks wrote a letter to a boy named Corona who was being bullied and it's perfect - indy100", "description": "", "url": "https://www.indy100.com/article/tom-hanks-typewriter-young-fan-corona-australia-9482646", "urlToImage": null, "publishedAt": "2020-04-24T15:01:29Z", "content": "People are obsessed with \"hero\" Tom Hanks's heartwarming gesture to an eight-year-old boy being bullied because his name is Corona. \r\nCorona De Vries, who lives on Australia's Gold Coast, wrote to Tom Hanks and his wife Rita Wilson in early April to wish them… [+1923 chars]"}]}