{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Lucy Needham", "title": "John Stapleton breaks silence to thank fans for support after death of wife Lynn Faulds Wood - Mirror Online", "description": "Former Watchdog host Lynn Faulds Wood died at the age of 72 on Friday after suffering a 'massive stroke'", "url": "https://www.mirror.co.uk/3am/celebrity-news/breaking-lynn-faulds-wood-death-21925015", "urlToImage": null, "publishedAt": "2020-04-25T10:43:02Z", "content": "John Stapleton has spoken out to thank fans for their support following the death of his wife Lynn Faulds Wood.\r\nFormer Watchdog host Lynn died at the age of 72 on Friday after suffering a 'massive stroke'.\r\n On Saturday morning her husband John took to Twitt… [+3374 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Roisin O'Connor", "title": "Kanye West is unhappy with Forbes for saying he’s ‘only’ worth £1 billion - The Independent", "description": "Rapper, producer and Yeezy designer apparently texted the magazine to tell them how much he thought he was worth", "url": "https://www.independent.co.uk/arts-entertainment/music/news/kanye-west-billionaire-forbes-net-worth-2020-kylie-jenner-a9483641.html", "urlToImage": null, "publishedAt": "2020-04-25T10:17:32Z", "content": "Kanye West has officially reached billionaire status, as his line of sneakers was described as one of the great retail stores of the century.\r\nAccording to Forbes, the rapper, producer and fashion designer is said to have reached a net worth of $1.3bn (£1.05b… [+1116 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Martha Cliff", "title": "The Queen has been forced to ‘give up horse-riding’ in lockdown and has been avidly watching the news - The Sun", "description": "", "url": "http://www.thesun.co.uk/fabulous/11478185/queen-give-up-horses-lockdown/", "urlToImage": null, "publishedAt": "2020-04-25T10:10:11Z", "content": "LIKE the rest of us the Queen has been in lockdown for the past five weeks, isolating at private apartment in Windsor.\r\nAnd it seems like the monarchs routine has received a bit of a mix up with some of her favourite activities now off limits.\r\nThe Queen has … [+2290 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Roxy Simons For Mailonline", "title": "Mick Jagger hits out at Paul McCartney for claiming The Beatles are better than The Rolling Stones - Daily Mail", "description": "The singer, 76, hit out at the Hey Jude hitmaker, 77, while he appeared on Zane Lowe's Apple Music show on Friday.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8256045/Mick-Jagger-hits-Paul-McCartney-claiming-Beatles-better-Rolling-Stones.html", "urlToImage": null, "publishedAt": "2020-04-25T10:00:17Z", "content": "Mick Jagger has called out Paul McCartney for claiming The Beatles were bigger than The Rolling Stones.\r\nThe singer, 76, hit out at the Hey Jude hitmaker, 77, for suggesting The Rolling Stones copied whatever The Beatles did during their time as music rivals,… [+2546 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Helen Brown", "title": "Lucinda Williams: ‘I’m here to show people all the good stuff can happen to older women’ - The Independent", "description": "The country-rock legend is taking aim at Trump with her politically charged new album. She talks to Helen Brown about the state of the US, finding her way out of an abusive relationship, and why she refuses to mellow with age", "url": "https://www.independent.co.uk/arts-entertainment/music/features/lucinda-williams-interview-good-souls-better-angels-trump-a9482666.html", "urlToImage": null, "publishedAt": "2020-04-25T09:21:02Z", "content": "You cant rule me! roars Lucinda Williams from her sofa in Nashville, where she is quarantined with her husband and manager Tom Overby. Other artists of her vintage have comforted fans through the pandemic with cosy renditions of old favourites, but Williams w… [+13544 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Michael Cragg", "title": "Diana Gordon: the secret ingredient in Beyoncé’s Lemonade - The Guardian", "description": "The LA artist’s career was heading down a cul-de-sac until Bey came calling. Now she’s ready for her moment in the spotlight", "url": "https://www.theguardian.com/music/2020/apr/25/diana-gordon-the-secret-ingredient-in-beyonces-lemonade", "urlToImage": null, "publishedAt": "2020-04-25T09:03:53Z", "content": "It is 11am LA time and Diana Gordon is feeling, as she puts it, hazy. We were meant to start our interview half an hour ago, but Gordons sleeping pattern has gone out the window, a symptom of lockdowns anxiety-tinged paranoia. There is a more practical reason… [+4855 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Laura Fox Eve Buckland For Mailonline", "title": "Kate Garraway is having 'hardest time of her life' as her husband Derek Draper battles coronavirus - Daily Mail", "description": "The Good Morning Britain presenter, 52, shared another heartbreaking update with fans on her Club Garraway Wellbeing website, as she thanked them for their messages of support.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8256083/Kate-Garraway-having-hardest-time-life-husband-Derek-Draper-battles-coronavirus.html", "urlToImage": null, "publishedAt": "2020-04-25T08:42:08Z", "content": "Kate Garraway has revealed she's having 'the hardest time of her life' as her husband Derek Draper continues to fight for his life after contracting coronavirus.\r\nThe Good Morning Britain presenter, 52, shared another heartbreaking update with fans on her Clu… [+23830 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Roisin O'Connor", "title": "RuPaul's Drag Race: Jeff Goldblum receives backlash for Islam comments to Jackie Cox - The Independent", "description": "‘As if America hasn’t been anti-gay and anti-woman from the outset, or killed and displaced millions of Muslims, including women and queers,’ one critic retorted", "url": "https://www.independent.co.uk/arts-entertainment/tv/news/jeff-goldblum-islam-rupaul-drag-race-jackie-cox-women-homosexuality-a9483536.html", "urlToImage": null, "publishedAt": "2020-04-25T08:14:31Z", "content": "Jeff Goldblum has found himself the subject of a backlash after asking a contestant on RuPauls Drag Race if Islam is anti-homosexuality and anti-woman.\r\nThe actor and musician appeared as a guest judge on an episode of the shows 12th season, in which the seve… [+29238 chars]"}, {"source": {"id": null, "name": "Nme.com"}, "author": null, "title": "Post Malone’s Nirvana tribute livestream sounded like a wild and heavy garage band in rehearsal - NME Live", "description": "With Blink-182's Travis Barker on drums and the approval of Courtney Love and Krist Novoselić, this COVID-19 charity gig rocked and raised funds", "url": "https://www.nme.com/reviews/live/post-malone-nirvana-tribute-livestream-travis-barker-covid-19-coronavirus-2653588", "urlToImage": null, "publishedAt": "2020-04-25T07:50:45Z", "content": "The atmosphere at Post Malones Nirvana tribute livestream is a far cry from that of his mammoth stadium shows; it’s more like sitting around in a garage with your mates band rehearsing. The YouTube gig isn’t polished but that wasnt the point: it’s intimate, l… [+3555 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Martin Chilton", "title": "‘I don’t believe in God – I believe in Al Pacino’: How one of our greatest living actors kicked his boozy, brawling ways - The Independent", "description": "As the star of ‘Scarface’ and ‘The Godfather’ turns 80, Martin Chilton looks back at his drunken early years and his ascent to Oscar-winning glory", "url": "https://www.independent.co.uk/arts-entertainment/films/features/al-pacino-interview-godfather-serpico-scarface-alcohol-career-best-movies-a9481701.html", "urlToImage": null, "publishedAt": "2020-04-25T07:06:06Z", "content": "Al Pacino spent much of the Seventies in a drunken haze. The Oscar-winning star of the Godfather trilogy, Serpico, Scarface and Scent of a Woman has been teetotal for more than four decades now, and is about to soberly celebrate his 80th birthday. But he dran… [+28283 chars]"}, {"source": {"id": null, "name": "Wrestlinginc.com"}, "author": "Marc Middleton", "title": "Vince McMahon Clears Bayley Of Blame For Infamous \"This Is Your Life\" RAW Segment, Bayley Thanks Him - Wrestling Inc.", "description": "Vince McMahon Clears Bayley Of Blame For Infamous \"This Is Your Life\" RAW Segment, Bayley Thanks Him", "url": "https://www.WrestlingInc.com/news/2020/04/vince-mcmahon-clears-bayley-of-blame-for-infamous-this-is-669637/", "urlToImage": null, "publishedAt": "2020-04-25T06:55:44Z", "content": "As noted, WWE Chairman Vince McMahon appeared during last night's Triple H 25th Anniversary Celebration with WWE Hall of Famers The Game and Shawn Michaels during the closing segment to SmackDown on FOX.\r\nWhile joking about Triple H's career, Vince apparently… [+821 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "BBC News", "title": "Captain Tom tops the charts, breaking record - BBC News", "description": "He's become the oldest artist to have a number one track, and is donating the proceeds to the NHS.", "url": "https://www.bbc.com/news/av/uk-52419261/captain-tom-tops-the-charts-breaking-record", "urlToImage": null, "publishedAt": "2020-04-25T06:42:27Z", "content": null}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "The Guide", "title": "Musicians, comedians and more on their isolation culture picks - The Guardian", "description": "Lauren from Chvrches, George the Poet, Shura and more on how they’ve been entertaining themselves, from rewatching the Coen brothers to folding knickers", "url": "https://www.theguardian.com/culture/2020/apr/25/the-art-of-lockdown-musicians-comedians-and-more-on-their-isolation-culture-picks", "urlToImage": null, "publishedAt": "2020-04-25T06:31:00Z", "content": "Nish Kumar\r\nHost, The Mash Report\r\nNish Kumar. Photograph: Idil Sukan\r\n1. Sullivans Travels (film)I have been using this as an opportunity to catch up on the enormous stack of Blu-rays that Ive accumulated. This is a masterful film by Preston Sturges, a charm… [+13659 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Mirror .co.uk", "title": "Cher Lloyd says music bosses tried to force her into fake romantic relationships - Mirror Online", "description": "Cher Lloyd is back with a brand new single called Lost and is marking her tenth year in the music world – but has shared details of some of the choices she was asked to make earlier in her career", "url": "https://www.mirror.co.uk/3am/celebrity-news/cher-lloyd-says-music-bosses-21924665", "urlToImage": null, "publishedAt": "2020-04-25T06:15:10Z", "content": "Cher Lloyd has claimed that music bosses tried to pressure her into entering a fake romance with a fellow celebrity to boost her fame.\r\nThe 26-year-old singer found fame on The X Factor ten years ago and went on to land a record deal with Simon Cowell s Syco … [+1644 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Rupert Jones", "title": "Coronavirus refunds: why fans are raging over ticket policies - The Guardian", "description": "With thousands of live events axed or rescheduled, many fans are finding it tricky to get money back", "url": "https://www.theguardian.com/money/2020/apr/25/coronavirus-refunds-fans-ticket-policies", "urlToImage": null, "publishedAt": "2020-04-25T06:15:03Z", "content": null}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Seamus Duff", "title": "Inside billionaire Kylie Jenner's new $36 million seven bedroom home - Mirror Online", "description": "The price tag of $36 million will be but a drop in the ocean for billionaire Kylie Jenner – however it is believed she managed to haggle down the asking price from $55 million", "url": "https://www.mirror.co.uk/3am/celebrity-news/inside-billionaire-kylie-jenners-new-21924615", "urlToImage": null, "publishedAt": "2020-04-25T05:55:43Z", "content": "Kylie Jenner has spent a fortune snapping up a new mansion at the cost of $36 million which is small change to the self made billionaire.\r\nThe 22-year-old Keeping Up With The Kardashians star is said to have plashed the equivalent of £30 million on a new pad … [+3120 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Manon Dark", "title": "Meghan Markle could face father in court as family tensions boil over - Express", "description": "MEGHAN MARKLE could face her father, Thomas Markle, in court over a dispute fuelled by an article published in the Mail on Sunday.", "url": "https://www.express.co.uk/news/royal/1273682/Meghan-Markle-royal-news-court-mail-on-sunday-sue-father-Thomas-Markle", "urlToImage": null, "publishedAt": "2020-04-25T04:53:13Z", "content": null}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Seamus Duff", "title": "Will and Grace ends on sour note as show makers admit cast backstage 'squabble' - Mirror Online", "description": "The rumours that show stars Debra Messing and Megan Mullaly had an epic behind-the-scenes fall out were all but confirmed by show creators David Kohan and Max Mutchnick", "url": "https://www.mirror.co.uk/tv/tv-news/grace-ends-sour-note-show-21924530", "urlToImage": null, "publishedAt": "2020-04-25T03:07:52Z", "content": "Long running comedy Will and Grace has come to a bitter end as two of the top cast had a fall out, show creators admitted.\r\n The hit US sitcom has run for 22-years and more than 240 episodes with eight seasons running between between 1998 and 2006 before the … [+2207 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Kyle O'Sullivan", "title": "Gogglebox slammed for denying 'breaking' lockdown rules despite 'clear breaches' - Mirror Online", "description": "Gogglebox viewers have blasted Channel 4's 'patronising' message of reassurance as Izzi and Ellie Warner and the Siddiqui brothers move houses amid the coronavirus pandemic", "url": "https://www.mirror.co.uk/tv/tv-news/gogglebox-slammed-denying-breaking-lockdown-21923892", "urlToImage": null, "publishedAt": "2020-04-25T03:00:19Z", "content": "Gogglebox has been slammed for denying they are 'breaking' lockdown rules.\r\nOutraged viewers have blasted Channel 4 for their message of reassurance before tonight's programme aired.\r\nThe announcer said: \"Dont worry. Everyone on Gogglebox is following social … [+3936 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Prince William has unexpected issue with watching Tiger King on Netflix - Mirror Online", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiVWh0dHBzOi8vd3d3Lm1pcnJvci5jby51ay90di90di1uZXdzL3ByaW5jZS13aWxsaWFtLXVuZXhwZWN0ZWQtaXNzdWUtd2F0Y2hpbmctMjE5MjExNjHSAVlodHRwczovL3d3dy5taXJyb3IuY28udWsvdHYvdHYtbmV3cy9wcmluY2Utd2lsbGlhbS11bmV4cGVjdGVkLWlzc3VlLXdhdGNoaW5nLTIxOTIxMTYxLmFtcA?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T03:00:14Z", "content": null}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Frank Skinner: Will Gompertz reviews the comedian's poetry podcast on Absolute Radio ★★★★☆ - BBC News", "description": "It's a simple idea presented by someone who brings insight to an art form that is enjoying a resurgence.", "url": "https://www.bbc.co.uk/news/entertainment-arts-52403782", "urlToImage": null, "publishedAt": "2020-04-25T02:48:36Z", "content": "Odd combinations have long been a staple of the entertainment industry. For those old enough to have seen it (still available on YouTube), who can forget Prince Edward's cringe-inducing toe-dip into television production with the culture-clash that was It's A… [+9008 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Barbara  Mcmahon Barbara Davies for the Daily Mail", "title": "Vogue editor Anna 'Nuclear' Wintour has fallen out with her right-hand man Andre Leon Talley... - Daily Mail", "description": "There was a time when Andre Leon Talley's friendship with Dame Anna Wintour was regarded as a match made in fashion heaven.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8255427/Vogue-editor-Anna-Nuclear-Wintour-fallen-right-hand-man-Andre-Leon-Talley.html", "urlToImage": null, "publishedAt": "2020-04-25T02:47:23Z", "content": "There was a time when Andre Leon Talley's friendship with Dame Anna Wintour was regarded as a match made in fashion heaven. She was the formidable British editor-in-chief of Vogue whose presence in the front row at catwalk shows left designers quaking in thei… [+15005 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Verity Sulway", "title": "Britain's Got Talent audience scream in horror as magician's fire stunt goes wrong - Mirror Online", "description": "On Saturday's Britain's Got Talent preview a magician attempts to walk through swinging fireballs with his eyes covered - but his machine malfunctions and he is totally unaware of the danger he is in", "url": "https://www.mirror.co.uk/tv/tv-news/britains-talent-audience-scream-horror-21921987", "urlToImage": null, "publishedAt": "2020-04-25T02:11:46Z", "content": "Britain's Got Talent turned to horror in a first look at Saturday's show as a magician's fire stunt ended in disaster. \r\nKevin Quantum impressed judges when he explained he had invented a machine which swings cannonballs of fire.\r\n He told Simon Cowell, David… [+1743 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Charlotte Dean For Mailonline", "title": "Katya Jones makes a cheeky joke while sporting a fluffy cushion for the pillow challenge - Daily Mail", "description": "The Strictly Come Dancing star, 30, joked the residents surrounding her property would be getting 'some view' as she posed wearing just a fluffy pillow.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8255497/Katya-Jones-makes-cheeky-joke-sporting-fluffy-cushion-pillow-challenge.html", "urlToImage": null, "publishedAt": "2020-04-25T02:11:23Z", "content": "She recently joked she had a complaint from her neighbour during lockdown.\r\nAnd Katya Jones has since suggested her neighbours may have more to say after she posed in her garden wearing a cushion while taking part in the pillow challenge.\r\nThe Strictly Come D… [+5908 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Shannon Power", "title": "Kate Garraway having ‘hardest time of her life’ as she discusses husband Derek’s critical condition fighting c - The Sun", "description": "", "url": "http://www.thesun.co.uk/tvandshowbiz/11475998/kate-garraway-husband-coronavirus/", "urlToImage": null, "publishedAt": "2020-04-25T01:59:01Z", "content": "KATE Garraway has told fans she is going through the \"hardest\" time in her life as her husband Derek Draper is in a critical condition fighting coronavirus.\r\nThe Good Morning Britain presenter opened up about her struggles on her personal blog.\r\n Kate Garrawa… [+2846 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Oliver Harvey", "title": "How Prince William is helping to lift the nation’s spirits during the coronavirus lockdown - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11476479/prince-william-nations-spirits-lockdown/", "urlToImage": null, "publishedAt": "2020-04-25T01:36:09Z", "content": "LIKE monarchs down a long line of history, Prince William has proved himself strongest as his country faces its darkest hours.\r\nGrabbing the baton for the Royal Family, William, wife Kate and their joyful young family have led by example, with their knack of … [+13336 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Sam Baker For Mailonline", "title": "Princess Eugenie and husband Jack Brooksbank celebrate their 10th anniversary with Instagram snap - Daily Mail", "description": "Princess Eugenie took to Instagram to celebrate her anniversary with husband Jack Brookshank by posting a loved-up picture. In the post the tenth-in-line said her and her husband were lucky to be together.", "url": "https://www.dailymail.co.uk/news/article-8255567/Princess-Eugenie-husband-Jack-Brooksbank-celebrate-10th-anniversary-Instagram-snap.html", "urlToImage": null, "publishedAt": "2020-04-25T00:51:50Z", "content": "Princess Eugenie took to Instagram to celebrate her anniversary with husband Jack Brookshank by posting a loved-up picture.\r\nThe 30-year-old married her husband on October 12 2018 but the couple met when Princess Eugenie was skiing in Verbier, Switzerland, an… [+4055 chars]"}, {"source": {"id": null, "name": "Digitalspy.com"}, "author": "Justin Harp", "title": "Two Spider-Man movies and Thor Love and Thunder delayed - digitalspy.com", "description": "Doctor Strange in the Multiverse of Madness is moving, too.", "url": "https://www.digitalspy.com/movies/a32273576/spider-man-3-thor-doctor-strange-delayed/", "urlToImage": null, "publishedAt": "2020-04-25T00:50:00Z", "content": "Marvel release dates are in flux once again thanks to coronavirus.\r\nThe latest in the game of superhero musical chairs came on Friday (April 24) when Sony announced that it was officially delaying the release dates of two upcoming Spider-Man movies.\r\nNow, Spi… [+1728 chars]"}, {"source": {"id": null, "name": "Ladbible.com"}, "author": "Jake Massey", "title": "Chris Hemsworth's New Netflix Action Thriller Extraction Is Being Called A 'Must Watch' - LADbible", "description": "The film dropped on Netflix today and is receiving positive reviews from viewers", "url": "https://www.ladbible.com/entertainment/tv-and-film-new-netflix-action-thriller-extraction-is-being-called-a-must-watch-20200424", "urlToImage": null, "publishedAt": "2020-04-24T23:26:04Z", "content": "A new action thriller starring Chris Hemsworth has just dropped on Netflix, and judging by the reaction on social media, it should make for some quality weekend viewing. \r\nExtraction follows mercenary Tyler Rake (Hemsworth) on his mission to rescue the kidnap… [+2520 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Sarah Sotoodeh For Dailymail.com", "title": "Mission: Impossible films seven and eight release days delayed amid COVID-19 pandemic - Daily Mail", "description": "The next film in the Mission: Impossible franchise starring Tom Cruise, the seventh installment, was supposed to hit theaters July 23, 2021 with the eight film released on August 2022.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8255267/Mission-Impossible-films-seven-eight-release-days-delayed-amid-COVID-19-pandemic.html", "urlToImage": null, "publishedAt": "2020-04-24T22:32:29Z", "content": "The next film in the Mission: Impossible franchise starring Tom Cruise, the seventh installment, was supposed to hit theaters July 23, 2021 with the eight film released on August 5, 2022.\r\nBut, due to the COVID-19 global pandemic, Paramount has delayed the re… [+2337 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Sky", "title": "Eddie Large: Well-wishers applaud hearse before comedy legend's funeral - Sky News", "description": "Video posted online showed well-wishers following social distancing guidelines as the vehicle set off for the service.", "url": "https://news.sky.com/story/eddie-large-well-wishers-applaud-hearse-before-comedy-legends-funeral-11978486", "urlToImage": null, "publishedAt": "2020-04-24T21:58:19Z", "content": null}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Tamara Davison", "title": "Liam Payne volunteers at food bank in 'humbling' experience during coronavirus crisis - Mirror Online", "description": "The One Direction heartthrob helped out at a local food bank organised food donations in Euston on Thursday", "url": "https://www.mirror.co.uk/3am/celebrity-news/liam-payne-volunteers-food-bank-21922447", "urlToImage": null, "publishedAt": "2020-04-24T21:36:34Z", "content": "Liam Payne has decided to volunteer at a local food bank to support struggling families during the coronavirus crisis.\r\nThe One Direction heartthrob, 26, said his experience was 'humbling' and that he had committed long-term to helping the organisation out.\r\n… [+2471 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Kathryn Ingate", "title": "Dimitri Diatchenko dead: Chernobyl Diaries and Indiana Jones actor dies aged 52 - Express.co.uk", "description": "DIMITRI DIATCHENKO - who was best known for his role in The Chernobyl Diaries and for appearing in Indiana Jones and the Kingdom of the Crystal Skull - has been found dead at his Florida home at the age of 52 according to TMZ.", "url": "https://www.express.co.uk/celebrity-news/1273623/Dimitri-Diatchenko-dead-death-Chernobyl-Diaries-Indiana-Jones-cause-of-death-news-latest", "urlToImage": null, "publishedAt": "2020-04-24T19:45:00Z", "content": null}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Lottie Gibbons", "title": "Coronation Street fans left 'feeling sick' after vulgar scenes - Liverpool Echo", "description": "Viewers said they 'felt sick' after Geoff and Yasmeen went to the bedroom", "url": "https://www.liverpoolecho.co.uk/news/tv/coronation-street-fans-left-feeling-18148800", "urlToImage": null, "publishedAt": "2020-04-24T19:21:28Z", "content": "Coronation Street fans said they \"felt sick\" after tonight's scenes between Geoff and Yasmeen.\r\n At No.6, Geoff read Yasmeens pamphlet on domestic abuse with a list of signs of controlling behaviour and realised he needs to take a different approach. \r\nViewer… [+922 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Abbie Bray", "title": "The Grand Tour Madagascar Special delayed after producer caught coronavirus - Metro.co.uk", "description": "Jeremy Clarkson also teased fans with the release date.", "url": "https://metro.co.uk/2020/04/24/grand-tour-special-delayed-producer-caught-coronavirus-jeremy-clarkson-teases-release-date-12607069/", "urlToImage": null, "publishedAt": "2020-04-24T19:18:34Z", "content": "To view this video please enable JavaScript, and consider upgrading to a web\r\nbrowser that\r\nsupports HTML5\r\nvideo\r\nJeremy Clarkson has given fans an update on why The Grand Tour Madagascar Special has been delayed as he teased when the release date could be.\r… [+3353 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Kathryn Ingate", "title": "Piers Morgan: GMB host issues apology to Ofcom after hitting back at 2,000 complaints - Express", "description": "PIERS MORGAN has issued an apology to Ofcom on Twitter after hitting back at complaints that were sent to the broadcasting regulator following his interviews with MPs on Good Morning Britain.", "url": "https://www.express.co.uk/celebrity-news/1273604/Piers-Morgan-Twitter-apology-ofcom-complaints-Good-Morning-Britain-news-latest", "urlToImage": null, "publishedAt": "2020-04-24T19:15:13Z", "content": null}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Tamara Davison", "title": "Gogglebox's Amy Tapper calls for plus-size inclusive plane and theme park seats - Mirror Online", "description": "The Channel 4 star said that she didn't want plus-sized people to feel uncomfortable and embarrassed as she called for the changes to be made", "url": "https://www.mirror.co.uk/3am/celebrity-news/goggleboxs-amy-tapper-calls-plus-21923103", "urlToImage": null, "publishedAt": "2020-04-24T18:25:52Z", "content": "Gogglebox star Amy Tapper said that she doesn't want plus-sized people to feel 'embarrassed' in theme parks and on aeroplanes. \r\nThe 20-year-old, who lost an impressive three stone last year, called for more variety in seating options that are inclusive of la… [+2016 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Eve Wagstaff", "title": "Inside Vicar of Dibley star Dawn French’s jaw-dropping £3m Cornwall castle with 30 rooms and sea views - The Sun", "description": "", "url": "http://www.thesun.co.uk/tvandshowbiz/11473354/inside-dawn-frenchs-jaw-dropping-3m-cornwall-castle/", "urlToImage": null, "publishedAt": "2020-04-24T18:14:19Z", "content": "DAWN French lives in a jaw-dropping £3m Cornwall called Point Neptune that has 30 rooms and incredible sea views.\r\nThe Vicar of Dibley star lives in the coastal mansion with her daughter Billie and second husband, Mark Bignell.\r\n Dawn's home is on the coast o… [+3733 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Helena Vesty", "title": "The Bolton key workers who made it into Peter Kay's Amarillo video - Manchester Evening News", "description": "The famous video was recreated 15 years after it was first released", "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/peter-kay-amarillo-bolton-workers-18145560", "urlToImage": null, "publishedAt": "2020-04-24T18:08:27Z", "content": "From his back garden in Bolton, Peter Kay revealed his recreation of his Amarillo video live on the BBC's Big Night In on Thursday evening - and Bolton's key workers made an appearance. \r\nThe charity single was released in 2005 for Comic Relief and the music … [+2709 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nTelegraph Obituaries", "title": "Lynn Faulds Wood, fearless consumer champion who was the first co-presenter of Watchdog – obituary - Telegraph.co.uk", "description": "She became a familiar face on television exposing everything from faulty household products to fly-by-night conmen", "url": "https://www.telegraph.co.uk/obituaries/2020/04/24/lynn-faulds-wood-fearless-consumer-champion-first-co-presenter/", "urlToImage": null, "publishedAt": "2020-04-24T17:45:00Z", "content": "From 2003 to 2009, Lynne Faulds Wood returned to breakfast television, as Consumer Champion on GMTV. In 2006 she joined Esther Rantzen on the BBC consumer series Old Dogs, New Tricks, then in 2014 she and Sophie Raworth presented Watchdog Test House.\r\nShe was… [+848 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Monica Greep For Mailonline", "title": "Gangs of London leaves viewers gripped but insist violence is not for the faint hearted - Daily Mail", "description": "New Sky Atlantic drama Gangs of London left viewers gripped with it's 'increible' fight scenes, but insisted the 'brutal' violence of the show left them wincing at the graphic scenes", "url": "https://www.dailymail.co.uk/femail/article-8253529/Gangs-London-leaves-viewers-gripped-insist-violence-not-faint-hearted.html", "urlToImage": null, "publishedAt": "2020-04-24T17:21:21Z", "content": "A gorey new TV show about warring gangs in London opened last night with dramatic scenes that saw a character being set alight while being dangled off a building within the first few minutes. \r\nThe new drama, written by Gareth Evans, started on Sky Atlantic l… [+4713 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Phoebe Waller-Bridge's hilariously X-RATED wall art revealed! | The Graham Norton Show - BBC - BBC", "description": "Subscribe and 🔔 to OFFICIAL BBC YouTube 👉 https://bit.ly/2IXqEIn Stream original BBC programmes FIRST on BBC iPlayer 👉 https://bbc.in/2J18jYJ Graham Norton i...", "url": "https://www.youtube.com/watch?v=hSwK3Kxghj0", "urlToImage": null, "publishedAt": "2020-04-24T17:00:32Z", "content": "Subscribe and to OFFICIAL BBC YouTube https://bit.ly/2IXqEInStream original BBC programmes FIRST on BBC iPlayer https://bbc.in/2J18jYJ\r\nGraham Norton is horrified by some of Phoebe Waller-Bridge's rather unusual art.\r\nGraham is joined in his virtual studio by… [+729 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Lottie Gibbons", "title": "ITV The Chase's Bradley Walsh has meltdown over Shaun Wallace's embarrassing blunder - Liverpool Echo", "description": "The Dark Destroyer wasn't pleased with himself...", "url": "https://www.liverpoolecho.co.uk/news/tv/itv-chases-bradley-walsh-meltdown-18147836", "urlToImage": null, "publishedAt": "2020-04-24T16:53:23Z", "content": "The Chase's Bradley Walsh was doubled-over with laughter today as Shaun Wallace's embarrassing blunder. \r\nUp first was Aislinn, a 19-year-old engineering student from Hampshire.\r\n She impressed host Bradley with her knowledge as she secured £7,000 in the cash… [+953 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Martina Bet", "title": "Royal outrage: How US President shocked the Queen Mother with kiss on the lips - Express", "description": "THE QUEEN MOTHER was left in shock when former US President Jimmy Carter greeted her with a kiss on the lips in 1977, unearthed reports reveal.", "url": "https://www.express.co.uk/news/royal/1273552/royal-news-queen-mother-us-president-jimmy-carter-kiss-spt", "urlToImage": null, "publishedAt": "2020-04-24T16:33:22Z", "content": null}, {"source": {"id": null, "name": "Officialcharts.com"}, "author": null, "title": "Live Lounge Allstars charity single enters Top 5 just hours after release - Official Charts Company", "description": "Some of the biggest names in music teamed up for the cover of the Foo Fighters hit.", "url": "https://www.officialcharts.com/chart-news/bbc-radio-1s-live-lounge-allstars-charity-single-times-like-these-enters-top-5-just-hours-after-its-release__29567/", "urlToImage": null, "publishedAt": "2020-04-24T16:23:42Z", "content": "BBC Radio 1's Stay Home Live Lounge charity single is off to an incredible start on the Official Single, landing in the Top 5 debut with just 12 hours' worth of sales.\r\nThe song by the Live Lounge Allstars - made up of 23 of the biggest names in music includi… [+935 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Oli Gamp For Mailonline", "title": "Mike Tyson admits Tiger King star Joe Exotic could have supplied him with his big cats - Daily Mail", "description": "Tyson bought the Bengal tigers in the 1990s, and following the release of the hit Netflix documentary Tiger King, the 53-year-old has been pondering the origin of his big cats.", "url": "https://www.dailymail.co.uk/sport/boxing/article-8253211/Mike-Tyson-admits-Tiger-King-star-Joe-Exotic-supplied-big-cats.html", "urlToImage": null, "publishedAt": "2020-04-24T16:20:23Z", "content": "Mike Tyson has admitted his pet tigers could have come from infamous former zoo owner Joe Exotic - star of the Netflix show Tiger King.\r\nHeavyweight legend Tyson was known for having three big cats in his house and became synonymous with the creatures, but ha… [+2432 chars]"}, {"source": {"id": null, "name": "Givemesport.com"}, "author": "Matthew Lee", "title": "Travis Scott performs live to over 12m people in record-breaking Fortnite concert - GIVEMESPORT", "description": "Travis Scott performs live to over 12m people in record-breaking Fortnite concert", "url": "https://www.givemesport.com/1564673-travis-scott-performs-live-to-over-12m-people-in-recordbreaking-fortnite-concert", "urlToImage": null, "publishedAt": "2020-04-24T16:18:29Z", "content": "Popular musician Travis Scott has found a new way to keep his followers entertained - performing live to over 12 million people on the video game Fortnite.\r\nThe music industry is one of a number of sectors suffering as a result of the coronavirus pandemic.\r\nL… [+1570 chars]"}, {"source": {"id": null, "name": "Digitalspy.com"}, "author": "Laura Jane Turner", "title": "After Life season 2 ending explained - it had to end that way, according to Ricky Gervais - digitalspy.com", "description": "And what it could mean for season 3...", "url": "https://www.digitalspy.com/tv/a32235764/after-life-season-2-ending-explained-netflix/", "urlToImage": null, "publishedAt": "2020-04-24T16:00:00Z", "content": "After Life season two spoilers follow, including its ending. \r\nWell, there you have it. By now, if you're reading this article, you have come to the end of After Life's second season – and if you haven't quite finished, you should probably do so before readin… [+4565 chars]"}, {"source": {"id": null, "name": "Standard.co.uk"}, "author": "Imogen Braddick", "title": "Camilla: I've really been missing my grandchildren during the coronavirus lockdown - Evening Standard", "description": "", "url": "https://www.standard.co.uk/news/uk/duchess-of-cornwall-camilla-grandchildren-lockdown-a4423571.html", "urlToImage": null, "publishedAt": "2020-04-24T15:55:18Z", "content": "The Duchess of Cornwall says she is missing seeing and hugging her grandchildren during the coronavirus lockdown.\r\nCamilla made the comments during a call to an elderly user of the Silver Line, a 24-hour helpline for older people feeling lonely or in need of … [+13303 chars]"}, {"source": {"id": null, "name": "Indy100.com"}, "author": "Joanna Taylor", "title": "Tom Hanks wrote a letter to a boy named Corona who was being bullied and it's perfect - indy100", "description": "", "url": "https://www.indy100.com/article/tom-hanks-typewriter-young-fan-corona-australia-9482646", "urlToImage": null, "publishedAt": "2020-04-24T15:01:29Z", "content": "People are obsessed with \"hero\" Tom Hanks's heartwarming gesture to an eight-year-old boy being bullied because his name is Corona. \r\nCorona De Vries, who lives on Australia's Gold Coast, wrote to Tom Hanks and his wife Rita Wilson in early April to wish them… [+1923 chars]"}, {"source": {"id": null, "name": "Cultaholic.com"}, "author": "Aidan Gibbons", "title": "Vince McMahon On Why WWE Raw's Ratings Have Declined During The Coronavirus Pandemic - Cultaholic", "description": "During the coronavirus pandemic, Monday Night Raw's ratings have declined by approximately 20 percent and the April 20 episode set another record non-holiday low for viewership.\nDuring the&nbsp;Q1 2020 earnings conference call, Vince McMahon was asked about w…", "url": "https://cultaholic.com/posts/vince-mcmahon-on-why-wwe-raw-s-ratings-have-declined-during-the-coronavirus-pandemic", "urlToImage": null, "publishedAt": "2020-04-24T14:58:00Z", "content": "During the coronavirus pandemic, Monday Night Raw's ratings have declined by approximately 20 percent and the April 20 episode set another record non-holiday low for viewership.\r\nDuring the Q1 2020 earnings conference call, Vince McMahon was asked about why h… [+760 chars]"}, {"source": {"id": null, "name": "Thenational.scot"}, "author": "Emer O'Toole", "title": "TRNSMT forced to issue clarification after blaming Nicola Sturgeon for cancellation - The National", "description": "ORGANISERS of Scottish music festival TRNSMT have been forced to issue a clarification after their original statement about cancelling the event…", "url": "https://www.thenational.scot/news/18403899.trnsmt-issues-clarification-blaming-nicola-sturgeon-cancellation/", "urlToImage": null, "publishedAt": "2020-04-24T14:05:40Z", "content": "ORGANISERS of Scottish music festival TRNSMT have been forced to issue a clarification after their original statement about cancelling the event appeared to blame Nicola Sturgeon. \r\nBosses said in a statement this morning that \"due to the comments made by the… [+2577 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Annie Lord", "title": "Ricky Gervais calls Gal Gadot’s ‘Imagine’ video an ‘awful rendition’ - The Independent", "description": "‘They might have been doing it for good reasons, to help these normal nobodies’", "url": "https://www.independent.co.uk/arts-entertainment/tv/news/ricky-gervais-gal-gadot-imagine-john-lennon-awful-viral-video-coronavirus-a9482296.html", "urlToImage": null, "publishedAt": "2020-04-24T13:54:36Z", "content": "Ricky Gervais has criticised the viral video that saw Gal Gadot lead a host of celebrities to perform a cover of John Lennons Imagine.\r\nIn a video posted to Instagram, the Wonder Woman actor began singing Lennons iconic track, before the likes of Will Ferrell… [+1012 chars]"}, {"source": {"id": null, "name": "Whatculture.com"}, "author": "Jamie Kennedy", "title": "AEW Boss Tony Khan Says \"We're Not A Cult\" - WhatCulture", "description": "Talent are free to attend any shows they like, including WWE ones...", "url": "https://whatculture.com/wwe/aew-boss-tony-khan-says-34-were-not-a-cult-34", "urlToImage": null, "publishedAt": "2020-04-24T13:25:41Z", "content": "AEW\r\nAEW chief Tony Khan does not want to run his promotion like some sort of anti-WWE hate-fest.\r\nThat's something Britt Baker made perfectly clear during her recent interview with Chris Jericho for the ex-AEW Champ's 'Talk Is Jericho' podcast. When Britt wa… [+833 chars]"}, {"source": {"id": null, "name": "Bristolpost.co.uk"}, "author": "Conor Gogarty", "title": "Statement issued on whether Bristol Banksy piece's new face mask will be removed - Bristol Post", "description": "The site is a specially protected \"character building\"", "url": "https://www.bristolpost.co.uk/news/bristol-news/banksy-harbourside-face-mask-coronavirus-4072489", "urlToImage": null, "publishedAt": "2020-04-24T13:06:59Z", "content": "The new face mask on Banksy's famous Girl with a Pierced Eardrum graffiti seems set to stay.\r\nThe Bristolian guerilla artist's parody of Johannes Vermeer's Girl with a Pearl Earring painting first appeared on the side of an Albion Docks building at Bristol Ha… [+1776 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Kate Nicholson", "title": "Brutal nickname royal staff gave to Charles during affair with Camilla exposed - Express.co.uk", "description": "PRINCE CHARLES was dubbed the ‘Prince of Darkness' during the earlier years of his affair with his now-wife Camilla Parker Bowles, a royal expert has revealed.", "url": "https://www.express.co.uk/news/royal/1273428/prince-charles-news-camilla-parker-bowles-princess-diana-prince-of-darkness-spt", "urlToImage": null, "publishedAt": "2020-04-24T12:46:00Z", "content": null}, {"source": {"id": null, "name": "Entertainmentdaily.co.uk"}, "author": "Rebecca Carter", "title": "Viewers angry with ITV as it issues statement about Gordon, Gino and Fred: Road Trip - Entertainment Daily", "description": "They want more episodes next time", "url": "https://www.entertainmentdaily.co.uk/tv/viewers-angry-with-itv-as-it-issues-statement-about-gordon-gino-and-fred-road-trip/", "urlToImage": null, "publishedAt": "2020-04-24T11:11:18Z", "content": "Viewers are gutted Gordon Ramsay, Gino D'Acampo and Fred Sirieix's latest ITV Road Trip series has come to an end.\r\nThe fourth and final episode of their American Road Trip aired last night (April 24) as they travelled around Texas.\r\nEven though the series ha… [+2573 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Amanda Devlin", "title": "Matt Lucas drops biggest hint yet that he’s bringing back Little Britain with David Walliams after Big Night I - The Sun", "description": "", "url": "http://www.thesun.co.uk/tvandshowbiz/11470449/matt-lucas-hint-little-britain-return/", "urlToImage": null, "publishedAt": "2020-04-24T11:00:40Z", "content": "MATT Lucas has dropped the biggest hint yet that he's bringing back Little Britain with David Walliams after their Big Night In performance.\r\nThe legendary comedy duo returned to TV for the first time in more than decade last night to raise funds to provide s… [+1461 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: 'We're giving our tour buses to the NHS' - BBC News", "description": "Buses which are usually home to rock stars are now giving frontline workers a place to rest.", "url": "https://www.bbc.co.uk/news/newsbeat-52410888", "urlToImage": null, "publishedAt": "2020-04-24T10:18:06Z", "content": "Image copyrightVans For BandsImage caption\r\n Buses have been deployed all over the UK including this one at The Whittington NHS Trust in London\r\nMusic fans won't need reminding there are no live gigs happening at the moment.\r\nAs well as empty venues and festi… [+4092 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Adam White", "title": "Dolly Parton secretly produced Buffy the Vampire Slayer, and fans have only just found out - The Independent", "description": "Unexpected crossover between pop culture icons has been a secret for almost three decades", "url": "https://www.independent.co.uk/arts-entertainment/tv/news/dolly-parton-buffy-the-vampire-slayer-producer-sandollar-sandy-gallin-gail-berman-a9481656.html", "urlToImage": null, "publishedAt": "2020-04-24T10:04:12Z", "content": "Dolly Parton secretly produced Buffy the Vampire Slayer, and the unexpected crossover of cultural icons has left fans reeling.\r\nWhile Parton was not herself credited as a producer on the long-running fantasy series, a company she co-created and owned was resp… [+1764 chars]"}, {"source": {"id": null, "name": "Theguardian.commusic"}, "author": "Ben Beaumont-Thomas", "title": "Taylor Swift disowns new live album, calling it 'shameless greed' - The Guardian", "description": "Singer complains of ‘tasteless’ release amid coronavirus crisis by former label Big Machine, owned by frequent adversary Scooter Braun", "url": "https://amp.theguardian.commusic/2020/apr/24/taylor-swift-disowns-new-live-album-scooter-braun-big-machine", "urlToImage": null, "publishedAt": "2020-04-24T09:49:00Z", "content": "Taylor Swift has disowned a new live album released under her name, calling it tasteless and shameless greed amid the coronavirus outbreak.\r\nThe album, Live from Clear Channel Stripped 2008, was recorded when Swift was 18, around the release of her Grammy-win… [+1225 chars]"}, {"source": {"id": null, "name": "Gazettelive.co.uk"}, "author": "Naomi Corrigan", "title": "The Killers announce new Riverside Stadium date after confirming postponement - Gazette Live", "description": "The Hot Fuss hitmakers said all UK and Ireland gigs will not go ahead this year due to to Covid-19.", "url": "https://www.gazettelive.co.uk/whats-on/killers-confirm-postponement-riverside-stadium-18142318", "urlToImage": null, "publishedAt": "2020-04-24T08:02:08Z", "content": "The Killers have confirmed their sell-out Riverside Stadium concert will be postponed until 2021.\r\nIn a Tweet, the US rockers said they are not cancelling, and the show will instead go ahead on Thursday, June 10, 2021.\r\n The scheduled Middlesbrough show on Ju… [+2010 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Katie Palmer", "title": "Big Night In fundraising: How much was raised? Can you still donate? - Express", "description": "BIG NIGHT IN raised millions of pounds to support vulnerable people during the coronavirus outbreak and fans were left gobsmacked at the final total. How much was raised? Can you still donate?", "url": "https://www.express.co.uk/showbiz/tv-radio/1273283/big-night-in-fundraising-how-much-raised-can-you-donate-bbc", "urlToImage": null, "publishedAt": "2020-04-24T07:49:07Z", "content": null}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "George Griffiths", "title": "Parks and Recreation cast returning for coronavirus one-off special - Metro.co.uk", "description": "Hint: she's got a ring binder for everything.", "url": "https://metro.co.uk/2020/04/24/parks-recreation-cast-reuniting-special-one-off-episode-show-us-lesley-knope-deals-coronavirus-12602798/", "urlToImage": null, "publishedAt": "2020-04-24T06:51:19Z", "content": "Lesley Knope is back to save us all from coronavirus (Picture: NBC)\r\nThe cast of Parks and Recreation will be reuniting for a special one-off episode of the beloved sitcom. \r\nLuckily, this will show us how everyones favourite politician, Lesley Knope (Amy Poe… [+2249 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Alexandra Rucki", "title": "Beyonce donates $6m to coronavirus relief effort in US cities - Manchester Evening News", "description": "Money will be going to frontline workers and people affected by the pandemic", "url": "https://www.manchestereveningnews.co.uk/news/world-news/beyonce-coronavirus-donations-usa-twitter-18142005", "urlToImage": null, "publishedAt": "2020-04-24T06:44:43Z", "content": "Beyonce has joined forced with Twitter CEO Jack Dorsey to donate six million dollars (£4.9 million) to the coronavirus relief effort.\r\nThe pop singer's BeyGood foundation announced the donation on Thursday, with the money going to frontline workers and people… [+1223 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Rachel Mcgrath For Dailymail.com", "title": "Elton John postpones next leg of Farewell Yellow Brick Road Tour during COVID-19 pandemic - Daily Mail", "description": "'This tough decision has been made with the continued safety and well-being of his fans... and with the concern that these gatherings continue to risk accelerating the spread of the Coronavirus,' he said.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8251573/Elton-John-postpones-leg-Farewell-Yellow-Brick-Road-Tour-COVID-19-pandemic.html", "urlToImage": null, "publishedAt": "2020-04-24T01:19:52Z", "content": "The end of the New Zealand and Australia leg of his farewell tour in February was marred by his ill health.\r\nAnd now Elton John, 73, has announced he is unable to go ahead with the next leg in the United States due to the coronavirus pandemic.\r\nIn an announce… [+3846 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Lewis Knight", "title": "Too Hot To Handle star Harry Jowsey spills details on sex act with Francesca - Mirror Online", "description": "Netflix has found a reality TV hit in the form Too Hot To Handle and tall Aussie Harry Jowsey had quite the impact on Francesca Farago", "url": "https://www.mirror.co.uk/tv/tv-news/hot-handle-star-harry-jowsey-21915347", "urlToImage": null, "publishedAt": "2020-04-23T19:31:00Z", "content": "One of the stars of Too Hot To Handle has spilt details on a now infamous sexual encounter he had on the show.\r\nTall Aussie model Harry Jowsey, 23, failed to stick to the celibacy rules on a number of occasions across the Netflix show's run.\r\nOne of the most … [+2019 chars]"}, {"source": {"id": null, "name": "Ok.co.uk"}, "author": "Ayla Soguksu", "title": "Holly Willoughby shares rare glimpse of son Chester as they wear matching rainbow t-shirts for NHS - OK! magazine", "description": "This Morning star Holly Willoughby has offered fans a sneak look at her five year old son Chester as she shared a sweet selfie of them wearing matching rainbow t-shirts in support of the NHS.", "url": "https://www.ok.co.uk/celebrity-news/holly-willoughby-son-chester-nhs-21916066", "urlToImage": null, "publishedAt": "2020-04-23T16:23:21Z", "content": "Holly Willoughby has given her fans a rare look at her youngest son Chester.\r\nThe 39 year old took to her Instagram Feed to share a sweet selfie with her five year old posing in matching M&amp;S t-shirts, of which all proceeds will be going to the NHS as they… [+2543 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Verity Sulway", "title": "Piers Morgan jokes he will remove son from his will if social media taunts continue - Mirror Online", "description": "Piers Morgan revealed he was considering cutting his son Spencer out of his will for taunting him on social media for saying he would head to the pub after lockdown before seeing his sons", "url": "https://www.mirror.co.uk/tv/tv-news/piers-morgan-jokes-remove-son-21912539", "urlToImage": null, "publishedAt": "2020-04-23T15:54:30Z", "content": "Piers Morgan said today he was considering removing his son Spencer from his will if he carries on taunting his dad on social media. \r\n Good Morning Britain hosts Piers and Susanna Reid were talking about phoning your friends and family during the coronavirus… [+1818 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Female Star Wars TV Series Coming! - WhatCulture", "description": "Todays news brought to you by Ash Millman, Adam Clery and Kirsten Ria. For more awesome content, check out: http://whatculture.com/ Follow us on Facebook at:...", "url": "https://www.youtube.com/watch?v=6a0gMHDlhvg", "urlToImage": null, "publishedAt": "2020-04-23T14:00:22Z", "content": null}]}