{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Holly Christodoulou", "title": "Prince Harry and Meghan Markle ‘help ‘friendly’ journalists pen bombshell biography’ to ‘settle scores with Pa - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11482952/prince-harry-meghan-markle-biography-royals/", "urlToImage": null, "publishedAt": "2020-04-26T10:41:17Z", "content": "MEGHAN Markle and Prince Harry are helping two journalist pals write a bombshell biography that could pile further pain on the royal family, according to reports.\r\nThe Duke and Duchess of Sussex have reportedly given an interview to the \"friendly\" authors of … [+3431 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Lucy Needham", "title": "The Masked Singer returns tonight with new celebs and disguises in lockdown special - Mirror Online", "description": "The singing contest had been a huge hit for ITV when it broadcast in January and a second instalment has come sooner than fans thought", "url": "https://www.mirror.co.uk/tv/tv-news/masked-singer-returns-tonight-new-21928242", "urlToImage": null, "publishedAt": "2020-04-26T10:35:36Z", "content": "The Masked Singer is set to make a return for a lockdown special with host Joel Dommett at the helm.\r\nThe singing contest, which sees a group of celebs performing in elaborate disguises, had been a huge hit for ITV earlier this year.\r\nPresenter Joel sparked a… [+1897 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Sam Elliott", "title": "Piers Morgan flirts with Love Island's Lucie Donlan following Donald Trump heartache - Mirror Online", "description": "The Good Morning Britain host turned his attentio to the stunning ex-Islander with a cheeky Instagram message", "url": "https://www.mirror.co.uk/3am/celebrity-news/piers-morgan-flirts-love-islands-21928043", "urlToImage": null, "publishedAt": "2020-04-26T10:26:50Z", "content": "Piers Morgan is helping get over his social media shunning by President Trump by flirting outrageously with Love Island babe Lucie Donlan.\r\nThe 55-year-old left a cheeky comment on the ITV2 star's latest sizzling bikini post.\r\nThe Good Morning Britain present… [+2291 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Roisin O'Connor", "title": "RuPaul's Drag Race: Jeff Goldblum receives backlash for Islam comments to Jackie Cox - The Independent", "description": "‘As if America hasn’t been anti-gay and anti-woman from the outset, or killed and displaced millions of Muslims, including women and queers,’ one critic retorted", "url": "https://www.independent.co.uk/arts-entertainment/tv/news/jeff-goldblum-islam-rupaul-drag-race-jackie-cox-women-homosexuality-a9483536.html", "urlToImage": null, "publishedAt": "2020-04-26T10:25:20Z", "content": "Jeff Goldblum has found himself the subject of a backlash after asking a contestant on RuPauls Drag Race if Islam is anti-homosexuality and anti-woman.\r\nThe actor and musician appeared as a guest judge on an episode of the shows 12th season, in which the seve… [+29238 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Annie Lord", "title": "Laurence Fox reveals brother-in-law Richard Ayoade's furious reaction to Question Time race row - The Independent", "description": "The ‘IT Crowd’ star did not agree with Fox’s comments on ‘Question Time’ and ignored Fox’s pleas to support him on social media", "url": "https://www.independent.co.uk/arts-entertainment/tv/news/lawrence-fox-richard-ayoade-racism-row-question-time-meghan-markle-a9484406.html", "urlToImage": null, "publishedAt": "2020-04-26T09:53:03Z", "content": "Laurence Fox has revealed how his brother-in-law, the comedian, writer and actor Richard Ayoade, reacted after his notorious appearance on BBCs Question Time. \r\nDuring his appearance on the political chat show, Fox accused a woman of colour of racism after sh… [+1410 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Mary Gallagher", "title": "Pregnant Rochelle Humes says she is ‘in tears’ as she suffers severe morning sickness in her second tri - The Sun", "description": "", "url": "http://www.thesun.co.uk/tvandshowbiz/11480705/pregnant-rochelle-humes-morning-sickness-trimester/", "urlToImage": null, "publishedAt": "2020-04-26T09:40:58Z", "content": "ROCHELLE Humes has revealed she has been crying today after suffering painful morning sickness in the second trimester of her pregnancy.\r\nThe This Morning host announced her third pregnancy earlier this month and is expecting a baby boy later this year.\r\n Pre… [+4676 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Sean O'grady For Mailonline", "title": "Feud between Oasis and Blur started after Damon Albarn slept with Liam's girlfriend - Daily Mail", "description": "According to The Sun, Noel claimed a lot of drugs were involved: 'Liam and Damon were s****ing the same bird and there was a lot of cocaine involved. That's where the germ of it grew from.'", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8258033/Feud-Oasis-Blur-started-Damon-Albarn-slept-Liams-girlfriend.html", "urlToImage": null, "publishedAt": "2020-04-26T09:17:39Z", "content": "The feud between Oasis and Blue was due to Damon Albarn sleeping with a woman Liam Gallagher was dating at the time, his brother Noel has claimed.\r\nNoel, 52, revealed the infamous chart battle between the two rock groups kicked off after Liam, 47, found out B… [+2877 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Michelle Keegan becomes victim of sex attack as Erin in hit show Brassic - Mirror Online", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiQWh0dHBzOi8vd3d3Lm1pcnJvci5jby51ay90di9taWNoZWxsZS1rZWVnYW4tbm90LWp1c3QtZXllLTIxOTI2NTE00gFFaHR0cHM6Ly93d3cubWlycm9yLmNvLnVrL3R2L21pY2hlbGxlLWtlZWdhbi1ub3QtanVzdC1leWUtMjE5MjY1MTQuYW1w?oc=5", "urlToImage": null, "publishedAt": "2020-04-26T09:02:07Z", "content": null}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Robert Webb", "title": "'They were literally about to turn me off and on again': Robert Webb on his brush with mortality - The Guardian", "description": "A routine medical brought life-changing news for the comedian and author. And the curious thing was he’d predicted it in his new novel", "url": "https://www.theguardian.com/books/2020/apr/26/they-were-literally-about-to-turn-me-off-and-on-again-robert-webb-on-his-brush-with-mortality", "urlToImage": null, "publishedAt": "2020-04-26T09:00:55Z", "content": "There are moments when your life changes over the length of a single word. For example, you might remember that particular time you heard the word pregnant. Or maybe divorce or congratulations or guilty. And maybe you remember the silence that followed and ho… [+8084 chars]"}, {"source": {"id": null, "name": "Nme.com"}, "author": null, "title": "Phoebe Waller-Bridge has the ‘Fleabag’ wall of penises in her house - NME Live", "description": "Phoebe Waller-Bridge, creator and star of the hit sitcom Fleabag has revealed that she keeps the show's 'wall of penises' in her house.", "url": "https://www.nme.com/news/tv/phoebe-waller-bridge-has-the-fleabag-wall-of-penises-in-her-house-2653954", "urlToImage": null, "publishedAt": "2020-04-26T08:41:29Z", "content": "Phoebe Waller-Bridge, creator and star of the hit sitcom Fleabag has revealed that she keeps the show’s ‘wall of penises’ in her house.\r\nAppearing on The Graham Norton Show from home, the writer and actor showed viewers how she keeps the prop by her front doo… [+1201 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Euan Ferguson", "title": "The week in TV: After Life; Gangs of London; Emergence; Have I Got News for You – and more - The Guardian", "description": "Ricky Gervais’s After Life struggles second time round, as 21st-century London’s answer to Peaky Blinders gets off to a flying, if violent, start", "url": "https://www.theguardian.com/tv-and-radio/2020/apr/26/the-week-in-tv-after-life-gangs-of-london-emergence-have-i-got-news-for-you-and-more", "urlToImage": null, "publishedAt": "2020-04-26T08:31:06Z", "content": "After Life (Netflix)Gangs of London (Sky Atlantic)Emergence (Fox)Twin (BBC Four) | iPlayerThe Graham Norton Show (BBC One) | iPlayerThe Mash Report (BBC Two) | iPlayerHave I Got News for You (BBC One) | iPlayer\r\nRicky Gervais is, take your pick, ever reinvent… [+6803 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Michelle Marshall", "title": "Dan Walker: BBC Breakfast star honours late colleague in heartfelt tribute 'Much love' - Express", "description": "DAN WALKER - a presenter on BBC Breakfast alongside Louise Minchin - took to Twitter and offered a heartfelt tribute to former BBC Watchdog host Lynn Faulds Woods following the news of her death this week.", "url": "https://www.express.co.uk/celebrity-news/1273971/dan-walker-bbc-breakfast-lynn-faulds-wood-dead-stroke-twitter-latest-news-updates", "urlToImage": null, "publishedAt": "2020-04-26T08:27:34Z", "content": null}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Joshua Fox For Daily Mail Australia", "title": "First Dates Australia star star suffers huge wardrobe malfunction and flashes match - Daily Mail", "description": "First Dates Australia endured one of its most awkward moments last week.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8257827/First-Dates-Australia-star-star-suffers-huge-wardrobe-malfunction-flashes-match.html", "urlToImage": null, "publishedAt": "2020-04-26T08:24:17Z", "content": "First Dates Australia endured one of its most awkward moments last week.\r\nAs the show returned to Channel Seven, Brittany McQuade, 23, suffered a wardrobe malfunction and accidentally flashed her date, teacher James Alexander, 27. \r\n'Oh my god, I can see her … [+2749 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Katie Fitzpatrick", "title": "Teetotal Christine McGuinness says she's been thinking about alcohol in lockdown after 12 years sober - Manchester Evening News", "description": "The mum-of-three hasn't had a drink in more than 12 years", "url": "https://www.manchestereveningnews.co.uk/news/showbiz-news/teetotal-christine-mcguinness-says-shes-18150469", "urlToImage": null, "publishedAt": "2020-04-26T08:20:10Z", "content": "Reality star mum Christine McGuinness has revealed that she's been thinking about alcohol in lockdown after going more than 12 years without a drink.\r\nThe mother-of-three opened up to her followers on Instagram, saying she'd been casting her mind back her fav… [+2375 chars]"}, {"source": {"id": null, "name": "Kentonline.co.uk"}, "author": "Ed McConnell", "title": "Reporter's vow of silence after Twitter shoe storm - Kent Online", "description": "A reporter has vowed never to discuss fashion again after finding himself at the centre of a social media storm.", "url": "https://www.kentonline.co.uk/sheerness/news/reporters-vow-of-silence-after-twitter-shoe-storm-226251/", "urlToImage": null, "publishedAt": "2020-04-26T07:39:00Z", "content": "A veteran reporter found himself at the centre of a social media storm after an ill-judged tweet about a newsreader's choice of footwear.\r\nVeteran journalist and former editor John Nurden posted his tweet on Saturday morning to question BBC presenter Naga Mun… [+2305 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Olivia Petter", "title": "Rowena Chiu: ‘The Harvey Weinstein survivors we know about are the tip of the iceberg’ - The Independent", "description": "The former assistant to the jailed producer talks to Olivia Petter about her attempted rape allegation against Harvey Weinstein, why his lawyers must be held to account, and the damaging myths we attach to rape survivors and perpetrators", "url": "https://www.independent.co.uk/arts-entertainment/tv/features/rowena-chiu-interview-harvey-weinstein-donna-rotunno-zelda-perkins-documentary-a9482581.html", "urlToImage": null, "publishedAt": "2020-04-26T07:24:14Z", "content": "Rowena Chiu does not want you to call her brave. Im grateful when people say it, but at the same time, I cant help but worry its an indictment of sexual assault survivors who have chosen to stay silent, she says over Zoom from her home in California. Do they … [+10698 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Clémence Michallon", "title": "SNL at Home: Brad Pitt destroys Trump with Dr Anthony Fauci impersonation - The Independent", "description": "Fauci has been a leading member of Trump's coronavirus task force", "url": "https://www.independent.co.uk/arts-entertainment/tv/news/snl-at-home-brad-pitt-anthony-fauci-coronavirus-trump-miley-cyrus-a9484296.html", "urlToImage": null, "publishedAt": "2020-04-26T07:22:10Z", "content": "Brad Pitt surprised SNL viewers on Saturday (25 April) when he made his first appearance as Dr Anthony Fauci.\r\nSaturday Night Live was returning for a second at-home episode after a first instalment two weeks prior.\r\nFauci has been a leading member of Donald … [+1569 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Seamus Duff", "title": "Tiger King star Carole Baskin's husband 'strangled and thrown from plane' - Mirror Online", "description": "The lawyer of Carole's ex-husband Don Lewis, who went missing on 18 August 1997 aged 59, has shared his shocking theory that Don was murdered above the skies and his body dumped in the Gulf of Mexico", "url": "https://www.mirror.co.uk/3am/celebrity-news/tiger-king-star-carole-baskins-21927770", "urlToImage": null, "publishedAt": "2020-04-26T07:21:32Z", "content": "Tiger King star Carole Baskins missing husband was strangled and thrown from a plane, his lawyer has claimed in an astonishing interview.\r\nNetflix fans have been gripped by the hit documentary series Tiger King which focused on the rise and fall of zoo owner … [+3548 chars]"}, {"source": {"id": null, "name": "Digitalspy.com"}, "author": "Ian Sandwell", "title": "Extraction director explains ambiguous ending to Netflix movie - digitalspy.com", "description": "\"Different people view the film in different ways.\"", "url": "https://www.digitalspy.com/movies/a32266319/extraction-ending-sam-hargrave-netflix/", "urlToImage": null, "publishedAt": "2020-04-26T07:00:00Z", "content": "Extraction spoilers follow.\r\nExtraction, starring Chris Hemsworth, arrived on Netflix on Friday (April 24) and left viewers with a major question over its ending.\r\nThe movie sees Hemsworth play mercenary Tyler Rake who undertakes a dangerous mission to rescue… [+1995 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Sirin Kale", "title": "How coronavirus helped TikTok find its voice - The Guardian", "description": "The video-sharing app’s blend of memes, jokes and skits have been a surprise lockdown hit – but teen users are worried it will lose its cool", "url": "https://www.theguardian.com/technology/2020/apr/26/how-coronavirus-helped-tiktok-find-its-voice", "urlToImage": null, "publishedAt": "2020-04-26T07:00:00Z", "content": null}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "BBC News", "title": "Coronavirus: Naomi Campbell and African artists entertain fans online - BBC News", "description": "Big-name celebrities and artists have been going online to entertain their fans during the pandemic.", "url": "https://www.bbc.co.uk/news/av/world-africa-52417537/coronavirus-naomi-campbell-and-african-artists-entertain-fans-online", "urlToImage": null, "publishedAt": "2020-04-26T05:44:51Z", "content": null}, {"source": {"id": null, "name": "Whatculture.com"}, "author": "Dylan Walker", "title": "10 Worst CGI Effects In Superhero Films - WhatCulture", "description": "Not all CGI is created equal.", "url": "https://whatculture.com/film/10-worst-cgi-effects-in-superhero-films", "urlToImage": null, "publishedAt": "2020-04-26T05:34:43Z", "content": "There's no argument, superhero movies have become\r\nthe dominant genre at the multiplex over the past decade. What were previously\r\nscattered releases that only ever had mild success, are now the biggest box\r\noffice hits of the year. With such an abundance of … [+815 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Seamus Duff", "title": "Daisy Lowe dumps boyfriend Jack Peñate because she 'didn't see a future' with him - Mirror Online", "description": "The model reportedly called time on her romance with Torn on the Platform singer Jack after realising they were better at being friends rather than boyfriend and girlfriend", "url": "https://www.mirror.co.uk/3am/celebrity-news/daisy-lowe-dumps-boyfriend-jack-21927909", "urlToImage": null, "publishedAt": "2020-04-26T05:04:32Z", "content": "Daisy Lowe has ditched her musician boyfriend Jack Peñate after failing to see a future with the guitar strumming hunk, according to a new report. \r\nThe 31-year-old model is believed to have dumped 35-year-old Torn on the Platform singer Jack before escaping … [+1894 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Seamus Duff", "title": "Joey Essex's girlfriend dumped him over his wild 24-hour night out with Rita Ora - Mirror Online", "description": "Joey's now ex-girlfriend Lorena Medina has revealed they engaged in a blazing row after paparazzi snapped the TOWIE star heading to Rita's house following a late night out", "url": "https://www.mirror.co.uk/3am/celebrity-news/joey-essexs-girlfriend-dumped-him-21927897", "urlToImage": null, "publishedAt": "2020-04-26T04:58:14Z", "content": "Joey Essexs partying ways caught up with him in the shape of being dumped by his stunning girlfriend Lorena Medina and all because he spent a wild night out with pop babe Rita Ora.\r\nThe 29-year-old former The Only Way Is Essex star has been thrown back on the… [+2201 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Tom Pyman For Mailonline", "title": "Sky News presenter chokes back tears as she reads out obituaries for coronavirus victims live on TV - Daily Mail", "description": "Anchor Kimberley Leonard became overwhelmed with emotion during a bulletin and her voice began to break as she shared stories of those who have fallen victim to the killer bug.", "url": "https://www.dailymail.co.uk/news/article-8257523/Sky-News-presenter-chokes-tears-reads-obituaries-coronavirus-victims-live-TV.html", "urlToImage": null, "publishedAt": "2020-04-26T04:26:48Z", "content": "A newsreader held back tears as she became overwhelmed with emotion while reading out the names of coronavirus victims on live TV.\r\nSky News anchor Kimberley Leonard's voice began to break as she shared obituaries for some of those who have lost their lives d… [+2834 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Charlotte Dean For Mailonline", "title": "Katie Price says she was sexually assaulted at gunpoint during horrific carjacking - Daily Mail", "description": "Katie Price has candidly detailed her horrific carjacking experience where she was sexually assaulted while with her children in South Africa in 2018.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8257599/Katie-Price-says-sexually-assaulted-gunpoint-horrific-carjacking.html", "urlToImage": null, "publishedAt": "2020-04-26T04:15:37Z", "content": "Katie Price has candidly detailed her horrific carjacking experience where she was sexually assaulted while with her children in South Africa in 2018.\r\nThe former glamour model, 41, said that she was groped and held at gunpoint when the family stopped at the … [+2405 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Seamus Duff", "title": "Price is Right announcer hospitalised following three heart attacks - Mirror Online", "description": "George Gray complained of chest pain and weakness in his arms before suffering three huge heart attacks, but is now recovering after his wife helped rush him to hospital", "url": "https://www.mirror.co.uk/3am/celebrity-news/price-right-announcer-hospitalised-following-21927829", "urlToImage": null, "publishedAt": "2020-04-26T02:39:33Z", "content": "Longtime The Price Is Right announcer George Gray has been hospitalised after suffering multiple heart attacks.\r\nThe 53-year-old game show personality has been the voice of Americas long-running The Price Is Right since 2011. \r\n George was rushed to hospital … [+2048 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Michael Hamilton", "title": "Prince William and Kate launch mental health scheme after being ‘moved to tears’ by frontline workers - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11481271/william-kate-mental-health-scheme-coronavirus/", "urlToImage": null, "publishedAt": "2020-04-26T01:58:44Z", "content": "PRINCE William and Kate Middleton launched their mental health support scheme after the Duchess of Cambridge was moved to tears by the plight of frontline workers battling coronavirus.\r\nKate, 38, - who this week launched Our Frontline alongside William is sai… [+5261 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Seamus Duff", "title": "Terminally ill ex-CBBC star fears she won't live to see family due to lockdown - Mirror Online", "description": "Chelsie Whibley, 28, suffers from cystic fibrosis and is isolating indefinitely while the coronavirus pandemic continues and fears she is losing precious time to spend with her family", "url": "https://www.mirror.co.uk/3am/celebrity-news/terminally-ill-ex-cbbc-star-21927795", "urlToImage": null, "publishedAt": "2020-04-26T01:56:02Z", "content": "Former CBBC star Chelsie Whibley fears she might not live to see her family again as she battles a terminal illness during the coronavirus pandemic. \r\n The 28-year-old former actress suffers from cystic fibrosis a condition that causes sticky mucus to build u… [+2949 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nNick Allen", "title": "Kanye West is a billionaire, says Forbes, after row over rapper's wealth - Telegraph.co.uk", "description": "West disputes the 1.3 billion valuation and says he is worth much more", "url": "https://www.telegraph.co.uk/news/2020/04/26/kanye-west-billionaire-says-forbes-row-rappers-wealth/", "urlToImage": null, "publishedAt": "2020-04-26T00:19:00Z", "content": "Kanye West, the mercurial rapper and fashion mogul, has officially gained the status of \"billionaire\" following a long and acrimonious dispute over his wealth with Forbes magazine.\r\nThe feud began after the august financial publication featured West, 42, on i… [+695 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Mary Gallagher", "title": "Strictly Come Dancing to offer Maya Jama a ‘six figure sum to join 2020 series’ - The Sun", "description": "", "url": "http://www.thesun.co.uk/tvandshowbiz/11482050/strictly-come-dancing-maya-jama/", "urlToImage": null, "publishedAt": "2020-04-26T00:16:56Z", "content": "STRICTLY Come Dancing are eyeing up Maya Jama for the 2020 series - hoping a six figure sum will sweeten the deal.\r\nSources say the stunning ex of rap star Stormzy could take a turn beneath the glitter ball when the show returns in September.\r\n Strictly Come … [+2536 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Mary Gallagher", "title": "Love Island’s Molly-Mae Hague compares swanky Manchester flat to ‘absolute captivity’ despite having a priva - The Sun", "description": "", "url": "http://www.thesun.co.uk/tvandshowbiz/11481798/love-island-molly-mae-hague-flat-lockdown-sauna/", "urlToImage": null, "publishedAt": "2020-04-26T00:16:42Z", "content": "MOLLY-Mae Hague admitted she's struggling in lockdown as she compared her swanky Manchester flat to \"absolute captivity\"  - despite having a private sauna.\r\nShe is currently isolating with Love Island boyfriend Tommy Fury in a luxury penthouse-style flat in M… [+2680 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Katie Hind For The Mail On Sunday", "title": "Victoria Beckham unrepentant for spending taxpayer cash on furloughed staff and thinks she's victim - Daily Mail", "description": "Last Sunday was the third and final day of Victoria Beckham's extended 46th birthday celebrations. Already she had enjoyed a 'virtual' party hosted by a celebrity DJ friend and broadcast on Instagram.", "url": "https://www.dailymail.co.uk/news/article-8257253/Victoria-Beckham-unrepentant-spending-taxpayer-cash-furloughed-staff-thinks-shes-victim.html", "urlToImage": null, "publishedAt": "2020-04-25T23:56:39Z", "content": "Last Sunday was the third and final day of Victoria Beckham's extended 46th birthday celebrations. \r\nAlready she had enjoyed a 'virtual' party hosted by a celebrity DJ friend and broadcast on Instagram, and had a chocolate cake which she had also proudly disp… [+9917 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Caroline Graham In Los Angeles For The Mail On Sunday", "title": "Jennifer Aniston, 51, forgives her estranged father, 86, for walking out on her - Daily Mail", "description": "She needed years of therapy to cope with the abandonment issues she suffered after her father walked out on her as a child.", "url": "https://www.dailymail.co.uk/news/article-8257199/Jennifer-Aniston-51-forgives-estranged-father-86-walking-her.html", "urlToImage": null, "publishedAt": "2020-04-25T23:06:03Z", "content": "She needed years of therapy to cope with the abandonment issues she suffered after her father walked out on her as a child.\r\nBut now Friends star Jennifer Aniston has reconciled with her dad John because of the coronavirus pandemic.\r\nA source close to the 86-… [+3655 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Mary Gallagher", "title": "Coronation Street legend Bill Roache celebrates his 88th birthday in lockdown with his family - The Sun", "description": "", "url": "http://www.thesun.co.uk/tvandshowbiz/11481574/coronation-street-bill-roache-88-birthday/", "urlToImage": null, "publishedAt": "2020-04-25T22:21:07Z", "content": "CORONATION Street legend Bill Roache celebrated his 88th birthday in lockdown today with his family.\r\nThe soap paid tribute to the actor with photos showing Bill, who has played Ken Barlow since 1960, surrounded by balloons and presents in his huge conservato… [+2708 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Nika Shakhnazarova", "title": "Mick Jagger slams rival Paul McCartney for bragging Beatles were better than The Rolling Stones - Mirror Online", "description": "Mick Jagger blasted rival Paul McCartney for suggesting The Rolling Stones copied The Beatles' style during their time as music rivals in the 60s", "url": "https://www.mirror.co.uk/3am/celebrity-news/mick-jagger-slams-rival-paul-21925821", "urlToImage": null, "publishedAt": "2020-04-25T21:45:18Z", "content": "Mick Jagger has launched a stinging attack on rival musician Paul McCartney. \r\nThe rocker, 76, hit out at Paul, 77, for suggesting The Rolling Stones copied The Beatles' style during their time as music rivals.\r\nMick bragged about the monumental success of Th… [+2420 chars]"}, {"source": {"id": null, "name": "Thescottishsun.co.uk"}, "author": "Matt Wilkinson", "title": "Queen locked down at Windsor Castle with 22 members of staff who are isolated from their families until - The Scottish Sun", "description": "", "url": "http://www.thescottishsun.co.uk/news/5531542/queen-lockdown-windsor-castle-staff/", "urlToImage": null, "publishedAt": "2020-04-25T21:38:53Z", "content": "THE Queen is locked down at Windsor Castle with 22 members of staff in what a top aide has dubbed HMS Bubble, The Sun on Sunday can reveal.\r\nThe team have said goodbye to their families for the duration of isolation.\r\n Read ourcoronavirus live blog for the la… [+5515 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Louise Griffin", "title": "Chris Pratt and wife Katherine Schwarzenegger 'expecting first child' - Metro.co.uk", "description": "So cute!", "url": "https://metro.co.uk/2020/04/25/chris-pratt-wife-katherine-schwarzenegger-expecting-first-child-together-12610624/", "urlToImage": null, "publishedAt": "2020-04-25T20:18:48Z", "content": "Chris Pratt and Katherine Schwarzenegger tied the knot last year (Picture: FilmMagic)\r\nChris Pratt and his wife Katherine Schwarzenegger are reportedly expecting their first child together.\r\nThe pair, who tied the knot last year, are expecting a new addition … [+2186 chars]"}, {"source": {"id": null, "name": "Belfastlive.co.uk"}, "author": "Sheena McStravick", "title": "Captain Tom Moore tribute as young Dundonald boy signs 'You'll Never Walk Alone' - Belfast Live", "description": "Jensen, aged six has hearing loss and wanted to sign a tribute to Dr Tom following his heroic fundraising efforts", "url": "https://www.belfastlive.co.uk/news/belfast-news/captain-tom-moore-tribute-young-18145261", "urlToImage": null, "publishedAt": "2020-04-25T19:50:19Z", "content": "A six-year-old boy has paid a heartwarming tribute to war veteran and NHS fundraising hero Captain Tom Moore in a moving online video.\r\n Jensen Douglas-Rea, from Dundonald has hearing loss and in an attempt to keep up communication with his classmates he has … [+2828 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Simon's GOLDEN BUZZER: Fayth Ifil is ROLLIN' all the way to the Semi-Finals! | BGT 2020 - Britain's Got Talent", "description": "See more from Britain's Got Talent at http://itv.com/talent Watch Britain's Got Talent: Unseen on the ITV HUB: https://bit.ly/2RreDOp Simon thinks a star is ...", "url": "https://www.youtube.com/watch?v=aii62acsp_E", "urlToImage": null, "publishedAt": "2020-04-25T19:42:20Z", "content": null}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Liam Martin", "title": "PS Plus May 2020 free PS4 games latest: The NEW PlayStation Plus games coming soon - Express", "description": "PLAYSTATION Plus subscribers are waiting for Sony to officially unveil the free PS4 games for May 2020.", "url": "https://www.express.co.uk/entertainment/gaming/1273793/PS-Plus-May-2020-free-PS4-games-latest-NEW-PlayStation-Plus-predictions", "urlToImage": null, "publishedAt": "2020-04-25T18:43:00Z", "content": null}, {"source": {"id": null, "name": "Digitalspy.com"}, "author": "Dan Seddon", "title": "Bradley Walsh says The Chase is \"100 shows behind schedule\" due to coronavirus - digitalspy.com", "description": "\"I've got absolutely no idea what is going to happen.\"", "url": "https://www.digitalspy.com/tv/reality-tv/a32276474/the-chase-coronavirus-bradley-walsh/", "urlToImage": null, "publishedAt": "2020-04-25T18:41:00Z", "content": "The Chasehost Bradley Walsh has detailed just how badly the coronavirus (COVID-19) is affecting the quiz show's schedule.\r\nProduction came to an end in February, but due to health fears over the pandemic Bradley and the five Chasers never returned to work.\r\n\"… [+1596 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Isla Williams", "title": "Timothée Chalamet and Lily-Rose Depp 'split' after a year of dating - Metro.co.uk", "description": "Say it isn't so.", "url": "https://metro.co.uk/2020/04/25/timothee-chalamet-lily-rose-depp-split-year-dating-12610064/", "urlToImage": null, "publishedAt": "2020-04-25T17:43:22Z", "content": "The two are said to have split after more than a year of dating (Picture: FilmMagic/Backgrid)\r\nTimothee Chalamet and Lily-Rose Depp have reportedly split after more than a year of dating.\r\nThe couple have recently called it quits on their romance, according t… [+2247 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Molli Mitchell", "title": "After Life season 2 ending explained: What happened at the end? - Express", "description": "AFTER LIFE season 2 is streaming on Netflix now but what happened at the end of the dark comedy series?", "url": "https://www.express.co.uk/showbiz/tv-radio/1273855/After-Life-season-2-ending-explained-what-happened-at-the-end-recap-episode-6-finale", "urlToImage": null, "publishedAt": "2020-04-25T17:39:38Z", "content": null}, {"source": {"id": null, "name": "Ringsidenews.com"}, "author": "H Jenkins", "title": "WWE Doctored Triple H Career Stats During SmackDown Celebration - Ringside News", "description": "WWE celebrated Triple H's career this week on Friday Night SmackDown. They apparently got a bit over zealous when recounting all of his achievements. One", "url": "https://www.ringsidenews.com/2020/04/25/wwe-doctored-triple-h-career-stats-during-smackdown-celebration/", "urlToImage": null, "publishedAt": "2020-04-25T17:12:00Z", "content": "WWE celebrated Triple H’s career this week on Friday Night SmackDown. They apparently got a bit over zealous when recounting all of his achievements.\r\nOne user noted on Reddit that WWE padded Triple H’s stats during his big celebration. They added 53 addition… [+785 chars]"}, {"source": {"id": null, "name": "Digitalspy.com"}, "author": "Dan Seddon", "title": "Spider-Man star is hosting Marvel-themed Instagram quiz - digitalspy.com", "description": "Get involved via Instagram next week.", "url": "https://www.digitalspy.com/movies/a32276017/spider-man-tom-holland-marvel-virtual-quiz/", "urlToImage": null, "publishedAt": "2020-04-25T16:49:00Z", "content": "Spider-Manactor Tom Holland will be hosting a Marvel-themed quiz on Instagram during the coronavirus lockdown.\r\nIn conjunction with The Brothers Trust, which was set up by Holland's family to support various charities, this virtual quiz will take place next W… [+1432 chars]"}, {"source": {"id": null, "name": "Nme.com"}, "author": null, "title": "Watch The Killers debut new song ‘Blowback’ and cover Tom Petty’s ‘The Waiting’ - NME Live", "description": "The Killers have debuted another new song from their forthcoming album ‘Imploding The Mirage’ - click here to listen to 'Blowback'.", "url": "https://www.nme.com/news/music/watch-the-killers-debut-new-song-blowback-and-cover-tom-pettys-the-waiting-2653845", "urlToImage": null, "publishedAt": "2020-04-25T16:13:05Z", "content": "The Killers have debuted another new song from their forthcoming album Imploding The Mirage.\r\nThe band’s frontman Brandon Flowers and Ronnie Vannucci Jr. appeared on CBS This Morning today (April 25) for the shows recurring Saturday Sessions segment. While on… [+1292 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Amalie Henden", "title": "Kate Garraway husband: Kate on 'critically ill' husband Derek - 'There is hope' - Express.co.uk", "description": "KATE GARRAWAY has issued an emotional update on social media as her husband Derek Draper remains in critical condition with coronavirus in intensive care.", "url": "https://www.express.co.uk/celebrity-news/1273696/Kate-Garraway-husband-Derek-Draper-coronavirus-hospital-Kate-Garraway-Through-the-Keyhole", "urlToImage": null, "publishedAt": "2020-04-25T16:00:00Z", "content": null}, {"source": {"id": null, "name": "Dexerto.com"}, "author": "Calum Patterson", "title": "Leaker reveals how Fortnite kept Travis Scott event hidden - Dexerto", "description": "Epic Games are using some simple tricks to keep data miners filthy hands off their precious in-game content and prevent leaks.", "url": "https://www.dexerto.com/fortnite/leaker-reveals-how-fortnite-kept-travis-scott-event-hidden-1357782", "urlToImage": null, "publishedAt": "2020-04-25T14:31:02Z", "content": "A Fortnite leaker has revealed how Epic Games tried to keep the Travis Scott event a secret and avoid major data mined leaks from spoiling it, by using code words.\r\nThis isn't the first time Epic has put on a major event, as the previous in-game concert by Ma… [+2513 chars]"}, {"source": {"id": null, "name": "Harpersbazaar.com"}, "author": "Amy Mackelden", "title": "Bella Hadid Celebrates Gigi's 25th Birthday with the Sweetest Vintage Snaps - HarpersBAZAAR.com", "description": "The adorable sisters have always done everything together.", "url": "https://www.harpersbazaar.com/celebrity/latest/a32275810/bella-hadid-gigi-birthday-throwback-photos-instagram/", "urlToImage": null, "publishedAt": "2020-04-25T14:31:00Z", "content": "<ul><li>Gigi Hadid celebrated her 25th birthday in quarantine, along with sister Bella Hadid and mom Yolanda.</li><li>Fellow model Bella took to Instagram to share some adorable throwback snaps of her big sister.</li><li>Gigi revealed that she had \"the sweete… [+1721 chars]"}, {"source": {"id": null, "name": "Unilad.co.uk"}, "author": "Emily Brown", "title": "Jeff Goldblum’s Question About Islam On RuPaul’s Drag Race Leaves Viewers Divided - UNILAD", "description": "Jeff Goldblum has sparked some serious debate after he appeared on RuPaul&#8217;s Drag Race and raised a question about LGBTQ+ acceptance in Islam.  The actor appeared as a guest judge on the reality show, which is currently in the midst of its twelfth season…", "url": "https://www.unilad.co.uk/film-and-tv/jeff-goldblums-question-about-islam-on-rupauls-drag-race-leaves-viewers-divided/", "urlToImage": null, "publishedAt": "2020-04-25T14:20:41Z", "content": "Jeff Goldblum has sparked some serious debate after he appeared on RuPauls Drag Race and raised a question about LGBTQ+ acceptance in Islam. \r\nThe actor appeared as a guest judge on the reality show, which is currently in the midst of its twelfth season, wher… [+3164 chars]"}, {"source": {"id": null, "name": "Hulldailymail.co.uk"}, "author": "Nisha Mal", "title": "The Queen uses her handbag to send secret signals to her staff - Hull Daily Mail", "description": "At events Her Majesty also uses her wedding ring to send signals to her staff", "url": "https://www.hulldailymail.co.uk/news/uk-world-news/queen-uses-handbag-send-secret-4078690", "urlToImage": null, "publishedAt": "2020-04-25T13:38:16Z", "content": "The Queen sends secret signals to her staff members, to let them know when she is ready to leave an event or, when she wishes to end a conversation with someone.\r\nShe uses the little tricks to communicate with her staff, and let them know when they may need t… [+1399 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Eddie Large funeral held in Bristol - BBC News", "description": "Syd Little pays tribute to his comedy partner and \"best friend\" Eddie Large at a ceremony in Bristol.", "url": "https://www.bbc.com/news/uk-england-somerset-52410413", "urlToImage": null, "publishedAt": "2020-04-25T13:23:44Z", "content": "Image copyrightPA MediaImage caption\r\n Syd Little and his wife Sheree were among just 10 family and close friends allowed to attend the service\r\nComedian Syd Little has bid farewell to his \"best friend\" and showbiz partner of 60 years, Eddie Large.\r\nLittle sa… [+1649 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Chris Slater", "title": "John Stapleton pays emotional tribute to wife Lynn Faulds Wood after death of ex-BBC presenter - Manchester Evening News", "description": "Former Watchdog presenter Lynn died on Friday aged 72 after suffering a 'massive stroke'", "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/john-stapleton-pays-emotional-tribute-18149970", "urlToImage": null, "publishedAt": "2020-04-25T12:53:57Z", "content": "Mancunian former TV star John Stapleton has thanked fans for their support following the death of his wife Lynn Faulds Wood.\r\nFormer Watchdog presenter Lynn died on Friday aged 72 after suffering a 'massive stroke'.\r\nIt has been reported she fell ill just mom… [+3057 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Brittany Vonow", "title": "Prince William and Kate Middleton mark Anzac Day with call to honour fallen soldiers ‘in spirit’ - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11478240/prince-william-kate-middleton-mark-anzac-day/", "urlToImage": null, "publishedAt": "2020-04-25T11:18:01Z", "content": "KATE Middleton and Prince William today paid tribute to fallen Australian and New Zealand troops on Anzac Day.\r\nThe Duke and Duchess of Cambridge honoured the day of remembrance - urging people to come together \"in spirit\" amid the coronavirus crisis.\r\n The D… [+2803 chars]"}, {"source": {"id": null, "name": "Entertainmentdaily.co.uk"}, "author": "Entertainment Daily", "title": "Coronation Street villain Geoff forces Yasmeen into sex in sickening scenes - Entertainment Daily", "description": "There's no low to which he won't stoop", "url": "https://www.entertainmentdaily.co.uk/soaps/coronation-street-villain-geoff-forces-yasmeen-into-sex-in-sickening-scenes/", "urlToImage": null, "publishedAt": "2020-04-25T09:43:52Z", "content": "Coronation Street fans are devastated and sickened by Geoff Metcalfe forcing wife Yasmeen to have sex.\r\nEvil Geoff coerced Yasmeen into satisfying his sick demands despite her being clearly unwell and unwilling.\r\nCoronation Street villain Geoff forced Yasmeen… [+2276 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Sue Haasler", "title": "Casualty spoilers: An old face returns as Fenisha’s world is turned upside down - Metro.co.uk", "description": "An emotionally charged instalment of the medical drama is on the horizon.", "url": "https://metro.co.uk/2020/04/25/casualty-spoilers-fenishas-world-turned-upside-shock-connie-old-face-back-12598304/", "urlToImage": null, "publishedAt": "2020-04-25T07:12:30Z", "content": "Short-lived bliss (Picture: BBC)\r\nCasualtys latest loved-up couple, Will (Jack Nolan) and Fenisha (Olivia DLima), look to be blissfully happy at the start of tonights episode. Theyre talking about holiday plans and Will even floats the idea of taking Fenisha … [+2102 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Martin Chilton", "title": "‘I don’t believe in God – I believe in Al Pacino’: How one of our greatest living actors kicked his boozy, brawling ways - The Independent", "description": "As the star of ‘Scarface’ and ‘The Godfather’ turns 80, Martin Chilton looks back at his drunken early years and his ascent to Oscar-winning glory", "url": "https://www.independent.co.uk/arts-entertainment/films/features/al-pacino-interview-godfather-serpico-scarface-alcohol-career-best-movies-a9481701.html", "urlToImage": null, "publishedAt": "2020-04-25T07:06:06Z", "content": "Al Pacino spent much of the Seventies in a drunken haze. The Oscar-winning star of the Godfather trilogy, Serpico, Scarface and Scent of a Woman has been teetotal for more than four decades now, and is about to soberly celebrate his 80th birthday. But he dran… [+28283 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Seamus Duff", "title": "Will and Grace ends on sour note as show makers admit cast backstage 'squabble' - Mirror Online", "description": "The rumours that show stars Debra Messing and Megan Mullaly had an epic behind-the-scenes fall out were all but confirmed by show creators David Kohan and Max Mutchnick", "url": "https://www.mirror.co.uk/tv/tv-news/grace-ends-sour-note-show-21924530", "urlToImage": null, "publishedAt": "2020-04-25T03:07:52Z", "content": "Long running comedy Will and Grace has come to a bitter end as two of the top cast had a fall out, show creators admitted.\r\n The hit US sitcom has run for 22-years and more than 240 episodes with eight seasons running between between 1998 and 2006 before the … [+2207 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Eurovision Again: Why fans of the song contest get together every Saturday - BBC News", "description": "Fans of the song contest are re-watching old competitions as \"a distraction from all the bad stuff\".", "url": "https://www.bbc.co.uk/news/newsbeat-52381023", "urlToImage": null, "publishedAt": "2020-04-24T23:41:36Z", "content": "Image copyrightGetty Images\r\nIn the absence of this year's Eurovision Song Contest, cancelled because of the coronavirus pandemic, fans are reliving old competitions every Saturday night.\r\nEurovision Again - watched in sync at 8pm British time on YouTube - co… [+3683 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Sarah Sotoodeh For Dailymail.com", "title": "Mission: Impossible films seven and eight release days delayed amid COVID-19 pandemic - Daily Mail", "description": "The next film in the Mission: Impossible franchise starring Tom Cruise, the seventh installment, was supposed to hit theaters July 23, 2021 with the eight film released on August 2022.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8255267/Mission-Impossible-films-seven-eight-release-days-delayed-amid-COVID-19-pandemic.html", "urlToImage": null, "publishedAt": "2020-04-24T22:32:29Z", "content": "The next film in the Mission: Impossible franchise starring Tom Cruise, the seventh installment, was supposed to hit theaters July 23, 2021 with the eight film released on August 5, 2022.\r\nBut, due to the COVID-19 global pandemic, Paramount has delayed the re… [+2337 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Niamh Cavanagh", "title": "Neighbours’ daily ‘Is This The Way To Amarillo?’ march gets green light after council rejects lockdown compl - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11475218/neighbours-daily-amarillo-march-green-council-lockdown/", "urlToImage": null, "publishedAt": "2020-04-24T20:44:53Z", "content": "A NEIGHBOURHOOD in Warwickshire has been given the green light for their daily \"Is This The Way To Amarillo?\" march after the council rejected one resident's lockdown complaint. \r\nThe residents of Tysoe village recreate Peter Kay's classic Amarillo video on t… [+3267 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nTelegraph Obituaries", "title": "Lynn Faulds Wood, fearless consumer champion who was the first co-presenter of Watchdog – obituary - Telegraph.co.uk", "description": "She became a familiar face on television exposing everything from faulty household products to fly-by-night conmen", "url": "https://www.telegraph.co.uk/obituaries/2020/04/24/lynn-faulds-wood-fearless-consumer-champion-first-co-presenter/", "urlToImage": null, "publishedAt": "2020-04-24T17:45:00Z", "content": "From 2003 to 2009, Lynne Faulds Wood returned to breakfast television, as Consumer Champion on GMTV. In 2006 she joined Esther Rantzen on the BBC consumer series Old Dogs, New Tricks, then in 2014 she and Sophie Raworth presented Watchdog Test House.\r\nShe was… [+848 chars]"}, {"source": {"id": null, "name": "Harpersbazaar.com"}, "author": "Amy Mackelden", "title": "Prince William Jokes About Tiger King During Big Night In on BBC - HarpersBAZAAR.com", "description": "The only game of thrones I want to see.", "url": "https://www.harpersbazaar.com/celebrity/latest/a32267031/prince-william-tiger-king-joke-big-night-in-video/", "urlToImage": null, "publishedAt": "2020-04-24T16:49:00Z", "content": "<ul><li>Prince William appeared on Comic Relief and BBC's Big Night In last night.</li><li>William made a joke about Tiger King when host Stephen Fry asked if he'd watched the popular Netflix show.</li><li>The Cambridges also participated in Clap for Carers t… [+1442 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Ricky Gervais Rips Into Celebrities Singing John Lennon's 'Imagine' - Loudwire", "description": "#RickyGervais speaks his mind about celebs singing #JohnLennon's #Imagine from quarantine. If you're new, Subscribe! → http://bit.ly/subscribe-loudwire Go he...", "url": "https://www.youtube.com/watch?v=K6GeLe3cY8E", "urlToImage": null, "publishedAt": "2020-04-24T16:46:18Z", "content": null}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Martina Bet", "title": "Royal outrage: How US President shocked the Queen Mother with kiss on the lips - Express", "description": "THE QUEEN MOTHER was left in shock when former US President Jimmy Carter greeted her with a kiss on the lips in 1977, unearthed reports reveal.", "url": "https://www.express.co.uk/news/royal/1273552/royal-news-queen-mother-us-president-jimmy-carter-kiss-spt", "urlToImage": null, "publishedAt": "2020-04-24T16:33:22Z", "content": null}, {"source": {"id": null, "name": "Officialcharts.com"}, "author": null, "title": "Live Lounge Allstars charity single enters Top 5 just hours after release - Official Charts Company", "description": "Some of the biggest names in music teamed up for the cover of the Foo Fighters hit.", "url": "https://www.officialcharts.com/chart-news/bbc-radio-1s-live-lounge-allstars-charity-single-times-like-these-enters-top-5-just-hours-after-its-release__29567/", "urlToImage": null, "publishedAt": "2020-04-24T16:23:42Z", "content": "BBC Radio 1's Stay Home Live Lounge charity single is off to an incredible start on the Official Single, landing in the Top 5 debut with just 12 hours' worth of sales.\r\nThe song by the Live Lounge Allstars - made up of 23 of the biggest names in music includi… [+935 chars]"}, {"source": {"id": null, "name": "Thetimes.co.uk"}, "author": "Kieran Andrews", "title": "Coronavirus in Scotland: Festival takes a pop at Sturgeon - The Times", "description": "Scotland’s Trnsmt music festival has been branded irresponsible after appearing to blame Nicola Sturgeon for its cancellation.The event at Glasgow Green was due to take place from July 10-12", "url": "https://www.thetimes.co.uk/article/coronavirus-in-scotland-irresponsible-trnsmt-music-festival-organisers-blame-nicola-sturgeon-for-cancellation-mzqttgks3", "urlToImage": null, "publishedAt": "2020-04-24T16:00:00Z", "content": "Scotlands Trnsmt music festival has been branded irresponsible after appearing to blame Nicola Sturgeon for its cancellation.\r\nThe event at Glasgow Green was due to take place from July 10-12, headlined by Lewis Capaldi and Liam Gallagher.\r\nOrganisers today a… [+475 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "James Whitbrook", "title": "Watch the Stars of Doctor Who Spend Time Together (Remotely) - Gizmodo", "description": "Last night in the UK, the BBC and charities Comic Relief and Children in Need hosted a special fundraising event called The Big Night In to raise money for UK healthcare workers currently on the front lines of the country’s response to the coronavirus pandemi…", "url": "https://io9.gizmodo.com/watch-the-stars-of-doctor-who-spend-time-together-remo-1843043506", "urlToImage": null, "publishedAt": "2020-04-24T15:15:00Z", "content": "Last night in the UK, the BBC and charities Comic Relief and Children in Need hosted a special fundraising event called The Big Night In to raise money for UK healthcare workers currently on the front lines of the countrys response to the coronavirus pandemic… [+1259 chars]"}, {"source": {"id": null, "name": "Indy100.com"}, "author": "Joanna Taylor", "title": "Tom Hanks wrote a letter to a boy named Corona who was being bullied and it's perfect - indy100", "description": "", "url": "https://www.indy100.com/article/tom-hanks-typewriter-young-fan-corona-australia-9482646", "urlToImage": null, "publishedAt": "2020-04-24T15:01:29Z", "content": "People are obsessed with \"hero\" Tom Hanks's heartwarming gesture to an eight-year-old boy being bullied because his name is Corona. \r\nCorona De Vries, who lives on Australia's Gold Coast, wrote to Tom Hanks and his wife Rita Wilson in early April to wish them… [+1923 chars]"}]}