{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Joe Davies For Mailonline", "title": "Robert Webb told his heart would 'fail' due to undiagnosed condition mirroring the plot of his book - Daily Mail", "description": "Robert Webb, 47, had heart surgery for a mitral valve prolapse in October last year after writing his debut novel Come Again. The comedian accelerated the unknown condition with alcohol 'addiction'.", "url": "https://www.dailymail.co.uk/news/article-8258545/Robert-Webb-told-heart-fail-undiagnosed-condition-mirroring-plot-book.html", "urlToImage": null, "publishedAt": "2020-04-26T18:41:00Z", "content": "Comedian Robert Webb was told his heart would 'fail' due to an undiagnosed heart condition, at the same time he had finished a book that closely mirrored his reality.\r\nThe Peep Show star, 47, had just finished editing his novel Come Again where a central char… [+3487 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Christine Rendon Heather Waugh For Dailymail.com", "title": "Kristin Cavallari announces she and Jay Cutler are to divorce after 10 years together - Daily Mail", "description": "The reality star made the shock announcement on Sunday, writing on Instagram that the couple have decided to get a divorce after 10 years and three children together.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8258853/Kristin-Cavallari-announces-Jay-Cutler-divorce-10-years-together.html", "urlToImage": null, "publishedAt": "2020-04-26T18:35:09Z", "content": "Kristin Cavallari has split from husband Jay Cutler.\r\nThe reality star, 33, made the shock announcement on Sunday, writing on Instagram that the couple have decided to get a divorce after 10 years and three children together. \r\nShe wrote: 'With great sadness,… [+4766 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Sam Elliott", "title": "BGT fans furious to discover Simon Cowell's Golden Buzzer act is West End star - Mirror Online", "description": "Fayth Ifil played a young Tina Turner in the London stage show - and viewers weren't thrilled producers failed to mention this as she wowed with the diva's smash hit Rolling on a River", "url": "https://www.mirror.co.uk/3am/celebrity-news/annoyed-bgt-fans-discover-simon-21928903", "urlToImage": null, "publishedAt": "2020-04-26T18:31:57Z", "content": "Ticked-off Britain's Got Talent viewers are asking questions after discovering Simon Cowell's golden buzzer act is already a West End star. \r\nCute 12-year-old Fayth Ifil is into the show's semi-finals after winning the judges' hearts with her incredible vocal… [+1985 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Brogan-Leigh Hurst", "title": "Dancing On Ice star Carlotta's parents 'didn't suspect' marriage split over Maura Higgins - Mirror Online", "description": "Dancing On Ice Carlotta Edwards' parents reportedly didn't suspect there were any problems with her marriage to Alex Demetriou when she visited at Christmas", "url": "https://www.mirror.co.uk/3am/celebrity-news/dancing-ice-star-carlottas-parents-21928193", "urlToImage": null, "publishedAt": "2020-04-26T18:31:44Z", "content": "Dancing On Ice star Carlotta Edwards' family were left \"shocked\" by her recent marriage split over Maura Higgins, it has been reported. \r\n The pro dancer, 30, and husband Alex Demetriou, 28, are said to have taken a break on their relationship after he was pa… [+1846 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Lucy Needham", "title": "Molly Mae Hague says she 'hates herself' for using chin strap after dissolving filler - Mirror Online", "description": "The Love Island beauty said she wound up looking like a 'blockhead' after getting facial fillers at 18-years-old", "url": "https://www.mirror.co.uk/3am/celebrity-news/molly-mae-hague-hates-herself-21928008", "urlToImage": null, "publishedAt": "2020-04-26T18:01:14Z", "content": "Molly Mae Hague has revealed she has started sleeping with a chin strap in attempt to sculpt her face.\r\nIt comes after the 20-year-old reality star admitted she underwent cosmetic surgery at the age of 18 by having dermal fillers inserted into her jawline but… [+2484 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Sean O'grady For Mailonline", "title": "Elizabeth Hurley's lookalike son Damian also bares strong resemblance to grandmother Angela - Daily Mail", "description": "The 18-year-old was all smiles as he posed alongside his grandmother, who is self-isolating with Damian and Elizabeth and other family members amid lockdown.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8258609/Elizabeth-Hurleys-lookalike-son-Damian-bares-strong-resemblance-grandmother-Angela.html", "urlToImage": null, "publishedAt": "2020-04-26T17:39:42Z", "content": "He has often been hailed as a lookalike for his famous mother Elizabeth Hurley.\r\nAnd Damian Hurley has shown just how strong the family genes are as he shared a photo alongside his grandmother Angela on her 80th birthday.\r\nThe 18-year-old was all smiles as he… [+2456 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Sean O'grady For Mailonline", "title": "Vicky Pattison admits she feared for her mother Caroll's life as she battled with coronavirus - Daily Mail", "description": "The former Geordie Shore star, 32, told how her mother Caroll became sick after she contracted the virus in February after travelling back from Hong Kong, Singapore and New York.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8258413/Vicky-Pattison-admits-feared-mother-Carolls-life-battled-coronavirus.html", "urlToImage": null, "publishedAt": "2020-04-26T17:24:29Z", "content": "Vicky Pattison has revealed she feared for her mother's life after she became gravely ill from coronavirus.\r\nThe former Geordie Shore star, 32, told how her mother Caroll became sick after she contracted the virus in February after travelling back from Hong K… [+4447 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "OMG! MAGIC man Sean Heydon WOWS with TIME TRAVELLING trick! | BGT: UNSEEN - Britain's Got Talent", "description": "Ever fancied going back in time? Magician Sean Heydon has just the trick... Taking card tricks to a whole new dimension (and time zone!), watch as he leaves ...", "url": "https://www.youtube.com/watch?v=qNJJrxaEDKA", "urlToImage": null, "publishedAt": "2020-04-26T17:00:17Z", "content": null}, {"source": {"id": null, "name": "Theguardian.comtv-and-radio"}, "author": "Anthony Hayward", "title": "Lynn Faulds Wood obituary - The Guardian", "description": "Presenter of BBC TV’s consumer rights show Watchdog who went on to become a campaigner for bowel cancer patients", "url": "https://amp.theguardian.comtv-and-radio/2020/apr/26/lynn-faulds-wood-obituary", "urlToImage": null, "publishedAt": "2020-04-26T16:57:59Z", "content": "Lynn Faulds Wood, who has died of a stroke aged 72, was a journalist whose warm personality and relentless campaigning made her popular on screen as a consumer champion over three decades in breakfast television and as a presenter of Watchdog.\r\nBy the time sh… [+5484 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Milly Vincent Claire Toureille For Mailonline", "title": "'HMS Bubble': Memo reveals how the Queen and Prince Philip are relying on 22 staff - Daily Mail", "description": "A memo from the Queen's master of household Tony Johnstone-Burt, 62, revealed that the Queen, 94, and the Duke of Edinburgh, 98 are isolating with 22 members of staff  at Windsor Castle.", "url": "https://www.dailymail.co.uk/femail/article-8258257/Queen-94-Duke-Edinburgh-98-isolating-22-members-staff.html", "urlToImage": null, "publishedAt": "2020-04-26T16:42:53Z", "content": "Twenty two royal staff have sacrificed their home lives to stay isolated at Windsor Castle and serve Queen Elizabeth and Prince Philip for the duration of the coronavirus lockdown. \r\nA memo issued to staff from the master of the household Tony Johnstone-Burt,… [+8062 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nJessica Carpani", "title": "Royal fears as Duke and Duchess of Sussex cooperate with journalists on new biography - Telegraph.co.uk", "description": "The book is provisionally titled 'Thoroughly Modern Royals: The Real World Of Harry And Meghan'", "url": "https://www.telegraph.co.uk/news/2020/04/26/royal-fears-duke-duchess-sussex-cooperate-journalists-new-biography/", "urlToImage": null, "publishedAt": "2020-04-26T16:30:00Z", "content": "The couple, who have since moved to California with their 11-month-old son Archie, were said to have given an interview for the book, jointly written by Omid Scobie and Carolyn Durand, according to The Mail on Sunday.\r\nBut sources close to the Sussexes stress… [+1779 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Jack Newman For Mailonline", "title": "Sam Smith admits they freaked out about being single in lockdown and wants to date an older man - Daily Mail", "description": "The singer's last serious relationship was with Brandon Flynn, 26, in 2018, and the star revealed they immediately turned to dating apps when the restrictions were imposed.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8258427/Sam-Smith-admits-freaked-single-lockdown-wants-date-older-man.html", "urlToImage": null, "publishedAt": "2020-04-26T16:23:35Z", "content": "Sam Smith has admitted they freaked out about being single when the coronavirus lockdown started in the UK.\r\nThe singer's last serious relationship was with Brandon Flynn, 26, in 2018, and the star revealed they immediately turned to dating apps when the rest… [+2790 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Alexis Petridis", "title": "Hamilton Bohannon: dynamic disco king who laid foundations of house - The Guardian", "description": "The drummer, who has died aged 78, pushed a relentless beat loved by dance floors and hip-hop samplers alike", "url": "https://www.theguardian.com/music/2020/apr/26/hamilton-bohannon-accidental-disco-king-who-laid-foundations-of-house", "urlToImage": null, "publishedAt": "2020-04-26T16:09:59Z", "content": "In 1973, Hamilton Bohannon, who died on Friday aged 78, released his debut album, Stop &amp; Go. It was a solid set of tough, largely instrumental funk tracks, the kind of album that was destined to get lost amid the glut of incredible soul music pouring out … [+5502 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Jon Boon", "title": "Mike Tyson’s three wives including one he caught having sex with Brad Pitt, one who is a doctor and ex-con K - The Sun", "description": "", "url": "http://www.thesun.co.uk/sport/11472016/mike-tyson-wife-brad-pitt/", "urlToImage": null, "publishedAt": "2020-04-26T15:27:17Z", "content": "BOXING legend Mike Tyson is the most settled he's ever been.\r\nAnd that could be because of the influence of his new wife, Lakiha Spicer.\r\n Mike Tyson has married three different women in his lifetimeCredit: New York Daily News - Getty\r\nTyson's first wife Robi… [+5436 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Sean O'grady For Mailonline", "title": "Adam Thomas admits he and brothers Ryan and Scott had 'emotional' confrontation with father - Daily Mail", "description": "The brothers are sons to singer Dougie James, and went to India for their new show Absolutely India: Mancs In Mumbai to reconnect with their family heritage,", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8258529/Adam-Thomas-admits-brothers-Ryan-Scott-emotional-confrontation-father.html", "urlToImage": null, "publishedAt": "2020-04-26T15:15:59Z", "content": "Adam, Ryan and Scott Thomas confronted their absent father in a new documentary that sees the brothers travel to Mumbai, India to explore their family roots.\r\nThe brothers are sons to singer Dougie James, and went to India for their new show Absolutely India:… [+2538 chars]"}, {"source": {"id": null, "name": "Standard.co.uk"}, "author": "Ellena Cruse", "title": "Laurence Fox was dumped by his mixed-race girlfriend after BBC Question time comments about race - Evening Standard", "description": "", "url": "https://www.standard.co.uk/showbiz/celebrity-news/laurence-fox-dumped-mixed-race-girlfriend-bbc-question-time-comments-a4424386.html", "urlToImage": null, "publishedAt": "2020-04-26T14:39:07Z", "content": "Laurence Fox was dumped by his mixed-race girlfriend after his rant about racism on BBC Question earlier this year.\r\nThe actor and musician waded into a debate about how Meghan Markle is portrayed in the media with his comments sparking a race row about white… [+1600 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Lucy Needham", "title": "Michael Buble returns to Instagram in son Noah's first appearance since beating cancer - Mirror Online", "description": "The singer returned to instagram with eldest child Noah for the youngster's first public appearance since he beat cancer", "url": "https://www.mirror.co.uk/3am/celebrity-news/michael-buble-returns-instagram-son-21928758", "urlToImage": null, "publishedAt": "2020-04-26T14:35:44Z", "content": "Michael Buble has shared an adorable Instagram video featuring six-year-old Noah, which is the first time the youngster has appeared on their Story since beating cancer.\r\nSinger Michael and his wife Luisana Lopilato took to social media on Friday night to sha… [+2764 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Jack Newman For Mailonline", "title": "Simon Cowell wears inflatable shellsuits on planes to avoid germs, reveals close friend Sinitta - Daily Mail", "description": "Friend and on/off lover Sinitta said she bought the blow-up contraptions for herself and the X Factor boss long before the coronavirus pandemic took hold.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8258203/Simon-Cowell-wears-inflatable-shellsuits-planes-avoid-germs-reveals-close-friend-Sinitta.html", "urlToImage": null, "publishedAt": "2020-04-26T14:30:08Z", "content": "Simon Cowell wears an inflatable suit on aeroplanes to protect himself from germs.\r\nFriend and former flame Sinitta said she bought the blow-up contraptions for herself and the X Factor boss long before the coronavirus pandemic took hold.\r\nThe singer, 56, tol… [+2004 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Jack Newman For Mailonline", "title": "Ricky Gervais reveals grieving widowers are sending him letters because of After Life - Daily Mail", "description": "The show, written by Gervais, portrays a suicidal local journalist struggling to cope with the loss of his wife Lisa.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8258133/Ricky-Gervais-reveals-grieving-widowers-sending-letters-Life.html", "urlToImage": null, "publishedAt": "2020-04-26T14:27:23Z", "content": "Ricky Gervais has revealed he receives many letters from grieving widowers  and is approached by touched fans on the street because of his series After Life.\r\nThe actor, 58, stars as Tony in the dark comedy whose second series has just been released on Netfli… [+4002 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Isabella Nikolic For Mailonline", "title": "EastEnders star Jessie Wallace works up a sweat on a jog - Daily Mail", "description": "Jessie Wallace, 48, was spotted stepping out in London on Sunday on a jog during coronavirus lockdown.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8258227/EastEnders-star-Jessie-Wallace-works-sweat-jog.html", "urlToImage": null, "publishedAt": "2020-04-26T14:21:20Z", "content": "She was reportedly suspended from BBC soap EastEnders earlier this year. \r\nYet Jessie Wallace looked in good spirits on Sunday as she headed out in London on a jog during coronavirus lockdown. \r\nThe soap star, 48, looked like she may have caught the sun as sh… [+2595 chars]"}, {"source": {"id": null, "name": "Whatculture.com"}, "author": "Gareth Morgan", "title": "Why WWE Is Ending House Shows - WhatCulture", "description": "It's been a long time coming.", "url": "https://whatculture.com/wwe/why-wwe-is-ending-house-shows-2", "urlToImage": null, "publishedAt": "2020-04-26T14:15:44Z", "content": "WWE.com\r\nDuring WWE's recent Q1 2020 earnings call, Vince McMahon yet again hinted that the company may be pulling the plug on house shows/live events.\r\nWWE house shows used to be a huge money earner for the company and the warmer crowds would usually refrain… [+932 chars]"}, {"source": {"id": null, "name": "Chroniclelive.co.uk"}, "author": "Jess Flaherty, Katie Collings", "title": "What all the Gogglebox families do when they're not filming hit show - Chronicle Live", "description": "County Durham born Scarlett Moffatt turned her stint on the show into a lucrative TV career", "url": "https://www.chroniclelive.co.uk/news/tv/what-gogglebox-families-theyre-not-18152114", "urlToImage": null, "publishedAt": "2020-04-26T14:05:33Z", "content": "Hit show Gogglebox has introduced viewers to a range of friends and families offering their opinions on the week's TV.\r\nThe show was inspired by hit British sitcom The Royle Family and hit our screens back in 2013.\r\n Some cast members, including County Durham… [+8027 chars]"}, {"source": {"id": null, "name": "Nme.com"}, "author": null, "title": "Watch Miley Cyrus cover Pink Floyd by her campfire for ‘Saturday Night Live’ - NME Live", "description": "Miley Cyrus has taken on Pink Floyd's 1975 classic 'Wish You Were Here' for a performance on 'Saturday Night Live''s latest 'At Home' episode.", "url": "https://www.nme.com/news/tv/watch-miley-cyrus-cover-pink-floyd-by-her-campfire-for-saturday-night-live-2653971", "urlToImage": null, "publishedAt": "2020-04-26T14:00:19Z", "content": "Miley Cyrus has taken on Pink Floyd‘s 1975 classic ‘Wish You Were Here’ for a performance on Saturday Night Live‘s latest ‘At Home’ episode.\r\nThe singer performed from beside a campfire bathed in dramatic red lighting and was introduced by Brad Pitt. You can … [+1238 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Katie Fitzpatrick", "title": "The world's oldest soap actor has died aged 108 - Manchester Evening News", "description": "Inspirational Jack Reynolds was a four-time record breaker", "url": "https://www.manchestereveningnews.co.uk/news/showbiz-news/worlds-oldest-soap-actor-died-18153128", "urlToImage": null, "publishedAt": "2020-04-26T13:56:29Z", "content": "Tributes have been paid to one of the world's oldest men who has died at the age of 108.\r\nJack Reyolds broke a Guinness World Record last year by becoming the oldest man ever to appear in a soap.\r\nAs part of an ongoing challenge with Good Morning Britain he m… [+1896 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Amalie Henden", "title": "Kate Middleton title: Is Kate Middleton a Princess? What is Kate’s full title? - Express", "description": "KATE MIDDLETON married Prince William, the second in line to the British throne, in a fairytale ceremony in 2011. But is she a Princess? What is Kate's full royal title?", "url": "https://www.express.co.uk/news/royal/1274059/Kate-Middleton-title-is-Kate-Middleton-a-Princess-Duchess-Queen-royal-family-title", "urlToImage": null, "publishedAt": "2020-04-26T13:56:02Z", "content": null}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Metro News Reporter", "title": "Captain Tom Moore birthday gifts - Metro.co.uk", "description": "He has received tens of thousands of cards, gifts and tokens for his 100th birthday", "url": "https://metro.co.uk/2020/04/26/captain-tom-blown-away-huge-haul-birthday-gifts-big-enough-fill-school-hall-12612025/", "urlToImage": null, "publishedAt": "2020-04-26T13:55:04Z", "content": "British World War II veteran Captain Tom Moore, 99, poses with his walking frame doing a lap of his garden in the village of Marston Moretaine (Picture: Getty)\r\nCaptain Tom Moore has been blown away by the outpouring of love for his sponsored walk.\r\nThe 99-ye… [+2375 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Zach Vasquez", "title": "Saturday Night Live: Brad Pitt plays Dr Anthony Fauci in standout virtual episode - The Guardian", "description": "In cold open, Fauci (Pitt) clears up Trump’s false claims about the coronavirus and Miley Cyrus performs a killer cover of Pink Floyd’s Wish You Were Here", "url": "https://www.theguardian.com/tv-and-radio/2020/apr/26/saturday-night-live-brad-pitt-dr-anthony-fauci-virtual-episode", "urlToImage": null, "publishedAt": "2020-04-26T13:45:51Z", "content": "For the second time this month, Saturday Night Live made a surprise return to deliver a new episode filmed remotely. This time, virtual hosting duties fell to Brad Pitt, playing lead member of the White House coronavirus task force, Dr Anthony Fauci. The rasp… [+6959 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Tim Ashley", "title": "The Metropolitan Opera's At-Home Gala review – thrilling singing, live from the stars' living-rooms - The Guardian", "description": "This technically remarkable event offered performances from more than 40 of the Met’s regular singers – as well as an irresistible peek into their homes", "url": "https://www.theguardian.com/music/2020/apr/26/the-metropolitan-opera-at-home-gala-review", "urlToImage": null, "publishedAt": "2020-04-26T13:42:54Z", "content": "In many ways, it was quite extraordinary. Streamed on its website, the Metropolitan Operas At-Home Gala, featured more than 40 of the houses regular singers, most of whom performed live via Skype live from their living rooms and studies, or indeed, in the cas… [+2629 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Jessica Gibb | Digital Assistant Showbiz Editor | Jessica.Gibb@the-sun.co.uk", "title": "‘Sulking’ Victoria Beckham stops boastful Instagram posts after backlash over furlough – despite £335m family - The Sun", "description": "", "url": "http://www.thesun.co.uk/tvandshowbiz/11483455/victoria-beckham-furlough-boasting-instagram-backlash/", "urlToImage": null, "publishedAt": "2020-04-26T13:30:50Z", "content": "VICTORIA Beckham has stopped posting boastful images from her charmed life on Instagram after she faced a public backlash over her decision to use the taxpayer funded furlough scheme to pay her staff.\r\nLast week The Sun Online exclusively revealed the former … [+6885 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Jack Newman For Mailonline", "title": "The Masked Singer RETURNS for a lockdown special with new celebrities and disguises - Daily Mail", "description": "Host Joel Dommett announced he has recorded a special lockdown edition of the talent show, with Jonathan Ross and Davina McCall returning as judges.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8258307/The-Masked-Singer-RETURNS-lockdown-special-new-celebrities-disguises.html", "urlToImage": null, "publishedAt": "2020-04-26T13:26:44Z", "content": "The Masked Singer is returning to TV for a lockdown special on Sunday night.\r\nThe cult singing show was a huge hit for ITV at the start of the year, featuring a number of celebrities performing in bizarre and elaborate costumes.\r\nHost Joel Dommett announced h… [+1632 chars]"}, {"source": {"id": null, "name": "Ringsidenews.com"}, "author": "H Jenkins", "title": "Clear Betting Favorite To Win Men's Money In The Bank Match - Ringside News", "description": "WWE is holding a very different kind of Money In The Bank pay-per-view this year. Since they can't have the event in Baltimore in front of screaming fans", "url": "https://www.ringsidenews.com/2020/04/26/clear-betting-favorite-to-win-mens-money-in-the-bank-match/", "urlToImage": null, "publishedAt": "2020-04-26T13:11:00Z", "content": "WWE is holding a very different kind of Money In The Bank pay-per-view this year. Since they can’t have the event in Baltimore in front of screaming fans like they wanted, the company is holding the big ladder matches on the roof of their Stamford headquarter… [+1089 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Chris Caulfield", "title": "Princess Charlotte celebrating 5th birthday with a Zoom party with the Queen - Metro.co.uk", "description": "They have put together a full plan that will give her all the fun of a birthday – including cake and games", "url": "https://metro.co.uk/2020/04/26/queen-prince-philip-attend-princess-charlottes-zoom-birthday-party-12611507/", "urlToImage": null, "publishedAt": "2020-04-26T12:27:26Z", "content": "The Queen will be dropping in on Zoom for Princess Charlottes 5th birthday party (Picture: PA/Getty)\r\nPrincess Charlottes fifth birthday will be celebrated with cake, games and a Zoom party with the Queen.\r\nThe Duke and Duchess of Cambridge are organising the… [+2083 chars]"}, {"source": {"id": null, "name": "Digitalspy.com"}, "author": "Susannah Alexander", "title": "Gavin and Stacey's Nessa returns to give lockdown advice - digitalspy.com", "description": "She has a very tidy tip to share with us.", "url": "https://www.digitalspy.com/tv/a32279196/gavin-stacey-nessa-lockdown-advice-ruth-jones/", "urlToImage": null, "publishedAt": "2020-04-26T12:20:00Z", "content": "Gavin &amp; Stacey fans have another reason to be happy today, as Nessa has issued some quality advice to us all during the coronavirus-caused lockdown.\r\nRuth Jones, who co-wrote the super-popular BBC comedy series and also played Stacey's straight-talking be… [+2903 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Michelle Marshall", "title": "Holly Willoughby: This Morning host's co-star 'in tears' in candid admission 'Hardest day' - Express", "description": "HOLLY WILLOUGHBY, who presents This Morning alongside Phillip Schofield, recently gushed over her colleague Rochelle Humes and her pregnancy news. The latter ITV star has since opened up about her struggles in a candid admission.", "url": "https://www.express.co.uk/celebrity-news/1274027/holly-willoughby-this-morning-rochelle-humes-baby-instagram-tears-news-latest-updates", "urlToImage": null, "publishedAt": "2020-04-26T12:17:57Z", "content": null}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Emily Hennings", "title": "Britain's Got Talent fans baffled as show thrown into chaos in Ant and Dec blunder - Express", "description": "BRITAIN'S GOT TALENT continued last night with Simon Cowell, David Walliams, Alesha Dixon, and Amanda Holden. But, one act on the ITV reality programme threw the show into chaos when he didn't know who the hosts were.", "url": "https://www.express.co.uk/showbiz/tv-radio/1274023/britains-got-talent-chaos-ant-dec-singer-Bhim-Niroula-blunder-mistake-itv-video", "urlToImage": null, "publishedAt": "2020-04-26T11:51:29Z", "content": null}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Per Olov Enquist: Swedish author dies at the age of 85 - BBC News", "description": "He penned more than 20 novels, plays and essays which won a number of awards at home and abroad.", "url": "https://www.bbc.co.uk/news/world-europe-52432215", "urlToImage": null, "publishedAt": "2020-04-26T11:03:13Z", "content": "Image copyrightGetty ImagesImage caption\r\n Per Olov Enquist at his home in Stockholm in 2011\r\nOne of Sweden's best-known authors, Per Olov Enquist, has died aged 85.\r\nHis career spanned more than half a century, and his work won acclaim not just in his native… [+911 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Chelsea Flower Show moves online for first time - BBC News", "description": "Virtual tours, gardening demonstrations and special shows will take place during week-along event.", "url": "https://www.bbc.co.uk/news/uk-england-london-52430933", "urlToImage": null, "publishedAt": "2020-04-26T10:52:37Z", "content": "Image copyrightPA MediaImage caption\r\n The famous event has been held at London's Royal Hospital Chelsea since 1913\r\nChelsea Flower Show will be held virtually for the first time after it was cancelled due to coronavirus.\r\nThe famous event has taken place at … [+2241 chars]"}, {"source": {"id": null, "name": "Nme.com"}, "author": null, "title": "Jeff Goldblum faces backlash for Islam comments on RuPaul’s Drag Race - NME Live", "description": "Jeff Goldblum has faced backlash from viewers of RuPaul's Drag Race after his comments on Islam's treatment of women and LGBTQ+ people", "url": "https://www.nme.com/news/tv/jeff-goldblum-faces-backlash-for-islam-comments-on-rupauls-drag-race-2653984", "urlToImage": null, "publishedAt": "2020-04-26T10:47:21Z", "content": "Jeff Goldblum has faced backlash from viewers of RuPaul‘s Drag Race after his comments on Islam.\r\nAppearing as a guest judge, he asked one contestant Jackie Cox, who is of Iranian ancestry, about Islam’s treatment of women and the LGBTQ+ community.\r\nIm here, … [+3954 chars]"}, {"source": {"id": null, "name": "Whatculture.com"}, "author": "Scott Banner", "title": "Brooklyn Nine-Nine: 10 Best Characters Only In One Episode - WhatCulture", "description": "Limited screen time doesn't stop these from becoming classic characters.", "url": "https://whatculture.com/tv/brooklyn-nine-nine-10-best-characters-only-in-one-episode", "urlToImage": null, "publishedAt": "2020-04-26T10:41:49Z", "content": "There have been countless great cop shows on TV, and many of them based in New York, but still Brooklyn Nine-Nine manages to stand out as something special. One of the biggest reasons for this is the characters. From Jake and Holt down to Hitchcock and Scully… [+866 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Sam Elliott", "title": "Notorious 90s Oasis-vs-Blur Britpop feud 'triggered by coke-fuelled love triangle' - Mirror Online", "description": "Liam Gallagher and Damon Albarn weren't just battling over becoming the biggest band in the country, the Oasis star's brother Noel has claimed, as he lifts the lid on the pair's 25-year-old war", "url": "https://www.mirror.co.uk/3am/celebrity-news/notorious-90s-oasis-vs-blur-21928109", "urlToImage": null, "publishedAt": "2020-04-26T08:53:30Z", "content": "The iconic Oasis-vs-Blur Britpop battle kicked off because of a vicious love triangle involving Liam Gallagher and Damon Albarn, rocker Noel claims. \r\nOasis and Blur had many well-documented fall outs and fights in the 90s as they went head-to-head to be Brit… [+2147 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Jack Newman For Mailonline", "title": "Idris Elba's DJ sitcom Turn Up Charlie is 'axed' by Netflix after just one series - Daily Mail", "description": "The sitcom, created by the actor, 47, depicted a has-been DJ trying to turn his fortunes around.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8258049/Idris-Elbas-DJ-sitcom-Turn-Charlie-axed-Netflix-just-one-series.html", "urlToImage": null, "publishedAt": "2020-04-26T08:47:34Z", "content": "Idris Elba's Netflix comedy Turn Up Charlie has been cancelled after just one series, according to reports.\r\nThe sitcom, created by the actor, 47, depicted a has-been DJ trying to turn his fortunes around.\r\nIt was a passion close to the Luther actor's heart a… [+2059 chars]"}, {"source": {"id": null, "name": "Nme.com"}, "author": null, "title": "Phoebe Waller-Bridge has the ‘Fleabag’ wall of penises in her house - NME Live", "description": "Phoebe Waller-Bridge, creator and star of the hit sitcom Fleabag has revealed that she keeps the show's 'wall of penises' in her house.", "url": "https://www.nme.com/news/tv/phoebe-waller-bridge-has-the-fleabag-wall-of-penises-in-her-house-2653954", "urlToImage": null, "publishedAt": "2020-04-26T08:41:29Z", "content": "Phoebe Waller-Bridge, creator and star of the hit sitcom Fleabag has revealed that she keeps the show’s ‘wall of penises’ in her house.\r\nAppearing on The Graham Norton Show from home, the writer and actor showed viewers how she keeps the prop by her front doo… [+1201 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Lucy Middleton", "title": "Exhausted mum 'named and shamed' for sleeping through Clap for Carers - Metro.co.uk", "description": "Neighbours told her that if she can't 'spend one minute' showing appreciation, then she 'doesn't deserve to use the NHS'.", "url": "https://metro.co.uk/2020/04/26/exhausted-mum-named-shamed-sleeping-clap-carers-12611114/", "urlToImage": null, "publishedAt": "2020-04-26T08:38:34Z", "content": "Clap for Carers takes place every Thursday (Picture: Rex Features)\r\nA tired mum who accidentally missed Thursdays Clap for Carers was left devastated after her neighbours named and shamed her online.\r\nThe woman said she had suffered a rough night with her you… [+2402 chars]"}, {"source": {"id": null, "name": "Ok.co.uk"}, "author": "Amy Denman", "title": "Joey Essex’s ex Lorena Medina reveals they split after he was snapped leaving Rita Ora's home - OK! magazine", "description": "Joey Essex’s Celebrity Ex On The Beach ex-girlfriend Lorena Medina says she “fell in love with him” but their romance was short-lived in the outside world.", "url": "https://www.ok.co.uk/celebrity-news/joey-essex-girlfriend-split-rita-21928062", "urlToImage": null, "publishedAt": "2020-04-26T08:36:16Z", "content": "Joey Essexs ex-girlfriend Lorena Medina has broken her silence on her split from him, after he spent a wild night out with Rita Ora.\r\nThe 28 year old, who met the former The Only Way Is Essex star on Celebrity Ex On The Beach, said she fell in love with Joey … [+2804 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Euan Ferguson", "title": "The week in TV: After Life; Gangs of London; Emergence; Have I Got News for You – and more - The Guardian", "description": "Ricky Gervais’s After Life struggles second time round, as 21st-century London’s answer to Peaky Blinders gets off to a flying, if violent, start", "url": "https://www.theguardian.com/tv-and-radio/2020/apr/26/the-week-in-tv-after-life-gangs-of-london-emergence-have-i-got-news-for-you-and-more", "urlToImage": null, "publishedAt": "2020-04-26T08:31:06Z", "content": "After Life (Netflix)Gangs of London (Sky Atlantic)Emergence (Fox)Twin (BBC Four) | iPlayerThe Graham Norton Show (BBC One) | iPlayerThe Mash Report (BBC Two) | iPlayerHave I Got News for You (BBC One) | iPlayer\r\nRicky Gervais is, take your pick, ever reinvent… [+6803 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Joshua Fox For Daily Mail Australia", "title": "First Dates Australia star star suffers huge wardrobe malfunction and flashes match - Daily Mail", "description": "First Dates Australia endured one of its most awkward moments last week.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8257827/First-Dates-Australia-star-star-suffers-huge-wardrobe-malfunction-flashes-match.html", "urlToImage": null, "publishedAt": "2020-04-26T08:24:17Z", "content": "First Dates Australia endured one of its most awkward moments last week.\r\nAs the show returned to Channel Seven, Brittany McQuade, 23, suffered a wardrobe malfunction and accidentally flashed her date, teacher James Alexander, 27. \r\n'Oh my god, I can see her … [+2749 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Katie Fitzpatrick", "title": "Teetotal Christine McGuinness says she's been thinking about alcohol in lockdown after 12 years sober - Manchester Evening News", "description": "The mum-of-three hasn't had a drink in more than 12 years", "url": "https://www.manchestereveningnews.co.uk/news/showbiz-news/teetotal-christine-mcguinness-says-shes-18150469", "urlToImage": null, "publishedAt": "2020-04-26T08:20:10Z", "content": "Reality star mum Christine McGuinness has revealed that she's been thinking about alcohol in lockdown after going more than 12 years without a drink.\r\nThe mother-of-three opened up to her followers on Instagram, saying she'd been casting her mind back her fav… [+2375 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By David Lawrance For Dailymail.com", "title": "Adam Sandler MAKES OUT with wife Jackie during hilarious Saturday Night Live At Home cameo - Daily Mail", "description": "In his portion of the video, Adam initially pretended to avoid any sort of intimacy with his wife Jackie, although later in the song the married couple could be seen ferociously making out on their couch.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8258019/Adam-Sandler-MAKES-wife-Jackie-hilarious-Saturday-Night-Live-Home-cameo.html", "urlToImage": null, "publishedAt": "2020-04-26T08:04:11Z", "content": "He memorably returned in 2019 to host the show that made him famous. \r\nAnd this week, Adam Sandler was back on Saturday Night Live, this time to make a cameo in a Pete Davidson sketch in which the main cast member performed an original song about quarantine.\r… [+2381 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Nosheen Iqbal", "title": "Pranks, skits and dancing… welcome to the TikTok house - The Guardian", "description": "Six of generation Z’s star performers are living under the the same roof to create content for their 15 million followers", "url": "https://www.theguardian.com/technology/2020/apr/26/tiktok-house-stars-move-in-together", "urlToImage": null, "publishedAt": "2020-04-26T07:17:00Z", "content": "Imagine a cross between Love Island and Big Brother and you would be part way to understanding the hype behind Britains first TikTok house.\r\nLaunched online last week, Bytehouse has bundled six of the nations biggest TikTok stars to live together in a house i… [+3096 chars]"}, {"source": {"id": null, "name": "Digitalspy.com"}, "author": "Ian Sandwell", "title": "Extraction director explains ambiguous ending to Netflix movie - digitalspy.com", "description": "\"Different people view the film in different ways.\"", "url": "https://www.digitalspy.com/movies/a32266319/extraction-ending-sam-hargrave-netflix/", "urlToImage": null, "publishedAt": "2020-04-26T07:00:00Z", "content": "Extraction spoilers follow.\r\nExtraction, starring Chris Hemsworth, arrived on Netflix on Friday (April 24) and left viewers with a major question over its ending.\r\nThe movie sees Hemsworth play mercenary Tyler Rake who undertakes a dangerous mission to rescue… [+1995 chars]"}, {"source": {"id": null, "name": "Refinery29.com"}, "author": "Gwendolyn Smith", "title": "Normal People Is The Horniest Show On TV – But Not In A Traditional Way - Refinery29", "description": "Normal People is incredibly sexual but in the most refreshing way possible. Here's why that matters.", "url": "https://www.refinery29.com/en-gb/normal-people-sally-rooney-review-tv", "urlToImage": null, "publishedAt": "2020-04-26T06:00:00Z", "content": "A scene where Marianne hungrily watches Connell playing football asserts that he's as much an object of desire as she is."}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Nicole Chenoweth", "title": "Arnold Schwarzenegger goes on a bike ride with son David Baena as daughter Katherine and Chris Pratt reveal - The Sun", "description": "", "url": "http://www.thesun.co.uk/tvandshowbiz/11482856/arnold-schwarzenegger-bike-ride-david-baena-katherine-pregnancy/", "urlToImage": null, "publishedAt": "2020-04-26T05:59:04Z", "content": "ARNOLD Schwarzenegger covered up with a face mask during a bike ride with his son David Baena on Friday in Santa Monica, California.\r\nThe 22-year-old opted to go on the outing with no protective gear as his dad, 72, wore a mask that read well be back - a refe… [+3597 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "BBC News", "title": "Coronavirus: Naomi Campbell and African artists entertain fans online - BBC News", "description": "Big-name celebrities and artists have been going online to entertain their fans during the pandemic.", "url": "https://www.bbc.co.uk/news/av/world-africa-52417537/coronavirus-naomi-campbell-and-african-artists-entertain-fans-online", "urlToImage": null, "publishedAt": "2020-04-26T05:44:51Z", "content": null}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Clemmie Moodie", "title": "Katie Price says she was sexually assaulted during carjacking in South Africa while her kids were with her - The Sun", "description": "", "url": "http://www.thesun.co.uk/tvandshowbiz/11480467/katie-price-sexual-assault-south-africa/", "urlToImage": null, "publishedAt": "2020-04-26T02:30:55Z", "content": "KATIE PRICE has revealed she was indecently assaulted during a terrifying armed carjacking in South Africa.\r\nThe model spoke about the 2018 robbery on Channel 4s Celebrity SAS: Who Dares Wins last week.\r\n Katie Price has revealed she was sexually assaulted wh… [+2011 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Connie Rusk For Mailonline", "title": "Daisy Lowe 'SPLITS from musician boyfriend Jack Peñate' - Daily Mail", "description": "The model, 32, is said to have made the decision to end their relationship because she 'didn't see future' with the singer, 35.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8257485/Daisy-Lowe-SPLITS-musician-boyfriend-Jack-Pe-ate.html", "urlToImage": null, "publishedAt": "2020-04-26T00:20:43Z", "content": "Daisy Lowe has reportedly split from her boyfriend Jack Peñate.\r\nThe model, 32, is said to have made the decision to end their six-month relationship because she 'didn't see future' with the singer, 35.  \r\nA source told The Sun: 'It was Daisy's choice to end … [+2308 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nNick Allen", "title": "Kanye West is a billionaire, says Forbes, after row over rapper's wealth - Telegraph.co.uk", "description": "West disputes the 1.3 billion valuation and says he is worth much more", "url": "https://www.telegraph.co.uk/news/2020/04/26/kanye-west-billionaire-says-forbes-row-rappers-wealth/", "urlToImage": null, "publishedAt": "2020-04-26T00:19:00Z", "content": "Kanye West, the mercurial rapper and fashion mogul, has officially gained the status of \"billionaire\" following a long and acrimonious dispute over his wealth with Forbes magazine.\r\nThe feud began after the august financial publication featured West, 42, on i… [+695 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Hana Carter", "title": "Sky News presenter chokes up on air reading obituaries of coronavirus victims as toll passes 20,000 - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11481668/sky-news-presenter-chokes-up/", "urlToImage": null, "publishedAt": "2020-04-26T00:18:08Z", "content": "A NEWSREADER broke down with emotion as she read out the names of people who had died from Covid-19 during a live broadcast.\r\nSky News presenter Kimberley Leonard choked up as she shared a handful of personal stories today in a heartbreaking news segment on t… [+2772 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Mary Gallagher", "title": "Coronation Street legend Bill Roache celebrates his 88th birthday in lockdown with his family - The Sun", "description": "", "url": "http://www.thesun.co.uk/tvandshowbiz/11481574/coronation-street-bill-roache-88-birthday/", "urlToImage": null, "publishedAt": "2020-04-25T22:21:07Z", "content": "CORONATION Street legend Bill Roache celebrated his 88th birthday in lockdown today with his family.\r\nThe soap paid tribute to the actor with photos showing Bill, who has played Ken Barlow since 1960, surrounded by balloons and presents in his huge conservato… [+2708 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Lily Waddell", "title": "Mike Tyson admits Tiger King's Joe Exotic could have sold him big cats as pets - Mirror Online", "description": "Mike Tyson confessed he could have got his tigers indirectly from Tiger King star Joe Exotic in the early 1990s", "url": "https://www.mirror.co.uk/3am/celebrity-news/mike-tyson-admits-tiger-kings-21927371", "urlToImage": null, "publishedAt": "2020-04-25T21:24:19Z", "content": "Mike Tyson admitted he could have got his big cats from Tiger King star Joe Exotic.\r\nThe boxing champion, 53, splashed out his cash on three Bengal tigers as house pets at his home.\r\nTyson confessed he could have got his tigers from now-jailed zoo operator Jo… [+1832 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Ellie Kirwin-Jones", "title": "Harold Reid dead: Statler Brothers singer dies at the age of 80 after kidney failure - Express", "description": "HAROLD REID, who was best known for being the founder and singer of the Statler Brothers, has died at the age of 80 after his 'long battle' with kidney failure.", "url": "https://www.express.co.uk/celebrity-news/1273886/Harold-Reid-dead-statler-brothers-singer-kidney-failure-news-latest-update", "urlToImage": null, "publishedAt": "2020-04-25T21:05:13Z", "content": null}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Sophie McCoid, Zoe Forsey", "title": "Queen's secret signals for when she wants to leave conversations - Liverpool Echo", "description": "Her Majesty has a few tricks to communicate with staff", "url": "https://www.liverpoolecho.co.uk/news/uk-world-news/queens-secret-signals-wants-leave-18151647", "urlToImage": null, "publishedAt": "2020-04-25T19:33:47Z", "content": "The Queen has spoken to millions of people during her lifetime and has come up with ways to communicate with her staff during events, it has been claimed.\r\nHer Majesty is used to small talk, but when she's finished talking to someone and would like to leave s… [+2198 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Isla Williams", "title": "Timothée Chalamet and Lily-Rose Depp 'split' after a year of dating - Metro.co.uk", "description": "Say it isn't so.", "url": "https://metro.co.uk/2020/04/25/timothee-chalamet-lily-rose-depp-split-year-dating-12610064/", "urlToImage": null, "publishedAt": "2020-04-25T17:43:22Z", "content": "The two are said to have split after more than a year of dating (Picture: FilmMagic/Backgrid)\r\nTimothee Chalamet and Lily-Rose Depp have reportedly split after more than a year of dating.\r\nThe couple have recently called it quits on their romance, according t… [+2247 chars]"}, {"source": {"id": null, "name": "Digitalspy.com"}, "author": "Dan Seddon", "title": "Spider-Man star is hosting Marvel-themed Instagram quiz - digitalspy.com", "description": "Get involved via Instagram next week.", "url": "https://www.digitalspy.com/movies/a32276017/spider-man-tom-holland-marvel-virtual-quiz/", "urlToImage": null, "publishedAt": "2020-04-25T16:49:00Z", "content": "Spider-Manactor Tom Holland will be hosting a Marvel-themed quiz on Instagram during the coronavirus lockdown.\r\nIn conjunction with The Brothers Trust, which was set up by Holland's family to support various charities, this virtual quiz will take place next W… [+1432 chars]"}, {"source": {"id": null, "name": "Nme.com"}, "author": null, "title": "Watch The Killers debut new song ‘Blowback’ and cover Tom Petty’s ‘The Waiting’ - NME Live", "description": "The Killers have debuted another new song from their forthcoming album ‘Imploding The Mirage’ - click here to listen to 'Blowback'.", "url": "https://www.nme.com/news/music/watch-the-killers-debut-new-song-blowback-and-cover-tom-pettys-the-waiting-2653845", "urlToImage": null, "publishedAt": "2020-04-25T16:13:05Z", "content": "The Killers have debuted another new song from their forthcoming album Imploding The Mirage.\r\nThe band’s frontman Brandon Flowers and Ronnie Vannucci Jr. appeared on CBS This Morning today (April 25) for the shows recurring Saturday Sessions segment. While on… [+1292 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Chris Slater", "title": "John Stapleton pays emotional tribute to wife Lynn Faulds Wood after death of ex-BBC presenter - Manchester Evening News", "description": "Former Watchdog presenter Lynn died on Friday aged 72 after suffering a 'massive stroke'", "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/john-stapleton-pays-emotional-tribute-18149970", "urlToImage": null, "publishedAt": "2020-04-25T12:53:57Z", "content": "Mancunian former TV star John Stapleton has thanked fans for their support following the death of his wife Lynn Faulds Wood.\r\nFormer Watchdog presenter Lynn died on Friday aged 72 after suffering a 'massive stroke'.\r\nIt has been reported she fell ill just mom… [+3057 chars]"}, {"source": {"id": null, "name": "Entertainmentdaily.co.uk"}, "author": "Entertainment Daily", "title": "Coronation Street villain Geoff forces Yasmeen into sex in sickening scenes - Entertainment Daily", "description": "There's no low to which he won't stoop", "url": "https://www.entertainmentdaily.co.uk/soaps/coronation-street-villain-geoff-forces-yasmeen-into-sex-in-sickening-scenes/", "urlToImage": null, "publishedAt": "2020-04-25T09:43:52Z", "content": "Coronation Street fans are devastated and sickened by Geoff Metcalfe forcing wife Yasmeen to have sex.\r\nEvil Geoff coerced Yasmeen into satisfying his sick demands despite her being clearly unwell and unwilling.\r\nCoronation Street villain Geoff forced Yasmeen… [+2276 chars]"}, {"source": {"id": null, "name": "Faroutmagazine.co.uk"}, "author": "Far Out Staff", "title": "The Rolling Stones frontman Mick Jagger responds to Paul McCartney: ‘The Beatles doesn’t exist’ - Far Out Magazine", "description": "A beef is brewing", "url": "https://faroutmagazine.co.uk/rolling-stones-mick-jagger-paul-mccartney-beatles-doesnt-exist/", "urlToImage": null, "publishedAt": "2020-04-25T08:52:00Z", "content": "The Rolling Stones frontman, Mick Jagger, has responded to Paul McCartney’s claims that The Beatles were a better band in a new interview with Zane Lowe.\r\nThe back and forth between music icons has arisen from the moment former Beatles bassist McCartney jovia… [+1226 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Sara-Aisha Kent", "title": "Watchdog's Lynn Faulds Wood bravely beat cancer twice before tragic death from stroke - Mirror Online", "description": "Former Watchdog host Lynn Faulds Wood, who died today at the age of 72 from a \"massive\" stroke, beat both skin and bowel cancer before her death", "url": "https://www.mirror.co.uk/3am/celebrity-news/watchdogs-lynn-faulds-wood-bravely-21923092", "urlToImage": null, "publishedAt": "2020-04-25T00:18:38Z", "content": "Lynn Faulds Wood sadly died at the age of 72 from a stroke today. \r\nThe former Watchdog presenter battled cancer twice before she died and used her experience to help others who were diagnosed with the disease.\r\nShe bravely got through a diagnosis of skin can… [+2892 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Eurovision Again: Why fans of the song contest get together every Saturday - BBC News", "description": "Fans of the song contest are re-watching old competitions as \"a distraction from all the bad stuff\".", "url": "https://www.bbc.co.uk/news/newsbeat-52381023", "urlToImage": null, "publishedAt": "2020-04-24T23:41:36Z", "content": "Image copyrightGetty Images\r\nIn the absence of this year's Eurovision Song Contest, cancelled because of the coronavirus pandemic, fans are reliving old competitions every Saturday night.\r\nEurovision Again - watched in sync at 8pm British time on YouTube - co… [+3683 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Sarah Sotoodeh For Dailymail.com", "title": "Mission: Impossible films seven and eight release days delayed amid COVID-19 pandemic - Daily Mail", "description": "The next film in the Mission: Impossible franchise starring Tom Cruise, the seventh installment, was supposed to hit theaters July 23, 2021 with the eight film released on August 2022.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8255267/Mission-Impossible-films-seven-eight-release-days-delayed-amid-COVID-19-pandemic.html", "urlToImage": null, "publishedAt": "2020-04-24T22:32:29Z", "content": "The next film in the Mission: Impossible franchise starring Tom Cruise, the seventh installment, was supposed to hit theaters July 23, 2021 with the eight film released on August 5, 2022.\r\nBut, due to the COVID-19 global pandemic, Paramount has delayed the re… [+2337 chars]"}]}