{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Theguardian.com"}, "author": "Sian Cain", "title": "Sexy beats: How Normal People’s ‘intimacy coordinator’ works - The Guardian", "description": "Ita O’Brien, who worked on the BBC version of Sally Rooney’s novel, explains her often vexed role and how she helped with a story that depends on its sex scenes", "url": "https://www.theguardian.com/books/2020/apr/25/normal-people-intimacy-coordinator-works-sally-rooney-sex-scenes", "urlToImage": null, "publishedAt": "2020-04-25T06:00:53Z", "content": "Its easy to forget just how much sex there is in Sally Rooneys Normal People, when many of its greatest romantic beats are carried in a furtive glance or something left unsaid. But when putting the novels most intimate scenes between Marianne and Connell on s… [+4562 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Seamus Duff", "title": "Inside billionaire Kylie Jenner's new $36 million seven bedroom home - Mirror Online", "description": "The price tag of $36 million will be but a drop in the ocean for billionaire Kylie Jenner – however it is believed she managed to haggle down the asking price from $55 million", "url": "https://www.mirror.co.uk/3am/celebrity-news/inside-billionaire-kylie-jenners-new-21924615", "urlToImage": null, "publishedAt": "2020-04-25T05:55:43Z", "content": "Kylie Jenner has spent a fortune snapping up a new mansion at the cost of $36 million which is small change to the self made billionaire.\r\nThe 22-year-old Keeping Up With The Kardashians star is said to have plashed the equivalent of £30 million on a new pad … [+3120 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Sara-Aisha Kent", "title": "Dimitri Diatchenko dead - Chernobyl Diaries star dies at age of 52 - Mirror Online", "description": "Actor Dimitri Diatechenko, who also appeared in Indiana Jones and How I Met Your Mother, died earlier this week at the age of 52, his family have told", "url": "https://www.mirror.co.uk/3am/celebrity-news/dimitri-diatchenko-dead-chernobyl-diaries-21923436", "urlToImage": null, "publishedAt": "2020-04-25T05:55:19Z", "content": "Dimitri Diatchenko has died at the age of 52.\r\n The Chernobyl Diaries star, who played Uri, was found dead in his Daytona Beach home in Florida on Wednesday, TMZ reports.\r\nIt is thought that he died on Monday or Tuesday and his cause of death is pending the m… [+2257 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Christopher Bucktin", "title": "Trophy hunter who shot giraffe taunts Ricky Gervais saying she's 'proud' of sick new vid - Mirror Online", "description": "Tess Talley, 38, has shared a video of her killing a giraffe in South Africa following a backlash led by Ricky Gervais and other animal lovers for posing next to the dead animal in a picture", "url": "https://www.mirror.co.uk/news/uk-news/trophy-hunter-who-shot-giraffe-21923288", "urlToImage": null, "publishedAt": "2020-04-25T05:51:01Z", "content": "An American big game hunter has enraged animal lovers by ­posting a video online of her slaughtering a giraffe.\r\nTess Talley, 38, killed the majestic creature in South Africa three years ago and claims she has only shared the video now because other hunters h… [+7166 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Manon Dark", "title": "Meghan Markle could face father in court as family tensions boil over - Express", "description": "MEGHAN MARKLE could face her father, Thomas Markle, in court over a dispute fuelled by an article published in the Mail on Sunday.", "url": "https://www.express.co.uk/news/royal/1273682/Meghan-Markle-royal-news-court-mail-on-sunday-sue-father-Thomas-Markle", "urlToImage": null, "publishedAt": "2020-04-25T04:53:13Z", "content": null}, {"source": {"id": null, "name": "Sky.com"}, "author": "Tom Gillespie", "title": "Kanye West: Hip hop star and fashion designer becomes a billionaire - Sky News", "description": "The rapper, who has long coveted the status, has claimed he is worth more after his net worth was valued at $1.3bn (£1.05bn).", "url": "https://news.sky.com/story/kanye-west-hip-hop-star-and-fashion-designer-becomes-a-billionaire-11978510", "urlToImage": null, "publishedAt": "2020-04-25T03:39:04Z", "content": null}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Tamara Davison", "title": "Paddy McGuinness rocks short shorts as he enjoys the sunshine in lockdown - Mirror Online", "description": "The television presenter enjoyed some father and son time with little Leo in the garden while his wife and two daughters were off elsewhere", "url": "https://www.mirror.co.uk/3am/celebrity-news/paddy-mcguinness-rocks-short-shorts-21923747", "urlToImage": null, "publishedAt": "2020-04-25T03:30:05Z", "content": "Paddy McGuinness donned his tight denim shorts as he lapped up the sunshine from his garden in lockdown. \r\nIt appears that his next lockdown challenge - after bleaching his hair an impressive bright blond - was to top up his tan.\r\nLess than a day after presen… [+2109 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Coronation Street's Geoff rapes helpless Yasmeen in sick 'love doctor' twist - Mirror Online", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiVGh0dHBzOi8vd3d3Lm1pcnJvci5jby51ay90di90di1uZXdzL2Nvcm9uYXRpb24tc3RyZWV0cy1nZW9mZi1yYXBlcy1oZWxwbGVzcy0yMTkyMzI5MdIBWGh0dHBzOi8vd3d3Lm1pcnJvci5jby51ay90di90di1uZXdzL2Nvcm9uYXRpb24tc3RyZWV0cy1nZW9mZi1yYXBlcy1oZWxwbGVzcy0yMTkyMzI5MS5hbXA?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T03:29:05Z", "content": null}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Kyle O'Sullivan", "title": "Gogglebox slammed for denying 'breaking' lockdown rules despite 'clear breaches' - Mirror Online", "description": "Gogglebox viewers have blasted Channel 4's 'patronising' message of reassurance as Izzi and Ellie Warner and the Siddiqui brothers move houses amid the coronavirus pandemic", "url": "https://www.mirror.co.uk/tv/tv-news/gogglebox-slammed-denying-breaking-lockdown-21923892", "urlToImage": null, "publishedAt": "2020-04-25T03:00:19Z", "content": "Gogglebox has been slammed for denying they are 'breaking' lockdown rules.\r\nOutraged viewers have blasted Channel 4 for their message of reassurance before tonight's programme aired.\r\nThe announcer said: \"Dont worry. Everyone on Gogglebox is following social … [+3936 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Lewis Knight", "title": "Prince William has unexpected issue with watching Tiger King on Netflix - Mirror Online", "description": "Prince William, Duke of Cambridge, took part in The Big Night In last night and told Stephen Fry just why he won't be watching Netflix docuseries Tiger King", "url": "https://www.mirror.co.uk/tv/tv-news/prince-william-unexpected-issue-watching-21921161", "urlToImage": null, "publishedAt": "2020-04-25T03:00:14Z", "content": "Prince William has delivered a hilarious reason for not watching hit Netflix series Tiger King.\r\n The Duke of Cambridge, 37, appeared on the BBC charity event The Big Night In which aimed to raise fund for front line workers. \r\nIn all, the effort amassed a wh… [+2312 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Frank Skinner: Will Gompertz reviews the comedian's poetry podcast on Absolute Radio ★★★★☆ - BBC News", "description": "It's a simple idea presented by someone who brings insight to an art form that is enjoying a resurgence.", "url": "https://www.bbc.co.uk/news/entertainment-arts-52403782", "urlToImage": null, "publishedAt": "2020-04-25T02:48:36Z", "content": "Odd combinations have long been a staple of the entertainment industry. For those old enough to have seen it (still available on YouTube), who can forget Prince Edward's cringe-inducing toe-dip into television production with the culture-clash that was It's A… [+9008 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Helen Davidson", "title": "Coronavirus live news: Brazil’s health system on verge of collapse, medics warn - The Guardian", "description": "Leader of US group peddling bleach as ‘miracle’ cure wrote to Trump before remarks; Australia and New Zealand mark Anzac Day from driveways", "url": "https://www.theguardian.com/world/live/2020/apr/25/coronavirus-live-news-brazils-health-system-on-verge-of-collapse-medics-warn", "urlToImage": null, "publishedAt": "2020-04-25T02:17:45Z", "content": null}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Sophie Tanno For Mailonline", "title": "Captain Tom Moore, 99, 'is added to honours shortlist as nominations flood in' - Daily Mail", "description": "Captain Tom could now receive a CBE after his fundraising efforts for the National Health Service amid the coronavirus pandemic captured the hearts of the nation.", "url": "https://www.dailymail.co.uk/news/article-8255323/Captain-Tom-Moore-99-added-honours-shortlist-nominations-flood-in.html", "urlToImage": null, "publishedAt": "2020-04-25T01:44:34Z", "content": "Captain Tom Moore has reportedly been added to the honours shortlist after nominations for him flooded for him. \r\nThe war veteran from Bedfordshire raised £28 million for the NHS by walking laps of his garden.   \r\nCaptain Tom could now receive a CBE after his… [+5330 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Sameer Suri For Dailymail.com", "title": "Spider-Man and Doctor Strange sequels postponed as Thor: Love & Thunder leaps back a week - Daily Mail", "description": "As movie releases continue to shift around amid the coronavirus pandemic, a slate of new changes have been announced for the Spider-Man, Doctor Strange and Thor franchises.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8255537/Spider-Man-Doctor-Strange-sequels-postponed-Thor-Love-Thunder-leaps-week.html", "urlToImage": null, "publishedAt": "2020-04-25T01:26:24Z", "content": "As movie releases continue to shift around amid the coronavirus pandemic, a slate of new changes have been announced.\r\nThe next Spider-Man movie starring Tom Holland was slated to come out on July 16, 2021 but has been bumped a few months to November 5, Deadl… [+2143 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Sam Baker For Mailonline", "title": "Princess Eugenie and husband Jack Brooksbank celebrate their 10th anniversary with Instagram snap - Daily Mail", "description": "Princess Eugenie took to Instagram to celebrate her anniversary with husband Jack Brookshank by posting a loved-up picture. In the post the tenth-in-line said her and her husband were lucky to be together.", "url": "https://www.dailymail.co.uk/news/article-8255567/Princess-Eugenie-husband-Jack-Brooksbank-celebrate-10th-anniversary-Instagram-snap.html", "urlToImage": null, "publishedAt": "2020-04-25T00:51:50Z", "content": "Princess Eugenie took to Instagram to celebrate her anniversary with husband Jack Brookshank by posting a loved-up picture.\r\nThe 30-year-old married her husband on October 12 2018 but the couple met when Princess Eugenie was skiing in Verbier, Switzerland, an… [+4055 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Seamus Duff", "title": "Madonna snogs boyfriend Ahlamalik Williams and gushes about love as he turns 26 - Mirror Online", "description": "The Queen of Pop said there is no one she would rather be in isolation with amid coronavirus quarantine measures than her much younger boyfriend as they celebrated his birthday together", "url": "https://www.mirror.co.uk/3am/celebrity-news/madonna-snogs-boyfriend-ahlamalik-williams-21924408", "urlToImage": null, "publishedAt": "2020-04-25T00:20:13Z", "content": "Madonna might be nearing retirement age but she proved she is as young at heart as a schoolgirl in love as she paid a gushing tribute to her toyboy lover on his birthday.\r\nThe 61-year-old undisputed queen of pop is head over heels for her 26-year-old lover Ah… [+1820 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Danielle Cinone", "title": "Tiger King Joe Exotic ‘brutally gunned down HUNDREDS of caged tigers for greed,’ zoo manager says - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11477233/tiger-king-joe-exotic-killed-caged-tigers/", "urlToImage": null, "publishedAt": "2020-04-25T00:19:50Z", "content": "TIGER King Joe Exotic brutally gunned down hundreds of caged tigers to satisfy his own greed, an ex employee has claimed.\r\nZoo workers are accusing Joe Exotic - the star of the controversial Netflix show Tiger King: Murder, Mayhem and Madness - of being a hea… [+3039 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By James Wood For Mailonline", "title": "Syd Little is among mourners at Eddie Large's funeral after star died from coronavirus - Daily Mail", "description": "Around 50 well-wishers turned out to show their support for the comedian as his body was taken to a crematorium in Portishead, Somerset this afternoon.", "url": "https://www.dailymail.co.uk/news/article-8253737/Syd-Little-mourners-Eddie-Larges-funeral-star-died-coronavirus.html", "urlToImage": null, "publishedAt": "2020-04-25T00:02:51Z", "content": "Syd Little said a sad goodbye to his comedy partner Eddie Large today after the other comic legend passed away in hospital from coronavirus while being treated for heart failure. \r\nSyd was consoled by his wife Sheree as he touched the hearse carrying his old … [+14010 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "The celebrities striking the right note by spreading comfort and joy - BBC News", "description": "Not all stars have come off well, but some are providing positivity, humour and a human touch.", "url": "https://www.bbc.com/news/entertainment-arts-52379807", "urlToImage": null, "publishedAt": "2020-04-24T23:44:28Z", "content": "Image copyrightYOUTUBE/INSTAGRAMImage caption\r\n Left-right: John Krasinski, Sophie Ellis-Bextor and Miley Cyrus\r\nWith tours, TV shows and film shoots shut down, the coronavirus pandemic has left celebrities with little to do but go on social media and show us… [+6151 chars]"}, {"source": {"id": null, "name": "Ladbible.com"}, "author": "Jake Massey", "title": "Chris Hemsworth's New Netflix Action Thriller Extraction Is Being Called A 'Must Watch' - LADbible", "description": "The film dropped on Netflix today and is receiving positive reviews from viewers", "url": "https://www.ladbible.com/entertainment/tv-and-film-new-netflix-action-thriller-extraction-is-being-called-a-must-watch-20200424", "urlToImage": null, "publishedAt": "2020-04-24T23:26:04Z", "content": "A new action thriller starring Chris Hemsworth has just dropped on Netflix, and judging by the reaction on social media, it should make for some quality weekend viewing. \r\nExtraction follows mercenary Tyler Rake (Hemsworth) on his mission to rescue the kidnap… [+2520 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Olivia Wheeler For Mailonline", "title": "Inside Robbie Williams and Ayda Field's lavish £26m LA mansion with 22 bathrooms - Daily Mail", "description": "The Let Me Entertain You hitmaker, 46, took to Instagram on Friday to strip down to his boxers as he showed off his toned inked torso in a cheeky snap. He penned: 'Informal Friday x.'", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8253327/Inside-Robbie-Williams-Ayda-Fields-lavish-26m-LA-mansion-22-bathrooms.html", "urlToImage": null, "publishedAt": "2020-04-24T23:10:02Z", "content": "They have an impressive property portfolio with the couple dividing their time between their £17.5million west London home, sprawling £26m Beverly Hills mansion and £15.9million Malibu abode. \r\nAnd Robbie Williams and Ayda Field have been self-isolating at th… [+8054 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Sara-Aisha Kent", "title": "Watchdog's Lynn Faulds Wood bravely beat cancer twice before tragic death from stroke - Mirror Online", "description": "Former Watchdog host Lynn Faulds Wood, who died today at the age of 72 from a \"massive\" stroke, beat both skin and bowel cancer before her death", "url": "https://www.mirror.co.uk/3am/celebrity-news/watchdogs-lynn-faulds-wood-bravely-21923092", "urlToImage": null, "publishedAt": "2020-04-24T22:44:05Z", "content": "Lynn Faulds Wood sadly died at the age of 72 from a stroke today. \r\nThe former Watchdog presenter battled cancer twice before she died and used her experience to help others who were diagnosed with the disease.\r\nShe bravely got through a diagnosis of skin can… [+2892 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By George Stark For Dailymail.com", "title": "Will & Grace stars Debra Messing and Megan Mullally's rumored feud gets addressed - Daily Mail", "description": "Will & Grace creators David Kohan and Max Mutchnick have added fuel to the rumours the co-stars Debra Messing and Meghan Mullally have harbored a secret feud with each other.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8255239/Will-Grace-stars-Debra-Messing-Megan-Mullallys-rumored-feud-gets-addressed.html", "urlToImage": null, "publishedAt": "2020-04-24T22:32:15Z", "content": "Will &amp; Grace creators David Kohan and Max Mutchnick have added fuel to the rumours the co-stars Debra Messing, 51, and Megan Mullally, 61, have harbored a secret feud with each other.\r\nKohan and Mutchnick were asked about the alleged clash in a recent Q&a… [+2240 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Aliss Higham", "title": "Queen Elizabeth II net worth: How much is the Queen worth? - Express", "description": "QUEEN ELIZABETH II has served Britain and the Commonwealth for almost 70 years. How much is Queen Elizabeth II worth?", "url": "https://www.express.co.uk/life-style/life/1273657/Queen-Elizabeth-II-news-how-much-is-the-Queen-worth-royal-family", "urlToImage": null, "publishedAt": "2020-04-24T22:06:52Z", "content": null}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Tamara Davison", "title": "Liam Payne volunteers at food bank in 'humbling' experience during coronavirus crisis - Mirror Online", "description": "The One Direction heartthrob helped out at a local food bank organised food donations in Euston on Thursday", "url": "https://www.mirror.co.uk/3am/celebrity-news/liam-payne-volunteers-food-bank-21922447", "urlToImage": null, "publishedAt": "2020-04-24T21:36:34Z", "content": "Liam Payne has decided to volunteer at a local food bank to support struggling families during the coronavirus crisis.\r\nThe One Direction heartthrob, 26, said his experience was 'humbling' and that he had committed long-term to helping the organisation out.\r\n… [+2471 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Jamie Downham", "title": "Gogglebox star Amy Tapper calls for bigger airline and theme park seats for plus-sized people - The Sun", "description": "", "url": "http://www.thesun.co.uk/tvandshowbiz/11473851/gogglebox-amy-tapper-airline-theme-park-seats/", "urlToImage": null, "publishedAt": "2020-04-24T21:00:20Z", "content": "GOGGLEBOX'S Amy Tapper has said theme parks and aeroplanes should have bigger seats for plus-sized customers, saying: \"People shouldn't be embarrassed.\"\r\nThe 20-year-old Channel 4 star spoke about how she was shut out of a Harry Potter ride with her dad Jonat… [+2831 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Andy Rudd, Vicki Newman", "title": "Kate Garraway opens up about 'hardest' time of her life as Derek remains critical - Mirror Online", "description": "The Good Morning Britain presenter sent out a heartfelt thanks to her fans who have offered her support and the NHS staff risking their lives to care for her husband", "url": "https://www.mirror.co.uk/3am/celebrity-news/kate-garraway-opens-up-hardest-21923220", "urlToImage": null, "publishedAt": "2020-04-24T20:33:32Z", "content": "Kate Garraway has opened up about going through the \"hardest\" time of her life as her husband Derek Draper remains in a deeply critical condition. \r\n The Good Morning Britain presenter's husband is in hospital battling coronavirus. \r\nKate, 52, has told fans t… [+1783 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Vicki Newman", "title": "Holly Willoughby unveils weekend plans to get smashed on Phillip Schofield's wine - Mirror Online", "description": "The This Morning star posed up with two boxes of best pal Phil's new supermarket wine - and it looks like she's got big plans for the weekend", "url": "https://www.mirror.co.uk/3am/celebrity-news/holly-willoughby-unveils-weekend-plans-21922714", "urlToImage": null, "publishedAt": "2020-04-24T20:33:21Z", "content": "Holly Willoughby looks set for a pretty epic weekend thanks to her best pal Phillip Schofield. \r\n The This Morning presenter, 39, took to Instagram to unveil her plans as she posed up with two boxes of Phil's new supermarket wine. \r\nHolly expressed her sadnes… [+2105 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Kathryn Ingate", "title": "Piers Morgan: GMB host issues apology to Ofcom after hitting back at 2,000 complaints - Express", "description": "PIERS MORGAN has issued an apology to Ofcom on Twitter after hitting back at complaints that were sent to the broadcasting regulator following his interviews with MPs on Good Morning Britain.", "url": "https://www.express.co.uk/celebrity-news/1273604/Piers-Morgan-Twitter-apology-ofcom-complaints-Good-Morning-Britain-news-latest", "urlToImage": null, "publishedAt": "2020-04-24T19:15:13Z", "content": null}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Eve Wagstaff", "title": "Inside Vicar of Dibley star Dawn French’s jaw-dropping £3m Cornwall castle with 30 rooms and sea views - The Sun", "description": "", "url": "http://www.thesun.co.uk/tvandshowbiz/11473354/inside-dawn-frenchs-jaw-dropping-3m-cornwall-castle/", "urlToImage": null, "publishedAt": "2020-04-24T18:14:19Z", "content": "DAWN French lives in a jaw-dropping £3m Cornwall called Point Neptune that has 30 rooms and incredible sea views.\r\nThe Vicar of Dibley star lives in the coastal mansion with her daughter Billie and second husband, Mark Bignell.\r\n Dawn's home is on the coast o… [+3733 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Phoebe Waller-Bridge's hilariously X-RATED wall art revealed! | The Graham Norton Show - BBC - BBC", "description": "Subscribe and 🔔 to OFFICIAL BBC YouTube 👉 https://bit.ly/2IXqEIn Stream original BBC programmes FIRST on BBC iPlayer 👉 https://bbc.in/2J18jYJ Graham Norton i...", "url": "https://www.youtube.com/watch?v=hSwK3Kxghj0", "urlToImage": null, "publishedAt": "2020-04-24T17:00:32Z", "content": "Subscribe and to OFFICIAL BBC YouTube https://bit.ly/2IXqEInStream original BBC programmes FIRST on BBC iPlayer https://bbc.in/2J18jYJ\r\nGraham Norton is horrified by some of Phoebe Waller-Bridge's rather unusual art.\r\nGraham is joined in his virtual studio by… [+729 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Martina Bet", "title": "Royal outrage: How US President shocked the Queen Mother with kiss on the lips - Express", "description": "THE QUEEN MOTHER was left in shock when former US President Jimmy Carter greeted her with a kiss on the lips in 1977, unearthed reports reveal.", "url": "https://www.express.co.uk/news/royal/1273552/royal-news-queen-mother-us-president-jimmy-carter-kiss-spt", "urlToImage": null, "publishedAt": "2020-04-24T16:33:22Z", "content": null}, {"source": {"id": null, "name": "Givemesport.com"}, "author": "Matthew Lee", "title": "Travis Scott performs live to over 12m people in record-breaking Fortnite concert - GIVEMESPORT", "description": "Travis Scott performs live to over 12m people in record-breaking Fortnite concert", "url": "https://www.givemesport.com/1564673-travis-scott-performs-live-to-over-12m-people-in-recordbreaking-fortnite-concert", "urlToImage": null, "publishedAt": "2020-04-24T16:18:29Z", "content": "Popular musician Travis Scott has found a new way to keep his followers entertained - performing live to over 12 million people on the video game Fortnite.\r\nThe music industry is one of a number of sectors suffering as a result of the coronavirus pandemic.\r\nL… [+1570 chars]"}, {"source": {"id": null, "name": "Entertainmentdaily.co.uk"}, "author": "Richard Bell", "title": "The Big Night In: Peter Kay's comeback appearance leaves fans emotional as he proves he's still 'one of us' - Entertainment Daily", "description": "Fans called him \"honest\" and \"down to Earth\"", "url": "https://www.entertainmentdaily.co.uk/tv/peter-kays-comeback-appearance-leaves-fans-emotional-as-he-proves-hes-still-one-of-us/", "urlToImage": null, "publishedAt": "2020-04-24T16:03:10Z", "content": "Fans of Peter Kay were delighted to see him back on their screens last night for the BBC's huge coronavirus charity show The Big Night In.\r\nThe Boltonian funnyman, 46, sat in the sun enjoying a Solero as he addressed viewers and called on them to support the … [+2895 chars]"}, {"source": {"id": null, "name": "Digitalspy.com"}, "author": "Laura Jane Turner", "title": "After Life season 2 ending explained - it had to end that way, according to Ricky Gervais - digitalspy.com", "description": "And what it could mean for season 3...", "url": "https://www.digitalspy.com/tv/a32235764/after-life-season-2-ending-explained-netflix/", "urlToImage": null, "publishedAt": "2020-04-24T16:00:00Z", "content": "After Life season two spoilers follow, including its ending. \r\nWell, there you have it. By now, if you're reading this article, you have come to the end of After Life's second season – and if you haven't quite finished, you should probably do so before readin… [+4565 chars]"}, {"source": {"id": null, "name": "Digitalspy.com"}, "author": "Ian Sandwell", "title": "Avengers Endgame originally mocked Captain America plot hole - digitalspy.com", "description": "War Machine has a valid point.", "url": "https://www.digitalspy.com/movies/a32266649/avengers-endgame-deleted-scene-captain-america-plot-hole/", "urlToImage": null, "publishedAt": "2020-04-24T16:00:00Z", "content": "Avengers: Endgame is packed with callbacks to the entire Marvel Cinematic Universe due to its timey-wimey plot.\r\nAnd it turns out that it might have taken the meta references even further by mocking a much-talked about plot hole fromCaptain America: The First… [+2993 chars]"}, {"source": {"id": null, "name": "Standard.co.uk"}, "author": "Imogen Braddick", "title": "Camilla: I've really been missing my grandchildren during the coronavirus lockdown - Evening Standard", "description": "", "url": "https://www.standard.co.uk/news/uk/duchess-of-cornwall-camilla-grandchildren-lockdown-a4423571.html", "urlToImage": null, "publishedAt": "2020-04-24T15:55:18Z", "content": "The Duchess of Cornwall says she is missing seeing and hugging her grandchildren during the coronavirus lockdown.\r\nCamilla made the comments during a call to an elderly user of the Silver Line, a 24-hour helpline for older people feeling lonely or in need of … [+13303 chars]"}, {"source": {"id": null, "name": "Indy100.com"}, "author": "Joanna Taylor", "title": "Tom Hanks wrote a letter to a boy named Corona who was being bullied and it's perfect - indy100", "description": "", "url": "https://www.indy100.com/article/tom-hanks-typewriter-young-fan-corona-australia-9482646", "urlToImage": null, "publishedAt": "2020-04-24T15:01:29Z", "content": "People are obsessed with \"hero\" Tom Hanks's heartwarming gesture to an eight-year-old boy being bullied because his name is Corona. \r\nCorona De Vries, who lives on Australia's Gold Coast, wrote to Tom Hanks and his wife Rita Wilson in early April to wish them… [+1923 chars]"}, {"source": {"id": null, "name": "Thenational.scot"}, "author": "Emer O'Toole", "title": "TRNSMT forced to issue clarification after blaming Nicola Sturgeon for cancellation - The National", "description": "ORGANISERS of Scottish music festival TRNSMT have been forced to issue a clarification after their original statement about cancelling the event…", "url": "https://www.thenational.scot/news/18403899.trnsmt-issues-clarification-blaming-nicola-sturgeon-cancellation/", "urlToImage": null, "publishedAt": "2020-04-24T14:05:40Z", "content": "ORGANISERS of Scottish music festival TRNSMT have been forced to issue a clarification after their original statement about cancelling the event appeared to blame Nicola Sturgeon. \r\nBosses said in a statement this morning that \"due to the comments made by the… [+2577 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Annie Lord", "title": "Ricky Gervais calls Gal Gadot’s ‘Imagine’ video an ‘awful rendition’ - The Independent", "description": "‘They might have been doing it for good reasons, to help these normal nobodies’", "url": "https://www.independent.co.uk/arts-entertainment/tv/news/ricky-gervais-gal-gadot-imagine-john-lennon-awful-viral-video-coronavirus-a9482296.html", "urlToImage": null, "publishedAt": "2020-04-24T13:54:36Z", "content": "Ricky Gervais has criticised the viral video that saw Gal Gadot lead a host of celebrities to perform a cover of John Lennons Imagine.\r\nIn a video posted to Instagram, the Wonder Woman actor began singing Lennons iconic track, before the likes of Will Ferrell… [+1012 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "George Griffiths", "title": "Buffy The Vampire Slayer was secretly produced by Dolly Parton - Metro.co.uk", "description": "If the apocalypse comes, beep Dolly.", "url": "https://metro.co.uk/2020/04/24/buffy-vampire-slayer-fans-discover-dolly-parton-secretly-produced-show-obsessed-12604889/", "urlToImage": null, "publishedAt": "2020-04-24T13:13:38Z", "content": "Buffy, Buffy, BuffyIm begging of you please dont take my man (Picture: Getty/Warner)\r\nBuffy The Vampire Slayer fans have discovered that Dolly Parton was actually a secret producer of the show throughout its iconic run. \r\nThe cult drama ran for seven seasons … [+3111 chars]"}, {"source": {"id": null, "name": "Bristolpost.co.uk"}, "author": "Conor Gogarty", "title": "Statement issued on whether Bristol Banksy piece's new face mask will be removed - Bristol Post", "description": "The site is a specially protected \"character building\"", "url": "https://www.bristolpost.co.uk/news/bristol-news/banksy-harbourside-face-mask-coronavirus-4072489", "urlToImage": null, "publishedAt": "2020-04-24T13:06:59Z", "content": "The new face mask on Banksy's famous Girl with a Pierced Eardrum graffiti seems set to stay.\r\nThe Bristolian guerilla artist's parody of Johannes Vermeer's Girl with a Pearl Earring painting first appeared on the side of an Albion Docks building at Bristol Ha… [+1776 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "FIRST LOOK: Billy and Chantelle WOW with a heavenly performance | BGT 2020 - Britain's Got Talent", "description": "See more from Britain's Got Talent at http://itv.com/talent Watch Britain's Got Talent: Unseen on the ITV HUB: https://bit.ly/2RreDOp Billy and Chantelle bri...", "url": "https://www.youtube.com/watch?v=XQ-29IGkpGo", "urlToImage": null, "publishedAt": "2020-04-24T13:01:13Z", "content": null}, {"source": {"id": null, "name": "Vogue.com"}, "author": "Liam Hess", "title": "‘RuPaul’s Drag Race’’s Gigi Goode Is More Than This Season’s Fashion Queen - Vogue", "description": "The frontrunner for “RuPaul’s Drag Race” 12th season is the fashion queen Gigi Goode.", "url": "https://www.vogue.com/article/gigi-goode-rupauls-drag-race-fashion-queen", "urlToImage": null, "publishedAt": "2020-04-24T12:45:42Z", "content": "Despite these frustrations, Goode remains cautiously upbeat. Obviously Ive had a dream come true that was kind of taken away, in the sense that I should be on an airplane, traveling the world and performing on as many stages as possible and meeting fans, and … [+3785 chars]"}, {"source": {"id": null, "name": "Entertainmentdaily.co.uk"}, "author": "Rebecca Carter", "title": "Viewers angry with ITV as it issues statement about Gordon, Gino and Fred: Road Trip - Entertainment Daily", "description": "They want more episodes next time", "url": "https://www.entertainmentdaily.co.uk/tv/viewers-angry-with-itv-as-it-issues-statement-about-gordon-gino-and-fred-road-trip/", "urlToImage": null, "publishedAt": "2020-04-24T11:11:18Z", "content": "Viewers are gutted Gordon Ramsay, Gino D'Acampo and Fred Sirieix's latest ITV Road Trip series has come to an end.\r\nThe fourth and final episode of their American Road Trip aired last night (April 24) as they travelled around Texas.\r\nEven though the series ha… [+2573 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Amanda Devlin", "title": "Matt Lucas drops biggest hint yet that he’s bringing back Little Britain with David Walliams after Big Night I - The Sun", "description": "", "url": "http://www.thesun.co.uk/tvandshowbiz/11470449/matt-lucas-hint-little-britain-return/", "urlToImage": null, "publishedAt": "2020-04-24T11:00:40Z", "content": "MATT Lucas has dropped the biggest hint yet that he's bringing back Little Britain with David Walliams after their Big Night In performance.\r\nThe legendary comedy duo returned to TV for the first time in more than decade last night to raise funds to provide s… [+1461 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Sean Keane", "title": "Star Wars: The Clone Wars episode 10 recap -- Ahsoka takes on Maul in The Phantom Apprentice - CNET", "description": "The former Sith Lord's plan is revealed as Siege of Mandalore gets personal.", "url": "https://www.cnet.com/news/star-wars-the-clone-wars-episode-10-recap-ahsoka-takes-on-maul-in-the-phantom-apprentice/", "urlToImage": null, "publishedAt": "2020-04-24T10:40:24Z", "content": "Aw yeah -- Maul mirrors his iconic post from The Phantom Menace as he wields signature style of lightsaber in this episode.\r\nLucasfilm\r\nOh wow. The third-to-last episode of Star Wars: The Clone Wars' final season arrived on Disney Plus on Friday, following on… [+6392 chars]"}, {"source": {"id": null, "name": "Indy100.com"}, "author": "Greg Evans", "title": "Prince Charles and Camilla clapping for carers might be the most awkward thing you'll see today - indy100", "description": "", "url": "https://www.indy100.com/article/prince-charles-camilla-clap-for-our-carers-coronavirus-nhs-9481651", "urlToImage": null, "publishedAt": "2020-04-24T10:25:45Z", "content": "Clapping for health care workers every Thursday evening has now become as fine a British tradition as the Sunday roast or forgetting to put the bins out. \r\nThe initiative which started around the start of lockdown aims to show appreciation to the NHS and care… [+1817 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: 'We're giving our tour buses to the NHS' - BBC News", "description": "Buses which are usually home to rock stars are now giving frontline workers a place to rest.", "url": "https://www.bbc.com/news/newsbeat-52410888", "urlToImage": null, "publishedAt": "2020-04-24T10:18:06Z", "content": "Image copyrightVans For BandsImage caption\r\n Buses have been deployed all over the UK including this one at The Whittington NHS Trust in London\r\nMusic fans won't need reminding there are no live gigs happening at the moment.\r\nAs well as empty venues and festi… [+4092 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Joanne Kavanagh", "title": "Who sings the Times Like These cover from Live Lounge? All the artists on the Foo Fighters song - The Sun", "description": "", "url": "http://www.thesun.co.uk/tvandshowbiz/11469609/times-like-these-cover-live-lounge/", "urlToImage": null, "publishedAt": "2020-04-24T10:02:18Z", "content": "DUA Lipa and Dave Grohl led the stars singing It's Times Like These for BBC's The Big Night In.\r\nWe take a look at who else was involved in this charity cover of the Foo Fighters classic.\r\n Dua Lipa and Dave Grohl led the stars singing It's Times Like These f… [+2301 chars]"}, {"source": {"id": null, "name": "Theguardian.commusic"}, "author": "Ben Beaumont-Thomas", "title": "Taylor Swift disowns new live album, calling it 'shameless greed' - The Guardian", "description": "Singer complains of ‘tasteless’ release amid coronavirus crisis by former label Big Machine, owned by frequent adversary Scooter Braun", "url": "https://amp.theguardian.commusic/2020/apr/24/taylor-swift-disowns-new-live-album-scooter-braun-big-machine", "urlToImage": null, "publishedAt": "2020-04-24T09:49:00Z", "content": "Taylor Swift has disowned a new live album released under her name, calling it tasteless and shameless greed amid the coronavirus outbreak.\r\nThe album, Live from Clear Channel Stripped 2008, was recorded when Swift was 18, around the release of her Grammy-win… [+1225 chars]"}, {"source": {"id": null, "name": "Nme.com"}, "author": null, "title": "‘Breaking Bad’ creator Vince Gilligan “embarrassed” over not wanting Lalo in ‘Better Call Saul’ - NME Live", "description": "Breaking Bad creator Vince Gilligan has said that he did not want Lalo to appear in Better Call Saul at first - but he is glad to have been proven wrong now.", "url": "https://www.nme.com/news/tv/breaking-bad-better-call-saul-vince-gilligan-lalo-2652496", "urlToImage": null, "publishedAt": "2020-04-24T09:18:57Z", "content": "Breaking Bad creator Vince Gilligan has said that he did not want Lalo to appear in Better Call Saul at first – but he is glad to have been proven wrong now.\r\nThe new beloved villain Lalo Salamanca (Tony Dalton), a character who was mentioned by Saul in a qui… [+1249 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nCaroline Leaper,", "title": "The Duchess of Cambridge in 'NHS blue' shows she understands the mood of the nation - Telegraph.co.uk", "description": "The Duchess of Cambridge sends exactly the right, subtle message", "url": "https://www.telegraph.co.uk/fashion/royals/duchess-cambridge-nhs-blue-shows-understands-mood-nation/", "urlToImage": null, "publishedAt": "2020-04-24T08:17:00Z", "content": "Everything the Duchess has worn has also, notably, been from the high street. She will have likely been advised that this is not the time to be seen in expensive designer labels, and instead she is using the opportunity to bolster mostly-British brands, which… [+1038 chars]"}, {"source": {"id": null, "name": "Gazettelive.co.uk"}, "author": "Naomi Corrigan", "title": "The Killers announce new Riverside Stadium date after confirming postponement - Gazette Live", "description": "The Hot Fuss hitmakers said all UK and Ireland gigs will not go ahead this year due to to Covid-19.", "url": "https://www.gazettelive.co.uk/whats-on/killers-confirm-postponement-riverside-stadium-18142318", "urlToImage": null, "publishedAt": "2020-04-24T08:02:08Z", "content": "The Killers have confirmed their sell-out Riverside Stadium concert will be postponed until 2021.\r\nIn a Tweet, the US rockers said they are not cancelling, and the show will instead go ahead on Thursday, June 10, 2021.\r\n The scheduled Middlesbrough show on Ju… [+2010 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Katie Palmer", "title": "Big Night In fundraising: How much was raised? Can you still donate? - Express", "description": "BIG NIGHT IN raised millions of pounds to support vulnerable people during the coronavirus outbreak and fans were left gobsmacked at the final total. How much was raised? Can you still donate?", "url": "https://www.express.co.uk/showbiz/tv-radio/1273283/big-night-in-fundraising-how-much-raised-can-you-donate-bbc", "urlToImage": null, "publishedAt": "2020-04-24T07:49:07Z", "content": null}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "George Griffiths", "title": "Parks and Recreation cast returning for coronavirus one-off special - Metro.co.uk", "description": "Hint: she's got a ring binder for everything.", "url": "https://metro.co.uk/2020/04/24/parks-recreation-cast-reuniting-special-one-off-episode-show-us-lesley-knope-deals-coronavirus-12602798/", "urlToImage": null, "publishedAt": "2020-04-24T06:51:19Z", "content": "Lesley Knope is back to save us all from coronavirus (Picture: NBC)\r\nThe cast of Parks and Recreation will be reuniting for a special one-off episode of the beloved sitcom. \r\nLuckily, this will show us how everyones favourite politician, Lesley Knope (Amy Poe… [+2249 chars]"}, {"source": {"id": null, "name": "Manchestereveningnews.co.uk"}, "author": "Alexandra Rucki", "title": "Beyonce donates $6m to coronavirus relief effort in US cities - Manchester Evening News", "description": "Money will be going to frontline workers and people affected by the pandemic", "url": "https://www.manchestereveningnews.co.uk/news/world-news/beyonce-coronavirus-donations-usa-twitter-18142005", "urlToImage": null, "publishedAt": "2020-04-24T06:44:43Z", "content": "Beyonce has joined forced with Twitter CEO Jack Dorsey to donate six million dollars (£4.9 million) to the coronavirus relief effort.\r\nThe pop singer's BeyGood foundation announced the donation on Thursday, with the money going to frontline workers and people… [+1223 chars]"}, {"source": {"id": null, "name": "Nme.com"}, "author": null, "title": "Val Kilmer reveals he didn’t want to be in ‘Top Gun’ but begged to be in reboot - NME Live", "description": "Val Kilmer has revealed that he didn't initially want to appear in the first Top Gun movie but begged to be in the upcoming reboot.", "url": "https://www.nme.com/news/film/val-kilmer-reveals-he-didnt-want-to-be-in-top-gun-but-begged-to-appear-in-reboot-2652726", "urlToImage": null, "publishedAt": "2020-04-24T04:14:19Z", "content": "Val Kilmer has revealed that he didn’t initially want to appear in the first Top Gun movie but begged to be in the upcoming reboot.\r\nThe actor played Tom “Iceman” Kazansky in the 1986 movie alongside Tom Cruise, but in his new memoir, I’m Your Huckleberry, he… [+1534 chars]"}, {"source": {"id": null, "name": "Digitalspy.com"}, "author": "Megan Davies", "title": "Line of Duty's Stephen Graham opens up about Peaky Blinders delay - digitalspy.com", "description": "Production on the new series has been \"put on hold indefinitely\".", "url": "https://www.digitalspy.com/tv/a32257469/line-of-duty-stephen-graham-peaky-blinders-delayed/", "urlToImage": null, "publishedAt": "2020-04-23T22:30:00Z", "content": "Line of Dutystar Stephen Graham has opened up about the production delay on Peaky Blinders season 6.\r\nPeaky Blinders creator Steven Knight confirmed last year that Graham would play a role in a future season of the show, and it looks like we can expect to see… [+2403 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Tom Newton Dunn", "title": "Piers Morgan’s ferocious TV maulings of government ministers over coronavirus ‘actually makes them more pop - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11467146/piers-morgan-good-morning-britain-coronavirus-ministers/", "urlToImage": null, "publishedAt": "2020-04-23T22:05:14Z", "content": "DOWNING Street has discovered Piers Morgans ferocious coronavirus TV maulings only boost ministers standings, insiders have claimed.\r\nThe GMB host has become notorious for his aggressive questioning of senior ministers throughout the crisis on the morning sho… [+3478 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Russell Hope, news reporter", "title": "Coronavirus: Rolling Stones release lockdown-inspired new song Living In A Ghost Town - Sky News", "description": "Sir Mick Jagger said they started the track before the lockdown and felt it would \"resonate with the times we're living in\".", "url": "https://news.sky.com/story/coronavirus-rolling-stones-release-lockdown-inspired-new-song-living-in-a-ghost-town-11977854", "urlToImage": null, "publishedAt": "2020-04-23T20:54:24Z", "content": null}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Lewis Knight", "title": "Too Hot To Handle star Harry Jowsey spills details on sex act with Francesca - Mirror Online", "description": "Netflix has found a reality TV hit in the form Too Hot To Handle and tall Aussie Harry Jowsey had quite the impact on Francesca Farago", "url": "https://www.mirror.co.uk/tv/tv-news/hot-handle-star-harry-jowsey-21915347", "urlToImage": null, "publishedAt": "2020-04-23T19:31:00Z", "content": "One of the stars of Too Hot To Handle has spilt details on a now infamous sexual encounter he had on the show.\r\nTall Aussie model Harry Jowsey, 23, failed to stick to the celibacy rules on a number of occasions across the Netflix show's run.\r\nOne of the most … [+2019 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "James Hockaday", "title": "Huge spike in coronavirus hospital admissions after Cheltenham Festival was held - Metro.co.uk", "description": "Calls are being made for an inquiry into whether the horse racing event should have gone ahead.", "url": "https://metro.co.uk/2020/04/23/huge-spike-coronavirus-hospital-admissions-cheltenham-festival-held-12600852/", "urlToImage": null, "publishedAt": "2020-04-23T18:35:51Z", "content": "Calls are being made for an inquiry into whether the event should have gone ahead (Picture: PA)\r\nLeaked data has revealed a high concentration of coronavirus hospitalisations in area next to Cheltehnaham Racecourse.\r\nThe map seen by GloucestershireLive shows … [+2343 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Daniel Bates For Dailymail.com", "title": "Ex Vogue editor Andre Leon Talley rips into Anna Wintour, revealing how their friendship ended - Daily Mail", "description": "Former Vogue editor Andew Leon Talley writes he has 'huge emotional and psychological scars' from his decades long friendship with Anna Wintour, Vogue's  notoriously icy editor.", "url": "https://www.dailymail.co.uk/news/article-8242469/Ex-Vogue-editor-Andre-Leon-Talley-rips-Anna-Wintour-revealing-friendship-ended.html", "urlToImage": null, "publishedAt": "2020-04-23T17:44:59Z", "content": "The former editor-at-large of Vogue paints a scathing portrait of his once close friend and boss Anna Wintour, saying she is 'not capable of human kindness', in his upcoming memoir obtained exclusively by DailyMail.com.\r\nAndré Leon Talley says he has 'huge em… [+14806 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Rebecca Lewis", "title": "Holly Willoughby shares rare snap with son Chester, 5, as they model charity T-shirt to support the NHS - The Sun", "description": "", "url": "http://www.thesun.co.uk/tvandshowbiz/11464901/holly-willoughby-shares-rare-snap-chester-support-the-nhs/", "urlToImage": null, "publishedAt": "2020-04-23T16:57:41Z", "content": "HOLLY Willoughby has shared a rare picture of youngest son Chester as the pair model a new charity T-shirt aimed at supporting NHS key workers.\r\nThe This Morning presenter took to Instagram to reveal the rainbow designs which will be sold in Marks and Spencer… [+2376 chars]"}, {"source": {"id": null, "name": "Digitalspy.com"}, "author": "Abby Robinson", "title": "Gangs of London TV series – how to watch for FREE - digitalspy.com", "description": "\"It changes the game.\"", "url": "https://www.digitalspy.com/tv/a32251012/gangs-of-london-how-to-watch-free-sky-now-tv/", "urlToImage": null, "publishedAt": "2020-04-23T16:00:00Z", "content": "Peaky Blinders spoilers follow. \r\nGangs of London might just hit the spot if you've been missing poor old John Shelby following his death at the hands of Luca Changretta's men.\r\nJoe Cole's character was gunned down in his front garden in the opening episode o… [+3369 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Verity Sulway", "title": "Piers Morgan jokes he will remove son from his will if social media taunts continue - Mirror Online", "description": "Piers Morgan revealed he was considering cutting his son Spencer out of his will for taunting him on social media for saying he would head to the pub after lockdown before seeing his sons", "url": "https://www.mirror.co.uk/tv/tv-news/piers-morgan-jokes-remove-son-21912539", "urlToImage": null, "publishedAt": "2020-04-23T15:54:30Z", "content": "Piers Morgan said today he was considering removing his son Spencer from his will if he carries on taunting his dad on social media. \r\n Good Morning Britain hosts Piers and Susanna Reid were talking about phoning your friends and family during the coronavirus… [+1818 chars]"}, {"source": {"id": null, "name": "Digitalspy.com"}, "author": "Rianne Houghton", "title": "James Bond's Pierce Brosnan shares mistake during GoldenEye filming - digitalspy.com", "description": "Oops.", "url": "https://www.digitalspy.com/movies/a32251111/james-bond-pierce-brosnan-goldeneye-mistake/", "urlToImage": null, "publishedAt": "2020-04-23T15:15:00Z", "content": "No Time to Die's Daniel Craig might grumble at claims of a James Bond curse, but Pierce Brosnan certainly had his fair share of bad luck while playing the famous secret agent.\r\nShortly after we learned that he had to save his co-star Halle Berry from choking … [+1885 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Female Star Wars TV Series Coming! - WhatCulture", "description": "Todays news brought to you by Ash Millman, Adam Clery and Kirsten Ria. For more awesome content, check out: http://whatculture.com/ Follow us on Facebook at:...", "url": "https://www.youtube.com/watch?v=6a0gMHDlhvg", "urlToImage": null, "publishedAt": "2020-04-23T14:00:22Z", "content": null}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Shakespeare Quiz : It's the Bard's birthday but just how much do you know about him? - CBBC Newsround", "description": "It's world famous playwright William Shakespeare's official birthday on 23 April. Try our tricky quizzes to mark the occasion!", "url": "https://www.bbc.co.uk/newsround/52396271", "urlToImage": null, "publishedAt": "2020-04-23T11:19:45Z", "content": "It's world-famous English playwright William Shakespeare's official birthday on 23 April. \r\nHe is considered by many to be one of the world's greatest writers.\r\nShakespeare was born in 1564 in Stratford-upon-Avon in England.\r\nHe became famous for his plays, s… [+789 chars]"}]}