{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Siasat.com"}, "author": "Rasia Hashmi", "title": "Artist Zarina Hashmi passes away in London - The Siasat Daily", "description": "New Delhi: New York-based Indian artist Zarina Hashmi, best known for creating simple, minimalist, yet powerful works, passed away on Saturday at her niece's home in London, following a long illness. She was 83. \"She passed away after a long illness, but she …", "url": "https://www.siasat.com/artist-zarina-hashmi-passes-away-london-1880147/", "urlToImage": null, "publishedAt": "2020-04-27T01:17:55Z", "content": "New Delhi: New York-based Indian artist Zarina Hashmi, best known for creating simple, minimalist, yet powerful works, passed away on Saturday at her niece’s home in London, following a long illness. She was 83.\r\n“She passed away after a long illness, but she… [+5030 chars]"}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": "Megha Thadani", "title": "Rashami Desai reminisces her journey from debut show Pari Hoon Main to Naagin 4 with a 'Then and Now' photo - PINKVILLA", "description": "Rashami Desai recently took down her memory lane as she shared a 'Then and Now' picture on Instagram. The former Bigg Boss 13 contestant recalled her journey from her first show Pari Hoon Main to Naagin 4. Take a look.", "url": "https://www.pinkvilla.com/tv/news-gossip/rashami-desai-reminisces-her-journey-debut-show-pari-hoon-main-naagin-4-then-and-now-photo-527585", "urlToImage": null, "publishedAt": "2020-04-26T23:18:22Z", "content": null}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": "Pinkvilla Desk", "title": "Mission Impossible's sequel delayed amid the Coronavirus scare; makers push the release to November 2021 - PINKVILLA", "description": "Paramount has now pushed the release of the seventh Mission Impossible film to November 19, 2021 and the eighth film to November 4, 2022.", "url": "https://www.pinkvilla.com/entertainment/hollywood/mission-impossibles-sequel-delayed-amid-coronavirus-scare-makers-push-release-november-2021-527672", "urlToImage": null, "publishedAt": "2020-04-26T22:16:24Z", "content": null}, {"source": {"id": null, "name": "Sportskeeda.com"}, "author": "Matty Paddock", "title": "WWE Rumors - Young Superstar being touted as future main event star by Vince McMahon - Sportskeeda", "description": "One youngster has been making a huge impression on McMahon and other staff!", "url": "https://www.sportskeeda.com/wwe/wwe-rumors-young-superstar-being-touted-as-future-main-event-star-by-vince-mcmahon", "urlToImage": null, "publishedAt": "2020-04-26T19:39:24Z", "content": "Vince McMahon has been impressed with this youngster\r\nSecond-generation wrestler Cal Bloom is reportedly being lined up for a major future at the top of WWE, according to reports.\r\nBloom, the youngster who recently faced Sheamus on Friday Night SmackDown, is … [+1465 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Lawyer seeks restraint on Netflix series for “maligning” legal fraternity - Hindustan Times", "description": "The plea said that the web series Hansmukh showed lawyers in extremely poor light.", "url": "https://www.hindustantimes.com/india-news/lawyer-seeks-restraint-on-netflix-series-for-maligning-legal-fraternity/story-aKDZKY2Tu2OLE4UsFPVNaL.html", "urlToImage": null, "publishedAt": "2020-04-26T18:35:25Z", "content": "A plea has been filed in the Delhi High Court seeking directions to entertainment service provider Netflix to stop airing the series Hansmukh especially episode 4 of the web series for allegedly maligning the image of lawyers. \r\nThe plea filed advocate Ashuto… [+843 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Urvashi Kandpal", "title": "Kartik Aaryan pokes fun at Kriti Sanon, asks if Majnu Bhai painted her dress; See pic - Republic World - Republic World", "description": "Bollywood actors Kartik Aaryan and Kriti Sanon entertained their fans with their hilarious banter over the dress that the latter wore in her Instagram post", "url": "https://www.republicworld.com/entertainment-news/bollywood-news/kartik-aaryan-pokes-fun-at-kriti-sanon-asks-if-majnu-bhai-painted-it.html", "urlToImage": null, "publishedAt": "2020-04-26T17:59:50Z", "content": "While under lockdown, Luka Chuppi co-stars Kartik Aaryan and Kriti Sanon have playfully been at each other's tails to outdo themselves in trolling with every post. Panipat actor Kriti Sanon shared a collage of her photos recently and captioned it, \"Yup I’m a … [+2843 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Chetna Kapoor", "title": "Dulquer Salmaan apologises after trolls slam his family over a scene in Varane Avashyamund - Republic World - Republic World", "description": "A small scene in the film triggered a major controversy where the users accused the makers of the film for hurting the sentiments of Tamizh people. Read", "url": "https://www.republicworld.com/entertainment-news/regional-indian-cinema/dulquer-salmaan-apologises-after-trolls-slam-family-varane-avashyamund.html", "urlToImage": null, "publishedAt": "2020-04-26T16:20:59Z", "content": "The Zoya Factor actor Dulquer Salmaan took to his social media handle on Sunday to release an apology after trolls attacked his family over a scene in his recent film Varane Avashyamund. \r\nA small scene in the film triggered a major controversy where the user… [+2568 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Hindustan Times", "title": "Raj and DK working on micro-series and films that will be shot indoors - Hindustan Times", "description": "Raj Nidimoru and Krishna DK of the Raj and DK director duo are producing two series and a film shot inside homes.", "url": "https://www.hindustantimes.com/bollywood/raj-and-dk-working-on-micro-series-and-films-that-will-be-shot-indoors/story-gXELo8YYMV7tT6WBs2v3FP.html", "urlToImage": null, "publishedAt": "2020-04-26T15:24:47Z", "content": "In order to encourage budding filmmakers during lockdown and to keep their creativity flowing, director duo Raj Nidimoru and Krishna DK, said they will mentor and back the new format of micro-storytelling. The duo already has two micro-series in the pipeline.… [+2319 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Anuj Asrani", "title": "“I Expressed Myself To Go Over To The WWE”-Colby Covington On Fighting Drew McIntyre - Essentially Sports", "description": "Colby Covington is all set to face Drew McIntyre and will not stop till he gets his desired fight. He talks about his macth up.", "url": "https://www.essentiallysports.com/i-expressed-myself-to-go-over-to-the-wwe-colby-covington-on-fighting-drew-mcintyre-covington-ufc-news/", "urlToImage": null, "publishedAt": "2020-04-26T15:21:00Z", "content": "Colby Covington has found his way back into the headlines. This time he goes after a WWE superstar.\r\nColby Covington is UFC’s welterweight fighter. Hes known for his trash-talking and ability to get under peoples skin with just a few words. His recent target … [+1706 chars]"}, {"source": {"id": null, "name": "Bollywoodlife.com"}, "author": "Nirali Kanabar", "title": "Hindustani Bhau reveals that even Sidharth Shukla and Shehnaaz Gill are NOT a part of the Bigg Boss 13 WhatsA - Bollywood Life", "description": "We are quite amused to know that Sidharth Shukla and Shehnaaz Gill are not a part of the group, given that they shared a good equation with almost everyone in the house.", "url": "https://www.bollywoodlife.com/bigg-boss/hindustani-bhau-reveals-that-even-sidharth-shukla-and-shehnaaz-gill-are-not-a-part-of-the-bigg-boss-13-whatsapp-group-1612435/", "urlToImage": null, "publishedAt": "2020-04-26T15:00:53Z", "content": "Bigg Boss 13 WhatsApp group has become a topic of discussion ever since Shefali Jariwala revealed that Asim Riaz is not a part of the group, created by Hindustani Bhau. However, it is not just Asim, even Sidharth Shukla and his best friend Shehnaaz, are not a… [+2063 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Friends: 10 Ways Chandler Got Worse & Worse | ScreenRant - Screen Rant", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiPGh0dHBzOi8vc2NyZWVucmFudC5jb20vZnJpZW5kcy13YXlzLWNoYW5kbGVyLWJpbmctZ290LXdvcnNlL9IBQGh0dHBzOi8vc2NyZWVucmFudC5jb20vZnJpZW5kcy13YXlzLWNoYW5kbGVyLWJpbmctZ290LXdvcnNlL2FtcC8?oc=5", "urlToImage": null, "publishedAt": "2020-04-26T14:45:49Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "When Shah Rukh Khan confessed about lying to his wife Gauri Khan on their honeymoon - Times of India", "description": "Shah Rukh Khan and Gauri Khan are one of the most popular and stylish couples in B-town, who have been together for", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/when-shah-rukh-khan-confessed-about-lying-to-his-wife-gauri-khan-on-their-honeymoon/articleshow/75393103.cms", "urlToImage": null, "publishedAt": "2020-04-26T14:41:00Z", "content": null}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": "Pinkvilla Desk", "title": "Kajal Aggarwal rejects Udhayanidhi Stalin starrer for Chiranjeevi's Acharya? Find Out - PINKVILLA", "description": "Now, the Koratala Siva directorial is all set to feature the Magadheera actress as the female lead. The latest update on the Thuppakki actress states that she rejected the film with Udhayanidhi Stalin to star in Acharya.", "url": "https://www.pinkvilla.com/entertainment/south/kajal-aggarwal-rejects-udhayanidhi-stalin-starrer-chiranjeevis-acharya-find-out-527636", "urlToImage": null, "publishedAt": "2020-04-26T14:21:04Z", "content": null}, {"source": {"id": null, "name": "Bollywoodhungama.com"}, "author": "Bollywood Hungama", "title": "Priyanka Chopra misses home, dons her Desi Girl avatar in the US - Bollywood Hungama", "description": "Priyanka Chopra misses home, dons her Desi Girl avatar in the US. Latest Bollywood News, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News at Bollywood Hungama.com", "url": "https://www.bollywoodhungama.com/news/features/priyanka-chopra-misses-home-dons-her-desi-girl-avatar-in-the-us/", "urlToImage": null, "publishedAt": "2020-04-26T14:09:51Z", "content": "Hence, she decided to dress up like a Desi Girl, and wore a blue and white saree and a bunch of silver bangles.  She later shared a photo of hers with Nick on Instagram, and wrote, \"Felt like wearing a saree. So I did...At home. Miss everyone.\"\r\nPriyanka, who… [+556 chars]"}, {"source": {"id": null, "name": "Telanganatoday.com"}, "author": "Telangana Today", "title": "Vijay plans to generate employment through Deverakonda foundation - Telangana Today", "description": "Hyderabad: Actor Vijay Deverakonda thanked the Chief Minister K Chandrashekar Rao for various welfare activities taken up in these troubling times of coronavirus and lockdown. In a video released on Sunday, Vijay said, The government is doing such an incredib…", "url": "https://telanganatoday.com/vijay-plans-to-generate-employment-through-deverakonda-foundation", "urlToImage": null, "publishedAt": "2020-04-26T14:08:10Z", "content": "Hyderabad: Actor Vijay Deverakonda thanked the Chief Minister K Chandrashekar Rao for various welfare activities taken up in these troubling times of coronavirus and lockdown.\r\nIn a video released on Sunday, Vijay said, “The government is doing such an incred… [+2314 chars]"}, {"source": {"id": null, "name": "Heroichollywood.com"}, "author": "Sebastian Peris", "title": "New Photos Of Robert Pattinson Show His Lean Physique For The Batman - Heroic Hollywood", "description": "New photos of Robert Pattinson jogging reveal give fans a better look at his lean physique for Warner Bros. and DC's 'The Batman'.", "url": "https://heroichollywood.com/robert-pattinson-the-batman-physique-pics/", "urlToImage": null, "publishedAt": "2020-04-26T13:41:15Z", "content": "New photos of Robert Pattinson show off the actor’s lean physique for his role as Bruce Wayne in Matt Reeves’ The Batman.\r\nWhile production on Matt Reeves’ The Batman was initially underway in the United Kingdom, the ongoing coronavirus pandemic forced Warner… [+1826 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Shilpa Shetty and Raj Kundra fight in Mahabharat style and son Viaan plays Narayan; watch hilarious video - Times of India", "description": "Super Dancer judge Shilpa Shetty's latest video will literally make you roll on the floor. The actress, along with", "url": "https://timesofindia.indiatimes.com/tv/news/hindi/shilpa-shetty-and-raj-kundra-fight-in-mahabharat-style-and-son-viaan-plays-narayan-watch-hilarious-video/articleshow/75391787.cms", "urlToImage": null, "publishedAt": "2020-04-26T13:33:00Z", "content": null}, {"source": {"id": null, "name": "Iwmbuzz.com"}, "author": "Editorial Team", "title": "Keerthy Suresh and Samantha Akkineni’s simple yet striking saree look! - IWMBuzz", "description": "Keerthy Suresh and Samantha Akkineni looks beautiful in saree", "url": "https://www.iwmbuzz.com/movies/photos-movies/keerthy-suresh-samantha-akkinenis-simple-yet-striking-saree-look/2020/04/26", "urlToImage": null, "publishedAt": "2020-04-26T13:28:05Z", "content": null}, {"source": {"id": null, "name": "Iwmbuzz.com"}, "author": "Editorial Team", "title": "5 Aishwarya Rai Bachchan’s Casual Collection that You Should Add In Your Summer Closet - IWMBuzz", "description": "Aishwarya Rai Bachchan's style game is on point", "url": "https://www.iwmbuzz.com/movies/photos-movies/5-aishwarya-rai-bachchans-casual-collection-add-summer-closet/2020/04/26", "urlToImage": null, "publishedAt": "2020-04-26T13:06:16Z", "content": null}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Aanchal Nigam", "title": "Adorable: Netizens are gushing over this little lion cub and its roar, watch - Republic World - Republic World", "description": "An “adorable” video of a lion cub walking in Serengeti National Park in northern Tanzania on April 26 has been making several rounds on the internet.", "url": "https://www.republicworld.com/entertainment-news/whats-viral/adorable-netizens-are-gushing-over-this-lion-cub-and-his-roar.html", "urlToImage": null, "publishedAt": "2020-04-26T12:59:00Z", "content": "Amid coronavirus outbreak with major countries are under lockdown and millions of people remain confined to their homes, an “adorable” video of a lion cub walking in Serengeti National Park in northern Tanzania has been making several rounds on the internet. … [+1965 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Kangana Ranaut shares throwback pictures from her 2008 Europe trip; says 'reminiscing about those carefre - Times of India", "description": "With more and more Bollywood celebs taking to social media to share throwback pictures of themselves from the befor", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/kangana-ranaut-shares-throwback-pictures-from-her-2008-europe-trip-says-reminiscing-about-those-carefree-days-till-we-can-travel-again/articleshow/75391244.cms", "urlToImage": null, "publishedAt": "2020-04-26T12:42:00Z", "content": null}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Karan Johar says sorry for social media posts: Have realised that I may have been insensitive - India Today", "description": "Karan Johar took to Twitter to apologies for his recent social media posts.", "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johar-says-sorry-for-social-media-posts-have-realised-that-i-may-have-been-insensitive-1671359-2020-04-26", "urlToImage": null, "publishedAt": "2020-04-26T12:33:59Z", "content": "Filmmaker Karan Johar on Sunday said he is apologetic for his social media posts, many of which may have come off as \"insensitive\", at a time when the world is fighting the coronavirus outbreak.\r\nJohar's post came as a reaction to Australian comedian Greta Le… [+2240 chars]"}, {"source": {"id": null, "name": "Ibtimes.co.in"}, "author": "Shefali Jha", "title": "'I would like to date Rahul Gandhi, don't mind if it is controversial': Kareena Kapoor (Throwback) - International Business Times, India Edition", "description": "When Kareena Kapoor spoke about wanting to date Rahul Gandhi and the logic behind it.", "url": "https://www.ibtimes.co.in/i-would-like-date-rahul-gandhi-dont-mind-if-it-controversial-kareena-kapoor-throwback-818458", "urlToImage": null, "publishedAt": "2020-04-26T12:13:30Z", "content": "Crazy things fans of Shah Rukh, Amitabh, Kareena, Shahid Kapoor and Aamir have done for them\r\nEver since her debut, Kareena Kapoor has always made statements that leave us off-guard. The diva, known for her unfiltered and uninhibited statements, manages to ge… [+2034 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Smriti Khanna compares pre and post delivery body in new pics, says ‘Amazed at what the human body can... - Hindustan Times", "description": "Smriti Khanna has shared pre and post pictures of her body transformation after having her baby. The TV actor wrote she’s ‘amazed at what the human body can do’.", "url": "https://www.hindustantimes.com/tv/smriti-khanna-compares-pre-and-post-delivery-body-in-new-pics-says-amazed-at-what-the-human-body-can-do/story-IbaRWErO2cy3mOAc4akVrK.html", "urlToImage": null, "publishedAt": "2020-04-26T12:13:00Z", "content": "TV actor Smriti Khanna, who gave birth to her daughter just 10 days ago, has posted a collage of her pre and post delivery images, highlighting her slim figure and how easily she has lost the extra kilos after her delivery. \r\nOne of the images is from a week … [+1550 chars]"}, {"source": {"id": null, "name": "Thenewsminute.com"}, "author": null, "title": "'Kammatipaadam' actor Manikandan scales down wedding, donates to CMDRF instead - The News Minute", "description": "Actor Manikandan R Achari, best known for his debut role in the 2016 film Kammatipaadam, got married to Anjaly on Sunday morning. They had a small wedding, taking into consideration the COVID-19 situation, and the actor contributed the money earlier meant for…", "url": "https://www.thenewsminute.com/article/kammatipaadam-actor-manikandan-scales-down-wedding-donates-cmdrf-instead-123365", "urlToImage": null, "publishedAt": "2020-04-26T12:04:07Z", "content": "The actor got married to Anjaly at a temple in Tripunithura on Sunday.Actor Manikandan R Achari, best known for his debut role in the 2016 film Kammatipaadam, got married to Anjaly on Sunday morning. They had a small wedding, taking into consideration the COV… [+1665 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Omar Rashid", "title": "Every person I came in contact with tested negative, says singer Kanika Kapoor - The Hindu", "description": "In a statement issued on Sunday, she responded to allegations of not adhering to quarantine norms.", "url": "https://www.thehindu.com/entertainment/every-person-i-came-in-contact-with-tested-negative-says-singer-kanika-kapoor/article31437427.ece", "urlToImage": null, "publishedAt": "2020-04-26T11:44:57Z", "content": "Bollywood singer Kanika Kapoor on Sunday for the first time openly responded to allegations of not adhering to quarantine norms around the time she had returned from abroad and tested positive for COVID-19 last month.\r\n\"Every person that I have come in contac… [+1685 chars]"}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": "Pinkvilla Desk", "title": "WATCH: Sonakshi Sinha wants to steal THESE things from Alia Bhatt, Katrina Kaif, Salman Khan, Akshay Kumar - PINKVILLA", "description": "Sonakshi Sinha reveals everything she would like to steal from Alia Bhatt, Katrina Kaif, Deepika Padukone, Akshay Kumar, Taapsee Pannu, Salman Khan, Ranveer Singh, Vidya Balan and others.", "url": "https://www.pinkvilla.com/entertainment/news/watch-sonakshi-sinha-wants-steal-these-things-alia-bhatt-katrina-kaif-salman-khan-akshay-kumar-527615", "urlToImage": null, "publishedAt": "2020-04-26T11:03:26Z", "content": null}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Step inside Taapsee Pannu’s house in Mumbai, actor recalls how she made it home. Watch video - Hindustan Times", "description": "Taapsee Pannu, who has been sharing throwback pictures and videos, on Saturday, shared her experience about moving into her own apartment in Mumbai.", "url": "https://www.hindustantimes.com/bollywood/step-inside-taapsee-pannu-s-house-in-mumbai-actor-recalls-how-she-made-it-home-watch-video/story-oZ90qWQm4Um1TJOysIRiQI.html", "urlToImage": null, "publishedAt": "2020-04-26T10:56:00Z", "content": "Actor Taapsee Pannu has been sharing throwback images and videos, making her journey as an outsider in Bollywood. Her latest is about when she bought her flat in Mumbai and made it her own.\r\nSharing a picture, she wrote how the process coincided with her shoo… [+3591 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Nikita Deb", "title": "Phir Muskurayega India belongs to every Indian: Vishal Mishra - Hindustan Times", "description": "The composer composed the superhit track in collaboration with Akshay Kumar and Jacky Bhagnani. The track has garnered over 11 million views on YouTube", "url": "https://www.hindustantimes.com/music/phir-muskurayega-india-belongs-to-every-indian-vishal-mishra/story-X8BaoXyUBGQHLgn7gtJqDJ.html", "urlToImage": null, "publishedAt": "2020-04-26T10:47:38Z", "content": "An artiste seeks understanding and the kind of love it has got, I think it is unprecedented. Phir Muskurayega India has reached every nook and corner of India and people are saying it has become like the new national anthem of the country and I think for an a… [+1811 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Hindustan Times", "title": "Brad Pitt transforms into Dr Anthony Fauci for SNL just like the infectious disease expert wanted. Watch... - Hindustan Times", "description": "Brad Pitt was Dr Anthony Fauci’s first choice to play him on Saturday Night Live and the actor delivered on it.", "url": "https://www.hindustantimes.com/tv/brad-pitt-transforms-into-dr-anthony-fauci-for-snl-just-like-the-infectious-disease-expert-wanted-watch-hilarious-segment/story-LAOCQwfOwPEoObR2sn1YFJ.html", "urlToImage": null, "publishedAt": "2020-04-26T10:47:32Z", "content": "Oscar-winner Brad Pitt portrayed White House infectious disease expert Dr Anthony Fauci in the latest ‘At Home’ version of Saturday Night Live and tried to set the record straight regarding President Donald Trump’s remarks on the coronavirus outbreak.\r\nThe NB… [+2075 chars]"}, {"source": {"id": null, "name": "Indiaglitz.com"}, "author": "IndiaGlitz", "title": "Suriya-Jyothika issue gets government intervention - Tamil News - IndiaGlitz.com", "description": "Suriya's 2D Entertainment has sold its upcoming movie 'Ponmagal Vanthaal' starring Jyothika and K. Bhagyaraj to Amazon Prime for a whopping 9 crores", "url": "https://www.indiaglitz.com/suriya-jyothika-issue-gets-government-intervention-tamil-news-258989", "urlToImage": null, "publishedAt": "2020-04-26T10:47:14Z", "content": "Suriya's 2D Entertainment has sold its upcoming movie 'Ponmagal Vanthaal' starring Jyothika and K. Bhagyaraj to Amazon Prime for a whopping 9 Crores and the film is all set to stream on the OTT in May foregoing the theatrical release. The Tamil Nadu theater o… [+801 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Subhash Ghai says Kartik Aaryan is working hard to be superstar like Aamir Khan and Salman Khan; shares a - Times of India", "description": "Filmmaker Subhash Ghai, who is known for his hit films and entertainers filled with romance, song and masala, has w", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/subhash-ghai-says-kartik-aaryan-is-working-hard-to-be-superstar-like-aamir-khan-and-salman-khan-shares-an-unseen-pic/articleshow/75389455.cms", "urlToImage": null, "publishedAt": "2020-04-26T10:08:00Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Did you know Ramayan's Lakshman aka Sunil Lahri romanced Sita aka Dipika Chikhlia earlier? - Times of India", "description": "Ramayan has become one of the strongest and most searched words on social media and is trending actively. The mytho", "url": "https://timesofindia.indiatimes.com/tv/news/hindi/did-you-know-ramayans-lakshman-aka-sunil-lahri-romanced-sita-aka-dipika-chikhlia-earlier/articleshow/75389361.cms", "urlToImage": null, "publishedAt": "2020-04-26T09:58:00Z", "content": null}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Arjun Kapoor on dumb image of actors: ‘That one question to Alia Bhatt on Koffee destroyed the combined... - Hindustan Times", "description": "Arjun Kapoor has talked about that one episode of Koffee With Karan featuring Alia Bhatt, which may have a role to play in people expecting actors to be dumb.", "url": "https://www.hindustantimes.com/bollywood/arjun-kapoor-on-dumb-image-of-actors-that-one-question-to-alia-bhatt-on-koffee-destroyed-the-combined-iq-of-film-fraternity/story-NTxDemA75GTf2VhnyFjMsK.html", "urlToImage": null, "publishedAt": "2020-04-26T09:42:18Z", "content": "Actor Arjun Kapoor is wondering why people have really low expectations from actors when it comes to intelligence. In a recent quiz video, Film Companion’s Anupama Chopra asked Arjun the pincode for his area, Juhu. \r\nArjun gave the right answer--400049-- and … [+1707 chars]"}, {"source": {"id": null, "name": "Arabnews.com"}, "author": null, "title": "Gigi Hadid celebrated her 25th birthday with Zayn Malik - Arab News", "description": "DUBAI: This week, part-Palestinian model Gigi Hadid celebrated her 25th birthday with her sister Bella Hadid and her on-again flame Zayn Malik. The newly-minted 25-year-old posted a string of photos from her princess-themed bash– organized by her little siste…", "url": "https://www.arabnews.com/node/1665261", "urlToImage": null, "publishedAt": "2020-04-26T08:58:28Z", "content": "LONDON: In a time of fear and uncertainty, when the world is grappling with a global pandemic, you might not imagine art having a practical purpose.\r\nBut when you see the work of data visualization artist Mona Chalabi, you immediately recognize that art can d… [+3883 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Lara Dutta says she is ‘one of the boys’ for Salman Khan, Akshay Kumar: ‘They call me Lara Paaji’ - Hindustan Times", "description": "Lara Dutta reveals her equation with Salman Khan and Akshay Kumar, expressing gratitude that Salman shared the trailer of her web series.", "url": "https://www.hindustantimes.com/bollywood/lara-dutta-says-she-is-one-of-the-boys-for-salman-khan-akshay-kumar-they-call-me-lara-paaji/story-KSfzYrSfxvyHHl7Nyo59TO.html", "urlToImage": null, "publishedAt": "2020-04-26T08:52:40Z", "content": "Actor Lara Dutta has said that she is great friends with Salman Khan and Akshay Kumar, adding that they consider her as “one of the boys”. Lara told Pinkvilla in an interview, “I’m honestly blessed! Over the years, I’ve worked with such amazing co-stars who h… [+1677 chars]"}, {"source": {"id": null, "name": "Thewire.in"}, "author": null, "title": "Review | 'Extraction' Falls Back on the Only Weapon in Its Arsenal: Action - The Wire", "description": "Most of the action really well done, especially a seemingly single-take shot that lasts for 16 breathtaking minutes. But after a point, the Chris Hemsworth starrer becomes tedious due to unimaginative and formulaic writing.", "url": "https://thewire.in/film/review-extraction-chris-hemsworth-netflix", "urlToImage": null, "publishedAt": "2020-04-26T08:09:14Z", "content": "The new Netflix release Extraction has a story that can be distilled into a line: a young boy is kidnapped; a mercenary is sent out to rescue him.\r\nThat boy is Ovi Mahajan (Rudhraksh Jaiswal), the son of a jailed Indian drug lord (Pankaj Tripathi). The one-ma… [+3432 chars]"}, {"source": {"id": null, "name": "Indiaglitz.com"}, "author": "IndiaGlitz", "title": "Thala Ajith's personal request to fans regarding birthday celebrations - Tamil News - IndiaGlitz.com", "description": "May 1st is observed as the International Workers Day all around the world but to Ajith's fans numbering in millions its Thala Day", "url": "https://www.indiaglitz.com/thala-ajiths-personal-request-to-fans-regarding-birthday-celebrations-tamil-news-258981", "urlToImage": null, "publishedAt": "2020-04-26T08:07:25Z", "content": "May 1st is observed as the International Workers Day all around the world but to Ajith's fans numbering in millions its Thala Day which they celebrate with as much vigour on the the streets as they do on social media. With just four days to go Thala fans on t… [+1316 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "NewsClicks", "title": "Sunny Leone posts adorable video with Nisha, says she is a ‘lucky mommy’ to have a daughter who is ‘so... - NewsClicks", "description": "Actor Sunny Leone on Sunday posted an adorable video with her daughter Nisha. In the video, the mom and daughter pose for the digital camera with rose tiaras on their foreheads. Sharing the video, Sunny wrote: “Nisha is so so pretty!! I’m a lucky mommy! With …", "url": "https://www.hindustantimes.com/bollywood/sunny-leone-posts-adorable-video-with-nisha-says-she-is-a-lucky-mommy-to-have-a-daughter-who-is-so-so-pretty/story-aeT6RoohrY3hOa30WsS7LL.html", "urlToImage": null, "publishedAt": "2020-04-26T07:56:32Z", "content": "Actor Sunny Leone on Sunday posted an adorable video with her daughter Nisha. In the video, the mom and daughter pose for the digital camera with rose tiaras on their foreheads.\r\nSharing the video, Sunny wrote: Nisha is so so pretty!! Im a lucky mommy! With t… [+1901 chars]"}, {"source": {"id": null, "name": "Iwmbuzz.com"}, "author": "Editorial Team", "title": "Anushka Sharma Vs Deepika Padukone: Who Gives Us Major Sartorial Goals? - IWMBuzz", "description": "Who gives us major sartorial goals - Anushka Sharma Or Deepika Padukone?", "url": "https://www.iwmbuzz.com/movies/celebrities-movies/anushka-sharma-vs-deepika-padukone-gives-us-major-sartorial-goals/2020/04/26", "urlToImage": null, "publishedAt": "2020-04-26T07:23:48Z", "content": null}, {"source": {"id": null, "name": "Telugucinema.com"}, "author": "tc editor", "title": "No second heroine in Allu Arjun's Pushpa - Telugu Cinema", "description": "That Nivetha Thomas has been roped in to play the second female lead in Sukumar’s recently launched action thriller ‘Pushpa’ has widely been reported. ‘Pushpa’ that features Allu Arjun in the lead role has been hitting the headlines of late. But sources close…", "url": "https://www.telugucinema.com/news/no-second-heroine-allu-arjuns-pushpa", "urlToImage": null, "publishedAt": "2020-04-26T07:17:03Z", "content": "That Nivetha Thomas has been roped in to play the second female lead in Sukumars recently launched action thriller Pushpa has widely been reported. Pushpa that features Allu Arjun in the lead role has been hitting the headlines of late. But sources close to t… [+688 chars]"}, {"source": {"id": null, "name": "Thenewsminute.com"}, "author": null, "title": "‘Love in the time of corona’: Prithviraj and Supriya complete 9 years of marriage - The News Minute", "description": "Prithiviraj and his wife Supriya have completed nine years of togetherness and are celebrating their wedding anniversary on Saturday. The actor has shared a special picture for his wife with the hashtag “Love In The Time Of Corona”.", "url": "https://www.thenewsminute.com/article/love-time-corona-prithviraj-and-supriya-complete-9-years-marriage-123331", "urlToImage": null, "publishedAt": "2020-04-26T07:06:15Z", "content": "Prithviraj's wife Supriya shared that this is the first time in these nine years that they are spending their wedding anniversary away from each other.Prithiviraj and his wife Supriya have completed nine years of togetherness and are celebrating their wedding… [+2206 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "India TV Entertainment Desk", "title": "Taarak Mehta Ka Oolath Chashmah: Babita Ji aka Munmun Dutta awares fans about her fake TikTok accounts - India TV News", "description": "Actress Munmun Dutta who plays the role of Babita Ji in the show Taarak Mehta Ka Ooltah Chashmah has denied being on TikTok with her real and reel names. Sharing the screenshots of various fake accounts, she asked fans to report against them.", "url": "https://www.indiatvnews.com/entertainment/tv/taarak-mehta-ka-oolath-chashmah-babita-ji-aka-munmun-dutta-awares-fans-about-her-fake-tiktok-accounts-611406", "urlToImage": null, "publishedAt": "2020-04-26T06:40:33Z", "content": "Taarak Mehta Ka Oolath Chashmah: Babita Ji aka Munmun Dutta awares fans about her fake TikTok accounts\r\nThe popular daily soap Taarak Mehta Ka Ooltah Chashmah has been entertaining the audiences for more than 11 years now. The actors and actresses of the show… [+1464 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Kiona N. Smith", "title": "This New Snake Species Is What Happens When Scientists Are Harry Potter Fans - Forbes", "description": "Harry Potter character Salazar Slytherin now has a real-world namesake (a namesnake, if you will).", "url": "https://www.forbes.com/sites/kionasmith/2020/04/26/this-new-snake-species-is-what-happens-when-scientists-are-harry-potter-fans/", "urlToImage": null, "publishedAt": "2020-04-26T06:39:35Z", "content": "Male members of T. salazar, like this one, have orange or red stripes along the lengths of their ... [+] bodies.\r\nAamod Zambre and Chintan Seth, Eaglenest Biodiversity Project\r\nHarry Potter character Salazar Slytherin now has a real-world namesake (a namesnak… [+4246 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Irrfan Khan attends mother Saeda Begum’s funeral via video conferencing - Hindustan Times", "description": "Irrfan Khan’s mother Saeda Begum died on Saturday morning. The actor could not make it to her funeral, owing to the lockdown.", "url": "https://www.hindustantimes.com/bollywood/irrfan-khan-attends-mother-saeda-begum-s-funeral-via-video-conferencing/story-U1oaroYOIteMiIH1R9zxWO.html", "urlToImage": null, "publishedAt": "2020-04-26T06:37:04Z", "content": "Unable to travel to Rajasthan for his mother Saeda Begum’s last rites, Irrfan Khan was a part of the funeral through video conferencing. Her last rites were performed on Saturday evening at Chungi Naka graveyard on the outskirts of Jaipur. DNA reports that on… [+1143 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "Vaishali Jain", "title": "Avengers Endgame 1 Year Anniversary: How a World Gripped with Fear of Covid-19 Can Relate to it Now More ... - News18", "description": "As the Hollywood blockbuster 'Avengers: Endgame' celebrates its one year anniversary, we look at how the movie holds water even today.", "url": "https://www.news18.com/news/movies/avengers-endgame-1-year-anniversary-how-a-world-gripped-with-fear-of-covid-19-can-relate-to-it-now-more-than-ever-2593117.html", "urlToImage": null, "publishedAt": "2020-04-26T06:17:22Z", "content": "Believe it or not, but one year has passed since Captain America (Chris Evans) led the entire Marvel Cinematic Universe in the fight against Thanos (Josh Brolin) and his alien army in Avengers: Endgame, which released in theaters on this day in 2019.\r\nThe Mar… [+3915 chars]"}, {"source": {"id": null, "name": "Indiaglitz.com"}, "author": "IndiaGlitz", "title": "Thalapathy Vijay's 'Master' confirmed release on Amazon Prime but... - Tamil News - IndiaGlitz.com", "description": "The past few days the Kollywood film industry is in a tussle after Suriya deciding to stream his next movie 'Ponmagal Vandhal' starring Jyothika on Amazon Prime foregoing theatrical release", "url": "https://www.indiaglitz.com/thalapathy-vijays-master-confirmed-release-on-amazon-prime-but-tamil-news-258975", "urlToImage": null, "publishedAt": "2020-04-26T05:48:01Z", "content": "The past few days the Kollywood film industry is in a tussle after Suriya deciding to stream his next movie 'Ponmagal Vandhal' starring Jyothika on Amazon Prime foregoing theatrical release. Theater owners are seeing red and are threatening to boycott the big… [+811 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Malaika Arora crashes Arjun Kapoor’s Instagram live, hilariously trolls him for ‘boring’ quarantine... - Hindustan Times", "description": "Arjun Kapoor’s girlfriend Malaika Arora made fun of his quarantine routine and sarcastically called it “very interesting”.", "url": "https://www.hindustantimes.com/bollywood/malaika-arora-crashes-arjun-kapoor-s-instagram-live-hilariously-trolls-him-for-boring-quarantine-routine/story-g5DKgeWOA2bA5GQSlR9EsL.html", "urlToImage": null, "publishedAt": "2020-04-26T05:44:55Z", "content": "Arjun Kapoor and Malaika Arora never miss a chance to pull each other’s leg, and it was no different on Saturday evening. She crashed her boyfriend’s Instagram live and poked fun at his daily routine during the lockdown.\r\nWith all shoots on hold due to the co… [+1678 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Chris Pratt and Katherine Schwarzenegger are Expecting Their First Child Together - News18", "description": "Chris and Katherine wed in June last year and now they have revealed that they are expecting their first child together.", "url": "https://www.news18.com/news/movies/chris-pratt-and-katherine-schwarzenegger-are-expecting-their-first-child-together-2593055.html", "urlToImage": null, "publishedAt": "2020-04-26T05:19:26Z", "content": "Hollywood actor Chris Pratt and his partner, author Katherine Schwarzenegger are expecting their first child together. Katherine and Chris were seen riding bikes when her baby bump was visible and it became clear that she was pregnant with Chris' child. In an… [+829 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Karan Johar realises mistake after watching sarcastic videos on celebs, Amitabh Bachchan gives ‘breaking... - Hindustan Times", "description": "Top entertainment news: Karan Johar has apologised for sharing ‘insensitive’ posts during coronavirus crisis while Amitabh Bachchan on Saturday declared on social media that a bat had entered his home in Mumbai.", "url": "https://www.hindustantimes.com/bollywood/karan-johar-realises-mistake-after-sarcastic-videos-on-celebs-amitabh-bachchan-gives-breaking-news-from-jalsa/story-aydICNSMdMWh6XsbPfwLRM.html", "urlToImage": null, "publishedAt": "2020-04-26T05:15:02Z", "content": "Amitabh Bachchan has a crisis at home in Covid-19 times, says ‘Breaking news, a bat just entered my home’\r\nActor Amitabh Bachchan, who has been putting out motivational posts through out the coronavirus pandemic, felt the crisis up close and personal on Satur… [+2147 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Mahira Sharma’s mother Sania says she will ‘not oppose’ the actor if she wants to marry Paras Chhab... - Hindustan Times", "description": "Sania Sharma said that though her daughter Mahira Sharma is not dating Paras Chhabra, she will have no objections if they decide to get married in the future.", "url": "https://www.hindustantimes.com/tv/mahira-sharma-s-mother-sania-says-she-will-not-oppose-the-actor-if-she-wants-to-marry-paras-chhabra/story-0fTFjp8VIQl8uRePijhc5N.html", "urlToImage": null, "publishedAt": "2020-04-26T05:14:59Z", "content": "Even as rumours of Paras Chhabra and Mahira Sharma’s romance intensify, her mother Sania Sharma has said that if they decide to get married in the future, she will have no objection to it. She, however, insisted that her daughter is not in a relationship with… [+2095 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Netflix has secret codes for hidden movies, shows: Here’s the whole list - Hindustan Times", "description": "Netflix has a lot of shows that might not show up on your home page thanks to what you watch normally. Here’s how you can unlock a bigger treasure trove of content", "url": "https://www.hindustantimes.com/tech/netflix-has-secret-codes-for-hidden-movies-shows-here-s-the-whole-list/story-yUcZuWvhZr2g7SgLNHqcNM.html", "urlToImage": null, "publishedAt": "2020-04-26T04:07:45Z", "content": "We are certain you have been watching a LOT of Netflix lately and you might have just exhausted everything you think this streaming platform has to offer. Don’t worry, we have news for you. \r\nNetflix has a whole list of secret codes that you can use to find m… [+7648 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "IANS", "title": "Vidya Balan donates 1000 PPE kits for doctors, raising funds for more - Times of India", "description": "Bollywood actress Vidya Balan is donating a 1000 PPE kits for doctors and other medical staff who are battling at t", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/vidya-balan-donates-1000-ppe-kits-for-doctors-raising-funds-for-more/articleshow/75385850.cms", "urlToImage": null, "publishedAt": "2020-04-26T03:51:00Z", "content": "Bollywood actress Vidya Balan is donating a 1000 PPE kits for doctors and other medical staff who are battling at the frontline to keep us safe from the deadly COVID 19.\r\nVidya has also collaborated with celebrity shout-out platform Tring to raise donations t… [+2001 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Taimur Ali Khan bumps into father Saif Ali Khan’s interview yet again and it is just too cute for words - - Times of India", "description": "Kareena Kapoor Khan and Saif Ali Khan's son Taimur Ali Khan is one of the most loved star kids in Bollywood. He enj", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/taimur-ali-khan-bumps-into-father-saif-ali-khans-interview-yet-again-and-it-is-just-too-cute-for-words-watch/articleshow/75385828.cms", "urlToImage": null, "publishedAt": "2020-04-26T03:48:00Z", "content": null}, {"source": {"id": null, "name": "Bollywoodhungama.com"}, "author": "Bollywood Hungama", "title": "Shah Rukh Khan, Gauri Khan and son Aryan Khan attend Kajols Mehandi ceremony in this priceless throwback - Bollywood Hungama", "description": "Shah Rukh Khan, Gauri Khan and son Aryan Khan attend Kajol’s Mehandi ceremony in this priceless throwback. Latest Bollywood News, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News at Bollywood Hungama.com", "url": "https://www.bollywoodhungama.com/news/features/shah-rukh-khan-gauri-khan-son-aryan-khan-attend-kajols-mehandi-ceremony-priceless-throwback/", "urlToImage": null, "publishedAt": "2020-04-26T03:04:41Z", "content": "We just stumbled upon a million-dollar throwback photo, from Kajol's pre-wedding ceremonies. The photo has SRK, wife Gauri Khan and their eldest child Aryan Khan in attendance. Aryan, who must not be over a few years old in the photo, is tucked in his father'… [+509 chars]"}, {"source": {"id": null, "name": "Bollywoodhungama.com"}, "author": "Bollywood Hungama", "title": "Hrithik Roshan enjoys the sunset with sons Hrehaan and Hridhaan - Bollywood Hungama", "description": "Hrithik Roshan enjoys the sunset with sons Hrehaan and Hridhaan. Latest Bollywood News, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News at Bollywood Hungama.com", "url": "https://www.bollywoodhungama.com/news/features/hrithik-roshan-enjoys-the-sunset-with-sons-hrehaan-and-hridhaan/", "urlToImage": null, "publishedAt": "2020-04-26T03:04:34Z", "content": "Sussanne, on Instagram, shared a delightful photo of Hrithik and the kids enjoying the sunset from their balcony. She also quoted an excerpt from Henry Davies' poem Leisure. \"So stop awhile and do enjoy that stare, Take it in.. absorb as we all are moving.. e… [+422 chars]"}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Eric Robinette", "title": "People Can't Get Over How Weird Tony Stark and Wanda's Relationship Is in the MCU - Showbiz Cheat Sheet", "description": "Trying to recall the nature of the relationship between Iron Man and Scarlet Witch in the Marvel Cinematic Universe is no easy task.", "url": "https://www.cheatsheet.com/entertainment/people-cant-get-over-how-weird-tony-stark-and-wandas-relationship-is-in-the-mcu.html/", "urlToImage": null, "publishedAt": "2020-04-26T02:45:28Z", "content": "Trying to recall the relationship between Iron Man and Scarlet Witch in the Marvel Cinematic Universe is no easy task. That’s not because their relationship is so strange – it’s that they barely have one. \r\nThe two characters share the screen for probably les… [+3882 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Dr Prem Kumar Sharma & Manisha Koushik", "title": "Horoscope Today: Astrological prediction for April 26, what’s in store for Aries, Leo, Virgo, Sagittarius... - Hindustan Times", "description": "Horoscope Today: Are the stars lined up in your favour? Find out the astrological prediction for Aries, Leo, Virgo, Sagittarius and other zodiac signs for April 26.", "url": "https://www.hindustantimes.com/more-lifestyle/horoscope-today-astrological-prediction-for-april-26-what-s-in-store-for-aries-leo-virgo-sagittarius-and-other-zodiac-signs/story-UZqIshfDA2z09RcKOo28hJ.html", "urlToImage": null, "publishedAt": "2020-04-26T02:39:30Z", "content": "The 12 zodiac signs have their own personality traits and characteristics. Horoscopes give us an insight into our daily life and how it will fare for all of us. Read on to know whether the odds will be in your favour today:\r\n*Aries (March 21-April 20) You wil… [+8191 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Horoscope Today, April 26, 2020: Know what your stars have for you - India Today", "description": "Horoscope Today, April 26, 2020: Here's what the stars have in store for you on Sunday.", "url": "https://www.indiatoday.in/india/story/horoscope-today-april-26-2020-know-what-your-stars-have-for-you-1671163-2020-04-26", "urlToImage": null, "publishedAt": "2020-04-26T02:39:06Z", "content": "Horoscope offers interesting and accurate insights. Let's find out what our stars have in store for us on Sunday, April 26.\r\nARIES March 21-April 19 A raise in salary may make you stable on the financial front. A side business will be beneficial for some. You… [+5127 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Alok Nayak", "title": "Former WWE Superstar Accuses CM Punk of Stealing His Finisher - Essentially Sports", "description": "GTS( Go to Sleep) a finishing maneuver that CM Punk made famous. However, it was not invented by Punk as per former WWE supertstar, KENTA", "url": "https://www.essentiallysports.com/wwe-news-former-wwe-superstar-accuses-cm-punk-of-stealing-his-finisher/", "urlToImage": null, "publishedAt": "2020-04-26T00:44:00Z", "content": "CM Punk has been away from the WWE ring for years now. However, fans in the arena never miss a chance to appreciate the Voice of the voiceless by chanting his name. CM Punk brought a revolution in WWE when he went against the Bossman, Vince McMahon, and start… [+1665 chars]"}, {"source": {"id": null, "name": "Digitalspy.com"}, "author": "Dan Seddon", "title": "Spider-Man star is hosting Marvel-themed Instagram quiz - digitalspy.com", "description": "Get involved via Instagram next week.", "url": "https://www.digitalspy.com/movies/a32276017/spider-man-tom-holland-marvel-virtual-quiz/", "urlToImage": null, "publishedAt": "2020-04-25T16:49:00Z", "content": "Spider-Manactor Tom Holland will be hosting a Marvel-themed quiz on Instagram during the coronavirus lockdown.\r\nIn conjunction with The Brothers Trust, which was set up by Holland's family to support various charities, this virtual quiz will take place next W… [+1432 chars]"}, {"source": {"id": null, "name": "Mirchi9.com"}, "author": "Saumya", "title": "Telugu Girl’s Small Mistake Magnified? - Mirchi9", "description": "picture surfaced showing a guy clicking one of the pictures that she uploaded. It looked like faking that she shot for the pics herself while she had help from a guy. Social distancing is the present norm and social media trolls weren't in a mood to forgive h…", "url": "https://www.mirchi9.com/movienews/sobhita-dhulipala-telugu-girls-small-mistake-magnified/", "urlToImage": null, "publishedAt": "2020-04-25T14:46:44Z", "content": null}, {"source": {"id": null, "name": "Iwmbuzz.com"}, "author": "Editorial Team", "title": "OMG: No theatre release for Akshay Kumar and Kiara Advani starrer Laxmmi Bomb? - IWMBuzz", "description": "IWMBuzz tells you about the possible OTT release of Laxmmi Bomb. Read the story for more details", "url": "https://www.iwmbuzz.com/movies/news-movies/omg-no-theatre-release-akshay-kumar-kiara-advani-starrer-laxmmi-bomb/2020/04/25", "urlToImage": null, "publishedAt": "2020-04-25T13:30:38Z", "content": "Akshay Kumar and Kiara Advani’s Laxmmi Bomb happened to be one of the biggest releases that Akki and Kiara were looking forward to.\r\nHowever seems like due to the Covid-19 pandemic, things have taken a hit. As per media reports, Laxmmi Bomb might not have a t… [+213 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "IANS", "title": "Suriya’s ‘Soorarai Pottru’ could be banned, if Jyothika’s ‘Pon Magal Vandhal’ releases directly on OTT - The Hindu", "description": "Tamil Nadu Theatre And Multiplex Owners’ Association respond to expected release of Jyothika’s film on Amazon Prime next month", "url": "https://www.thehindu.com/entertainment/movies/suriyas-soorarai-pottru-could-be-banned-if-jyothikas-pon-magal-vandhal-releases-directly-on-ott/article31432944.ece", "urlToImage": null, "publishedAt": "2020-04-25T12:25:03Z", "content": "The Tamil Nadu Theatre And Multiplex Owners Association have threatened to ban films starring Suriya, as well as the films produced by his production company 2D films. The decision comes after the news that the film Pon Magal Vandhal, produced by Suriya and s… [+1831 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Malaika Arora Shares Sun Kissed Selfie, Wonders 'What Awaits Us' - News18", "description": "Malaika Arora treated her social media family by sharing a gorgeous picture of her basking in the sun. She keeps sharing pictures from her daily routine.", "url": "https://www.news18.com/news/movies/malaika-arora-shares-sun-kissed-selfie-wonders-what-awaits-us-2592565.html", "urlToImage": null, "publishedAt": "2020-04-25T12:23:25Z", "content": "Bollywood actor Malaika Arora has shared a stunning sun-kissed selfie with her Instagram family.\r\nIn the photo, one can see the wind in her hair, sunlight striking her forehead as she looks up to the camera. Captioning the post, which till now has got over tw… [+1090 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Ajay Devgn asks fans to pause and reflect in new song Thahar Ja. Watch video - India Today", "description": "Ajay Devgn has released a new song called Thahar Ja. The song, which has been shot by the actor, marks the debut of his 9-year-old son Yug Devgn as an assistant director.", "url": "https://www.indiatoday.in/movies/celebrities/story/ajay-devgn-asks-fans-to-pause-and-reflect-in-new-song-thahar-ja-watch-video-1671020-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T12:22:30Z", "content": "While the world is grappling with the novel coronavirus pandemic, everyone is trying to stay positive. In this time, many celebrities are taking different means to help fans deal with the crisis.\r\nAjay Devgn has been taking to social media to keep people info… [+1953 chars]"}, {"source": {"id": null, "name": "Tellychakkar.com"}, "author": "Tellychakkar Team", "title": "Asim Riaz shares his love story with Siddarth Shukla - Tellychakkar", "description": "When Asim shared his feelings with Siddarth", "url": "https://www.tellychakkar.com/tv/tv-news/asim-riaz-shares-his-love-story-siddarth-shukla-200425", "urlToImage": null, "publishedAt": "2020-04-25T12:05:00Z", "content": "MUMBAI: Bigg Boss 13 was one the most successful shows on television, and Asim and Sidharth were the two of the most popular contestants of the show. Where Sidharth emerged as the winner of the show, Asim was the first runner up.\r\nThe two were not in good ter… [+1724 chars]"}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": null, "title": "Kiara Advani's younger brother Mishaal is one handsome chap; Check out their photos - PINKVILLA", "description": "Kiara Advani is one popular diva of Bollywood. She is also a known celebrity in the South and has shared screen space with Ram Charan and Mahesh Babu. The stunning actress made her B-town debut with Fugly and was later seen opposite Sushant Singh Rajput in M.…", "url": "https://www.pinkvilla.com/photos/kiara-advani/kiara-advanis-younger-brother-mishaal-one-handsome-chap-check-out-their-photos-527441", "urlToImage": null, "publishedAt": "2020-04-25T09:21:00Z", "content": "Kiara Advani is one popular diva of Bollywood. She is also a known celebrity in the South and has shared screen space with Ram Charan and Mahesh Babu. The stunning actress made her B-town debut with Fugly and was later seen opposite Sushant Singh Rajput in M.… [+943 chars]"}, {"source": {"id": null, "name": "Gqindia.com"}, "author": "Vrutika Shah", "title": "7 shows on Netflix, Amazon Prime Video and Disney+ Hotstar that you shouldn’t watch with your family - GQ India", "description": "You should steer clear from these shows on Netflix, Amazon Prime Video, Hotstar if you want to keep the harmony in your family-friendly binge watch sessions", "url": "https://www.gqindia.com/binge-watch/collection/7-shows-on-netflix-amazon-prime-video-disney-hotstar-you-should-not-watch-with-family/", "urlToImage": null, "publishedAt": "2020-04-25T07:12:46Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Celebs in their school uniform Pics | Celebs in their school uniform Photos | Celebs in their school uniform Portfolio Pics | Celebs in their school uniform Personal Photos - ETimes - Times of India", "description": "Deepika was all smiles when she received a gift from her school teacher. (Photo: Instagram)", "url": "https://photogallery.indiatimes.com/celebs/celeb-themes/celebs-in-their-school-uniform/articleshow/75368536.cms", "urlToImage": null, "publishedAt": "2020-04-25T04:34:46Z", "content": "Priyanka Chopra's J-sister, Danielle Jonas, shares unseen pictures from Grammy Awards 2020"}]}