{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Pinkvilla.com"}, "author": "Pinkvilla Desk", "title": "Taarak Mehta Ka Ooltah Chashmah fame Munmun Dutta aka Babita CLARIFIES she is NOT on TikTok - PINKVILLA", "description": "Taarak Mehta Ka Ooltah Chashmah actress Munmun Dutta aka Babita recently revealed that she is not using Tiktok and urged her fans to report fake accounts on the app. Read on.", "url": "https://www.pinkvilla.com/tv/news-gossip/taarak-mehta-ka-ooltah-chashmah-fame-munmun-dutta-aka-babita-clarifies-she-not-tiktok-527574", "urlToImage": null, "publishedAt": "2020-04-26T12:34:26Z", "content": null}, {"source": {"id": null, "name": "Thenewsminute.com"}, "author": null, "title": "'Kammatipaadam' actor Manikandan scales down wedding, donates to CMDRF instead - The News Minute", "description": "Actor Manikandan R Achari, best known for his debut role in the 2016 film Kammatipaadam, got married to Anjaly on Sunday morning. They had a small wedding, taking into consideration the COVID-19 situation, and the actor contributed the money earlier meant for…", "url": "https://www.thenewsminute.com/article/kammatipaadam-actor-manikandan-scales-down-wedding-donates-cmdrf-instead-123365", "urlToImage": null, "publishedAt": "2020-04-26T12:04:07Z", "content": "The actor got married to Anjaly at a temple in Tripunithura on Sunday.Actor Manikandan R Achari, best known for his debut role in the 2016 film Kammatipaadam, got married to Anjaly on Sunday morning. They had a small wedding, taking into consideration the COV… [+1665 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Mimansa Shekhar", "title": "Coronavirus impact explained: How India’s film industry got hit and is preparing for a new normal - The Indian Express", "description": "While the impact of the lockdown on the Indian film industry at large is still being evaluated, we take a look at how slim production and related fields have suffered in India over the past month.", "url": "https://indianexpress.com/article/explained/explained-how-will-coronavirus-impact-entertainment-industry-6370412/", "urlToImage": null, "publishedAt": "2020-04-26T11:50:50Z", "content": "Written by Mimansa Shekhar\r\n | New Delhi | \r\nUpdated: April 26, 2020 5:16:47 pm\r\nThe Indian film industry is going through its worst phase because of the lockdown necessitated by the coronavirus pandemic. (Express Photo By Pavan Khengre)Big releases postponed… [+16798 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Omar Rashid", "title": "Every person I came in contact with tested negative, says singer Kanika Kapoor - The Hindu", "description": "In a statement issued on Sunday, she responded to allegations of not adhering to quarantine norms.", "url": "https://www.thehindu.com/entertainment/every-person-i-came-in-contact-with-tested-negative-says-singer-kanika-kapoor/article31437427.ece", "urlToImage": null, "publishedAt": "2020-04-26T11:44:57Z", "content": "Bollywood singer Kanika Kapoor on Sunday for the first time openly responded to allegations of not adhering to quarantine norms around the time she had returned from abroad and tested positive for COVID-19 last month.\r\n\"Every person that I have come in contac… [+1685 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Step inside Taapsee Pannu’s house in Mumbai, actor recalls how she made it home. Watch video - Hindustan Times", "description": "Taapsee Pannu, who has been sharing throwback pictures and videos, on Saturday, shared her experience about moving into her own apartment in Mumbai.", "url": "https://www.hindustantimes.com/bollywood/step-inside-taapsee-pannu-s-house-in-mumbai-actor-recalls-how-she-made-it-home-watch-video/story-oZ90qWQm4Um1TJOysIRiQI.html", "urlToImage": null, "publishedAt": "2020-04-26T11:02:24Z", "content": "Actor Taapsee Pannu has been sharing throwback images and videos, making her journey as an outsider in Bollywood. Her latest is about when she bought her flat in Mumbai and made it her own.\r\nSharing a picture, she wrote how the process coincided with her shoo… [+3591 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Kshitij Rawat", "title": "Vijay Deverakonda on coronavirus outbreak: Wasn’t prepared mentally or financially - The Indian Express", "description": "Vijay Deverakonda said his foundation has been teaching youngsters skills to make them more employable and this will continue. His dream, Deverakonda said, is to ultimately employ 1 lakh people in his lifetime.", "url": "https://indianexpress.com/article/entertainment/telugu/vijay-deverakonda-on-coronavirus-outbreak-wasnt-prepared-mentally-or-financially-6379875/", "urlToImage": null, "publishedAt": "2020-04-26T10:40:33Z", "content": "Written by Kshitij Rawat\r\n | New Delhi | \r\nUpdated: April 26, 2020 4:09:50 pm\r\nVijay Deverakonda shared what he is doing to help the less fortunate. (Vijay Deverakonda/YouTube)Telugu star Vijay Deverakonda recently posted a video on YouTube detailing his expe… [+1354 chars]"}, {"source": {"id": null, "name": "Bollywoodhungama.com"}, "author": "Bollywood Hungama", "title": "Irrfan Khan loses his mother; his friends dont know where he is - Bollywood Hungama", "description": "Irrfan Khan loses his mother; his friends don’t know where he is. Latest Bollywood News, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News at Bollywood Hungama.com", "url": "https://www.bollywoodhungama.com/news/bollywood/irrfan-khan-loses-mother-friends-dont-know/", "urlToImage": null, "publishedAt": "2020-04-26T10:14:06Z", "content": "Apparently he has flown back to the UK for treatment after the completion of Angrezi Medium. But what kind of medical attention could Irrfan be getting during these times of the Coronavirus? More importantly, being unwell himself how has Irrfan taken this ber… [+439 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Subhash Ghai says Kartik Aaryan is working hard to be superstar like Aamir Khan and Salman Khan; shares a - Times of India", "description": "Filmmaker Subhash Ghai, who is known for his hit films and entertainers filled with romance, song and masala, has w", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/subhash-ghai-says-kartik-aaryan-is-working-hard-to-be-superstar-like-aamir-khan-and-salman-khan-shares-an-unseen-pic/articleshow/75389455.cms", "urlToImage": null, "publishedAt": "2020-04-26T10:08:00Z", "content": null}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": "Pinkvilla Desk", "title": "When AbRam Khan adorably photo bombed Alia Bhatt and Katrina Kaif's photo; Check It Out - PINKVILLA", "description": "Katrina and Alia were once really close and also used to party and click a bunch of pictures. We stumbled upon one such picture which shows the two ladies posing.", "url": "https://www.pinkvilla.com/entertainment/news/when-abram-khan-adorably-photo-bombed-alia-bhatt-and-katrina-kaifs-photo-check-it-out-527602", "urlToImage": null, "publishedAt": "2020-04-26T10:00:16Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Did you know Ramayan's Lakshman aka Sunil Lahri romanced Sita aka Dipika Chikhlia earlier? - Times of India", "description": "Ramayan has become one of the strongest and most searched words on social media and is trending actively. The mytho", "url": "https://timesofindia.indiatimes.com/tv/news/hindi/did-you-know-ramayans-lakshman-aka-sunil-lahri-romanced-sita-aka-dipika-chikhlia-earlier/articleshow/75389361.cms", "urlToImage": null, "publishedAt": "2020-04-26T09:58:00Z", "content": null}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": null, "title": "Brad Pitt turns Dr Fauci in new SNL At Home episode - khabrisala", "description": "", "url": "https://indianexpress.com/article/entertainment/television/brad-pitt-turns-dr-fauci-in-new-snl-at-home-episode-6379981/", "urlToImage": null, "publishedAt": "2020-04-26T09:35:00Z", "content": "By: PTI | Los Angeles |Published: April 26, 2020 2:06:25 pm \r\nBrad Pitts flip as Dr Anthony Fauci comes weeks after director of the National Institute of Allergy and Infectious Diseases was requested who he want to impersonate him on SNL.\r\nOscar winner Brad P… [+2575 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Neena Gupta bakes delicious cake with mangoes and cream in new video. Here's the basic recipe - India Today", "description": "Neena Gupta spent Saturday baking a cake with mangoes and cream. She shared a video on Instagram.", "url": "https://www.indiatoday.in/lifestyle/celebrity/story/neena-gupta-bakes-delicious-cake-with-mangoes-and-cream-in-new-video-here-s-the-basic-recipe-1671271-2020-04-26", "urlToImage": null, "publishedAt": "2020-04-26T09:07:29Z", "content": "It is the season of mangoes and if you are in the mood to bake a sweet delight with the king of fruits, turn to Neena Gupta's Instagram. The 60-year-old actress baked a delectable mango cake on Saturday and also shared a basic recipe of it with her fans and f… [+1593 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "The Kapil Sharma Show's Archana Puran Singh thanks fans for half a million followers on Instagram; apolog - Times of India", "description": "The Kapil Sharma Show's special judge Archana Puran Singh is extremely active on social media, especially Instagram", "url": "https://timesofindia.indiatimes.com/tv/news/hindi/the-kapil-sharma-shows-archana-puran-singh-thanks-fans-for-half-a-million-followers-on-instagram-apologises-for-not-being-able-to-reply-to-everyone/articleshow/75388801.cms", "urlToImage": null, "publishedAt": "2020-04-26T09:01:00Z", "content": null}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "admin", "title": "Kartik Aaryan trolls Kriti Sanon’s dress, asks if Majnu bhai from Welcome painted it. She trolls him... - Jimmys Post", "description": "", "url": "https://www.hindustantimes.com/bollywood/kartik-aaryan-trolls-kriti-sanon-s-dress-asks-if-majnu-bhai-from-welcome-painted-it-she-trolls-him-back/story-IRjWVO0l165QrK9M54RqSM.html/", "urlToImage": null, "publishedAt": "2020-04-26T08:58:46Z", "content": "Kriti Sanon got hilariously trolled by her Luka Chuppi co-star Kartik Aaryan after she shared a picture collage of herself on Instagram. It was the abstract zebra printed on her dress that caught his attention and he quipped, Aapki kameez Majnu bhai ne paint … [+1915 chars]"}, {"source": {"id": null, "name": "Spotboye.com"}, "author": "Vickey Lalwani", "title": "Hindustani Bhau: 'Big Deal That Asim Riaz Isn't A Part Of Bigg Boss 13 WhatsApp Group, Even Sidharth-Shehnaaz Aren't!'- EXCLUSIVE - SpotboyE", "description": "Hindustani Bhau is rather amused at the brouhaha that the WhatsApp Group of Bigg Boss 13 inmates made by him does not have Asim Riaz", "url": "https://www.spotboye.com/television/television-news/hindustani-bhau-big-deal-that-asim-riaz-isn-t-a-part-of-bigg-boss-13-whatsapp-group-even-sidharth-shehnaaz-aren-t-exclusive/5ea54abd74f5ce660a225788", "urlToImage": null, "publishedAt": "2020-04-26T08:49:02Z", "content": "Up NextBrad Pitt AKA Dr Fauci Takes On Donald Trump On Saturday Night Live; Finishes Off Saying, 'I'm Getting Fired'"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Joel Kurian", "title": "No government gave me any award; didnt get commercial films after Ramayan: Arun Govil - Republic World - Republic World", "description": "Arun Govil stated that no government, either central or state, gave him any award. The actor also said that he didn't get commercial films after 'Ramayan'.", "url": "https://www.republicworld.com/entertainment-news/television-news/ramayan-ram-actor-arun-govil-episode-sita-dd-time-films-awards-governm.html", "urlToImage": null, "publishedAt": "2020-04-26T08:42:02Z", "content": "One often sees artists achieving success in the initial phases of their careers, but failing to sustain it for a long time. The same had happened with Arun Govil, who is back in the news for the re-run of Ramayan. The actor, who played the role of Lord Ram in… [+2158 chars]"}, {"source": {"id": null, "name": "Indiaglitz.com"}, "author": "IndiaGlitz", "title": "Thala Ajith's personal request to fans regarding birthday celebrations - Tamil News - IndiaGlitz.com", "description": "May 1st is observed as the International Workers Day all around the world but to Ajith's fans numbering in millions its Thala Day", "url": "https://www.indiaglitz.com/thala-ajith-requests-fans-not-to-celebrate-birthday-due-to-coronavirus-pandemic-tamil-news-258981", "urlToImage": null, "publishedAt": "2020-04-26T08:16:58Z", "content": "May 1st is observed as the International Workers Day all around the world but to Ajith's fans numbering in millions its Thala Day which they celebrate with as much vigour on the the streets as they do on social media. With just four days to go Thala fans on t… [+1316 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "NewsClicks", "title": "Sunny Leone posts adorable video with Nisha, says she is a ‘lucky mommy’ to have a daughter who is ‘so... - NewsClicks", "description": "Actor Sunny Leone on Sunday posted an adorable video with her daughter Nisha. In the video, the mom and daughter pose for the digital camera with rose tiaras on their foreheads. Sharing the video, Sunny wrote: “Nisha is so so pretty!! I’m a lucky mommy! With …", "url": "https://www.hindustantimes.com/bollywood/sunny-leone-posts-adorable-video-with-nisha-says-she-is-a-lucky-mommy-to-have-a-daughter-who-is-so-so-pretty/story-aeT6RoohrY3hOa30WsS7LL.html", "urlToImage": null, "publishedAt": "2020-04-26T07:56:32Z", "content": "Actor Sunny Leone on Sunday posted an adorable video with her daughter Nisha. In the video, the mom and daughter pose for the digital camera with rose tiaras on their foreheads.\r\nSharing the video, Sunny wrote: Nisha is so so pretty!! Im a lucky mommy! With t… [+1901 chars]"}, {"source": {"id": null, "name": "Asianetnews.com"}, "author": null, "title": "Did you know Shah Rukh Khan cheated wife Gauri on their honeymoon? - Asianet News English", "description": "In an event, Shah Rukh Khan revealed a hilarious story from his honeymoon, where he tricked his wife Gauri", "url": "https://newsable.asianetnews.com/gallery/entertainment/did-you-know-shah-rukh-khan-cheated-wife-gauri-on-their-honeymoon--q9dx5f", "urlToImage": null, "publishedAt": "2020-04-26T07:37:19Z", "content": "\"This is my favourite picture...When I got married, I was very poor while Gauri was middle class, well to do. So like how usually everyone does, I had promised her that after we get married, I'll take her to Paris and show her the Eiffel Tower. But obviously,… [+374 chars]"}, {"source": {"id": null, "name": "Thenewsminute.com"}, "author": null, "title": "‘Love in the time of corona’: Prithviraj and Supriya complete 9 years of marriage - The News Minute", "description": "Prithiviraj and his wife Supriya have completed nine years of togetherness and are celebrating their wedding anniversary on Saturday. The actor has shared a special picture for his wife with the hashtag “Love In The Time Of Corona”.", "url": "https://www.thenewsminute.com/article/love-time-corona-prithviraj-and-supriya-complete-9-years-marriage-123331", "urlToImage": null, "publishedAt": "2020-04-26T07:06:15Z", "content": "Prithviraj's wife Supriya shared that this is the first time in these nine years that they are spending their wedding anniversary away from each other.Prithiviraj and his wife Supriya have completed nine years of togetherness and are celebrating their wedding… [+2206 chars]"}, {"source": {"id": null, "name": "Ibtimes.co.in"}, "author": "Tanvi Lad", "title": "'Do more movies than magazine covers', when Imran Khan criticized Sonam Kapoor - International Business Times, India Edition", "description": "Bollywood actor Imran Khan had openly taken a dig at Sonam Kapoor on national television. This definitely irked the leggy lass but she never reacted to the same.", "url": "https://www.ibtimes.co.in/do-more-movies-magazine-covers-when-imran-khan-criticized-sonam-kapoor-818439", "urlToImage": null, "publishedAt": "2020-04-26T06:26:43Z", "content": "Great validation for women in media: Sonam Kapoor on Veere Di Weddings success\r\nSonam Kapoor can never be untagged from being Bollywood's fashionista. But that's quite unfortunate that Sonam is widely known for her magnificent fashion sense rather than her ac… [+1388 chars]"}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": "Pinkvilla Desk", "title": "7 years of Aashiqui 2: Five reasons why Shraddha & Aditya's romantic drama still leaves an impact on our heart - PINKVILLA", "description": "As Aashiqui 2 starring Shraddha Kapoor and Aditya Roy Kapur completes 7 years, we would like to give you 5 reasons why this romantic drama still leaves an impact on the audience's heart.", "url": "https://www.pinkvilla.com/entertainment/news/7-years-aashiqui-2-five-reasons-why-shraddha-adityas-romantic-drama-still-leaves-impact-our-heart-527572", "urlToImage": null, "publishedAt": "2020-04-26T06:13:44Z", "content": null}, {"source": {"id": null, "name": "Indiaglitz.com"}, "author": "IndiaGlitz", "title": "Thalapathy Vijay's 'Master' confirmed release on Amazon Prime but... - Tamil News - IndiaGlitz.com", "description": "The past few days the Kollywood film industry is in a tussle after Suriya deciding to stream his next movie 'Ponmagal Vandhal' starring Jyothika on Amazon Prime foregoing theatrical release", "url": "https://www.indiaglitz.com/thalapathy-vijays-master-confirmed-release-on-amazon-prime-but-tamil-news-258975", "urlToImage": null, "publishedAt": "2020-04-26T05:48:01Z", "content": "The past few days the Kollywood film industry is in a tussle after Suriya deciding to stream his next movie 'Ponmagal Vandhal' starring Jyothika on Amazon Prime foregoing theatrical release. Theater owners are seeing red and are threatening to boycott the big… [+811 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Malaika Arora crashes Arjun Kapoor’s Instagram live, hilariously trolls him for ‘boring’ quarantine... - Hindustan Times", "description": "Arjun Kapoor’s girlfriend Malaika Arora made fun of his quarantine routine and sarcastically called it “very interesting”.", "url": "https://www.hindustantimes.com/bollywood/malaika-arora-crashes-arjun-kapoor-s-instagram-live-hilariously-trolls-him-for-boring-quarantine-routine/story-g5DKgeWOA2bA5GQSlR9EsL.html", "urlToImage": null, "publishedAt": "2020-04-26T05:44:55Z", "content": "Arjun Kapoor and Malaika Arora never miss a chance to pull each other’s leg, and it was no different on Saturday evening. She crashed her boyfriend’s Instagram live and poked fun at his daily routine during the lockdown.\r\nWith all shoots on hold due to the co… [+1678 chars]"}, {"source": {"id": null, "name": "Www.geo.tv"}, "author": "Web Desk", "title": "Zayn Malik and Gigi Hadid are spending quarantine together: See pictures - Geo News", "description": "Zayn Malik and Gigi Hadid have been spending their time in isolation together", "url": "https://www.geo.tv/latest/284996-zayn-malik-and-gigi-hadid-are-spending-quarantine-together-see-pictures", "urlToImage": null, "publishedAt": "2020-04-26T05:42:46Z", "content": "Zayn Malik and Gigi Hadid have been spending their time in isolation together, with a recent bunch of pictures from the supermodels 25th birthday proving the same.\r\nGigi recently turned 25 and celebrated her birthday in quarantine with her close family member… [+2232 chars]"}, {"source": {"id": null, "name": "Tellychakkar.com"}, "author": "Tellychakkar Team", "title": "This is how Sony TV’s Ishaaron Ishaaron Mein was supposed to END! - Tellychakkar", "description": "MUMBAI: The lockdown has already hit the TV industry!", "url": "https://www.tellychakkar.com/tv/tv-news/how-sony-tv-s-ishaaron-ishaaron-mein-was-supposed-end-200426", "urlToImage": null, "publishedAt": "2020-04-26T05:30:00Z", "content": "MUMBAI: The lockdown has already hit the TV industry!\r\nRecently, there was news about Sony TV discontinuing three of their shows namely, Beyhadh 2, Ishaaron Ishaaron Mein and Patiala Babes. Yes, the channel has axed the shows and it wont return post the lockd… [+1012 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Chris Pratt and Katherine Schwarzenegger are Expecting Their First Child Together - News18", "description": "Chris and Katherine wed in June last year and now they have revealed that they are expecting their first child together.", "url": "https://www.news18.com/news/movies/chris-pratt-and-katherine-schwarzenegger-are-expecting-their-first-child-together-2593055.html", "urlToImage": null, "publishedAt": "2020-04-26T05:19:26Z", "content": "Hollywood actor Chris Pratt and his partner, author Katherine Schwarzenegger are expecting their first child together. Katherine and Chris were seen riding bikes when her baby bump was visible and it became clear that she was pregnant with Chris' child. In an… [+829 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Karan Johar realises mistake after watching sarcastic videos on celebs, Amitabh Bachchan gives ‘breaking... - Hindustan Times", "description": "Top entertainment news: Karan Johar has apologised for sharing ‘insensitive’ posts during coronavirus crisis while Amitabh Bachchan on Saturday declared on social media that a bat had entered his home in Mumbai.", "url": "https://www.hindustantimes.com/bollywood/karan-johar-realises-mistake-after-sarcastic-videos-on-celebs-amitabh-bachchan-gives-breaking-news-from-jalsa/story-aydICNSMdMWh6XsbPfwLRM.html", "urlToImage": null, "publishedAt": "2020-04-26T05:15:02Z", "content": "Amitabh Bachchan has a crisis at home in Covid-19 times, says ‘Breaking news, a bat just entered my home’\r\nActor Amitabh Bachchan, who has been putting out motivational posts through out the coronavirus pandemic, felt the crisis up close and personal on Satur… [+2147 chars]"}, {"source": {"id": null, "name": "Bollywoodhungama.com"}, "author": "Bollywood Hungama", "title": "Sachin Tendulkar addresses Ayushmann Khurrana as Professor from Money Heist - Bollywood Hungama", "description": "Sachin Tendulkar addresses Ayushmann Khurrana as Professor from Money Heist . Latest Bollywood News, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News at Bollywood Hungama.com", "url": "https://www.bollywoodhungama.com/news/features/sachin-tendulkar-addresses-ayushmann-khurrana-professor-money-heist/", "urlToImage": null, "publishedAt": "2020-04-26T05:10:43Z", "content": "Now, cricket legend Sachin Tendulkar addressed the Andhadhun actor as the Professor in a tweet. Tendulkar was replying to Ayushmann Khurrana wishing him on his birthday. In his tweet, Sachin wrote, \"Thanks for your prayers &amp; support over the years, 'Profe… [+693 chars]"}, {"source": {"id": null, "name": "Indiaglitz.com"}, "author": "IndiaGlitz", "title": "WOW! Tamannaah takes up the 'Pillow challenge' effortlessly - Tamil News - IndiaGlitz.com", "description": "Tamannaah has surprised her fans by taking up this trending Pillow challenge as she shared a picture of herself wearing a white pillow.", "url": "https://www.indiaglitz.com/tamannaah-takes-up-the-pillow-challenge-effortlessly--tamil-news-258971", "urlToImage": null, "publishedAt": "2020-04-26T05:10:17Z", "content": "Amid the ongoing COVID-19 pandemic and lockdown, the latest challenge that's going viral on the internet is the 'Pillow Challenge' which is being aced by celebrities from across the globe. It seems like the Pillow Challenge has hit many of our Indian celebrit… [+812 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Priyanka Chopra Jonas wears a saree at home as she poses for a romantic picture with hubby Nick Jonas ami - Times of India", "description": "Lockdown has given ample time to our B-town celebrities to spend quality time with their loved ones. Every day we g", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/priyanka-chopra-jonas-wears-a-saree-at-home-as-she-poses-for-a-romantic-picture-with-hubby-nick-jonas-amid-the-lockdown/articleshow/75386442.cms", "urlToImage": null, "publishedAt": "2020-04-26T05:05:00Z", "content": null}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Deepika Padukone video chats with childhood best friends, shares an image of their life 50 years from... - Hindustan Times", "description": "Deepika Padukone, who has been in self isolation for more than a month with husband Ranveer Singh in Mumbai, bonded with her best friends over online chat and shared a screen shot.", "url": "https://www.hindustantimes.com/bollywood/deepika-padukone-video-chats-with-childhood-best-friends-shares-an-image-of-their-life-50-years-from-now/story-K2joi1UPzEVwtsYr42kimK.html", "urlToImage": null, "publishedAt": "2020-04-26T04:39:08Z", "content": "Actor Deepika Padukone is a family girl at heart and her latest Instagram stories only proves the point further. The actor shared a screen grab of her chat with her childhood best friends.\r\nThe chat screen grab showed Deepika with two of other friends - Sneha… [+2184 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Netflix has secret codes for hidden movies, shows: Here’s the whole list - Hindustan Times", "description": "Netflix has a lot of shows that might not show up on your home page thanks to what you watch normally. Here’s how you can unlock a bigger treasure trove of content", "url": "https://www.hindustantimes.com/tech/netflix-has-secret-codes-for-hidden-movies-shows-here-s-the-whole-list/story-yUcZuWvhZr2g7SgLNHqcNM.html", "urlToImage": null, "publishedAt": "2020-04-26T04:07:45Z", "content": "We are certain you have been watching a LOT of Netflix lately and you might have just exhausted everything you think this streaming platform has to offer. Don’t worry, we have news for you. \r\nNetflix has a whole list of secret codes that you can use to find m… [+7648 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Taimur Ali Khan bumps into father Saif Ali Khan’s interview yet again and it is just too cute for words - - Times of India", "description": "Kareena Kapoor Khan and Saif Ali Khan's son Taimur Ali Khan is one of the most loved star kids in Bollywood. He enj", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/taimur-ali-khan-bumps-into-father-saif-ali-khans-interview-yet-again-and-it-is-just-too-cute-for-words-watch/articleshow/75385828.cms", "urlToImage": null, "publishedAt": "2020-04-26T03:48:00Z", "content": null}, {"source": {"id": null, "name": "Whatculture.com"}, "author": "Jamie Kennedy", "title": "How Much Does WWE's New Signature Triple H Championship Cost? - WhatCulture", "description": "It's time to pay 'The Game'...", "url": "https://whatculture.com/wwe/how-much-does-wwes-new-signature-triple-h-championship-cost", "urlToImage": null, "publishedAt": "2020-04-26T03:44:51Z", "content": "WWE.com\r\nWWE Shop has just released a brand new signature championship belt to commemorate Triple H's 25th Anniversary celebrations.\r\nThe replica title, which will be available for purchase on 7 May, has Attitude era style and comes with a personalised leathe… [+858 chars]"}, {"source": {"id": null, "name": "Iwmbuzz.com"}, "author": "Editorial Team", "title": "Unseen Pictures Of Mohsin Khan And Shaheer Sheikh You Must Check Out - IWMBuzz", "description": "Yes! Mohsin Khan and Shaheer Sheikh’s UNSEEN pictures are here!", "url": "https://www.iwmbuzz.com/television/photos/unseen-pictures-mohsin-khan-shaheer-sheikh-must-check/2020/04/26", "urlToImage": null, "publishedAt": "2020-04-26T03:07:58Z", "content": "Dont think that this handsome hunk got fame only because of Yeh Rishta Kya Kehlata Hai. He was more popular even before stepping his shoes as Kartik Goenka in fame daily soap yeh Rishta kya Kehlata hai. His sexy charm, cute smile, clean shaved face, and amazi… [+1058 chars]"}, {"source": {"id": null, "name": "Bollywoodhungama.com"}, "author": "Bollywood Hungama", "title": "Shah Rukh Khan, Gauri Khan and son Aryan Khan attend Kajols Mehandi ceremony in this priceless throwback - Bollywood Hungama", "description": "Shah Rukh Khan, Gauri Khan and son Aryan Khan attend Kajol’s Mehandi ceremony in this priceless throwback. Latest Bollywood News, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News at Bollywood Hungama.com", "url": "https://www.bollywoodhungama.com/news/features/shah-rukh-khan-gauri-khan-son-aryan-khan-attend-kajols-mehandi-ceremony-priceless-throwback/", "urlToImage": null, "publishedAt": "2020-04-26T03:04:41Z", "content": "We just stumbled upon a million-dollar throwback photo, from Kajol's pre-wedding ceremonies. The photo has SRK, wife Gauri Khan and their eldest child Aryan Khan in attendance. Aryan, who must not be over a few years old in the photo, is tucked in his father'… [+509 chars]"}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Eric Robinette", "title": "People Can't Get Over How Weird Tony Stark and Wanda's Relationship Is in the MCU - Showbiz Cheat Sheet", "description": "Trying to recall the nature of the relationship between Iron Man and Scarlet Witch in the Marvel Cinematic Universe is no easy task.", "url": "https://www.cheatsheet.com/entertainment/people-cant-get-over-how-weird-tony-stark-and-wandas-relationship-is-in-the-mcu.html/", "urlToImage": null, "publishedAt": "2020-04-26T02:45:28Z", "content": "Trying to recall the relationship between Iron Man and Scarlet Witch in the Marvel Cinematic Universe is no easy task. That’s not because their relationship is so strange – it’s that they barely have one. \r\nThe two characters share the screen for probably les… [+3882 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "Antara Kashyap", "title": "Karan Johar Apologises Over Posts Showcasing Privileges of Celebrities During Lockdown - News18", "description": "Karan Johar was recently moved by a viral video on  coronavirus called 'Thank You Celebrities' which made him apologise about some of his posts that might be seen an insensitive to many struggling in these times.", "url": "https://www.news18.com/news/movies/karan-johar-apologises-over-posts-showcasing-privileges-of-celebrities-during-coronavirus-lockdown-2592913.html", "urlToImage": null, "publishedAt": "2020-04-26T02:40:37Z", "content": "Karan Johar might have been entertaining fans amid the Coronavirus lockdown with the series \"Lockdown With The Johars,\" where his children poke fun at him, but one thing that is glaring in his post is that he is comfortable at a time when millions of people i… [+2769 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Dr Prem Kumar Sharma & Manisha Koushik", "title": "Horoscope Today: Astrological prediction for April 26, what’s in store for Aries, Leo, Virgo, Sagittarius... - Hindustan Times", "description": "Horoscope Today: Are the stars lined up in your favour? Find out the astrological prediction for Aries, Leo, Virgo, Sagittarius and other zodiac signs for April 26.", "url": "https://www.hindustantimes.com/more-lifestyle/horoscope-today-astrological-prediction-for-april-26-what-s-in-store-for-aries-leo-virgo-sagittarius-and-other-zodiac-signs/story-UZqIshfDA2z09RcKOo28hJ.html", "urlToImage": null, "publishedAt": "2020-04-26T02:39:30Z", "content": "The 12 zodiac signs have their own personality traits and characteristics. Horoscopes give us an insight into our daily life and how it will fare for all of us. Read on to know whether the odds will be in your favour today:\r\n*Aries (March 21-April 20) You wil… [+8191 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Varun-Natasha’s engagement announcement to Police complaint against Kangana Ranaut – here are the newsmakers of the week - Times of India", "description": "Bollywood celebrities are making sure to keep fans entertained through lockdown. From Kartik Aaryan posting videos on social media to Ileana D’Cruz winning the internet with her response to a fan – stars are hitting headlines for all things interesting. And a…", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/varun-natashas-engagement-announcement-to-police-complaint-against-kangana-ranaut-here-are-the-newsmakers-of-the-week/photostory/75383226.cms", "urlToImage": null, "publishedAt": "2020-04-26T02:30:00Z", "content": "Kangana Ranaut hit headlines this week following a police complaint against her. According to IANS, advocate Ali Kaashif Khan Deshmukh has filed a complaint against Kangana for allegedly referring to people of a particular community as \"terrorist\" and coming … [+341 chars]"}, {"source": {"id": null, "name": "Vogue.in"}, "author": "Nupur Sarvaiya", "title": "Aishwarya Rai Bachchan’s pink lehenga from her mehandi is for brides who love soothing hues - VOGUE India", "description": "Aishwarya Rai Bachchan chose a romantic pink lehenga for her pre-wedding celebrations back in 2007. Here's how you can get the look", "url": "https://www.vogue.in/wedding-wardrobe/collection/aishwarya-rai-bachchan-pink-mehandi-lehenga-neeta-lulla-long-blouse-floral-maangtikka-necklace-earrings-abhishek-bachchan/", "urlToImage": null, "publishedAt": "2020-04-26T01:12:38Z", "content": "For her wedding with Abhishek Bachchan back in April 2007, Aishwarya Rai Bachchan served up a good mix of traditional and contemporary bridal looks. While the star dressed in a pastel blue Abu Jani Sandeep Khosla lehenga for her sangeet, a regal gold silk sar… [+1517 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Alok Nayak", "title": "Former WWE Superstar Accuses CM Punk of Stealing His Finisher - Essentially Sports", "description": "GTS( Go to Sleep) a finishing maneuver that CM Punk made famous. However, it was not invented by Punk as per former WWE supertstar, KENTA", "url": "https://www.essentiallysports.com/wwe-news-former-wwe-superstar-accuses-cm-punk-of-stealing-his-finisher/", "urlToImage": null, "publishedAt": "2020-04-26T00:44:00Z", "content": "CM Punk has been away from the WWE ring for years now. However, fans in the arena never miss a chance to appreciate the Voice of the voiceless by chanting his name. CM Punk brought a revolution in WWE when he went against the Bossman, Vince McMahon, and start… [+1665 chars]"}, {"source": {"id": null, "name": "Dawn.com"}, "author": "Images Staff", "title": "Imran Khan shares why the youth needs to watch Dirilis Ertugul - DAWN.com", "description": "The dubbed version of the Turkish drama is airing on PTV as per the Prime Minister's request.", "url": "https://images.dawn.com/news/1185146", "urlToImage": null, "publishedAt": "2020-04-26T00:09:51Z", "content": "Turkish dramas have always been rather popular here but it was a personal recommendation from Imran Khan that put Dirili Erturul on the top of everyone's must-watch list.\r\nIn fact, it was the Prime Minister's request that led to the drama being dubbed in Urdu… [+478 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Alok Nayak", "title": "“Top Five at Worst”- WWE Hall of Famer Makes a Huge Claim About John Cena - Essentially Sports", "description": "After winning WWE champion for record 16 times, should John Cena be on the Mt. Rushmore of WWE? Jim Ross gives his verdict", "url": "https://www.essentiallysports.com/wwe-news-top-five-at-worst-wwe-hall-of-famer-makes-a-huge-claim-about-john-cena/", "urlToImage": null, "publishedAt": "2020-04-25T23:23:00Z", "content": "When you are talking about the greatest pro wrestlers to ever step into the WWE ring the name John Cena comes to the table. Making his debut in the attitude era, John Cena instantly became a fan favorite thanks to his charismatic persona and his in-ring talen… [+1856 chars]"}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": "Pinkvilla Desk", "title": "Shaheer Sheikh urges everyone to pray at home during Ramzan with the sweetest photo ever; Check it out - PINKVILLA", "description": "Shaheer Sheikh shared a post on social media urging everyone to pray from home during Ramzan. Check out the post here.", "url": "https://www.pinkvilla.com/tv/serial-updates/shaheer-sheikh-urges-everyone-pray-home-during-ramzan-sweetest-photo-ever-check-it-out-527556", "urlToImage": null, "publishedAt": "2020-04-25T21:45:16Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Vampire Diaries: Why Nina Dobrev Left After Season 6 - Screen Rant", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiSmh0dHBzOi8vc2NyZWVucmFudC5jb20vdmFtcGlyZS1kaWFyaWVzLXNob3ctbmluYS1kb2JyZXYtZWxlbmEtZXhpdC1yZWFzb24v0gFOaHR0cHM6Ly9zY3JlZW5yYW50LmNvbS92YW1waXJlLWRpYXJpZXMtc2hvdy1uaW5hLWRvYnJldi1lbGVuYS1leGl0LXJlYXNvbi9hbXAv?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T19:15:42Z", "content": null}, {"source": {"id": null, "name": "Abplive.com"}, "author": "ABP News Bureau", "title": "Did 'Nach Baliye 9' Winners END Their Friendship With Arhaan Because Of Rashami? - ABP Live", "description": "According to a recent grapevine, Prince and Yuvika have maintained a distance from Arhaan after they got to know about his reality.", "url": "https://news.abplive.com/entertainment/television/did-prince-narula-yuvika-chaudhary-end-their-friendship-with-arhaan-khan-because-of-rashami-desai-1206040", "urlToImage": null, "publishedAt": "2020-04-25T18:48:58Z", "content": "New Delhi: Salman Khans Bigg Boss 13 managed to become the talk of the town throughout its four-and-a-half month journey. Although, the popular reality show has ended two months back, the BB 13 contestants continue to remain in headlines. Small screens Tapasy… [+2043 chars]"}, {"source": {"id": null, "name": "Telugucinema.com"}, "author": "tc editor", "title": "Pic: Naga Chaitanya's quarantine look - Telugu Cinema", "description": "Naga Chaitanya and his wife Samantha have been kept themselves during this lockdown period. They have cut down posts on social media as well. After being silent on social media for more than two weeks, Samantha is now sharing a pic or two.  She now posted a n…", "url": "https://www.telugucinema.com/news/pic-naga-chaitanyas-quarantine-look", "urlToImage": null, "publishedAt": "2020-04-25T18:33:09Z", "content": "Naga Chaitanya and his wife Samantha have been kept themselves during this lockdown period. They have cut down posts on social media as well. After being silent on social media for more than two weeks, Samantha is now sharing a pic or two. \r\nShe now posted a … [+642 chars]"}, {"source": {"id": null, "name": "Tecake.com"}, "author": null, "title": "Kylie Jenner no makeup photo is going viral! You won’t recognise her - The TeCake", "description": "Amid Coronavirus pandemic that has forced people to stay in lockdown in their homes, many celebrities have chosen to go with no makeup look. Celebrities", "url": "https://tecake.com/news/kylie-jenner-no-makeup-photo-is-going-viral-you-wont-recognise-her-292533.html", "urlToImage": null, "publishedAt": "2020-04-25T18:23:31Z", "content": "Amid Coronavirus pandemic that has forced people to stay in lockdown in their homes, many celebrities have chosen to go with no makeup look. Celebrities are sharing their photos of bare face and oh boy, they look a lot different without make. It would take yo… [+2682 chars]"}, {"source": {"id": null, "name": "Digitalspy.com"}, "author": "Dan Seddon", "title": "Spider-Man star is hosting Marvel-themed Instagram quiz - digitalspy.com", "description": "Get involved via Instagram next week.", "url": "https://www.digitalspy.com/movies/a32276017/spider-man-tom-holland-marvel-virtual-quiz/", "urlToImage": null, "publishedAt": "2020-04-25T16:49:00Z", "content": "Spider-Manactor Tom Holland will be hosting a Marvel-themed quiz on Instagram during the coronavirus lockdown.\r\nIn conjunction with The Brothers Trust, which was set up by Holland's family to support various charities, this virtual quiz will take place next W… [+1432 chars]"}, {"source": {"id": null, "name": "Koimoi.com"}, "author": null, "title": "Avengers: Endgame: Memes Ft. Iron Man, Captain America, Thanos & Others Will Make You Go ROFL On Film’s 1st Anniversary! - Koimoi", "description": "A year ago, Avengers: Endgame released in theatres and it turned out to be the biggest blockbuster worldwide. It was the last time we", "url": "https://www.koimoi.com/hollywood-2/avengers-endgame-memes-iron-man-captain-america-thanos/", "urlToImage": null, "publishedAt": "2020-04-25T16:17:55Z", "content": "Avengers: Endgame: Memes Ft. Iron Man, Captain America, Thanos &amp; Others Will Make You Go ROFL On Film’s 1st Anniversary!\r\nA year ago, Avengers: Endgame released in theatres and it turned out to be the biggest blockbuster worldwide. It was the last time we… [+2963 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Amir Khollam", "title": "How many devices can use Amazon Prime Video on a single account? - Republic World - Republic World", "description": "How many devices can use Amazon Prime Video on a single account? has reportedly been a frequently searched question on the internet. Read to know the answer.", "url": "https://www.republicworld.com/technology-news/apps/how-many-devices-can-use-amazon-prime-video-on-a-single-account.html", "urlToImage": null, "publishedAt": "2020-04-25T15:08:00Z", "content": "Amazon Prime Video is one of the most famous streaming platforms in India and across the globe. As per reports, Amazon Prime Video itself has a subscriber base of over 100 million users. The video streaming platform has a number of movies and shows from vario… [+1943 chars]"}, {"source": {"id": null, "name": "Tellychakkar.com"}, "author": "Tellychakkar Team", "title": "Did Kavita Kaushik just take a dig at Arnab Goswami? - Tellychakkar", "description": "MUMBAI: Journalist and anchor Arnab Goswami recently claimed that some goons attacked his car when he was travelling back home.", "url": "https://www.tellychakkar.com/tv/tv-news/did-kavita-kaushik-just-take-dig-arnab-goswami-200425", "urlToImage": null, "publishedAt": "2020-04-25T13:53:00Z", "content": "MUMBAI: Journalist and anchor Arnab Goswami recently claimed that some goons attacked his car when he was travelling back home. He revealed that he was with his wife when the incident took place. He later took to social media to post a video calling out a pol… [+1274 chars]"}, {"source": {"id": null, "name": "Iwmbuzz.com"}, "author": "Editorial Team", "title": "OMG: No theatre release for Akshay Kumar and Kiara Advani starrer Laxmmi Bomb? - IWMBuzz", "description": "IWMBuzz tells you about the possible OTT release of Laxmmi Bomb. Read the story for more details", "url": "https://www.iwmbuzz.com/movies/news-movies/omg-no-theatre-release-akshay-kumar-kiara-advani-starrer-laxmmi-bomb/2020/04/25", "urlToImage": null, "publishedAt": "2020-04-25T13:30:38Z", "content": "Akshay Kumar and Kiara Advani’s Laxmmi Bomb happened to be one of the biggest releases that Akki and Kiara were looking forward to.\r\nHowever seems like due to the Covid-19 pandemic, things have taken a hit. As per media reports, Laxmmi Bomb might not have a t… [+213 chars]"}, {"source": {"id": null, "name": "Desimartini.com"}, "author": "Sandip Pal", "title": "5 Times Extraction Star Randeep Hooda Experimented With Roles And Emerged A Winner - Desimartini", "description": "Randeep Hooda is surely one of the most underrated actors of Bollywood. The actor lets his work do the talking and is not much bothered about anything else. We don’t quite see Hooda in many advertisem", "url": "https://www.desimartini.com/news/martini-shots/trending/5-times-extraction-star-randeep-hooda-experimented-with-roles-and-emerged-a-winner-article140801.htm", "urlToImage": null, "publishedAt": "2020-04-25T13:05:28Z", "content": "Randeep Hooda is surely one of the most underrated actors of Bollywood. The actor lets his work do the talking and is not much bothered about anything else. We don’t quite see Hooda in many advertisements which imply he steers clear of promoting products be i… [+4048 chars]"}, {"source": {"id": null, "name": "Bollywoodhungama.com"}, "author": "Bollywood Hungama", "title": "Disha Patani says she hates pampering herself in a salon - Bollywood Hungama", "description": "Disha Patani says she hates pampering herself in a salon . Latest Bollywood News, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News at Bollywood Hungama.com", "url": "https://www.bollywoodhungama.com/news/features/disha-patani-says-hates-pampering-salon/", "urlToImage": null, "publishedAt": "2020-04-25T12:31:40Z", "content": "Talking to a daily, Disha said that she is very lazy when it comes to beauty treatments. However, with the lockdown in place, the actress is utilising the time doing facials. She said that she has been using face scrubs and masks. The Baaghi 2 actress said th… [+272 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Uday Bhatia", "title": "Film review: ‘Extraction’ on Netflix is a joyless slab of action cinema - Livemint", "description": "Chris Hemsworth lays waste to Dhaka in order to save an Indian drug lord’s kidnapped son in this Netflix film written by Joe Russo", "url": "https://www.livemint.com/mint-lounge/features/film-review-extraction-on-netflix-is-a-joyless-slab-of-action-cinema-11587817372674.html", "urlToImage": null, "publishedAt": "2020-04-25T12:29:38Z", "content": "Sometimes the smallest detail can trip up your experience of a movie. Forty minutes into Extraction, Tyler (Chris Hemsworth) and Ovi (Rudhraksh Jaiswal) are dodging gunmen in a Dhaka building. They break into an apartment, and the famous intro to Didi Tera De… [+3823 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "IANS", "title": "Suriya’s ‘Soorarai Pottru’ could be banned, if Jyothika’s ‘Pon Magal Vandhal’ releases directly on OTT - The Hindu", "description": "Tamil Nadu Theatre And Multiplex Owners’ Association respond to expected release of Jyothika’s film on Amazon Prime next month", "url": "https://www.thehindu.com/entertainment/movies/suriyas-soorarai-pottru-could-be-banned-if-jyothikas-pon-magal-vandhal-releases-directly-on-ott/article31432944.ece", "urlToImage": null, "publishedAt": "2020-04-25T12:25:03Z", "content": "The Tamil Nadu Theatre And Multiplex Owners Association have threatened to ban films starring Suriya, as well as the films produced by his production company 2D films. The decision comes after the news that the film Pon Magal Vandhal, produced by Suriya and s… [+1831 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Did you know Mahabharat's Firoz Khan changed his real name to 'Arjun' for his on-screen character? - Times of India", "description": "Amidst gloomy times of the lockdown, DD's decision to bring back mythological shows Mahabharat and Ramayan proved t", "url": "https://timesofindia.indiatimes.com/tv/news/hindi/did-you-know-mahabharats-firoz-khan-changed-his-real-name-to-arjun-for-his-on-screen-character/articleshow/75376447.cms", "urlToImage": null, "publishedAt": "2020-04-25T11:24:00Z", "content": null}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Tom Cruise will be 60 years old by the time Mission Impossible 8 is released, will have played Ethan... - Hindustan Times", "description": "Tom Cruise will be 60 years old, and will have played Ethan Hunt for over a quarter-of-a-century by the time the now delayed Mission: Impossible 8 hits theatres.", "url": "https://www.hindustantimes.com/hollywood/tom-cruise-will-be-60-years-old-by-the-time-mission-impossible-8-is-released-will-have-played-ethan-hunt-for-over-quarter-century/story-y8wlOd2s6rcRKkNXLPTdOJ.html", "urlToImage": null, "publishedAt": "2020-04-25T11:16:00Z", "content": "The theatrical release of Mission: Impossible 7 and Mission: Impossible 8 has been delayed by Paramount, which means that when the eighth film opens in 2022, Tom Cruise will be 60 years old. The seventh instalment in the franchise was initially set to hit the… [+1328 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Malayalam actor Ravi Vallathol dies at 67 in Thiruvananthapuram - India Today", "description": "Film and television actor Ravi Vallathol died of age-related ailments at his residence in Thiruvananthapuram, Kerala.", "url": "https://www.indiatoday.in/movies/regional-cinema/story/malayalam-actor-ravi-vallathol-dies-at-67-in-thiruvananthapuram-1670968-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T10:31:01Z", "content": "Malayalam actor Ravi Vallathol, aged 67, breathed his last at his residence in Thiruvananthapuram, Kerala. Reportedly, he was unwell for a couple of years and had succumbed to age-related illness today (April 25).\r\nThe actor had stopped doing films and Malaya… [+1359 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Hindustan Times", "title": "Kanye West officially now a billionaire: Forbes - Hindustan Times", "description": "Forbes magazine has finally included Kanye West on their list of billionaires of the world. The magazine said West has been pressing them to be listed for years.", "url": "https://www.hindustantimes.com/music/kanye-west-officially-now-a-billionaire-forbes/story-RrYr70DZ4f0uj9m6UF4MdJ.html", "urlToImage": null, "publishedAt": "2020-04-25T10:26:06Z", "content": "Rapper Kanye West is now a billionaire thanks largely to the basketball shoes bearing his name that he developed with Adidas, Forbes magazine said Friday. The rough figure of the wealth of Kim Kardashian’s hubby is $1.3 billion, the magazine said in announcin… [+1011 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Sussanne Khan Shares Adorable Family Pic With Hrithik Roshan And Their Kids; See Here - News18", "description": "Sussanne Khan took to her social media to share a candid picture of her ex-husband Hrithik Roshan with their sons Hrehaan and Hridhaan.", "url": "https://www.news18.com/news/movies/sussanne-khan-shares-adorable-family-pic-with-hrithik-roshan-and-their-kids-see-here-2592287.html", "urlToImage": null, "publishedAt": "2020-04-25T09:35:56Z", "content": "Ever since designer Sussanne Khan moved in with ex-husband Hrithik Roshan, to be with their kids during quarantine, her online family has been keenly expecting a glimpse of them together on her feed.\r\nRecently, Sussane took to her social media to share a cand… [+1063 chars]"}, {"source": {"id": null, "name": "Soompi.com"}, "author": "jeeelim5", "title": "Kim Go Eun And Lee Min Ho Are Closer Than Ever Before In “The King: Eternal Monarch” - soompi", "description": "SBS’s Friday-Saturday drama “The King: Eternal Monarch” has shared new stills of Kim Go Eun and Lee Min Ho closer than ever before. “The King: Eternal Monarch” tells the story of Emperor Lee Gon (Lee Min Ho) and detective Jung Tae Eul (Kim Go Eun), who live i…", "url": "https://www.soompi.com/article/1396589wpp/kim-go-eun-and-lee-min-ho-are-closer-than-ever-before-in-the-king-eternal-monarch", "urlToImage": null, "publishedAt": "2020-04-25T09:03:26Z", "content": "SBSs Friday-Saturday drama The King: Eternal Monarch has shared new stills of Kim Go Eun and Lee Min Ho closer than ever before.\r\nThe King: Eternal Monarch tells the story of Emperor Lee Gon (Lee Min Ho) and detective Jung Tae Eul (Kim Go Eun), who live in pa… [+1251 chars]"}, {"source": {"id": null, "name": "Tellychakkar.com"}, "author": "Tellychakkar Team", "title": "Mahira Sharma reveals why she is not in touch with Sidharth Shukla - Tellychakkar", "description": "Mahira Sharma has her own reason to not be in contact with Sidharth Shukla.", "url": "https://www.tellychakkar.com/tv/tv-news/mahira-sharma-reveals-why-she-not-touch-sidharth-shukla-200425", "urlToImage": null, "publishedAt": "2020-04-25T08:40:00Z", "content": "MUMBAI: Mahira Sharma and Paras Chhabra grabbed a lot of attention for their growing closeness in the Bigg Boss 13 house.\r\nWhile both have maintained 'just good friends' status, fans are constantly linking them.\r\nWe all know Sidharth Shukla and Paras Chhabra … [+603 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Thahar Ja: Ajay Devgn gets teary-eyed as he urges people to stay home with new song, son Yug makes cameo.... - Hindustan Times", "description": "Ajay Devgn has released a new song titled Thahar Ja to encourage his fans to stay home amid coronavirus outbreak.", "url": "https://www.hindustantimes.com/bollywood/thahar-ja-ajay-devgn-gets-teary-eyed-as-he-urges-people-to-stay-home-with-new-song-son-yug-makes-cameo-watch/story-72ZuV33NjqBAq28PJaaPXN.html", "urlToImage": null, "publishedAt": "2020-04-25T08:14:04Z", "content": "Ajay Devgn has released a new song titled Thahar Ja through which he makes an emotional appeal to his fans to stay at home amid coronavirus lockdown. His son Yug also makes an appearance at the end of the music video. \r\nProduced by Ajay, the song has been sun… [+1800 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Pushpa: Bobby Simhaa replaces Vijay Sethupathi in Allu Arjun's film? - India Today", "description": "Bobby Simhaa is said to have replaced Vijay Sethupathi in Allu Arjun's upcoming film, Pushpa, directed by Sukumar.", "url": "https://www.indiatoday.in/movies/regional-cinema/story/pushpa-bobby-simhaa-replaces-vijay-sethupathi-in-allu-arjun-s-film-1670901-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T06:34:15Z", "content": "After the mammoth success of Ala Vaikuntapurramloo, actor Allu Arjun is thrilled about his upcoming film, Pushpa. Directed by Sukumar, the film is based on the lives of red sandalwood smugglers. Earlier, Vijay Sethupathi was rumoured to play the antagonist in… [+1371 chars]"}, {"source": {"id": null, "name": "Scroll.in"}, "author": "Nandini Ramnath", "title": "‘Hundred’ review: Lara Dutta and Rinku Rajguru steer a fun run to the crease - Scroll.in", "description": "In the Disney+ Hotstar web series, Lara Dutta is a police officer who uses Rinku Rajguru’s terminally ill government employee to save her job.", "url": "https://scroll.in/reel/960181/hundred-review-lara-dutta-and-rinku-rajguru-steer-a-fun-run-to-the-crease", "urlToImage": null, "publishedAt": "2020-04-25T06:34:00Z", "content": "Hundred is a web series that revolves around two women. One is going to die. The other is barely surviving. But dont you ever make the mistake of feeling sorry for Nethra or Saumya. \r\nNethra (Rinku Rajguru) has recently learnt that she has a galloping brain t… [+5002 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18.com", "title": "Sobhita Dhulipala Issues Clarification After Being Accused of Lying About 'Self-Clicked' Cover - News18", "description": "Sobhita's statement comes after a series of her behind-the-scenes pictures from the shoot were surfaced online.", "url": "https://www.news18.com/news/lifestyle/sobhita-dhulipala-releases-statement-after-being-accused-of-lying-about-self-clicked-cover-2591861.html", "urlToImage": null, "publishedAt": "2020-04-25T02:46:09Z", "content": "Actress Sobhita Dhulipala has released a statement regarding her \"self-timed\" magazine cover after being accused of lying about clicking them by herself.\r\nSobhita's statement comes after a series of her behind-the-scenes pictures from her Cosmopolitan magazin… [+2087 chars]"}]}