{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Irrfan's mother Saeeda Begum dies in Jaipur - India Today", "description": "Actor Irrfan's mother Saeeda Begum died due to natural causes in Jaipur.", "url": "https://www.indiatoday.in/movies/celebrities/story/irrfan-s-mother-saeeda-begum-dies-in-jaipur-1671060-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T14:25:02Z", "content": "Irrfan's mother Saeeda Begum took her last breath on Saturday (April 25) morning. According to a report in ANI, Saeeda was unwell for a long time and died due to natural causes. She resided at the Beniwal Kanta Krishna Colony in Jaipur.\r\nSaeeda belongs to a N… [+1221 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Suniel Shetty says Dhadkan sequel should star his and Akshay Kumar's sons, Ahan and Aarav - Hindustan Times", "description": "Suniel Shetty says he’s pitched the idea that the Dhadkan sequel should star his and Akshay Kumar’s sons, Ahan and Aarav, to the producer.", "url": "https://www.hindustantimes.com/bollywood/suniel-shetty-says-dhadkan-sequel-should-star-his-and-akshay-kumar-s-sons-ahan-and-aarav/story-otPBbTUVjvwepoDM8byDYN.html", "urlToImage": null, "publishedAt": "2020-04-25T13:57:38Z", "content": "Actor Suniel Shetty feels that both him and Akshay Kumar are too old to appear in a sequel to their 2000 film, Dhadkan, but that their sons, Ahan and Aarav, could take on the mantle. Dhadkan, directed by Dharmesh Darshan, also starred Shilpa Shetty.\r\nSuniel t… [+1192 chars]"}, {"source": {"id": null, "name": "Tellychakkar.com"}, "author": "Tellychakkar Team", "title": "Did Kavita Kaushik just take a dig at Arnab Goswami? - Tellychakkar", "description": "MUMBAI: Journalist and anchor Arnab Goswami recently claimed that some goons attacked his car when he was travelling back home.", "url": "https://www.tellychakkar.com/tv/tv-news/did-kavita-kaushik-just-take-dig-arnab-goswami-200425", "urlToImage": null, "publishedAt": "2020-04-25T13:53:00Z", "content": "MUMBAI: Journalist and anchor Arnab Goswami recently claimed that some goons attacked his car when he was travelling back home. He revealed that he was with his wife when the incident took place. He later took to social media to post a video calling out a pol… [+1274 chars]"}, {"source": {"id": null, "name": "Telugucinema.com"}, "author": "tc editor", "title": "Sleeping 9 hours daily during the lockdown: Vijay Deverakonda - Telugu Cinema", "description": "Handsome hunk Vijay Deverakonda revealed that he’s sleeping nine and half hours daily on an average during this lockdown period as opposed to a six-hour sleep routine. He made a video of his daily routine during this period. Taking a cue from director Siva Ko…", "url": "https://www.telugucinema.com/news/sleeping-9-hours-daily-during-lockdown-vijay-deverakonda", "urlToImage": null, "publishedAt": "2020-04-25T13:33:29Z", "content": "Handsome hunk Vijay Deverakonda revealed that hes sleeping nine and half hours daily on an average during this lockdown period as opposed to a six-hour sleep routine. He made a video of his daily routine during this period.\r\nTaking a cue from director Siva Ko… [+621 chars]"}, {"source": {"id": null, "name": "Versionweekly.com"}, "author": "Lavanya", "title": "Corona Special Songs released by Tollywood, Bollywood Celebrities and Singers to spread awareness on Corona Virus - Version Weekly", "description": "Corona Special Songs: During this 2020 Pandemic, everyone should spread some awareness about Coronavirus and educate other people to Stay Home & Stay Safe. Our favouirte Bollywood & Tollywood celebrities and singers dedicated some special", "url": "https://versionweekly.com/news/corona-special-songs-released-by-tollywood-bollywood-celebrities-and-singers-to-spread-awareness-on-corona-virus/", "urlToImage": null, "publishedAt": "2020-04-25T13:29:00Z", "content": "Corona Special Songs: During this 2020 Pandemic, everyone should spread some awareness about Coronavirus and educate other people to Stay Home &amp; Stay Safe. Our favouirte Bollywood &amp; Tollywood celebrities and singers dedicated some special corona songs… [+3657 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "‘Triple H is a total winner,’ Donald Trump wishes ‘Cerebral Assasin’ on his 25th WWE anniversary - Hindustan Times", "description": "Trump has a well-documented history with WWE. He appeared on WWE television for several weeks to hype up the “The Battle of the Billionaires” that took place at WrestleMania 23.", "url": "https://www.hindustantimes.com/other-sports/triple-h-is-a-total-winner-donald-trump-wishes-cerebral-assasin-on-his-25th-wwe-anniversary/story-IpZS6GFX0XGDgiOj4wh7UP.html", "urlToImage": null, "publishedAt": "2020-04-25T13:07:00Z", "content": "Donald Trump has been a friend of WWE Chairman Vince McMahon for several years and even appeared in a storyline at WWE WrestleMania 23. Trump has a well-documented history with WWE, he appeared on WWE television for several weeks to hype up the “The Battle of… [+2109 chars]"}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": "twinklekhanna", "title": "When Janhvi Kapoor and Khushi Kapoor’s offbeat yet stylish looks stole the show on the red carpet - PINKVILLA", "description": "Janhvi Kapoor and Khushi Kapoor have always rocked the red carpet with their style. In a throwback photo, both Janhvi and Khushi prove why they are the style icons of Gen-Y. Check it out.", "url": "https://www.pinkvilla.com/entertainment/news/when-janhvi-kapoor-and-khushi-kapoor-s-offbeat-yet-stylish-looks-stole-show-red-carpet-527471", "urlToImage": null, "publishedAt": "2020-04-25T13:05:39Z", "content": null}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Karan Johar Wants To Cry After Being Called An Elephant By Daughter Roohi, Watch Video - News18", "description": "Karan Johar filmed a video and shared with his online family where he is playing a game with his toddlers.", "url": "https://www.news18.com/news/movies/karan-johar-wants-to-cry-after-being-called-an-elephant-by-daughter-roohi-watch-video-2592577.html", "urlToImage": null, "publishedAt": "2020-04-25T13:02:52Z", "content": "Filmmaker Karan Johar came back with the second season of Lockdown with Johars after the first got exceptionally admired by the viewers. The Season 2 along with his kids, Yash and Roohi are now rolling in full swing.\r\nKaran filmed a video and shared with his … [+1294 chars]"}, {"source": {"id": null, "name": "Khaleejtimes.com"}, "author": "IANS", "title": "Popular Indian actor passes away at his residence - wknd.", "description": "Popular Malayalam TV serial actor Ravi Vallathol passed away at his residence, in Thiruvananthapuram on Saturday. He was 67 and is survived ...", "url": "https://www.khaleejtimes.com/citytimes/south-stars/popular-indian-actor-passes-away-at-his-residence", "urlToImage": null, "publishedAt": "2020-04-25T12:58:38Z", "content": "Popular Malayalam TV serial actor Ravi Vallathol passed away at his residence, in Thiruvananthapuram on Saturday. He was 67 and is survived by his wife.\r\nThough he began in the Malayalam film industry as a lyricist and then as an actor, he was a favourite amo… [+419 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Salman Khan looks suave and handsome sporting a beard in THIS latest picture - Times of India", "description": "Salman Khan is currently spending the quarantine period at his farmhouse in Panvel. The actor is spending time with", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/salman-khan-looks-suave-and-handsome-sporting-a-beard-in-this-latest-picture/articleshow/75378474.cms", "urlToImage": null, "publishedAt": "2020-04-25T12:53:00Z", "content": null}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "Bollywood News: Sajid Nadiadwala`s wife Warda opens up on his former wife and actress Divya Bharti`s death... - Zee News", "description": "Divya Bharti married filmmaker Sajid Nadiadwala in 1992 and their wedding was a private affair.", "url": "https://zeenews.india.com/people/bollywood-news-sajid-nadiadwalas-wife-warda-opens-up-on-his-former-wife-and-actress-divya-bhartis-death-and-life-afterwards-2278950.html", "urlToImage": null, "publishedAt": "2020-04-25T12:51:37Z", "content": "New Delhi: Actress Divya Bharti was all of 19 when she died under mysterious circumstances, reportedly falling from her apartment balcony in Mumbai. Her death sent shock waves across the nation as the young and vivacious Divya had already become the reigning … [+2048 chars]"}, {"source": {"id": null, "name": "Bollywoodhungama.com"}, "author": "Bollywood Hungama", "title": "Disha Patani says she hates pampering herself in a salon - Bollywood Hungama", "description": "Disha Patani says she hates pampering herself in a salon . Latest Bollywood News, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News at Bollywood Hungama.com", "url": "https://www.bollywoodhungama.com/news/features/disha-patani-says-hates-pampering-salon/", "urlToImage": null, "publishedAt": "2020-04-25T12:31:40Z", "content": "Talking to a daily, Disha said that she is very lazy when it comes to beauty treatments. However, with the lockdown in place, the actress is utilising the time doing facials. She said that she has been using face scrubs and masks. The Baaghi 2 actress said th… [+272 chars]"}, {"source": {"id": null, "name": "Tellychakkar.com"}, "author": "Tellychakkar Team", "title": "Paras Chhabra’s LOSS is Mahira Sharma’s GAIN! - Tellychakkar", "description": "MUMBAI: Actors Mahira Sharma and Paras Chhabra's friendship was undoubtedly one of the sweetest bonds inside the Bigg Boss 13 house.", "url": "https://www.tellychakkar.com/tv/tv-news/paras-chhabra-s-loss-mahira-sharma-s-gain-200425", "urlToImage": null, "publishedAt": "2020-04-25T12:31:00Z", "content": "MUMBAI: Actors Mahira Sharma and Paras Chhabra's friendship was undoubtedly one of the sweetest bonds inside the Bigg Boss 13 house.\r\nThe duo has always maintained that they are friends but their close bond has often been the topic of discussion among their f… [+570 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Uday Bhatia", "title": "Film review: ‘Extraction’ on Netflix is a joyless slab of action cinema - Livemint", "description": "Chris Hemsworth lays waste to Dhaka in order to save an Indian drug lord’s kidnapped son in this Netflix film written by Joe Russo", "url": "https://www.livemint.com/mint-lounge/features/film-review-extraction-on-netflix-is-a-joyless-slab-of-action-cinema-11587817372674.html", "urlToImage": null, "publishedAt": "2020-04-25T12:29:38Z", "content": "Sometimes the smallest detail can trip up your experience of a movie. Forty minutes into Extraction, Tyler (Chris Hemsworth) and Ovi (Rudhraksh Jaiswal) are dodging gunmen in a Dhaka building. They break into an apartment, and the famous intro to Didi Tera De… [+3823 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "IANS", "title": "Suriya’s ‘Soorarai Pottru’ could be banned, if Jyothika’s ‘Pon Magal Vandhal’ releases directly on OTT - The Hindu", "description": "Tamil Nadu Theatre And Multiplex Owners’ Association respond to expected release of Jyothika’s film on Amazon Prime next month", "url": "https://www.thehindu.com/entertainment/movies/suriyas-soorarai-pottru-could-be-banned-if-jyothikas-pon-magal-vandhal-releases-directly-on-ott/article31432944.ece", "urlToImage": null, "publishedAt": "2020-04-25T12:25:03Z", "content": "The Tamil Nadu Theatre And Multiplex Owners Association have threatened to ban films starring Suriya, as well as the films produced by his production company 2D films. The decision comes after the news that the film Pon Magal Vandhal, produced by Suriya and s… [+1831 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Kim Kardashian wears maang tikka yet again, slammed online for cultural appropriation - Hindustan Times", "description": "Several Twitter and Instagram users have slammed reality TV star Kim Kardashian for wearing maang tikka yet again, and have blamed her for cultural appropriation.", "url": "https://www.hindustantimes.com/tv/kim-kardashian-wears-maang-tikka-yet-again-slammed-online-for-cultural-appropriation/story-tnlqhMWAuUWrYA3nR71PML.html", "urlToImage": null, "publishedAt": "2020-04-25T12:20:00Z", "content": "Reality TV star Kim Kardashian has once again landed in a controversy, after she decided to wear the Indian traditional jewellery ‘maang tikka’ in her look for a few pictures that she shared online. Soon after Kim shared the post on Instagram and Twitter, she… [+3157 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": "", "title": "Beyond Money Heist, ten international shows to watch during Coronavirus lockdown, from Kingdom to 3% - Firstpost", "description": "If you’re looking to explore different kinds of shows, made in different parts of the world, here is a list on what to get started with", "url": "https://www.firstpost.com/entertainment/beyond-money-heist-ten-international-shows-to-watch-during-coronavirus-lockdown-from-kingdom-to-3-8287201.html", "urlToImage": null, "publishedAt": "2020-04-25T12:03:54Z", "content": "For more recommendations on what to watch during the Coronavirus lockdown, click here.\r\n*\r\nWhen we talk about how much Netflix has pervaded into our lives and changed the way films are made, one of the first things that comes up is how films and shows are now… [+5688 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Vicky Kaushal Celebrates Homecoming Of COVID-19 Warrior Along With Neighbours - News18", "description": "Vicky Kaushal shared a homecoming video of an 11-year-old girl who was tested positive of for the coronavirus. On her return, residents gave her a round of applause.", "url": "https://www.news18.com/news/movies/vicky-kaushal-celebrates-homecoming-of-covid-19-warrior-along-with-neighbours-2592345.html", "urlToImage": null, "publishedAt": "2020-04-25T12:00:50Z", "content": "Bollywood actor Vicky Kaushal recently joined his fellow residents who gathered at the complexs entrance to welcome a COVID-19 warrior. The Raazi actor shared a video on his Instagram to share the glimpses from the moment.\r\nLike a ray of sunshine on a gloomy … [+1320 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "How to use Instagram's new Challenges stickers in your stories - Hindustan Times", "description": "You can nominate your friends and also rise up to a challenge you have been nominated for with the appropriate stickers", "url": "https://www.hindustantimes.com/tech/how-to-use-instagram-s-new-challenges-stickers-in-your-stories/story-Z93NUNIMRf5i5HrvFNNT4J.html", "urlToImage": null, "publishedAt": "2020-04-25T11:53:25Z", "content": "Instagram has launched a new ‘Challenges’ sticker in the Stories gallery. Starting this Saturday, Instagram is testing this feature that makes it easy to join challenges through a sticker, via the stories text tool, or from nominations from friends.\r\n“We’ve s… [+1662 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Instagrammer of the Week: Pavitra Rishta fame Asha Negi’s style statements are chic and glamorous - Times of India", "description": "You might be seeing Asha Negi on-screen in simple salwar-kameez in her TV show Baarish, but off-screen her style statements are quite chic and glamorous. This week, we have her as our social media style maker. Take a look:", "url": "https://timesofindia.indiatimes.com/tv/news/hindi/instagrammer-of-the-week-pavitra-rishta-fame-asha-negis-style-statements-are-chic-and-glamorous/photostory/75358318.cms", "urlToImage": null, "publishedAt": "2020-04-25T11:30:00Z", "content": null}, {"source": {"id": null, "name": "Jantakareporter.com"}, "author": "https://www.facebook.com/rifat.jawaid", "title": "Remembering tough time, Archana Puran Singh of The Kapil Sharma Show can't stop crying in LIVE interview; days after domestic violence jibe at husband Parmeet Sethi - Janta Ka Reporter", "description": "Remembering tough time, Archana Puran Singh of The Kapil Sharma Show broke down during LIVE interview days after domestic violence jibe at husband Parmeet Sethi", "url": "http://www.jantakareporter.com/entertainment/omg-remembering-tough-time-archana-puran-singh-of-the-kapil-sharma-show-cant-stop-crying-in-live-interview-days-after-domestic-violence-jibe-at-husband-parmeet-sethi/288691/", "urlToImage": null, "publishedAt": "2020-04-25T11:17:19Z", "content": "Archana Puran Singh of The Kapil Sharma Show is known for her laughter on the comedy show and has become an inseparable part of Sony TV’s popular show. But, the veteran actress broke down in public recently remembering her tough time of the past. Archana coul… [+1853 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Tom Cruise will be 60 years old by the time Mission Impossible 8 is released, will have played Ethan... - Hindustan Times", "description": "Tom Cruise will be 60 years old, and will have played Ethan Hunt for over a quarter-of-a-century by the time the now delayed Mission: Impossible 8 hits theatres.", "url": "https://www.hindustantimes.com/hollywood/tom-cruise-will-be-60-years-old-by-the-time-mission-impossible-8-is-released-will-have-played-ethan-hunt-for-over-quarter-century/story-y8wlOd2s6rcRKkNXLPTdOJ.html", "urlToImage": null, "publishedAt": "2020-04-25T11:16:00Z", "content": "The theatrical release of Mission: Impossible 7 and Mission: Impossible 8 has been delayed by Paramount, which means that when the eighth film opens in 2022, Tom Cruise will be 60 years old. The seventh instalment in the franchise was initially set to hit the… [+1328 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Joel Kurian", "title": "Fund-raiser for Palghar mob lynching victims family initiated, Raveena Tandon urges help - Republic World - Republic World", "description": "A fund-raiser for Palghar mob lynching victim Nilesh Telgade's family has been initiated. Raveena Tandon was among those who urged her fans to help the family", "url": "https://www.republicworld.com/entertainment-news/bollywood-news/palghar-mob-lyching-sadhus-hindus-fundraiser-driver-family-muslim-dona.html", "urlToImage": null, "publishedAt": "2020-04-25T10:46:44Z", "content": "The lyching of three persons in Palghar near Mumbai last week sent shockwaves across the nation.The incident became a huge talking point countrywide with strong responses from the leaders as well. Out of the three victims, including two sadhus, a driver named… [+1817 chars]"}, {"source": {"id": null, "name": "Tellychakkar.com"}, "author": "Tellychakkar Team", "title": "Erica Fernandes finally fulfills her father’s dream - Tellychakkar", "description": "Erica shares a special bond with her father and finally she has made his dream come true", "url": "https://www.tellychakkar.com/tv/tv-news/erica-fernandes-finally-fulfills-her-father-s-dream-200425", "urlToImage": null, "publishedAt": "2020-04-25T10:44:00Z", "content": "MUMBAI: One of the most popular actresses in the telly land, Erica Fernandes has mesmerised the audience with her acting skills.\r\nThe actress is currently wooing the audience with her performance in Ekta Kapoor's show Kasautii Zindagii Kay. She is also popula… [+1229 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Nikki Bella poses with Aishwarya Rai Bachchan in throwback pic from 'incredible and unforgettable' Mumbai trip. See here - Hindustan Times", "description": "WWE wrestler Nikki Bella has shared a throwback picture from her 2007 trip to Mumbai with sister Brie, when they met actor Aishwarya Rai Bachchan.", "url": "https://www.hindustantimes.com/bollywood/nikki-bella-poses-with-aishwarya-rai-bachchan-in-throwback-pic-from-incredible-and-unforgettable-mumbai-trip-see-here/story-Y3eu4J5iia8rESInBAv5rI.html", "urlToImage": null, "publishedAt": "2020-04-25T10:43:30Z", "content": "WWE wrestler Nikki Bella has shared throwback pictures with her sister, Brie, from the time they met Aishwarya Rai Bachchan in Mumbai during a work trip in 2007. The Bella sisters were in town to shoot a commercial with Aishwarya. \r\nSharing 10 pictures on Ins… [+1386 chars]"}, {"source": {"id": null, "name": "Tellychakkar.com"}, "author": "Tellychakkar Team", "title": "THIS Star Plus’ show may not RETURN post the lockdown - Tellychakkar", "description": "Star Plus' Dadi Amma Dadi Amma Maan Jao to most probably not return post the lockdown.", "url": "https://www.tellychakkar.com/tv/tv-news/star-plus-show-may-not-return-post-the-lockdown-200425", "urlToImage": null, "publishedAt": "2020-04-25T10:00:00Z", "content": "MUMBAI: The lockdown has already hit the TV industry!\r\nRecently, there was news about Sony TV discontinuing three of their shows namely, Beyhadh 2, Ishaaron Ishaaron Mein and Patiala Babes. Yes, the channel has axed the shows and it wont return post the lockd… [+1108 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Throwback: When Mahabharat actors got emotional on the last day of shoot - Times of India", "description": "Mahabharat's rerun has been welcomed by telly viewers during the coronavirus lockdown. Such is the interest in the mythological show that every episode and sequence of the show is discussed on social media. Recently, a video surfaced online from the last day …", "url": "https://timesofindia.indiatimes.com/tv/news/hindi/throwback-when-mahabharat-actors-got-emotional-on-the-last-day-of-shoot/photostory/75374401.cms", "urlToImage": null, "publishedAt": "2020-04-25T09:37:52Z", "content": null}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Hrithik Roshan’s mom Pinkie shares tips for a perfect fitness regime, watch videos - Hindustan Times", "description": "Check out the inspirational fitness videos that Hrithik Roshan’s mother Pinkie Roshan has shared on Instagram.", "url": "https://www.hindustantimes.com/bollywood/hrithik-roshan-s-mom-pinkie-shares-tips-for-a-perfect-fitness-regime-watch-videos/story-DSJWQHoAlbPdSees83FvPL.html", "urlToImage": null, "publishedAt": "2020-04-25T09:30:13Z", "content": "Bollywood actor Hrithik Roshan’s mother Pinkie Roshan - who is quite a fitness freak - has shared new videos that is sure to give you the perfect inspiration required to keep it going even amid a lockdown. \r\nOne of the videos shows Pinkie walking, with her fa… [+1586 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Milind Soman says Ankita Konwar was cool with his sex scenes in Four More Shots Please!: ‘She was actually... - Hindustan Times", "description": "Days after they celebrated their second wedding anniversary, Milind Soman talks about wife Ankita Konwar’s reaction to his intimate scenes in web series, Four More Shots Please!.", "url": "https://www.hindustantimes.com/bollywood/milind-soman-says-ankita-konwar-was-cool-with-his-sex-scenes-in-four-more-shots-please-she-was-actually-very-excited/story-XmiImsEdVfK5pmksvrTdyN.html", "urlToImage": null, "publishedAt": "2020-04-25T09:27:00Z", "content": "Actor Milind Soman has revealed wife Ankita Konwar was “very excited” about his sex scenes from the web series Four More Shots Please! which also featured him walking in underwear.\r\nMilind told Pinkvilla in an interview, “She was very cool with it (intimate s… [+1598 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Neena Gupta in new video: If men can burp in public, why can't women? - India Today", "description": "Neena Gupta shared a video on Instagram and asked why women can't burp in public if men can.", "url": "https://www.indiatoday.in/lifestyle/celebrity/story/neena-gupta-in-new-video-if-men-can-burp-in-public-why-can-t-women-1670941-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T09:20:45Z", "content": "Neena Gupta discussed a significant subject with her Instagram fans and followers on Saturday as she questioned the stigma around women \"farting\" and \"burping\" in public. \"Aurton ko gas nahi hoti (Women don't have gas),\" Neena Gupta said in a sarcastic remark… [+2650 chars]"}, {"source": {"id": null, "name": "Asianetnews.com"}, "author": null, "title": "Candid pics of Abhishek Bachchan, Aishwarya Rai Bachchan show pure love - Asianet News English", "description": "Given the fact Aishwarya Rai Bachchan and Abhishek Bachchan share an amazing relationship and continue to give people major relationship goals, here are a few throwback candid photos of the couple.", "url": "https://newsable.asianetnews.com/gallery/entertainment/candid-pics-of-abhishek-bachchan-aishwarya-rai-bachchan-show-pure-love-q9c6wy", "urlToImage": null, "publishedAt": "2020-04-25T09:14:37Z", "content": "During the promotions of his film Happy New Year, Abhishek Bachchan opened up about his strong bond with Aishwarya Rai saying, \"Shes very down-to-earth, rooted, simple and real. Shes very beautiful, which everyone knows. But as a person, she is far more beaut… [+179 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Kashmira Patil", "title": "Kanika Kapoor missing from her apartment in Lucknow? Read deets - Republic World - Republic World", "description": "After being treated for COVID-19, Bollywood singer Kanika Kapoor has reportedly gone missing from her residence in Lucknow. Read to know more.", "url": "https://www.republicworld.com/entertainment-news/television-news/kanika-kapoor-has-gone-missing-from-her-apartment-in-lucknow.html", "urlToImage": null, "publishedAt": "2020-04-25T09:05:58Z", "content": "Bollywood singer Kanika Kapoor was tested positive for Coronavirus after she returned from London on March 9. The singer had also attended a few high profile parties after returning. Recently, it was reported that the singer has been discharged from Sanjay Ga… [+2204 chars]"}, {"source": {"id": null, "name": "Soompi.com"}, "author": "jeeelim5", "title": "Kim Go Eun And Lee Min Ho Are Closer Than Ever Before In “The King: Eternal Monarch” - soompi", "description": "SBS’s Friday-Saturday drama “The King: Eternal Monarch” has shared new stills of Kim Go Eun and Lee Min Ho closer than ever before. “The King: Eternal Monarch” tells the story of Emperor Lee Gon (Lee Min Ho) and detective Jung Tae Eul (Kim Go Eun), who live i…", "url": "https://www.soompi.com/article/1396589wpp/kim-go-eun-and-lee-min-ho-are-closer-than-ever-before-in-the-king-eternal-monarch", "urlToImage": null, "publishedAt": "2020-04-25T09:03:26Z", "content": "SBSs Friday-Saturday drama The King: Eternal Monarch has shared new stills of Kim Go Eun and Lee Min Ho closer than ever before.\r\nThe King: Eternal Monarch tells the story of Emperor Lee Gon (Lee Min Ho) and detective Jung Tae Eul (Kim Go Eun), who live in pa… [+1251 chars]"}, {"source": {"id": null, "name": "Spotboye.com"}, "author": "Neeki Singh", "title": "Shaheer Sheikh On Mahabharat: 'Couldn't Speak To Anyone For 10-15 Days After Shooting The Draupadi Cheer-Haran Scene, Made Me Terribly Sad'- EXCLUSIVE - SpotboyE", "description": "STAR Plus' Mahabharat, starring Shaheer Sheikh as Arjun, is being rerun currently. We spoke to the actor about the show and also about the memories attached with the character which brought him to the limelight", "url": "https://www.spotboye.com/television/tv-interviews/shaheer-sheikh-on-mahabharat-couldn-t-speak-to-anyone-for-10-15-days-after-shooting-the-draupadi-cheer-haran-scene-made-me-terribly-sad-exclusive/5ea3f51374f5ce660a22570f", "urlToImage": null, "publishedAt": "2020-04-25T08:35:29Z", "content": "Don't MissKundali Bhagya: Mahira Sharma, Shraddha Arya And Anjum Fakih Flaunt Their Killer Moves In This Throwback Video"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Thahar Ja: Ajay Devgn gets teary-eyed as he urges people to stay home with new song, son Yug makes cameo.... - Hindustan Times", "description": "Ajay Devgn has released a new song titled Thahar Ja to encourage his fans to stay home amid coronavirus outbreak.", "url": "https://www.hindustantimes.com/bollywood/thahar-ja-ajay-devgn-gets-teary-eyed-as-he-urges-people-to-stay-home-with-new-song-son-yug-makes-cameo-watch/story-72ZuV33NjqBAq28PJaaPXN.html", "urlToImage": null, "publishedAt": "2020-04-25T08:14:04Z", "content": "Ajay Devgn has released a new song titled Thahar Ja through which he makes an emotional appeal to his fans to stay at home amid coronavirus lockdown. His son Yug also makes an appearance at the end of the music video. \r\nProduced by Ajay, the song has been sun… [+1800 chars]"}, {"source": {"id": null, "name": "Bollywoodhungama.com"}, "author": "Bollywood Hungama", "title": "Malaika Arora shares a sun-kissed selfie, pens a note of gratitude amid lock-down - Bollywood Hungama", "description": "Malaika Arora shares a sun-kissed selfie, pens a note of gratitude amid lock-down. Latest Bollywood News, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News at Bollywood Hungama.com", "url": "https://www.bollywoodhungama.com/news/features/malaika-arora-shares-a-sun-kissed-selfie-pens-a-note-of-gratitude-amid-lock-down/", "urlToImage": null, "publishedAt": "2020-04-25T08:04:03Z", "content": "Malaika Arora, who is spending the lock-down with beau Arjun Kapoor, is indulging in cooking, working out from home or is plain chilling. On Instagram, she shared a sun-kissed selfie of herself, expressing gratitude about the fact that she is safe amid this c… [+474 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Kanye West officially now a billionaire: Forbes - India Today", "description": "Forbes said that Kanye West has been pressing the magazine for years to be listed as one of its mega-rich but that it declined.", "url": "https://www.indiatoday.in/lifestyle/celebrity/story/kanye-west-officially-now-a-billionaire-forbes-1670924-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T07:54:05Z", "content": "Rapper Kanye West is now a billionaire, thanks largely to the basketball shoes bearing his name that he developed with Adidas, Forbes magazine said on Friday.\r\nThe rough figure of the wealth of Kim Kardashian's hubby is USD 1.3 billion, the magazine said in a… [+1074 chars]"}, {"source": {"id": null, "name": "Ibtimes.co.in"}, "author": "Pramod Gaikwad", "title": "Deepika Padukone should stop interfering in my life and concentrate on her work: Kangana Ranaut [Throwback] - International Business Times, India Edition", "description": "Deepika Padukone and Kangana Ranaut have been at loggerheads ever since Deepika won the Best Actress award for her performance in Happy New Year over Kangana's role in Queen at an award function in 2014.", "url": "https://www.ibtimes.co.in/deepika-padukone-should-stop-interfering-my-life-concentrate-her-work-kangana-ranaut-throwback-818381", "urlToImage": null, "publishedAt": "2020-04-25T07:52:34Z", "content": "Kangana Ranaut had never shied away from expressing her dislike for Deepika Padukone on a public platform. The two have been at loggerheads ever since Deepika won the Best Actress award for her performance in Happy New Year over Kangana's role in Queen at an … [+2312 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "India TV Entertainment Desk", "title": "Ramayan's Sita aka Dipika Chikhlia's wedding reception photo goes viral, Rajesh Khanna also attended - India TV News", "description": "Along with many unseen photos from the Ramayan sets, actress Dipika Chikhlia's wedding reception photo has gone viral on the internet. interestingly, the reception was attended by Bollywood superstar Rajesh Khanna as well.", "url": "https://www.indiatvnews.com/entertainment/tv/ramayan-sita-dipika-chikhlia-wedding-reception-photo-viral-rajesh-khanna-attended-611113", "urlToImage": null, "publishedAt": "2020-04-25T07:16:23Z", "content": "Image Source : TWITTERRamayan's Sita aka Dipika Chikhlia's wedding reception photo goes viral, Rajesh Khanna also attended\r\nTV actress and politician Dipika Chikhlia, who played the role of Sita in Ramanand Sagar's Ramayan, has been ruling the headlines for h… [+3535 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Akshay Kumar's Laxmmi Bomb To Skip Theatrical Release And Premiere on Disney+Hotstar? - News18", "description": "The global viral scare reportedly seems to persuade Bollywood filmmakers and producers to release their upcoming titles on OTT platforms rather than delaying them.", "url": "https://www.news18.com/news/movies/akshay-kumars-laxmmi-bomb-to-skip-theatrical-release-and-premiere-on-disneyhotstar-2592117.html", "urlToImage": null, "publishedAt": "2020-04-25T07:11:35Z", "content": "It's a dreadful time for the film industry as cinema halls across the world remain closed amid the coronavirus crisis. The global viral scare reportedly seems to persuade Bollywood filmmakers and producers to release their upcoming titles on OTT platforms rat… [+1773 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "admin", "title": "Ramazan 2020: Dipika Kakar wishes Chand mubarak, shares glimpse of her first sehri. See pics, video - Jimmys Post", "description": "", "url": "https://www.hindustantimes.com/tv/ramazan-2020-dipika-kakar-wishes-chand-mubarak-shares-glimpse-of-her-first-sehri-see-pics-video/story-B3wGDrTzmhG6O5tTXPjYVP.html/", "urlToImage": null, "publishedAt": "2020-04-25T07:02:18Z", "content": "Dipika Kakar and husband Shoaib Ibrahim are all geared up to celebrate the month of Ramzan and took to social media to wish their fans on the occasion. Dipika also shared a picture as she sat to savour her first sehri before dawn on Saturday. \r\nSharing a happ… [+1577 chars]"}, {"source": {"id": null, "name": "Indiaglitz.com"}, "author": "IndiaGlitz", "title": "9th wedding anniversary: Prithviraj's wife pens an emotional note - Malayalam News - IndiaGlitz.com", "description": "As actor Prithviraj Sukumaran remains stranded in Jordan, the actor and his wife Supriya couldn't celebrate their wedding anniversary together this year.", "url": "https://www.indiaglitz.com/9th-wedding-anniversary-prithvirajs-wife-pens-an-emotional-note-malayalam-news-258915", "urlToImage": null, "publishedAt": "2020-04-25T06:46:12Z", "content": "As actor Prithviraj Sukumaran remains stranded in Jordan, the actor and his wife Supriya couldn't celebrate their wedding anniversary together this year. The lovely couple got married nine years ago on this very same day in a private ceremony in Palakkad on A… [+896 chars]"}, {"source": {"id": null, "name": "Scroll.in"}, "author": "Nandini Ramnath", "title": "‘Hundred’ review: Lara Dutta and Rinku Rajguru steer a fun run to the crease - Scroll.in", "description": "In the Disney+ Hotstar web series, Lara Dutta is a police officer who uses Rinku Rajguru’s terminally ill government employee to save her job.", "url": "https://scroll.in/reel/960181/hundred-review-lara-dutta-and-rinku-rajguru-steer-a-fun-run-to-the-crease", "urlToImage": null, "publishedAt": "2020-04-25T06:34:00Z", "content": "Hundred is a web series that revolves around two women. One is going to die. The other is barely surviving. But dont you ever make the mistake of feeling sorry for Nethra or Saumya. \r\nNethra (Rinku Rajguru) has recently learnt that she has a galloping brain t… [+5002 chars]"}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": "twinklekhanna", "title": "Anushka Sharma and Virat Kohli are at their goofy best as they begin the weekend with adorable morning selfies - PINKVILLA", "description": "Anushka Sharma and Virat Kohli took to their social media handles to share goofy morning selfies and it is beyond adorable. Check it out.", "url": "https://www.pinkvilla.com/entertainment/news/anushka-sharma-and-virat-kohli-are-their-goofy-best-they-begin-weekend-adorable-morning-selfies-527345", "urlToImage": null, "publishedAt": "2020-04-25T06:31:19Z", "content": null}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "PTI", "title": "Police complaint filed against Kangana Ranaut over terrorist remark - Deccan Herald", "description": "A complaint has been filed with police against Bollywood actor Kangana Ranaut for allegedly referring to members of a particular community as terrorists in a video released in support of her sister Rangoli Chandel, an official said on Friday. The complaint wa…", "url": "https://www.deccanherald.com/entertainment/police-complaint-filed-against-kangana-ranaut-over-terrorist-remark-829229.html", "urlToImage": null, "publishedAt": "2020-04-25T06:04:21Z", "content": "A complaint has been filed with police against Bollywood actor Kangana Ranaut for allegedly referring to members of a particular community as terrorists in a video released in support of her sister Rangoli Chandel, an official said on Friday.\r\nThe complaint w… [+604 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "'Stylish Star' Allu Arjun Dancing to 'Ramuloo Ramulaa' is a Treat to Watch - News18", "description": "Video of Allu Arjun dancing to the song Ramuloo Ramulaa from Ala Vaikunthapurramloo is making rounds on the Internet. Watch it here.", "url": "https://www.news18.com/news/movies/stylish-star-allu-arjun-dancing-to-ramuloo-ramulaa-is-a-treat-to-watch-2592063.html", "urlToImage": null, "publishedAt": "2020-04-25T05:50:13Z", "content": "Video of actor Allu Arjun dancing to song Ramuloo Ramulaa is making rounds on the Internet. The song featured in his recently released film Ala Vaikunthapurramloo (2020) which opened to critical acclaim and commercial praise and went on to be a blockbuster.\r\n… [+1311 chars]"}, {"source": {"id": null, "name": "Thenewsminute.com"}, "author": null, "title": "Nithiin-Rashmika starrer ‘Bheeshma’ now streaming online - The News Minute", "description": "Nithiin and Rashmika fans rejoice! The duo’s last film, Bheeshma has been released online and is now streaming on Netflix and Sun NXT. Bheeshma is a romantic action comedy that was met with positive reviews upon its release. The film revolves around the prota…", "url": "https://www.thenewsminute.com/article/nithiin-rashmika-starrer-bheeshma-now-streaming-online-123314", "urlToImage": null, "publishedAt": "2020-04-25T05:46:31Z", "content": "The film released in February and was met with positive reviews.Nithiin and Rashmika fans rejoice! The duos last film, Bheeshma has been released online and is now streaming on Netflix and Sun NXT.\r\nBheeshma is a romantic action comedy that was met with posit… [+1670 chars]"}, {"source": {"id": null, "name": "Tellychakkar.com"}, "author": "Tellychakkar Team", "title": "Taarak Mehta Ka Ooltah Chashmah's director turns actor! - Tellychakkar", "description": "MUMBAI: Television’s longest running show Taarak Mehta Ka Ooltah Chashmah (SAB TV and Neela Telefilms) has been winning the hearts and charts for many years now.", "url": "https://www.tellychakkar.com/tv/tv-news/taarak-mehta-ka-ooltah-chashmahs-director-turns-actor-200425", "urlToImage": null, "publishedAt": "2020-04-25T05:30:00Z", "content": null}, {"source": {"id": null, "name": "Bollywoodhungama.com"}, "author": "Bollywood Hungama", "title": "On his birthday, Varun Dhawan donates towards daily wage labourers of the film industry - Bollywood Hungama", "description": "On his birthday, Varun Dhawan donates towards daily wage labourers of the film industry. Latest Bollywood News, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News at Bollywood Hungama.com", "url": "https://www.bollywoodhungama.com/news/bollywood/birthday-varun-dhawan-donates-towards-daily-wage-labourers-film-industry/", "urlToImage": null, "publishedAt": "2020-04-25T05:02:27Z", "content": "Ashoke Pandit who is the president of Indian Film and TV directors Association took to Twitter to thank Varun Dhawan for his contribution. Sharing the video he wrote, \"@fwice_mum  thanks @Varun_dvn for donating towards the daily wage workers of the entertainm… [+993 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "I Trusted Arhaan But Didn't Know I'd Have To Pay Such A Big Price For It: Rashami Desai - News18", "description": "Rashami and Arhaan dated each other for over a year. However, things went haywire after they entered the Bigg Boss house last season.", "url": "https://www.news18.com/news/movies/i-trusted-arhaan-but-didnt-know-id-have-to-pay-such-a-big-price-for-it-rashami-desai-2591989.html", "urlToImage": null, "publishedAt": "2020-04-25T04:30:32Z", "content": "Rashami Desai got emotional while talking about her former boyfriend Arhaan Khan during an Instagram live session with fans. \r\nRashami and Arhaan dated each other for over a year. However, things went haywire after they entered the Bigg Boss house last season… [+1341 chars]"}, {"source": {"id": null, "name": "Gulte.com"}, "author": null, "title": "Mahesh-Rajamouli: A dream come true with hard realities! - Gulte", "description": "It sounds super enticing and a dream-come-true to many fans of Mahesh Babu when Rajamouli himself ma", "url": "https://www.gulte.com/movienews/1894/mahesh-rajamouli-a-dream-come-true-with-hard-realities", "urlToImage": null, "publishedAt": "2020-04-25T04:05:33Z", "content": "It sounds super enticing and a dream-come-true to many fans of Mahesh Babu when Rajamouli himself made it official about him directing the superstar in his next. It might give goosebumps when fans foresee the combination’s capability in the collections and in… [+2095 chars]"}, {"source": {"id": null, "name": "Bollywoodlife.com"}, "author": "Nirali Kanabar", "title": "It's expensive: When Katrina Kaif splurged Rs. 92,000 to look gorgeous at rumoured ex-boyfriend, Salman Khan' - Bollywood Life", "description": "Today, we are taking you back to Salman Khan's grand birthday bash where Katrina Kaif grabbed eyeballs for all the right reasons.", "url": "https://www.bollywoodlife.com/style/its-expensive-when-katrina-kaif-splurged-rs-92000-to-look-gorgeous-at-rumoured-ex-boyfriend-salman-khans-birthday-bash-1611259/", "urlToImage": null, "publishedAt": "2020-04-25T03:47:56Z", "content": "There's a dearth of Bollywood events due to the coronavirus lockdown. We haven't seen pictures of our celebrities flaunting their fashion ka jalwa for the longest time now. Hence, we are revisiting the times they made head turns in public because of their sar… [+2226 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Sobhita Dhulipala accused of lying about clicking her own pics for magazine shoot, issues clarification: 'It is upsetting' - Hindustan Times", "description": "Actor Sobhita Dhulipala recently shared pictures from a magazine photoshoot, saying that she had clicked the pictures herself. Later, a picture of her getting clicked by a man on her terrace landed online.", "url": "https://www.hindustantimes.com/bollywood/sobhita-dhulipala-accused-of-lying-about-clicking-her-own-pics-for-magazine-shoot-issues-clarification-it-is-upsetting/story-fYdaCclRaGZ8BSXzAcd5hN.html", "urlToImage": null, "publishedAt": "2020-04-25T03:32:00Z", "content": "Actor Sobhita Dhulipala has issued a clarification after she was accused of lying about a new magazine photoshoot. Sobhita had shared multiple pictures from the latest issue of Cosmopolitan magazine over the last couple of days, saying that she styles herself… [+3087 chars]"}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": "Pinkvilla Desk", "title": "Marvel’s Spider Man 3, Doctor Strange 2 and Thor: Love and Thunder shift release dates - PINKVILLA", "description": "Amid the ongoing Coronavirus pandemic, studios have shifted the date of Marvel’s Spider-Man 3 and Doctor Strange 2. Read on to know more.", "url": "https://www.pinkvilla.com/entertainment/hollywood/marvel-s-spider-man-3-doctor-strange-2-and-thor-love-and-thunder-shift-release-dates-527330", "urlToImage": null, "publishedAt": "2020-04-25T03:24:03Z", "content": null}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Hindustan Times", "title": "Shruti Haasan asked if she’d stalk an ex or be stalked by an ex, here’s her answer - Hindustan Times", "description": "Shruti Haasan played the ‘would you rather’ game  on social media and revealed whether she’d prefer stalking her ex or being stalked by her ex.", "url": "https://www.hindustantimes.com/bollywood/shruti-haasan-asked-if-she-d-stalk-an-ex-or-be-stalked-by-an-ex-here-s-her-answer/story-S6LpLHDjeInPimm1BO9mNJ.html", "urlToImage": null, "publishedAt": "2020-04-25T02:49:34Z", "content": "Shruti Haasan revealed on social media that she would neither stalk her ex nor be stalked by her ex. Shruti on Thursday night was playing the \"Would you rather\" game on Instagram stories where two options were given to her by the automated filter.\r\nThe option… [+753 chars]"}, {"source": {"id": null, "name": "Sportskeeda.com"}, "author": "Raunak Jaiswal", "title": "Roman Reigns takes a dig at tag team recently released by WWE - Sportskeeda", "description": "The former WWE tag team has been a thorn in Roman Reigns' side in the past.", "url": "https://www.sportskeeda.com/wwe/roman-reigns-takes-a-dig-at-tag-team-recently-released-by-wwe", "urlToImage": null, "publishedAt": "2020-04-25T02:49:10Z", "content": "Roman Reigns wasn't holding back in this exchange\r\nIn a shocking turn of events, WWE released over 20 Superstars in addition to furloughing backstage staff last week. To everyone's surprise, The Good Brothers Luke Gallows &amp; Karl Anderson were also among t… [+1792 chars]"}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": "Pinkvilla Desk", "title": "Varun Dhawan has Natasha by his side as he virtually celebrates birthday with Sara Ali Khan, Arjun & others - PINKVILLA", "description": "Varun Dhawan celebrated his 33rd birthday virtually with Coolie No 1 co-star Sara Ali Khan, Arjun Kapoor, Karan Johar and others.", "url": "https://www.pinkvilla.com/entertainment/news/varun-dhawan-has-natasha-his-side-he-virtually-celebrates-birthday-sara-ali-khan-arjun-others-527329", "urlToImage": null, "publishedAt": "2020-04-25T02:47:09Z", "content": null}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": "Pinkvilla Desk", "title": "Kareena Kapoor Khan glam up her quarantine look in a mustard Kaftan as she twirls in her living room; WATCH - PINKVILLA", "description": "Kareena Kapoor Khan proves she is the queen of slow mo as she nails her quarantine look in a mustard Kaftan; WATCH", "url": "https://www.pinkvilla.com/entertainment/news/kareena-kapoor-khan-glam-her-quarantine-look-mustard-kaftan-she-twirls-her-living-room-watch-527328", "urlToImage": null, "publishedAt": "2020-04-25T02:24:43Z", "content": null}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Yami Gautam Revisits First Day at School, Shares Childhood Pic in Uniform - News18", "description": "If you want to see actress Yami Gautam in school uniform then head to her Instagram profile right away.", "url": "https://www.news18.com/news/movies/yami-gautam-revisits-first-day-at-school-shares-childhood-pic-in-uniform-2591829.html", "urlToImage": null, "publishedAt": "2020-04-25T02:19:10Z", "content": "If you want to see actress Yami Gautam in school uniform then head to her Instagram profile right away. She has posted a picture of her first day in school.\r\n\"My first day to school! I am sure I did not know what it meant, but was just so excited to get dress… [+627 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Horoscope Today, April 25, 2020: Know what your stars have for you - India Today", "description": "Horoscope Today, April 25, 2020: Here's what the stars have in store for you on Saturday.", "url": "https://www.indiatoday.in/india/story/horoscope-today-april-25-2020-know-what-your-stars-have-for-you-1670847-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T00:01:38Z", "content": "Horoscope offers interesting and accurate insights. Let's find out what our stars have in store for us on Saturday, April 25.\r\nARIES Mar 21-Apr 20 Money will come your way from various sources and keeps your bank balance brimming. Though, you will not be in m… [+2355 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "When Shah Rukh Khan warned Aamir Khan to not work with Kajol: ‘She is very bad, unfocused’ - Hindustan Times", "description": "Before they came to be known as one of Bollywood’s best romantic pairs, actors Shah Rukh Khan and Kajol got off on the wrong foot.", "url": "https://www.hindustantimes.com/bollywood/when-shah-rukh-khan-warned-aamir-khan-to-not-work-with-kajol-she-is-very-bad-unfocused/story-ohHuC9ZVW9pUEacCoSFHQK.html", "urlToImage": null, "publishedAt": "2020-04-24T16:23:00Z", "content": "They’re known as one of Bollywood’s finest romantic pairs, but did you know that Shah Rukh Khan and Kajol got off on the wrong foot when they first met? In fact, Shah Rukh confessed that he’d even warned Aamir Khan about her, calling her unfocused and ‘very b… [+1622 chars]"}, {"source": {"id": null, "name": "Thenewsminute.com"}, "author": null, "title": "Revisiting 'Amarkalam', the film that brought Ajith and Shalini together - The News Minute", "description": "It would be an understatement to say that Amarkalam was an important film in Ajith's career. Not only did the 1999 film directed by Saran pave the way for the actor to do more action films, it was also on the sets of Amarkalam that Ajith fell in love with his…", "url": "https://www.thenewsminute.com:443/article/revisiting-amarkalam-film-brought-ajith-and-shalini-together-123255", "urlToImage": null, "publishedAt": "2020-04-24T14:14:05Z", "content": "The couple completes 20 years of marriage on April 24.It would be an understatement to say that Amarkalam was an important film in Ajith's career. Not only did the 1999 film directed by Saran pave the way for the actor to do more action films, it was also on … [+5298 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Danny Cyril D Cruze", "title": "Aarogya Setu App: How Bluetooth helps in identifying Covid-19 suspects - Livemint", "description": "The government-owned application is being posed as the primary contact tracing tool in India.Many organisations are planning to include the app in their daily operations to identify potential cases", "url": "https://www.livemint.com/technology/tech-news/aarogya-setu-app-how-bluetooth-helps-in-identifying-covid-19-suspects-11587730877077.html", "urlToImage": null, "publishedAt": "2020-04-24T12:51:31Z", "content": "Many food-delivery services have mandated the use of Aarogya Setu app for their delivery personnel. The government-owned application is being posed as the primary contact tracing tool in India. During Prime Minister Narendra Modis address to the nation, while… [+2367 chars]"}, {"source": {"id": null, "name": "Indiaglitz.com"}, "author": "IndiaGlitz", "title": "Mahesh Babu gives solid feedback on 2-minute massage! - Telugu News - IndiaGlitz.com", "description": "Mahesh Babu's family time is productive.  The other day, Sitara turned into a head massage volunteer as her dad was busy watching Gautham play his game.", "url": "https://www.indiaglitz.com/mahesh-babu-gives-solid-feedback-on-2-minute-massage-telugu-news-258876", "urlToImage": null, "publishedAt": "2020-04-24T12:49:59Z", "content": "Mahesh Babu's family time is productive. The other day, Sitara turned into a head massage volunteer as her dad was busy watching Gautham play his game. \r\n\"Watching GG (Gautham Ghattamaneni) play his game! MB had a head massage volunteer only to finish in 2 mi… [+562 chars]"}, {"source": {"id": null, "name": "Bollywoodbubble.com"}, "author": "Simran Khanna", "title": "Deepika Padukone and Ranveer Singh’s monthly expenditure on food will leave you shell-shocked! - Bollywood Bubble", "description": "<p>Image Source – InstagramDeepika Padukone and Ranveer Singh are one of the most talked-about couples in Bollywood.  Everything about their life is super extravagant. So when you think about their daily food neds you know it is going to be exorbitant.  Did y…", "url": "https://www.bollywoodbubble.com/bollywood-news/deepika-padukone-ranveer-singh-monthly-expenditure-food/", "urlToImage": null, "publishedAt": "2020-04-24T12:13:36Z", "content": "Deepika Padukone and Ranveer Singh are one of the most talked-about couples in Bollywood.  Everything about their life is super extravagant. So when you think about their daily food neds you know it is going to be exorbitant.  Did you know the amount Deepika … [+1195 chars]"}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": "Pinkvilla Desk", "title": "Priyanka Chopra Jonas' sun kissed photos have left husband Nick Jonas awestruck and us too - PINKVILLA", "description": "Priyanka Chopra Jonas recently shared a stunning sun-kissed photo and well, it has our attention for all the right reasons, and Nick Jonas' too. Check it out here.", "url": "https://www.pinkvilla.com/entertainment/hollywood/priyanka-chopra-jonas-sun-kissed-photos-have-left-husband-nick-jonas-awestruck-and-us-too-527027", "urlToImage": null, "publishedAt": "2020-04-24T11:15:54Z", "content": null}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Shakir Khan", "title": "New version of Teri Mitti dedicated to COVID-19 warriors leaves netizens teary eyed - Republic World - Republic World", "description": "'Teri Mitti's' new version has left fans teary eyed. This reprised version from the film 'Kesari' has touched the hearts of many. Watch", "url": "https://www.republicworld.com/entertainment-news/music/new-version-of-teri-mitti-dedicated-to-covid-19-warriors.html", "urlToImage": null, "publishedAt": "2020-04-24T11:01:55Z", "content": "The film fraternity has joined hands to spread awareness through various medium to spread awareness on the COVID-19 pandemic. May it be in the form of a video anthem or a song, artists are going all out to spread the message of positivity during this global c… [+2051 chars]"}, {"source": {"id": null, "name": "Koimoi.com"}, "author": null, "title": "Avengers: Endgame: Neither Iron Man Nor Captain America, Fans Think THIS Superhero Should’ve Snapped Fingers To Kill Thanos! - Koimoi", "description": "To save the world from Thanos' evil intentions once again, Iron Man sacrificed his life in Avengers: Endgame. In the climax, Robert Downey Jr", "url": "https://www.koimoi.com/hollywood-2/avengers-endgame-neither-iron-man-nor-captain-america-fans-think-this-superhero-shouldve-snapped-fingers-to-kill-thanos/", "urlToImage": null, "publishedAt": "2020-04-24T10:56:26Z", "content": "Avengers: Endgame: Neither Iron Man Nor Captain America, Fans Think THIS Superhero Should’ve Snapped Fingers To Kill Thanos!\r\nTo save the world from Thanos’ evil intentions once again, Iron Man sacrificed his life in Avengers: Endgame. In the climax, Robert D… [+2158 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "'Ladke Ko Sab Pata Hai': While Anushka Sharma Struggles at Guess the Gibberish, Virat Kohli Aces it - News18", "description": "Anushka Sharma, who's currently quarantining with her cricketer husband Virat Kohli, has taken up the 'Guess the Gibberish' challenge.", "url": "https://www.news18.com/news/movies/ladke-ko-sab-pata-hai-while-anushka-sharma-struggles-at-guess-the-gibberish-virat-kohli-aces-it-2590467.html", "urlToImage": null, "publishedAt": "2020-04-24T05:58:58Z", "content": "There's another challenge sweeping through Instagram which has gone viral in no time. With a number of people joining the 'guess the gibberish' filter, it has already become a hit among the netizens. \r\nBollywood actress Anushka Sharma, who's currently quarant… [+1573 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Jiya Chulet", "title": "Anushka Sharma fails at Instagram challenge, husband Virat Kohli comes to rescue - Republic World - Republic World", "description": "Actor Anushka Sharma recently attempted a trending online challenge but in vain; husband Virat Kohli came to her rescue and guessed the right answers. Watch.", "url": "https://www.republicworld.com/entertainment-news/bollywood-news/anushka-sharma-fails-at-guessthegibberish-virat-kohli-rescues.html", "urlToImage": null, "publishedAt": "2020-04-24T05:57:12Z", "content": "The current pandemic situation has confined people to homes. Amid the nationwide lockdown, various online challenges are keeping people entertained. But it seems like even stars are enjoying it, as recently, Bollywood actor Anushka Sharma tried a trending onl… [+1805 chars]"}]}