{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Dr Prem Kumar Sharma & Manisha Koushik", "title": "Horoscope Today: Astrological prediction for April 26, what’s in store for Aries, Leo, Virgo, Sagittarius... - Hindustan Times", "description": "Horoscope Today: Are the stars lined up in your favour? Find out the astrological prediction for Aries, Leo, Virgo, Sagittarius and other zodiac signs for April 26.", "url": "https://www.hindustantimes.com/more-lifestyle/horoscope-today-astrological-prediction-for-april-26-what-s-in-store-for-aries-leo-virgo-sagittarius-and-other-zodiac-signs/story-UZqIshfDA2z09RcKOo28hJ.html", "urlToImage": null, "publishedAt": "2020-04-26T02:39:30Z", "content": "The 12 zodiac signs have their own personality traits and characteristics. Horoscopes give us an insight into our daily life and how it will fare for all of us. Read on to know whether the odds will be in your favour today:\r\n*Aries (March 21-April 20) You wil… [+8191 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Amitabh Bachchan shares a 'Breaking News'; a BAT enters his room amid Coronavirus lockdown - Times of India", "description": "Amitabh Bachchan is currently spending quality time with his family sans wife Jaya Bachchan who is in Delhi due to", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/amitabh-bachchan-shares-a-breaking-news-a-bat-enters-his-room-amid-coronavirus-lockdown/articleshow/75384810.cms", "urlToImage": null, "publishedAt": "2020-04-25T22:34:00Z", "content": null}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": "Pinkvilla Desk", "title": "Shaheer Sheikh urges everyone to pray at home during Ramzan with the sweetest photo ever; Check it out - PINKVILLA", "description": "Shaheer Sheikh shared a post on social media urging everyone to pray from home during Ramzan. Check out the post here.", "url": "https://www.pinkvilla.com/tv/serial-updates/shaheer-sheikh-urges-everyone-pray-home-during-ramzan-sweetest-photo-ever-check-it-out-527556", "urlToImage": null, "publishedAt": "2020-04-25T21:45:16Z", "content": null}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Bhavya Sukheja", "title": "Chris Hemsworth speaking Bangla in Netflixs Extraction leaves netizens flipped - Republic World - Republic World", "description": "One of the scenes from the action-packed film left viewers a little taken aback as Chris Hemsworth, known for 'Thor', spoke fairly fluent Bangla.", "url": "https://www.republicworld.com/entertainment-news/whats-viral/chris-hemsworth-speaking-bangla-leaves-netizens-flipped.html", "urlToImage": null, "publishedAt": "2020-04-25T19:34:34Z", "content": "One of the most awaited movies of 2020, Extraction, starring Chris Hemsworth, Randeep Hooda and Pankaj Tripathi recently released on Netflix and netizens were completely blown away within the first 90 minutes of the film. One of the scenes from the action-pac… [+2489 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Titas Chowdhury", "title": "The name ‘Arjun’ went on to give me everything that I dreamed of: Firoz Khan - Hindustan Times", "description": "Actor Firoz Khan reminisces about the time when producers confused him with Feroz Khan - the Qurbani actor", "url": "https://www.hindustantimes.com/bollywood/the-name-arjun-went-on-to-give-me-everything-that-i-dreamed-of-firoz-khan/story-qgUIbqqrE4ZvSQmcAhjlDP.html", "urlToImage": null, "publishedAt": "2020-04-25T18:12:29Z", "content": "With Mahabharat re-running on DD Bharati and grabbing a lot of eyeballs, actor Firoz Khan who’s known by the moniker Arjun, is on cloud nine. “It’s a proud moment to watch Mahabharat with the present generation. It’s a good opportunity for them to know more a… [+1748 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Urvashi Kandpal", "title": "Thappad to premiere on Amazon Prime Video on May 1, announces Taapsee Pannu - Republic World - Republic World", "description": "Earlier on Saturday,Bollywood actor Taapsee Pannu took to her Instagram account to announce the release of her last film 'Thappad' on the OTT platform on May 1.", "url": "https://www.republicworld.com/entertainment-news/bollywood-news/taapsee-pannu-announces-anubhav-sinhas-thappad-release-on-amazon-prime.html", "urlToImage": null, "publishedAt": "2020-04-25T17:49:50Z", "content": "Bollywood actor Taapsee Pannu's tour de force film Thappad, directed by Anubhav Sinha is all set to release on OTT platform on May 1. The actor took to her Instagram and announced the date on which the film will be launched on Amazon Prime Video. She posted a… [+1952 chars]"}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": "Pinkvilla Desk", "title": "Mahira Sharma REVEALS she hasn’t been in touch with Sidharth Shukla after Bigg Boss 13 - PINKVILLA", "description": "Mahira Sharma and Sidharth Shukla shared a great bond during their stint on Bigg Boss 13.", "url": "https://www.pinkvilla.com/tv/news-gossip/mahira-sharma-reveals-she-hasn-t-been-touch-sidharth-shukla-after-bigg-boss-13-527546", "urlToImage": null, "publishedAt": "2020-04-25T17:15:15Z", "content": null}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "When Sunny Deol ripped his pants in anger after Shah Rukh Khan stole the limelight in Darr - Hindustan Times", "description": "Sunny Deol and Shah Rukh Khan were said to have had a falling out after Shah Rukh’s villainous character was given a more favourable portrayal in their 1993 film Darr.", "url": "https://www.hindustantimes.com/bollywood/when-sunny-deol-ripped-his-pants-in-anger-after-shah-rukh-khan-stole-the-limelight-in-darr/story-a8WZApceYKT72r0f67YUiL.html", "urlToImage": null, "publishedAt": "2020-04-25T17:00:00Z", "content": "Sunny Deol and Shah Rukh Khan didn’t speak to each other for 16 years after Shah Rukh, who played the antagonist in 1993’s Darr, was believed to have been a more fan-friendly portrayal in the film by director Yash Chopra. Sunny in an appearance on Aap Ki Adal… [+1929 chars]"}, {"source": {"id": null, "name": "Bollywoodhungama.com"}, "author": "Bollywood Hungama", "title": "When Shah Rukh Khans snore DISTURBED Salman Khans sleep during Karan Arjuns schedule! - Bollywood Hungama", "description": "When Shah Rukh Khan’s snore DISTURBED Salman Khan’s sleep during Karan Arjun’s schedule!. Latest Bollywood News, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News at Bollywood Hungama.com", "url": "https://www.bollywoodhungama.com/news/features/shah-rukh-khans-snore-disturbed-salman-khans-sleep-karan-arjuns-schedule/", "urlToImage": null, "publishedAt": "2020-04-25T16:19:45Z", "content": "While Salman Khan started his career in 1989, SRKs career started in 1990 but took off in a great way with twin successes of Baazigar and Darr in 1993. However, there was no bitter rivalry between the two at this point. When they had just started out, they ha… [+2845 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Karan Johar apologises for sharing ‘insensitive’ social media posts during Covid-19 pandemic: ‘I apologise... - Hindustan Times", "description": "Karan Johar has apologised for his ‘insensitive’ social media posts during the coronavirus pandemic, after watching a ‘hard-hitting’ video.", "url": "https://www.hindustantimes.com/bollywood/karan-johar-apologises-for-sharing-insensitive-social-media-posts-during-covid-19-pandemic-i-apologise-profusely/story-s3PG07KXmMswOWceePauAN.html", "urlToImage": null, "publishedAt": "2020-04-25T16:10:00Z", "content": "Filmmaker Karan Johar has apologised for his social media posts during the coronavirus lockdown, after watching a video which sarcastically pointed out that the real heroes are the celebrities. \r\nKaran wrote on Twitter, in reaction to the video, “This hit me … [+2134 chars]"}, {"source": {"id": null, "name": "Tellychakkar.com"}, "author": "Tellychakkar Team", "title": "Check out the winner list of Khatron Ke Khiladi - Tellychakkar", "description": "Checkout the winners of all seasons of Khatron Ke Khiladi", "url": "https://www.tellychakkar.com/tv/tv-news/check-out-the-winner-list-of-khatron-ke-khiladi-200425", "urlToImage": null, "publishedAt": "2020-04-25T15:30:00Z", "content": "MUMBAI: Khatron Ke Khiladi is one of the most popular adventure-based reality TV series. The show is currently airs the 10th season and many celebrities are seen as contestants. The gripping episodes have kept the audience hooked to the TV screens.\r\nIts a stu… [+1934 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Irrfan's mother Saeeda Begum dies in Jaipur - India Today", "description": "Actor Irrfan's mother Saeeda Begum died due to natural causes in Jaipur.", "url": "https://www.indiatoday.in/movies/celebrities/story/irrfan-s-mother-saeeda-begum-dies-in-jaipur-1671060-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T14:25:02Z", "content": "Irrfan's mother Saeeda Begum took her last breath on Saturday (April 25) morning. According to a report in ANI, Saeeda was unwell for a long time and died due to natural causes. She resided at the Beniwal Kanta Krishna Colony in Jaipur.\r\nSaeeda belongs to a N… [+1221 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Suniel Shetty says Dhadkan sequel should star his and Akshay Kumar's sons, Ahan and Aarav - Hindustan Times", "description": "Suniel Shetty says he’s pitched the idea that the Dhadkan sequel should star his and Akshay Kumar’s sons, Ahan and Aarav, to the producer.", "url": "https://www.hindustantimes.com/bollywood/suniel-shetty-says-dhadkan-sequel-should-star-his-and-akshay-kumar-s-sons-ahan-and-aarav/story-otPBbTUVjvwepoDM8byDYN.html", "urlToImage": null, "publishedAt": "2020-04-25T13:57:38Z", "content": "Actor Suniel Shetty feels that both him and Akshay Kumar are too old to appear in a sequel to their 2000 film, Dhadkan, but that their sons, Ahan and Aarav, could take on the mantle. Dhadkan, directed by Dharmesh Darshan, also starred Shilpa Shetty.\r\nSuniel t… [+1192 chars]"}, {"source": {"id": null, "name": "Tellychakkar.com"}, "author": "Tellychakkar Team", "title": "Did Kavita Kaushik just take a dig at Arnab Goswami? - Tellychakkar", "description": "MUMBAI: Journalist and anchor Arnab Goswami recently claimed that some goons attacked his car when he was travelling back home.", "url": "https://www.tellychakkar.com/tv/tv-news/did-kavita-kaushik-just-take-dig-arnab-goswami-200425", "urlToImage": null, "publishedAt": "2020-04-25T13:53:00Z", "content": "MUMBAI: Journalist and anchor Arnab Goswami recently claimed that some goons attacked his car when he was travelling back home. He revealed that he was with his wife when the incident took place. He later took to social media to post a video calling out a pol… [+1274 chars]"}, {"source": {"id": null, "name": "Tellychakkar.com"}, "author": "Tellychakkar Team", "title": "Sanjivani fame Chandni Bhagwanani locked down un Australia - Tellychakkar", "description": "MUMBAI: The lockdown due to COVID-19 has impacted everyone's life, especially those who were away from their houses and have now got stranded in a foreign land.", "url": "https://www.tellychakkar.com/tv/tv-news/sanjivani-fame-chandni-bhagwanani-locked-down-un-australia-200425", "urlToImage": null, "publishedAt": "2020-04-25T13:32:00Z", "content": "MUMBAI: The lockdown due to COVID-19 has impacted everyone's life, especially those who were away from their houses and have now got stranded in a foreign land. TV actress Chandni Bhagwanani, who played Dr.Asha Kanwar in Sanjivani, is stuck in Australia. She … [+1425 chars]"}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": "Ranpreet Kaur", "title": "Pinkvilla Picks: Ranveer Singh and Deepika Padukone’s Bajirao Mastani is a royal treat for you during lockdown - PINKVILLA", "description": "Today’s Pinkvilla Pick is Ranveer Singh and Deepika Padukone starrer Bajirao Mastani and it will take you down the history in this otherwise stressful lockdown.", "url": "https://www.pinkvilla.com/entertainment/news/pinkvilla-picks-ranveer-singh-and-deepika-padukone-s-bajirao-mastani-royal-treat-you-during-lockdown-527488", "urlToImage": null, "publishedAt": "2020-04-25T13:05:42Z", "content": null}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Joel Kurian", "title": "Ramayans Sita posts pic with Ramanand Sagar, netizens notice the photobombers - Republic World - Republic World", "description": "Amid 'Ramayan's record-breaking re-run, Dipika Chikhalia posted a pic with Ramanand Sagar, Arun Govil. Netizens observed Sita's 'dewars' in the background", "url": "https://www.republicworld.com/entertainment-news/television-news/ramayan-dipika-chihalia-sita-ram-arun-govil-pics-ramanand-sagar-episod.html", "urlToImage": null, "publishedAt": "2020-04-25T13:05:11Z", "content": "The re-run of Ramayan has not just freshened the memories of that era for those who watched the serial then, but also introduced the current generation to the religious text. That is evident in the manner in which the show has broken records to become the mos… [+3083 chars]"}, {"source": {"id": null, "name": "Khaleejtimes.com"}, "author": "IANS", "title": "Popular Malayalam actor Ravi Vallathol passes away - News - wknd.", "description": "Popular Malayalam TV serial actor Ravi Vallathol passed away at his residence, in Thiruvananthapuram on Saturday. He was 67 and is survived ...", "url": "https://www.khaleejtimes.com/citytimes/south-stars/popular-indian-actor-passes-away-at-his-residence", "urlToImage": null, "publishedAt": "2020-04-25T12:58:38Z", "content": "Popular Malayalam TV serial actor Ravi Vallathol passed away at his residence, in Thiruvananthapuram on Saturday. He was 67 and is survived by his wife.\r\nThough he began in the Malayalam film industry as a lyricist and then as an actor, he was a favourite amo… [+419 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Salman Khan looks suave and handsome sporting a beard in THIS latest picture - Times of India", "description": "Salman Khan is currently spending the quarantine period at his farmhouse in Panvel. The actor is spending time with", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/salman-khan-looks-suave-and-handsome-sporting-a-beard-in-this-latest-picture/articleshow/75378474.cms", "urlToImage": null, "publishedAt": "2020-04-25T12:53:00Z", "content": null}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "Bollywood News: Sajid Nadiadwala`s wife Warda opens up on his former wife and actress Divya Bharti`s death... - Zee News", "description": "Divya Bharti married filmmaker Sajid Nadiadwala in 1992 and their wedding was a private affair.", "url": "https://zeenews.india.com/people/bollywood-news-sajid-nadiadwalas-wife-warda-opens-up-on-his-former-wife-and-actress-divya-bhartis-death-and-life-afterwards-2278950.html", "urlToImage": null, "publishedAt": "2020-04-25T12:51:37Z", "content": "New Delhi: Actress Divya Bharti was all of 19 when she died under mysterious circumstances, reportedly falling from her apartment balcony in Mumbai. Her death sent shock waves across the nation as the young and vivacious Divya had already become the reigning … [+2048 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Vijay Deverakonda Takes Up the Real Man Challenge, Makes Mango Ice Cream - News18", "description": "The World Famous Lover star told fans that the video was documented by younger brother Anand Deverakonda, who is also an actor. Vijay then tagged actor Dulquer Salman for the #BeARealMan challenge.", "url": "https://www.news18.com/news/movies/vijay-deverakonda-takes-up-the-real-man-challenge-makes-mango-ice-cream-2592603.html", "urlToImage": null, "publishedAt": "2020-04-25T12:43:26Z", "content": "Southern heartthrob Vijay Deverakonda took the #BeARealMan challenge and documented his average lockdown routine recently. The challenge has become a trend after Arjun Reddy director Sandeep Vanga Reddy popularized it.\r\nPopular stars such as Chiranjeevi, Ram … [+1282 chars]"}, {"source": {"id": null, "name": "Bollywoodhungama.com"}, "author": "Bollywood Hungama", "title": "Sobhita Dhulipala issues clarification after being accused of lying about self-shot images for magazine cover - Bollywood Hungama", "description": "Sobhita Dhulipala issues clarification after being accused of lying about self-shot images for magazine cover. Latest Bollywood News, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News at Bollywood Hungama.com", "url": "https://www.bollywoodhungama.com/news/features/sobhita-dhulipala-issues-clarification-accused-lying-self-shot-images-magazine-cover/", "urlToImage": null, "publishedAt": "2020-04-25T12:31:44Z", "content": "Sobhita in her post mentioned that she self-styled and shot her images for the magazine. However, when an image of her being clicked by another person surfaced online, people accused her of lying. The actress later issued a clarification on the same.\r\nTaking … [+1519 chars]"}, {"source": {"id": null, "name": "Bollywoodhungama.com"}, "author": "Bollywood Hungama", "title": "Disha Patani says she hates pampering herself in a salon - Bollywood Hungama", "description": "Disha Patani says she hates pampering herself in a salon . Latest Bollywood News, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News at Bollywood Hungama.com", "url": "https://www.bollywoodhungama.com/news/features/disha-patani-says-hates-pampering-salon/", "urlToImage": null, "publishedAt": "2020-04-25T12:31:40Z", "content": "Talking to a daily, Disha said that she is very lazy when it comes to beauty treatments. However, with the lockdown in place, the actress is utilising the time doing facials. She said that she has been using face scrubs and masks. The Baaghi 2 actress said th… [+272 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "IANS", "title": "Suriya’s ‘Soorarai Pottru’ could be banned, if Jyothika’s ‘Pon Magal Vandhal’ releases directly on OTT - The Hindu", "description": "Tamil Nadu Theatre And Multiplex Owners’ Association respond to expected release of Jyothika’s film on Amazon Prime next month", "url": "https://www.thehindu.com/entertainment/movies/suriyas-soorarai-pottru-could-be-banned-if-jyothikas-pon-magal-vandhal-releases-directly-on-ott/article31432944.ece", "urlToImage": null, "publishedAt": "2020-04-25T12:25:03Z", "content": "The Tamil Nadu Theatre And Multiplex Owners Association have threatened to ban films starring Suriya, as well as the films produced by his production company 2D films. The decision comes after the news that the film Pon Magal Vandhal, produced by Suriya and s… [+1831 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Ajay Devgn asks fans to pause and reflect in new song Thahar Ja. Watch video - India Today", "description": "Ajay Devgn has released a new song called Thahar Ja. The song, which has been shot by the actor, marks the debut of his 9-year-old son Yug Devgn as an assistant director.", "url": "https://www.indiatoday.in/movies/celebrities/story/ajay-devgn-asks-fans-to-pause-and-reflect-in-new-song-thahar-ja-watch-video-1671020-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T12:22:30Z", "content": "While the world is grappling with the novel coronavirus pandemic, everyone is trying to stay positive. In this time, many celebrities are taking different means to help fans deal with the crisis.\r\nAjay Devgn has been taking to social media to keep people info… [+1953 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Akshay Kaushal", "title": "Kareena Kapoor Khan to Alia Bhatt: Celebs share their makeup-free selfies during quarantine - Hindustan Times", "description": "Makeup and vanity seem to be the last thing on the mind of these beauties during these testing times.", "url": "https://www.hindustantimes.com/fashion-and-trends/kareena-kapoor-khan-to-alia-bhatt-celebs-share-their-makeup-free-selfies-during-quarantine/story-AlVHIk2BoKZrkacfjVA7ZP.html", "urlToImage": null, "publishedAt": "2020-04-25T12:17:25Z", "content": "Bollywood beauties seem to have taken the au natural route during social distancing and self-isolation, while encouraging their fans on social media by putting their makeup-free selfies with messages worth introspecting. \r\nDuring the quarantine period due to … [+1304 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": "", "title": "Beyond Money Heist, ten international shows to watch during Coronavirus lockdown, from Kingdom to 3% - Firstpost", "description": "If you’re looking to explore different kinds of shows, made in different parts of the world, here is a list on what to get started with", "url": "https://www.firstpost.com/entertainment/beyond-money-heist-ten-international-shows-to-watch-during-coronavirus-lockdown-from-kingdom-to-3-8287201.html", "urlToImage": null, "publishedAt": "2020-04-25T12:03:54Z", "content": "For more recommendations on what to watch during the Coronavirus lockdown, click here.\r\n*\r\nWhen we talk about how much Netflix has pervaded into our lives and changed the way films are made, one of the first things that comes up is how films and shows are now… [+5688 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Vicky Kaushal Celebrates Homecoming Of COVID-19 Warrior Along With Neighbours - News18", "description": "Vicky Kaushal shared a homecoming video of an 11-year-old girl who was tested positive of for the coronavirus. On her return, residents gave her a round of applause.", "url": "https://www.news18.com/news/movies/vicky-kaushal-celebrates-homecoming-of-covid-19-warrior-along-with-neighbours-2592345.html", "urlToImage": null, "publishedAt": "2020-04-25T12:00:50Z", "content": "Bollywood actor Vicky Kaushal recently joined his fellow residents who gathered at the complexs entrance to welcome a COVID-19 warrior. The Raazi actor shared a video on his Instagram to share the glimpses from the moment.\r\nLike a ray of sunshine on a gloomy … [+1320 chars]"}, {"source": {"id": null, "name": "Tellychakkar.com"}, "author": "Tellychakkar Team", "title": "OMG! Vivek Dahiya asks Divyanka to have a control on herself - Tellychakkar", "description": "Television most loved couple Divek goof up in front of the media", "url": "https://www.tellychakkar.com/tv/tv-news/omg-vivek-dahiya-asks-divyanka-have-control-herself-200425", "urlToImage": null, "publishedAt": "2020-04-25T11:55:00Z", "content": "MUMBAI: Divyanka and Vivek are one of the most celebrated television couples. If the two are together today is because of their fans.\r\nThe couple gives the audience and their fans some major couple goals and the fans want to see them together again on screen … [+1051 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "How to use Instagram's new Challenges stickers in your stories - Hindustan Times", "description": "You can nominate your friends and also rise up to a challenge you have been nominated for with the appropriate stickers", "url": "https://www.hindustantimes.com/tech/how-to-use-instagram-s-new-challenges-stickers-in-your-stories/story-Z93NUNIMRf5i5HrvFNNT4J.html", "urlToImage": null, "publishedAt": "2020-04-25T11:53:25Z", "content": "Instagram has launched a new ‘Challenges’ sticker in the Stories gallery. Starting this Saturday, Instagram is testing this feature that makes it easy to join challenges through a sticker, via the stories text tool, or from nominations from friends.\r\n“We’ve s… [+1662 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Virat Kohli thanks Anushka Sharma for switching on lights during live chat with AB de Villiers: ‘Thanks... - Hindustan Times", "description": "Virat Kohli expressed his gratitude to wife Anushka Sharma after she turned on the lights during his live chat session on Friday.", "url": "https://www.hindustantimes.com/bollywood/virat-kohli-thanks-anushka-sharma-for-switching-on-lights-during-live-chat-with-ab-de-villiers-thanks-my-love/story-LEezrrdrYGBl9aUKEvvY3M.html", "urlToImage": null, "publishedAt": "2020-04-25T11:32:00Z", "content": "Actor Anushka Sharma is every bit a considerate wife to her cricketer husband Virat Kohli. It was evident on Friday when Virat was conducting an Instagram Live with AB de Villiers. A sweet gesture by Anushka made Virat smile. \r\nAs it grew dark out during thei… [+1612 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Tom Cruise will be 60 years old by the time Mission Impossible 8 is released, will have played Ethan... - Hindustan Times", "description": "Tom Cruise will be 60 years old, and will have played Ethan Hunt for over a quarter-of-a-century by the time the now delayed Mission: Impossible 8 hits theatres.", "url": "https://www.hindustantimes.com/hollywood/tom-cruise-will-be-60-years-old-by-the-time-mission-impossible-8-is-released-will-have-played-ethan-hunt-for-over-quarter-century/story-y8wlOd2s6rcRKkNXLPTdOJ.html", "urlToImage": null, "publishedAt": "2020-04-25T11:16:00Z", "content": "The theatrical release of Mission: Impossible 7 and Mission: Impossible 8 has been delayed by Paramount, which means that when the eighth film opens in 2022, Tom Cruise will be 60 years old. The seventh instalment in the franchise was initially set to hit the… [+1328 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "THESE throwback vacay photos of Aishwarya-Abhishek, Jaya-Amitabh Bachchan are pure gold! - Times of India", "description": "Due to Coronavirus lockdown, we miss seeing our favourite B-town celebs travelling and holidaying with friends and", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/these-throwback-vacay-photos-of-aishwarya-rai-abhishek-jaya-amitabh-bachchan-are-pure-gold/articleshow/75376177.cms", "urlToImage": null, "publishedAt": "2020-04-25T11:03:00Z", "content": null}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Avengers Endgame is Disney's Most Successful Movie Ever, Made A Whopping Rs 6,868 Crore In Profit - News18", "description": "Avengers: Endgame was the first film ever to surpass USD 1 billion worldwide in its debut, reaching the milestone in just five days.", "url": "https://www.news18.com/news/movies/avengers-endgame-is-disneys-most-successful-movie-ever-made-a-whopping-rs-6868-crore-in-profit-2592397.html", "urlToImage": null, "publishedAt": "2020-04-25T10:58:13Z", "content": "It was a year ago today that Avengers: Endgame opened and shattered multiple box office records, grossing a first-ever USD 1.2 billion (approximately Rs 9,158 crore) worldwide start to beat Avengers: Infinity War by a wide margin.\r\nOn its first anniversary, i… [+1403 chars]"}, {"source": {"id": null, "name": "Indiaglitz.com"}, "author": "IndiaGlitz", "title": "COVID-19: Wife discovers husband's heartbreaking note after he dies! - Malayalam News - IndiaGlitz.com", "description": "After her husband Jonathan died of the coronavirus, Katie Coelho found a goodbye note on his phone, that was heartbreaking.", "url": "https://www.indiaglitz.com/after-husband-dies-of-covid19-wife-finds-his-heartbreaking-note-for-her-malayalam-news-258933", "urlToImage": null, "publishedAt": "2020-04-25T10:57:56Z", "content": "After her husband Jonathan died of the coronavirus, Katie Coelho found a goodbye note on his phone, that was heartbreaking. For the past one month, Jonathan was getting treated for the Coronavirus at a hospital in Danbury, US. On Wednesday, the 32-year-old di… [+1658 chars]"}, {"source": {"id": null, "name": "Tellychakkar.com"}, "author": "Tellychakkar Team", "title": "Erica Fernandes finally fulfills her father’s dream - Tellychakkar", "description": "Erica shares a special bond with her father and finally she has made his dream come true", "url": "https://www.tellychakkar.com/tv/tv-news/erica-fernandes-finally-fulfills-her-father-s-dream-200425", "urlToImage": null, "publishedAt": "2020-04-25T10:44:00Z", "content": "MUMBAI: One of the most popular actresses in the telly land, Erica Fernandes has mesmerised the audience with her acting skills.\r\nThe actress is currently wooing the audience with her performance in Ekta Kapoor's show Kasautii Zindagii Kay. She is also popula… [+1229 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Joker is ‘the first one’ in series, producer Bradley Cooper casually lets slip - Hindustan Times", "description": "Joker producer Bradley Cooper casually revealed in a recent video that when director Todd Phillips first told him the idea for the film, he intended for it to be the ‘first one’ in ‘an altered version of DC’.", "url": "https://www.hindustantimes.com/hollywood/joker-is-the-first-one-in-series-producer-bradley-cooper-casually-lets-slip/story-YDeptiOGe46QVMPXLonjGK.html", "urlToImage": null, "publishedAt": "2020-04-25T10:43:13Z", "content": "Before the release of Joker, director Todd Phillips and actor Joaquin Phoenix had maintained that the film was a standalone story, and they had no intention of turning it into a franchise. But in the months that followed, and the love it received at the Oscar… [+1932 chars]"}, {"source": {"id": null, "name": "Thelivemirror.com"}, "author": null, "title": "KGF 2 actor Yash to romance THIS Bollywood actress in his next? - The Live Mirror", "description": "Tamannah Bhatia — who has already appeared in Tamil, Telugu and Hindi movies — will be seen opposite KGF star Yash in his next. Check out cast", "url": "https://www.thelivemirror.com/tamannah-bhatia-cast-opposite-kgf-2-yash/", "urlToImage": null, "publishedAt": "2020-04-25T10:22:35Z", "content": "Sandalwood superstar Yash is currently gearing up for his much-awaited film KGF Chapter 2. Even before KGF 2 hit the theatres, there have been numerous reports of Yash’s next project doing rounds on social media.\r\nIf anything to go by the latest buzz, Tamanna… [+1556 chars]"}, {"source": {"id": null, "name": "Tellychakkar.com"}, "author": "Tellychakkar Team", "title": "THIS Star Plus’ show may not RETURN post the lockdown - Tellychakkar", "description": "Star Plus' Dadi Amma Dadi Amma Maan Jao to most probably not return post the lockdown.", "url": "https://www.tellychakkar.com/tv/tv-news/star-plus-show-may-not-return-post-the-lockdown-200425", "urlToImage": null, "publishedAt": "2020-04-25T10:00:00Z", "content": "MUMBAI: The lockdown has already hit the TV industry!\r\nRecently, there was news about Sony TV discontinuing three of their shows namely, Beyhadh 2, Ishaaron Ishaaron Mein and Patiala Babes. Yes, the channel has axed the shows and it wont return post the lockd… [+1108 chars]"}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": "Pinkvilla Desk", "title": "Urvashi Rautela warns fans as her Facebook account gets hacked; Mumbai Police informs cyber police - PINKVILLA", "description": "Today, Hate Story fame actress Urvashi Rautela took to Twitter to inform that her Facebook account has been hacked. Read on", "url": "https://www.pinkvilla.com/entertainment/news/urvashi-rautela-warns-fans-her-facebook-account-gets-hacked-mumbai-police-informs-cyber-police-527416", "urlToImage": null, "publishedAt": "2020-04-25T09:49:33Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Throwback: When Mahabharat actors got emotional on the last day of shoot - Times of India", "description": "Mahabharat's rerun has been welcomed by telly viewers during the coronavirus lockdown. Such is the interest in the mythological show that every episode and sequence of the show is discussed on social media. Recently, a video surfaced online from the last day …", "url": "https://timesofindia.indiatimes.com/tv/news/hindi/throwback-when-mahabharat-actors-got-emotional-on-the-last-day-of-shoot/photostory/75374401.cms", "urlToImage": null, "publishedAt": "2020-04-25T09:37:52Z", "content": null}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Varun Dhawan Celebrates Birthday with Girlfriend Natasha Dalal - News18", "description": "Although Varun Dhawan couldn't get out to celebrate his birthday, his friends gathered on a video call to wish the actor.", "url": "https://www.news18.com/news/movies/varun-dhawan-celebrates-birthday-with-girlfriend-natasha-dalal-2592269.html", "urlToImage": null, "publishedAt": "2020-04-25T09:14:16Z", "content": "Coronavirus lockdown didn't stop Bollywood actor Varun Dhawan from having a birthday celebration. Although he couldn't get out to celebrate his birthday, his friends gathered on a video call to wish the actor. \r\nVarun shared a screenshot of the video call to … [+971 chars]"}, {"source": {"id": null, "name": "Koimoi.com"}, "author": null, "title": "Marvel’s Spider-Man 3, Doctor Strange 2, Thor: Love & Thunder Get Rescheduled – Here Are The New Release Dates - Koimoi", "description": "Amidst all the chaos, Marvel's upcoming three films Spider-Man 3, Doctor Strange 2 & Thor: Love and Thunder have been rescheduled.", "url": "https://www.koimoi.com/hollywood-2/marvels-spider-man-3-doctor-strange-2-thor-love-thunder-get-rescheduled-here-are-the-new-release-dates/", "urlToImage": null, "publishedAt": "2020-04-25T08:07:20Z", "content": "Marvel’s Spider-Man 3, Doctor Strange 2, Thor: Love &amp; Thunder Get Rescheduled – Here Are The New Release Dates\r\nThe ongoing Coronavirus Pandemic has hit the world severely. Coronavirus pandemic which started by the end of 2019, became visible to everyone … [+1432 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Prachi Arya", "title": "Akshay Kumar-Kiara Advanis Laxmmi Bomb to skip cinemas, release digitally due to COVID? - Republic World - Republic World", "description": "Amid rumors of theaters being shut for a long time, several reports of Akshay Kumar and Kiara Advani starrer Laxmmi Bomb releasing digitally are doing rounds.", "url": "https://www.republicworld.com/entertainment-news/bollywood-news/is-akshay-kumar-kiara-advani-starrer-laxmmi-bomb-to-release-digitally.html", "urlToImage": null, "publishedAt": "2020-04-25T08:02:20Z", "content": "Amid COVID-19 crisis, Bollywood fraternity seems to be severely affected by the infection as several films have been postponed owing to the theatre shut down. However, with the shutting down of cinemas, digital OTT platforms have become more popular now. Amid… [+2507 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Kanye West officially now a billionaire: Forbes - India Today", "description": "Forbes said that Kanye West has been pressing the magazine for years to be listed as one of its mega-rich but that it declined.", "url": "https://www.indiatoday.in/lifestyle/celebrity/story/kanye-west-officially-now-a-billionaire-forbes-1670924-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T07:54:05Z", "content": "Rapper Kanye West is now a billionaire, thanks largely to the basketball shoes bearing his name that he developed with Adidas, Forbes magazine said on Friday.\r\nThe rough figure of the wealth of Kim Kardashian's hubby is USD 1.3 billion, the magazine said in a… [+1074 chars]"}, {"source": {"id": null, "name": "Ibtimes.co.in"}, "author": "Pramod Gaikwad", "title": "Deepika Padukone should stop interfering in my life and concentrate on her work: Kangana Ranaut [Throwback] - International Business Times, India Edition", "description": "Deepika Padukone and Kangana Ranaut have been at loggerheads ever since Deepika won the Best Actress award for her performance in Happy New Year over Kangana's role in Queen at an award function in 2014.", "url": "https://www.ibtimes.co.in/deepika-padukone-should-stop-interfering-my-life-concentrate-her-work-kangana-ranaut-throwback-818381", "urlToImage": null, "publishedAt": "2020-04-25T07:52:34Z", "content": "Kangana Ranaut had never shied away from expressing her dislike for Deepika Padukone on a public platform. The two have been at loggerheads ever since Deepika won the Best Actress award for her performance in Happy New Year over Kangana's role in Queen at an … [+2312 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Sussanne Khan shares glimpse of her life in lockdown with Hrithik Roshan and their sons. Watch video - India Today", "description": "Sussanne Khan shared a video of Hrithik Roshan and their sons Hridhaan and Hrehaan, spending quality time in lockdown.", "url": "https://www.indiatoday.in/movies/celebrities/story/sussanne-khan-shares-glimpse-of-her-life-in-lockdown-with-hrithik-roshan-and-their-sons-see-pic-1670917-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T07:52:32Z", "content": "Sussanne Khan moved in with ex-husband Hrithik Roshan to co-parent their sons Hridhaan and Hrehaan during this lockdown period. Both Hrithik and Sussanne are making the most of self-quarantine with their kids.\r\nRecently, Sussanne shared a glimpse of her life … [+3026 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Adil Khan", "title": "Who has Triple H dated before marrying WWE Chairmans daughter Stephanie McMahon? - Republic World - Republic World", "description": "Who has Triple H dated? Before dating Stephanie McMahon, Triple H was dating his D-Generation X teammate and former Diva's champion, Chyna.", "url": "https://www.republicworld.com/sports-news/wwe-news/who-has-triple-h-dated-before-marrying-stephanie-mcmahon.html", "urlToImage": null, "publishedAt": "2020-04-25T07:28:53Z", "content": "Paul Levesque aka Triple H and Stephanie McMahon are seemingly the most powerful couple in WWE, right next to Vince and Linda McMahon. Triple H and Stephanie McMahon have been together for more than a decade and have dominated WWE in the ring and in the manag… [+2757 chars]"}, {"source": {"id": null, "name": "Indiaglitz.com"}, "author": "IndiaGlitz", "title": "9th wedding anniversary: Prithviraj's wife pens an emotional note - Malayalam News - IndiaGlitz.com", "description": "As actor Prithviraj Sukumaran remains stranded in Jordan, the actor and his wife Supriya couldn't celebrate their wedding anniversary together this year.", "url": "https://www.indiaglitz.com/9th-wedding-anniversary-prithvirajs-wife-pens-an-emotional-note-malayalam-news-258915", "urlToImage": null, "publishedAt": "2020-04-25T06:46:12Z", "content": "As actor Prithviraj Sukumaran remains stranded in Jordan, the actor and his wife Supriya couldn't celebrate their wedding anniversary together this year. The lovely couple got married nine years ago on this very same day in a private ceremony in Palakkad on A… [+896 chars]"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "PTI", "title": "Police complaint filed against Kangana Ranaut over terrorist remark - Deccan Herald", "description": "A complaint has been filed with police against Bollywood actor Kangana Ranaut for allegedly referring to members of a particular community as terrorists in a video released in support of her sister Rangoli Chandel, an official said on Friday. The complaint wa…", "url": "https://www.deccanherald.com/entertainment/police-complaint-filed-against-kangana-ranaut-over-terrorist-remark-829229.html", "urlToImage": null, "publishedAt": "2020-04-25T06:04:21Z", "content": "A complaint has been filed with police against Bollywood actor Kangana Ranaut for allegedly referring to members of a particular community as terrorists in a video released in support of her sister Rangoli Chandel, an official said on Friday.\r\nThe complaint w… [+604 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Uncharted Movie Release Date Moved Forward Three Months To July 2021 - Screen Rant", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiTGh0dHBzOi8vc2NyZWVucmFudC5jb20vdW5jaGFydGVkLW1vdmllLXJlbGVhc2UtZGF0ZS1tb3ZlZC1mb3J3YXJkLWp1bHktMjAyMS_SAVBodHRwczovL3NjcmVlbnJhbnQuY29tL3VuY2hhcnRlZC1tb3ZpZS1yZWxlYXNlLWRhdGUtbW92ZWQtZm9yd2FyZC1qdWx5LTIwMjEvYW1wLw?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T05:58:19Z", "content": null}, {"source": {"id": null, "name": "Bollywoodhungama.com"}, "author": "Bollywood Hungama", "title": "On his birthday, Varun Dhawan donates towards daily wage labourers of the film industry - Bollywood Hungama", "description": "On his birthday, Varun Dhawan donates towards daily wage labourers of the film industry. Latest Bollywood News, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News at Bollywood Hungama.com", "url": "https://www.bollywoodhungama.com/news/bollywood/birthday-varun-dhawan-donates-towards-daily-wage-labourers-film-industry/", "urlToImage": null, "publishedAt": "2020-04-25T05:02:27Z", "content": "Ashoke Pandit who is the president of Indian Film and TV directors Association took to Twitter to thank Varun Dhawan for his contribution. Sharing the video he wrote, \"@fwice_mum  thanks @Varun_dvn for donating towards the daily wage workers of the entertainm… [+993 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "I Trusted Arhaan But Didn't Know I'd Have To Pay Such A Big Price For It: Rashami Desai - News18", "description": "Rashami and Arhaan dated each other for over a year. However, things went haywire after they entered the Bigg Boss house last season.", "url": "https://www.news18.com/news/movies/i-trusted-arhaan-but-didnt-know-id-have-to-pay-such-a-big-price-for-it-rashami-desai-2591989.html", "urlToImage": null, "publishedAt": "2020-04-25T04:30:32Z", "content": "Rashami Desai got emotional while talking about her former boyfriend Arhaan Khan during an Instagram live session with fans. \r\nRashami and Arhaan dated each other for over a year. However, things went haywire after they entered the Bigg Boss house last season… [+1341 chars]"}, {"source": {"id": null, "name": "Gulte.com"}, "author": null, "title": "Mahesh-Rajamouli: A dream come true with hard realities! - Gulte", "description": "It sounds super enticing and a dream-come-true to many fans of Mahesh Babu when Rajamouli himself ma", "url": "https://www.gulte.com/movienews/1894/mahesh-rajamouli-a-dream-come-true-with-hard-realities", "urlToImage": null, "publishedAt": "2020-04-25T04:05:33Z", "content": "It sounds super enticing and a dream-come-true to many fans of Mahesh Babu when Rajamouli himself made it official about him directing the superstar in his next. It might give goosebumps when fans foresee the combination’s capability in the collections and in… [+2095 chars]"}, {"source": {"id": null, "name": "Spotboye.com"}, "author": "Oshine Koul", "title": "Ramadan 2020: Dipika Kakar Shares Sehri Picture; Flaunts Flawless No Makeup Skin While Posing With Hubby Shoaib Ibrahim - SpotboyE", "description": "Dipika Kakar shared some pictures following the Sehri rituals with husband Shoaib Ibrahim. Filling her Insta stories from ‘Sehri time’ pictures, the actress looks flawless in no makeup look while covering her head with white dupatta", "url": "https://www.spotboye.com/television/television-news/ramadan-2020-dipika-kakar-shares-sehri-picture-flaunts-flawless-no-makeup-skin-while-posing-with-hubby-shoaib-ibrahim/5ea3b2c674f5ce660a2256ee", "urlToImage": null, "publishedAt": "2020-04-25T03:52:06Z", "content": "Bigg Boss 13: Mahira Sharma's Mother Sania On Her Daughter Romantically Bonding With Paras Chhabra, Rashami Mocking Her Lips And Asim Riaz's Emotional Torture- EXCLUSIVE"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Hindustan Times", "title": "Shruti Haasan asked if she’d stalk an ex or be stalked by an ex, here’s her answer - Hindustan Times", "description": "Shruti Haasan played the ‘would you rather’ game  on social media and revealed whether she’d prefer stalking her ex or being stalked by her ex.", "url": "https://www.hindustantimes.com/bollywood/shruti-haasan-asked-if-she-d-stalk-an-ex-or-be-stalked-by-an-ex-here-s-her-answer/story-S6LpLHDjeInPimm1BO9mNJ.html", "urlToImage": null, "publishedAt": "2020-04-25T02:49:34Z", "content": "Shruti Haasan revealed on social media that she would neither stalk her ex nor be stalked by her ex. Shruti on Thursday night was playing the \"Would you rather\" game on Instagram stories where two options were given to her by the automated filter.\r\nThe option… [+753 chars]"}, {"source": {"id": null, "name": "Sportskeeda.com"}, "author": "Raunak Jaiswal", "title": "Roman Reigns takes a dig at tag team recently released by WWE - Sportskeeda", "description": "The former WWE tag team has been a thorn in Roman Reigns' side in the past.", "url": "https://www.sportskeeda.com/wwe/roman-reigns-takes-a-dig-at-tag-team-recently-released-by-wwe", "urlToImage": null, "publishedAt": "2020-04-25T02:49:10Z", "content": "Roman Reigns wasn't holding back in this exchange\r\nIn a shocking turn of events, WWE released over 20 Superstars in addition to furloughing backstage staff last week. To everyone's surprise, The Good Brothers Luke Gallows &amp; Karl Anderson were also among t… [+1792 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Yami Gautam Revisits First Day at School, Shares Childhood Pic in Uniform - News18", "description": "If you want to see actress Yami Gautam in school uniform then head to her Instagram profile right away.", "url": "https://www.news18.com/news/movies/yami-gautam-revisits-first-day-at-school-shares-childhood-pic-in-uniform-2591829.html", "urlToImage": null, "publishedAt": "2020-04-25T02:19:10Z", "content": "If you want to see actress Yami Gautam in school uniform then head to her Instagram profile right away. She has posted a picture of her first day in school.\r\n\"My first day to school! I am sure I did not know what it meant, but was just so excited to get dress… [+627 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Sara Ali Khan Brings Back Her Knock-knock Series with Brother Ibrahim, Watch Hilarious Video - News18", "description": "Sara Ali Khan reprised her iconic knock-knock series with her brother Ibrahim where she made bad jokes with hilarious results amid the Coronavirus lockdown.", "url": "https://www.news18.com/news/movies/sara-ali-khan-brings-back-her-knock-knock-series-with-brother-ibrahim-watch-hilarious-video-2591593.html", "urlToImage": null, "publishedAt": "2020-04-25T01:41:31Z", "content": "Actress Sara Ali Khan is known for her wit and sense of humour on social media. Be it her \"shayaris\", throwback videos or even her knock-knock jokes, Sara keeps her fans entertained. Recently, the actress reprised her iconic knock-knock series with her brothe… [+679 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Horoscope Today, April 25, 2020: Know what your stars have for you - India Today", "description": "Horoscope Today, April 25, 2020: Here's what the stars have in store for you on Saturday.", "url": "https://www.indiatoday.in/india/story/horoscope-today-april-25-2020-know-what-your-stars-have-for-you-1670847-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T00:01:38Z", "content": "Horoscope offers interesting and accurate insights. Let's find out what our stars have in store for us on Saturday, April 25.\r\nARIES Mar 21-Apr 20 Money will come your way from various sources and keeps your bank balance brimming. Though, you will not be in m… [+2355 chars]"}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": "Pinkvilla Desk", "title": "Anushka Sharma and Virat Kohli: Here's how compatible Taurus and Scorpio are in a relationship - PINKVILLA", "description": "Find out whether the two are compatible or not, based on their zodiac sign.", "url": "https://www.pinkvilla.com/lifestyle/love-relationships/anushka-sharma-and-virat-kohli-heres-how-compatible-taurus-and-scorpio-are-relationship-527088", "urlToImage": null, "publishedAt": "2020-04-24T15:56:21Z", "content": null}, {"source": {"id": null, "name": "Swarajyamag.com"}, "author": null, "title": "Vijay Fan Killed By Rajinikanth Fan After Argument Over Which Actor Donated More For Covid-19 Relief - Swarajya", "description": "", "url": "https://swarajyamag.com/insta/vijay-fan-killed-by-rajinikanth-fan-after-argument-over-which-actor-donated-more-for-covid-19-relief", "urlToImage": null, "publishedAt": "2020-04-24T13:41:56Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Bigg Boss 7 fame Ajaz Khan gets bail; tweets ‘justice has prevailed’ - Times of India", "description": "Actor Ajaz Khan was on Friday (April 24) granted bail by Bandra Metropolitan Magistrate court on a surety of Rs 1 l", "url": "https://timesofindia.indiatimes.com/tv/news/hindi/bigg-boss-7-fame-ajaz-khan-gets-bail-tweets-justice-has-prevailed/articleshow/75353668.cms", "urlToImage": null, "publishedAt": "2020-04-24T13:15:00Z", "content": null}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Danny Cyril D Cruze", "title": "Aarogya Setu App: How Bluetooth helps in identifying Covid-19 suspects - Livemint", "description": "The government-owned application is being posed as the primary contact tracing tool in India.Many organisations are planning to include the app in their daily operations to identify potential cases", "url": "https://www.livemint.com/technology/tech-news/aarogya-setu-app-how-bluetooth-helps-in-identifying-covid-19-suspects-11587730877077.html", "urlToImage": null, "publishedAt": "2020-04-24T12:51:31Z", "content": "Many food-delivery services have mandated the use of Aarogya Setu app for their delivery personnel. The government-owned application is being posed as the primary contact tracing tool in India. During Prime Minister Narendra Modis address to the nation, while… [+2367 chars]"}, {"source": {"id": null, "name": "Indiaglitz.com"}, "author": "IndiaGlitz", "title": "Mahesh Babu gives solid feedback on 2-minute massage! - Telugu News - IndiaGlitz.com", "description": "Mahesh Babu's family time is productive.  The other day, Sitara turned into a head massage volunteer as her dad was busy watching Gautham play his game.", "url": "https://www.indiaglitz.com/mahesh-babu-gives-solid-feedback-on-2-minute-massage-telugu-news-258876", "urlToImage": null, "publishedAt": "2020-04-24T12:49:59Z", "content": "Mahesh Babu's family time is productive. The other day, Sitara turned into a head massage volunteer as her dad was busy watching Gautham play his game. \r\n\"Watching GG (Gautham Ghattamaneni) play his game! MB had a head massage volunteer only to finish in 2 mi… [+562 chars]"}, {"source": {"id": null, "name": "Bollywoodbubble.com"}, "author": "Simran Khanna", "title": "Deepika Padukone and Ranveer Singh’s monthly expenditure on food will leave you shell-shocked! - Bollywood Bubble", "description": "<p>Image Source – InstagramDeepika Padukone and Ranveer Singh are one of the most talked-about couples in Bollywood.  Everything about their life is super extravagant. So when you think about their daily food neds you know it is going to be exorbitant.  Did y…", "url": "https://www.bollywoodbubble.com/bollywood-news/deepika-padukone-ranveer-singh-monthly-expenditure-food/", "urlToImage": null, "publishedAt": "2020-04-24T12:13:36Z", "content": "Deepika Padukone and Ranveer Singh are one of the most talked-about couples in Bollywood.  Everything about their life is super extravagant. So when you think about their daily food neds you know it is going to be exorbitant.  Did you know the amount Deepika … [+1195 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Shakir Khan", "title": "New version of Teri Mitti dedicated to COVID-19 warriors leaves netizens teary eyed - Republic World - Republic World", "description": "'Teri Mitti's' new version has left fans teary eyed. This reprised version from the film 'Kesari' has touched the hearts of many. Watch", "url": "https://www.republicworld.com/entertainment-news/music/new-version-of-teri-mitti-dedicated-to-covid-19-warriors.html", "urlToImage": null, "publishedAt": "2020-04-24T11:01:55Z", "content": "The film fraternity has joined hands to spread awareness through various medium to spread awareness on the COVID-19 pandemic. May it be in the form of a video anthem or a song, artists are going all out to spread the message of positivity during this global c… [+2051 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "AFP", "title": "You've got mail: Tom Hanks writes to bullied boy called 'Corona' - Livemint", "description": "Tom Hanks and his wife Rita Wilson contracted Covid-19 in March.Eight-year-old Corona De Vries sent a letter to Hanks asking after his health", "url": "https://www.livemint.com/news/world/you-ve-got-mail-tom-hanks-writes-to-bullied-boy-called-corona-11587712686667.html", "urlToImage": null, "publishedAt": "2020-04-24T07:26:46Z", "content": "Hollywood megastar and coronavirus survivor Tom Hanks has written a comforting letter to a bullied Australian boy called Corona and gifted him a cherished typewriter bearing the same name.Hanks and his wife Rita Wilson contracted COVID-19, the disease caused … [+1102 chars]"}, {"source": {"id": null, "name": "Tecake.com"}, "author": null, "title": "Elite Season 4 is happening!! Expected Release Date and Storyline - The TeCake", "description": "Spanish thriller teen drama web television series, Elite season 3 came out on Netflix and was well received by the audience. The show bagged several", "url": "https://tecake.com/news/elite-season-4-is-happening-expected-release-date-and-storyline-292300.html", "urlToImage": null, "publishedAt": "2020-04-24T06:25:33Z", "content": "Spanish thriller teen drama web television series, Elite season 3 came out on Netflix and was well received by the audience. The show bagged several positive reviews from the critics and fans and created a buzz among teenagers. The show created Carlos Montero… [+3132 chars]"}, {"source": {"id": null, "name": "Tellychakkar.com"}, "author": "Tellychakkar Team", "title": "Amidst BREAK-UP rumours, Rithvik Dhanjani wishes GOOD LUCK to Asha Negi for Baarish; check - Tellychakkar", "description": "Rithvik Dhanjani and Asha Negi have been making headlines for their break-up rumours. Amidst this scenario, the actor has wished the actress for her new project. Read on to know the details.", "url": "https://www.tellychakkar.com/tv/tv-news/amidst-break-rumours-rithvik-dhanjani-wishes-good-luck-asha-negi-baarish-check-200424", "urlToImage": null, "publishedAt": "2020-04-24T05:35:00Z", "content": "MUMBAI: Rithvik Dhanjani and Asha Negi are two of the most popular television actors. The Pavitra Rishta duo has impressed the viewers with their acting skills and amazing chemistry. \r\nThe two have been dating each other for a long time; however, they have be… [+867 chars]"}]}