{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Indianexpress.com"}, "author": "Kshitij Rawat", "title": "Vijay Deverakonda on coronavirus outbreak: Wasn’t prepared mentally or financially - The Indian Express", "description": "Vijay Deverakonda said his foundation has been teaching youngsters skills to make them more employable and this will continue. His dream, Deverakonda said, is to ultimately employ 1 lakh people in his lifetime.", "url": "https://indianexpress.com/article/entertainment/telugu/vijay-deverakonda-on-coronavirus-outbreak-wasnt-prepared-mentally-or-financially-6379875/", "urlToImage": null, "publishedAt": "2020-04-26T10:40:33Z", "content": "Written by Kshitij Rawat\r\n | New Delhi | \r\nUpdated: April 26, 2020 4:09:50 pm\r\nVijay Deverakonda shared what he is doing to help the less fortunate. (Vijay Deverakonda/YouTube)Telugu star Vijay Deverakonda recently posted a video on YouTube detailing his expe… [+1354 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Did you know Ramayan's Lakshman aka Sunil Lahri romanced Sita aka Dipika Chikhlia earlier? - Times of India", "description": "Ramayan has become one of the strongest and most searched words on social media and is trending actively. The mytho", "url": "https://timesofindia.indiatimes.com/tv/news/hindi/did-you-know-ramayans-lakshman-aka-sunil-lahri-romanced-sita-aka-dipika-chikhlia-earlier/articleshow/75389361.cms", "urlToImage": null, "publishedAt": "2020-04-26T09:58:00Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "The Kapil Sharma Show's Archana Puran Singh thanks fans for half a million followers on Instagram; apolog - Times of India", "description": "The Kapil Sharma Show's special judge Archana Puran Singh is extremely active on social media, especially Instagram", "url": "https://timesofindia.indiatimes.com/tv/news/hindi/the-kapil-sharma-shows-archana-puran-singh-thanks-fans-for-half-a-million-followers-on-instagram-apologises-for-not-being-able-to-reply-to-everyone/articleshow/75388801.cms", "urlToImage": null, "publishedAt": "2020-04-26T09:01:00Z", "content": null}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Joel Kurian", "title": "No government gave me any award; didnt get commercial films after Ramayan: Arun Govil - Republic World - Republic World", "description": "Arun Govil stated that no government, either central or state, gave him any award. The actor also said that he didn't get commercial films after 'Ramayan'.", "url": "https://www.republicworld.com/entertainment-news/television-news/ramayan-ram-actor-arun-govil-episode-sita-dd-time-films-awards-governm.html", "urlToImage": null, "publishedAt": "2020-04-26T08:42:02Z", "content": "One often sees artists achieving success in the initial phases of their careers, but failing to sustain it for a long time. The same had happened with Arun Govil, who is back in the news for the re-run of Ramayan. The actor, who played the role of Lord Ram in… [+2158 chars]"}, {"source": {"id": null, "name": "Asianetnews.com"}, "author": null, "title": "Did you know Shah Rukh Khan cheated wife Gauri on their honeymoon? - Asianet News English", "description": "In an event, Shah Rukh Khan revealed a hilarious story from his honeymoon, where he tricked his wife Gauri", "url": "https://newsable.asianetnews.com/gallery/entertainment/did-you-know-shah-rukh-khan-cheated-wife-gauri-on-their-honeymoon--q9dx5f", "urlToImage": null, "publishedAt": "2020-04-26T07:37:19Z", "content": "\"This is my favourite picture...When I got married, I was very poor while Gauri was middle class, well to do. So like how usually everyone does, I had promised her that after we get married, I'll take her to Paris and show her the Eiffel Tower. But obviously,… [+374 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Irrfan Khan attends mother Saeda Begum’s funeral via video conferencing - Hindustan Times", "description": "Irrfan Khan’s mother Saeda Begum died on Saturday morning. The actor could not make it to her funeral, owing to the lockdown.", "url": "https://www.hindustantimes.com/bollywood/irrfan-khan-attends-mother-saeda-begum-s-funeral-via-video-conferencing/story-U1oaroYOIteMiIH1R9zxWO.html", "urlToImage": null, "publishedAt": "2020-04-26T06:37:04Z", "content": "Unable to travel to Rajasthan for his mother Saeda Begum’s last rites, Irrfan Khan was a part of the funeral through video conferencing. Her last rites were performed on Saturday evening at Chungi Naka graveyard on the outskirts of Jaipur. DNA reports that on… [+1143 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Blast from the past! When Suhana Khan turned hairstylist for daddy Shah Rukh Khan on the sets, see pictur - Times of India", "description": "Superstar Shah Rukh Khan and his daughter Suhana Khan are one of the most loved father-daughter duos in town. Not o", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/blast-from-the-past-when-suhana-khan-turned-hairstylist-for-daddy-shah-rukh-khan-on-the-sets-see-picture/articleshow/75387332.cms", "urlToImage": null, "publishedAt": "2020-04-26T06:36:00Z", "content": null}, {"source": {"id": null, "name": "Ibtimes.co.in"}, "author": "Tanvi Lad", "title": "'Do more movies than magazine covers', when Imran Khan criticized Sonam Kapoor - International Business Times, India Edition", "description": "Bollywood actor Imran Khan had openly taken a dig at Sonam Kapoor on national television. This definitely irked the leggy lass but she never reacted to the same.", "url": "https://www.ibtimes.co.in/do-more-movies-magazine-covers-when-imran-khan-criticized-sonam-kapoor-818439", "urlToImage": null, "publishedAt": "2020-04-26T06:26:43Z", "content": "Great validation for women in media: Sonam Kapoor on Veere Di Weddings success\r\nSonam Kapoor can never be untagged from being Bollywood's fashionista. But that's quite unfortunate that Sonam is widely known for her magnificent fashion sense rather than her ac… [+1388 chars]"}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": "Pinkvilla Desk", "title": "7 years of Aashiqui 2: Five reasons why Shraddha & Aditya's romantic drama still leaves an impact on our heart - PINKVILLA", "description": "As Aashiqui 2 starring Shraddha Kapoor and Aditya Roy Kapur completes 7 years, we would like to give you 5 reasons why this romantic drama still leaves an impact on the audience's heart.", "url": "https://www.pinkvilla.com/entertainment/news/7-years-aashiqui-2-five-reasons-why-shraddha-adityas-romantic-drama-still-leaves-impact-our-heart-527572", "urlToImage": null, "publishedAt": "2020-04-26T06:13:44Z", "content": null}, {"source": {"id": null, "name": "Indiaglitz.com"}, "author": "IndiaGlitz", "title": "Thalapathy Vijay's 'Master' confirmed release on Amazon Prime but... - Tamil News - IndiaGlitz.com", "description": "The past few days the Kollywood film industry is in a tussle after Suriya deciding to stream his next movie 'Ponmagal Vandhal' starring Jyothika on Amazon Prime foregoing theatrical release", "url": "https://www.indiaglitz.com/thalapathy-vijays-master-confirmed-release-on-amazon-prime-but-tamil-news-258975", "urlToImage": null, "publishedAt": "2020-04-26T05:48:01Z", "content": "The past few days the Kollywood film industry is in a tussle after Suriya deciding to stream his next movie 'Ponmagal Vandhal' starring Jyothika on Amazon Prime foregoing theatrical release. Theater owners are seeing red and are threatening to boycott the big… [+811 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Malaika Arora crashes Arjun Kapoor’s Instagram live, hilariously trolls him for ‘boring’ quarantine... - Hindustan Times", "description": "Arjun Kapoor’s girlfriend Malaika Arora made fun of his quarantine routine and sarcastically called it “very interesting”.", "url": "https://www.hindustantimes.com/bollywood/malaika-arora-crashes-arjun-kapoor-s-instagram-live-hilariously-trolls-him-for-boring-quarantine-routine/story-g5DKgeWOA2bA5GQSlR9EsL.html", "urlToImage": null, "publishedAt": "2020-04-26T05:44:55Z", "content": "Arjun Kapoor and Malaika Arora never miss a chance to pull each other’s leg, and it was no different on Saturday evening. She crashed her boyfriend’s Instagram live and poked fun at his daily routine during the lockdown.\r\nWith all shoots on hold due to the co… [+1678 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Joel Kurian", "title": "Amitabh Bachchan shares breaking news of bat landing in his room at Jalsa; triggers row - Republic World - Republic World", "description": "As Amitabh Bachchan shared 'breaking news' of a bat in his room, netizens were not pleased and accused him of 'demonising' bats for calling them 'corona.'", "url": "https://www.republicworld.com/entertainment-news/bollywood-news/amitabh-bachchan-bat-room-jalsa-controversy-criticism-corona-films-son.html", "urlToImage": null, "publishedAt": "2020-04-26T05:38:14Z", "content": "People have been venting out at the practice of eatings bats, and bats in general amid reports that the coronavirus originated via this practice. Emraan Hashmi was one of the celebrities who had fumed at the ‘freakish culinary experience’ as the world  suffer… [+4397 chars]"}, {"source": {"id": null, "name": "Tellychakkar.com"}, "author": "Tellychakkar Team", "title": "This is how Sony TV’s Ishaaron Ishaaron Mein was supposed to END! - Tellychakkar", "description": "MUMBAI: The lockdown has already hit the TV industry!", "url": "https://www.tellychakkar.com/tv/tv-news/how-sony-tv-s-ishaaron-ishaaron-mein-was-supposed-end-200426", "urlToImage": null, "publishedAt": "2020-04-26T05:30:00Z", "content": "MUMBAI: The lockdown has already hit the TV industry!\r\nRecently, there was news about Sony TV discontinuing three of their shows namely, Beyhadh 2, Ishaaron Ishaaron Mein and Patiala Babes. Yes, the channel has axed the shows and it wont return post the lockd… [+1012 chars]"}, {"source": {"id": null, "name": "Ibtimes.co.in"}, "author": "Pramod Gaikwad", "title": "Why has Deepika Padukone always refused to work with Salman Khan? - International Business Times, India Edition", "description": "There had been several occassions which could've brought Salman Khan and Deepika Padukone in a film together. But every time, Deepika rejected the offer to work opposite Salman.", "url": "https://www.ibtimes.co.in/why-has-deepika-padukone-always-refused-work-salman-khan-818444", "urlToImage": null, "publishedAt": "2020-04-26T05:24:12Z", "content": "Deepika Padukone may have gotten a dream launch in Bollywood opposite Shah Rukh Khan in Farah Khan's directorial Om Shanti Om, but she is ruling the industry only because of her bold choices of films. She has always been a part of films with female centric ch… [+2530 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "admin", "title": "Sanjivani actor Chandni Bhagwanani stuck in Australia amid lockdown, says blowing through savings to... - Jimmys Post", "description": "", "url": "https://www.hindustantimes.com/tv/sanjivani-actor-chandni-bhagwanani-stuck-in-australia-amid-lockdown-says-blowing-through-savings-to-survive/story-CcO9nRwAbYT6yNgUsiWWHL.html/", "urlToImage": null, "publishedAt": "2020-04-26T05:16:47Z", "content": "Television actor Chandni Bhagwanani is stranded in Australia due to the lockdown owing to the coronavirus pandemic, and is blowing through her savings to survive. Airlines across the world have cancelled flights and countries have sealed their borders to cont… [+1571 chars]"}, {"source": {"id": null, "name": "Bollywoodhungama.com"}, "author": "Bollywood Hungama", "title": "Sachin Tendulkar addresses Ayushmann Khurrana as Professor from Money Heist - Bollywood Hungama", "description": "Sachin Tendulkar addresses Ayushmann Khurrana as Professor from Money Heist . Latest Bollywood News, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News at Bollywood Hungama.com", "url": "https://www.bollywoodhungama.com/news/features/sachin-tendulkar-addresses-ayushmann-khurrana-professor-money-heist/", "urlToImage": null, "publishedAt": "2020-04-26T05:10:43Z", "content": "Now, cricket legend Sachin Tendulkar addressed the Andhadhun actor as the Professor in a tweet. Tendulkar was replying to Ayushmann Khurrana wishing him on his birthday. In his tweet, Sachin wrote, \"Thanks for your prayers &amp; support over the years, 'Profe… [+693 chars]"}, {"source": {"id": null, "name": "Indiaglitz.com"}, "author": "IndiaGlitz", "title": "WOW! Tamannaah takes up the 'Pillow challenge' effortlessly - Tamil News - IndiaGlitz.com", "description": "Tamannaah has surprised her fans by taking up this trending Pillow challenge as she shared a picture of herself wearing a white pillow.", "url": "https://www.indiaglitz.com/tamannaah-takes-up-the-pillow-challenge-effortlessly--tamil-news-258971", "urlToImage": null, "publishedAt": "2020-04-26T05:10:17Z", "content": "Amid the ongoing COVID-19 pandemic and lockdown, the latest challenge that's going viral on the internet is the 'Pillow Challenge' which is being aced by celebrities from across the globe. It seems like the Pillow Challenge has hit many of our Indian celebrit… [+812 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Priyanka Chopra Jonas wears a saree at home as she poses for a romantic picture with hubby Nick Jonas ami - Times of India", "description": "Lockdown has given ample time to our B-town celebrities to spend quality time with their loved ones. Every day we g", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/priyanka-chopra-jonas-wears-a-saree-at-home-as-she-poses-for-a-romantic-picture-with-hubby-nick-jonas-amid-the-lockdown/articleshow/75386442.cms", "urlToImage": null, "publishedAt": "2020-04-26T05:05:00Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Taimur Ali Khan bumps into father Saif Ali Khan’s interview yet again and it is just too cute for words - - Times of India", "description": "Kareena Kapoor Khan and Saif Ali Khan's son Taimur Ali Khan is one of the most loved star kids in Bollywood. He enj", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/taimur-ali-khan-bumps-into-father-saif-ali-khans-interview-yet-again-and-it-is-just-too-cute-for-words-watch/articleshow/75385828.cms", "urlToImage": null, "publishedAt": "2020-04-26T03:48:00Z", "content": null}, {"source": {"id": null, "name": "Whatculture.com"}, "author": "Jamie Kennedy", "title": "How Much Does WWE's New Signature Triple H Championship Cost? - WhatCulture", "description": "It's time to pay 'The Game'...", "url": "https://whatculture.com/wwe/how-much-does-wwes-new-signature-triple-h-championship-cost", "urlToImage": null, "publishedAt": "2020-04-26T03:44:51Z", "content": "WWE.com\r\nWWE Shop has just released a brand new signature championship belt to commemorate Triple H's 25th Anniversary celebrations.\r\nThe replica title, which will be available for purchase on 7 May, has Attitude era style and comes with a personalised leathe… [+858 chars]"}, {"source": {"id": null, "name": "Iwmbuzz.com"}, "author": "Editorial Team", "title": "Unseen Pictures Of Mohsin Khan And Shaheer Sheikh You Must Check Out - IWMBuzz", "description": "Yes! Mohsin Khan and Shaheer Sheikh’s UNSEEN pictures are here!", "url": "https://www.iwmbuzz.com/television/photos/unseen-pictures-mohsin-khan-shaheer-sheikh-must-check/2020/04/26", "urlToImage": null, "publishedAt": "2020-04-26T03:07:58Z", "content": "Dont think that this handsome hunk got fame only because of Yeh Rishta Kya Kehlata Hai. He was more popular even before stepping his shoes as Kartik Goenka in fame daily soap yeh Rishta kya Kehlata hai. His sexy charm, cute smile, clean shaved face, and amazi… [+1058 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "Antara Kashyap", "title": "Karan Johar Apologises Over Posts Showcasing Privileges of Celebrities During Lockdown - News18", "description": "Karan Johar was recently moved by a viral video on  coronavirus called 'Thank You Celebrities' which made him apologise about some of his posts that might be seen an insensitive to many struggling in these times.", "url": "https://www.news18.com/news/movies/karan-johar-apologises-over-posts-showcasing-privileges-of-celebrities-during-coronavirus-lockdown-2592913.html", "urlToImage": null, "publishedAt": "2020-04-26T02:40:37Z", "content": "Karan Johar might have been entertaining fans amid the Coronavirus lockdown with the series \"Lockdown With The Johars,\" where his children poke fun at him, but one thing that is glaring in his post is that he is comfortable at a time when millions of people i… [+2769 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Dr Prem Kumar Sharma & Manisha Koushik", "title": "Horoscope Today: Astrological prediction for April 26, what’s in store for Aries, Leo, Virgo, Sagittarius... - Hindustan Times", "description": "Horoscope Today: Are the stars lined up in your favour? Find out the astrological prediction for Aries, Leo, Virgo, Sagittarius and other zodiac signs for April 26.", "url": "https://www.hindustantimes.com/more-lifestyle/horoscope-today-astrological-prediction-for-april-26-what-s-in-store-for-aries-leo-virgo-sagittarius-and-other-zodiac-signs/story-UZqIshfDA2z09RcKOo28hJ.html", "urlToImage": null, "publishedAt": "2020-04-26T02:39:30Z", "content": "The 12 zodiac signs have their own personality traits and characteristics. Horoscopes give us an insight into our daily life and how it will fare for all of us. Read on to know whether the odds will be in your favour today:\r\n*Aries (March 21-April 20) You wil… [+8191 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Varun-Natasha’s engagement announcement to Police complaint against Kangana Ranaut – here are the newsmakers of the week - Times of India", "description": "Bollywood celebrities are making sure to keep fans entertained through lockdown. From Kartik Aaryan posting videos on social media to Ileana D’Cruz winning the internet with her response to a fan – stars are hitting headlines for all things interesting. And a…", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/varun-natashas-engagement-announcement-to-police-complaint-against-kangana-ranaut-here-are-the-newsmakers-of-the-week/photostory/75383226.cms", "urlToImage": null, "publishedAt": "2020-04-26T02:30:00Z", "content": "Kangana Ranaut hit headlines this week following a police complaint against her. According to IANS, advocate Ali Kaashif Khan Deshmukh has filed a complaint against Kangana for allegedly referring to people of a particular community as \"terrorist\" and coming … [+341 chars]"}, {"source": {"id": null, "name": "Vogue.in"}, "author": "Nupur Sarvaiya", "title": "Aishwarya Rai Bachchan’s pink lehenga from her mehandi is for brides who love soothing hues - VOGUE India", "description": "Aishwarya Rai Bachchan chose a romantic pink lehenga for her pre-wedding celebrations back in 2007. Here's how you can get the look", "url": "https://www.vogue.in/wedding-wardrobe/collection/aishwarya-rai-bachchan-pink-mehandi-lehenga-neeta-lulla-long-blouse-floral-maangtikka-necklace-earrings-abhishek-bachchan/", "urlToImage": null, "publishedAt": "2020-04-26T01:12:38Z", "content": "For her wedding with Abhishek Bachchan back in April 2007, Aishwarya Rai Bachchan served up a good mix of traditional and contemporary bridal looks. While the star dressed in a pastel blue Abu Jani Sandeep Khosla lehenga for her sangeet, a regal gold silk sar… [+1517 chars]"}, {"source": {"id": null, "name": "Jantakareporter.com"}, "author": "https://www.facebook.com/rifat.jawaid", "title": "Farah Khan landed up at Karan Johar's Scotland hotel room at midnight; old video goes viral after Sonam Kapoor attacks choreographer for video criticising Disha Patani and Katrina Kaif - Janta Ka Reporter", "description": "Farah Khan desperately tried to pursue Karan Johar, landed up at his Scotland hotel room at midnight. The old video has gone viral after Sonam Kapoor attacked the choreograoher for video criticising actresses such as Disha Patani and Katrina Kaif.", "url": "http://www.jantakareporter.com/entertainment/farah-khan-landed-up-at-karan-johars-scotland-hotel-room-at-midnight-old-video-goes-viral-after-sonam-kapoor-attacks-choreographer-for-video-criticising-disha-patani-and-katrina-kaif/288717/", "urlToImage": null, "publishedAt": "2020-04-26T00:45:59Z", "content": "Farah Khan recently courted controversy by lashing out at Bollywood stars such as Disha Patani and Katrina Kaif for sharing workout videos during the nationwide lockdown. Her video elicited a terse response from Sonam Kapoor and her sister Rhea Kapoor, who fi… [+2108 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Alok Nayak", "title": "Former WWE Superstar Accuses CM Punk of Stealing His Finisher - Essentially Sports", "description": "GTS( Go to Sleep) a finishing maneuver that CM Punk made famous. However, it was not invented by Punk as per former WWE supertstar, KENTA", "url": "https://www.essentiallysports.com/wwe-news-former-wwe-superstar-accuses-cm-punk-of-stealing-his-finisher/", "urlToImage": null, "publishedAt": "2020-04-26T00:44:00Z", "content": "CM Punk has been away from the WWE ring for years now. However, fans in the arena never miss a chance to appreciate the Voice of the voiceless by chanting his name. CM Punk brought a revolution in WWE when he went against the Bossman, Vince McMahon, and start… [+1665 chars]"}, {"source": {"id": null, "name": "Dawn.com"}, "author": "Images Staff", "title": "Imran Khan shares why the youth needs to watch Dirilis Ertugul - DAWN.com", "description": "The dubbed version of the Turkish drama is airing on PTV as per the Prime Minister's request.", "url": "https://images.dawn.com/news/1185146", "urlToImage": null, "publishedAt": "2020-04-26T00:09:51Z", "content": "Turkish dramas have always been rather popular here but it was a personal recommendation from Imran Khan that put Dirili Erturul on the top of everyone's must-watch list.\r\nIn fact, it was the Prime Minister's request that led to the drama being dubbed in Urdu… [+478 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Alok Nayak", "title": "“Top Five at Worst”- WWE Hall of Famer Makes a Huge Claim About John Cena - Essentially Sports", "description": "After winning WWE champion for record 16 times, should John Cena be on the Mt. Rushmore of WWE? Jim Ross gives his verdict", "url": "https://www.essentiallysports.com/wwe-news-top-five-at-worst-wwe-hall-of-famer-makes-a-huge-claim-about-john-cena/", "urlToImage": null, "publishedAt": "2020-04-25T23:23:00Z", "content": "When you are talking about the greatest pro wrestlers to ever step into the WWE ring the name John Cena comes to the table. Making his debut in the attitude era, John Cena instantly became a fan favorite thanks to his charismatic persona and his in-ring talen… [+1856 chars]"}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": "Pinkvilla Desk", "title": "Shaheer Sheikh urges everyone to pray at home during Ramzan with the sweetest photo ever; Check it out - PINKVILLA", "description": "Shaheer Sheikh shared a post on social media urging everyone to pray from home during Ramzan. Check out the post here.", "url": "https://www.pinkvilla.com/tv/serial-updates/shaheer-sheikh-urges-everyone-pray-home-during-ramzan-sweetest-photo-ever-check-it-out-527556", "urlToImage": null, "publishedAt": "2020-04-25T21:45:16Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Vampire Diaries: Why Nina Dobrev Left After Season 6 - Screen Rant", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiSmh0dHBzOi8vc2NyZWVucmFudC5jb20vdmFtcGlyZS1kaWFyaWVzLXNob3ctbmluYS1kb2JyZXYtZWxlbmEtZXhpdC1yZWFzb24v0gFOaHR0cHM6Ly9zY3JlZW5yYW50LmNvbS92YW1waXJlLWRpYXJpZXMtc2hvdy1uaW5hLWRvYnJldi1lbGVuYS1leGl0LXJlYXNvbi9hbXAv?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T19:15:42Z", "content": null}, {"source": {"id": null, "name": "Abplive.com"}, "author": "ABP News Bureau", "title": "Did 'Nach Baliye 9' Winners END Their Friendship With Arhaan Because Of Rashami? - ABP Live", "description": "According to a recent grapevine, Prince and Yuvika have maintained a distance from Arhaan after they got to know about his reality.", "url": "https://news.abplive.com/entertainment/television/did-prince-narula-yuvika-chaudhary-end-their-friendship-with-arhaan-khan-because-of-rashami-desai-1206040", "urlToImage": null, "publishedAt": "2020-04-25T18:48:58Z", "content": "New Delhi: Salman Khans Bigg Boss 13 managed to become the talk of the town throughout its four-and-a-half month journey. Although, the popular reality show has ended two months back, the BB 13 contestants continue to remain in headlines. Small screens Tapasy… [+2043 chars]"}, {"source": {"id": null, "name": "Telugucinema.com"}, "author": "tc editor", "title": "Pic: Naga Chaitanya's quarantine look - Telugu Cinema", "description": "Naga Chaitanya and his wife Samantha have been kept themselves during this lockdown period. They have cut down posts on social media as well. After being silent on social media for more than two weeks, Samantha is now sharing a pic or two.  She now posted a n…", "url": "https://www.telugucinema.com/news/pic-naga-chaitanyas-quarantine-look", "urlToImage": null, "publishedAt": "2020-04-25T18:33:09Z", "content": "Naga Chaitanya and his wife Samantha have been kept themselves during this lockdown period. They have cut down posts on social media as well. After being silent on social media for more than two weeks, Samantha is now sharing a pic or two. \r\nShe now posted a … [+642 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Kartik Aaryan comments 'Aapki kameez Majnu bhai ne paint ki hai?' on Kriti Sanon's latest post! - Times of India", "description": "Kriti Sanon has been sharing posts of how she is spending time at home during the lockdown. Today, the actress took", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/kartik-aaryan-comments-aapki-kameez-majnu-bhai-ne-paint-ki-hai-on-kriti-sanons-latest-post/articleshow/75383870.cms", "urlToImage": null, "publishedAt": "2020-04-25T18:29:00Z", "content": null}, {"source": {"id": null, "name": "Tecake.com"}, "author": null, "title": "Kylie Jenner no makeup photo is going viral! You won’t recognise her - The TeCake", "description": "Amid Coronavirus pandemic that has forced people to stay in lockdown in their homes, many celebrities have chosen to go with no makeup look. Celebrities", "url": "https://tecake.com/news/kylie-jenner-no-makeup-photo-is-going-viral-you-wont-recognise-her-292533.html", "urlToImage": null, "publishedAt": "2020-04-25T18:23:31Z", "content": "Amid Coronavirus pandemic that has forced people to stay in lockdown in their homes, many celebrities have chosen to go with no makeup look. Celebrities are sharing their photos of bare face and oh boy, they look a lot different without make. It would take yo… [+2682 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Titas Chowdhury", "title": "The name ‘Arjun’ went on to give me everything that I dreamed of: Firoz Khan - Hindustan Times", "description": "Actor Firoz Khan reminisces about the time when producers confused him with Feroz Khan - the Qurbani actor", "url": "https://www.hindustantimes.com/bollywood/the-name-arjun-went-on-to-give-me-everything-that-i-dreamed-of-firoz-khan/story-qgUIbqqrE4ZvSQmcAhjlDP.html", "urlToImage": null, "publishedAt": "2020-04-25T18:12:29Z", "content": "With Mahabharat re-running on DD Bharati and grabbing a lot of eyeballs, actor Firoz Khan who’s known by the moniker Arjun, is on cloud nine. “It’s a proud moment to watch Mahabharat with the present generation. It’s a good opportunity for them to know more a… [+1748 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Urvashi Kandpal", "title": "Thappad to premiere on Amazon Prime Video on May 1, announces Taapsee Pannu - Republic World - Republic World", "description": "Earlier on Saturday,Bollywood actor Taapsee Pannu took to her Instagram account to announce the release of her last film 'Thappad' on the OTT platform on May 1.", "url": "https://www.republicworld.com/entertainment-news/bollywood-news/taapsee-pannu-announces-anubhav-sinhas-thappad-release-on-amazon-prime.html", "urlToImage": null, "publishedAt": "2020-04-25T17:49:50Z", "content": "Bollywood actor Taapsee Pannu's tour de force film Thappad, directed by Anubhav Sinha is all set to release on OTT platform on May 1. The actor took to her Instagram and announced the date on which the film will be launched on Amazon Prime Video. She posted a… [+1952 chars]"}, {"source": {"id": null, "name": "Koimoi.com"}, "author": null, "title": "Avengers: Endgame: Memes Ft. Iron Man, Captain America, Thanos & Others Will Make You Go ROFL On Film’s 1st Anniversary! - Koimoi", "description": "A year ago, Avengers: Endgame released in theatres and it turned out to be the biggest blockbuster worldwide. It was the last time we", "url": "https://www.koimoi.com/hollywood-2/avengers-endgame-memes-iron-man-captain-america-thanos/", "urlToImage": null, "publishedAt": "2020-04-25T16:17:55Z", "content": "Avengers: Endgame: Memes Ft. Iron Man, Captain America, Thanos &amp; Others Will Make You Go ROFL On Film’s 1st Anniversary!\r\nA year ago, Avengers: Endgame released in theatres and it turned out to be the biggest blockbuster worldwide. It was the last time we… [+2963 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "Bohni Bandyopadhyay", "title": "Streaming Now: Have a Thrilling Weekend with Chris Hemsworth's Extraction and Lara Dutta's Hundred - News18", "description": "Chris Hemsworth stars is a dashing mercenary in Extraction, while Lara Dutta and Rinku Rajguru form a quirky crime-solving pair in Hundred.", "url": "https://www.news18.com/news/movies/streaming-now-have-a-thrilling-weekend-with-chris-hemsworths-extraction-and-lara-duttas-hundred-2592423.html", "urlToImage": null, "publishedAt": "2020-04-25T15:44:53Z", "content": "As Netflix dropped its new film Extraction, fans rejoiced at the mini-Marvel reunion. Director Sam Hargrave was stunt coordinator on several Marvel films, Avengers: Endgame director Joe Russo wrote the script, and he and Anthony Russo are producers. Not to me… [+3022 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Amir Khollam", "title": "How many devices can use Amazon Prime Video on a single account? - Republic World - Republic World", "description": "How many devices can use Amazon Prime Video on a single account? has reportedly been a frequently searched question on the internet. Read to know the answer.", "url": "https://www.republicworld.com/technology-news/apps/how-many-devices-can-use-amazon-prime-video-on-a-single-account.html", "urlToImage": null, "publishedAt": "2020-04-25T15:08:00Z", "content": "Amazon Prime Video is one of the most famous streaming platforms in India and across the globe. As per reports, Amazon Prime Video itself has a subscriber base of over 100 million users. The video streaming platform has a number of movies and shows from vario… [+1943 chars]"}, {"source": {"id": null, "name": "Khaleejtimes.com"}, "author": "PTI", "title": "Combating Covid-19: Varun Dhawan donates to help Bollywood's daily wage workers - wknd.", "description": "Actor Varun Dhawan has donated money to help five lakh daily wage workers of the film industry. Several celebrities including Salman Khan, A...", "url": "https://www.khaleejtimes.com/citytimes/bollywood/combating-covid-19-varun-dhawan-donates-to-help-bollywoods-daily-wage-workers", "urlToImage": null, "publishedAt": "2020-04-25T14:44:30Z", "content": "Actor Varun Dhawan has donated money to help five lakh daily wage workers of the film industry. Several celebrities including Salman Khan, Amitabh Bachchan, Ajay Devgn, Rohit Shetty, Arjun Kapoor, Boney Kapoor, Jahnvi Kapoor and others have come forward to he… [+593 chars]"}, {"source": {"id": null, "name": "Heroichollywood.com"}, "author": "Sebastian Peris", "title": "New Photos Of Robert Pattinson Show His Lean Physique For The Batman - Heroic Hollywood", "description": "New photos of Robert Pattinson jogging reveal give fans a better look at his lean physique for Warner Bros. and DC's 'The Batman'.", "url": "https://heroichollywood.com/robert-pattinson-the-batman-physique-lean-photos/", "urlToImage": null, "publishedAt": "2020-04-25T14:30:39Z", "content": "Newly-surfaced photos of The Batman star Robert Pattinson show off the actor’s physique for his role as Bruce Wayne.\r\nWhile production on Matt Reeves’ The Batman was initially underway in the United Kingdom, the ongoing coronavirus outbreak forced Warner Bros… [+1757 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "NewsClicks", "title": "Joker is ‘the first one’ in series, producer Bradley Cooper casually lets slip - NewsClicks", "description": "Before the discharge of Joker, director Todd Phillips and actor Joaquin Phoenix had maintained that the movie was a standalone story, they usually had no intention of turning it right into a franchise. But in the months that adopted, and the adore it obtained…", "url": "https://www.hindustantimes.com/hollywood/joker-is-the-first-one-in-series-producer-bradley-cooper-casually-lets-slip/story-YDeptiOGe46QVMPXLonjGK.html", "urlToImage": null, "publishedAt": "2020-04-25T14:01:35Z", "content": "Before the discharge of Joker, director Todd Phillips and actor Joaquin Phoenix had maintained that the movie was a standalone story, they usually had no intention of turning it right into a franchise. But in the months that adopted, and the adore it obtained… [+1967 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Suniel Shetty says Dhadkan sequel should star his and Akshay Kumar’s sons, Ahan and Aarav - Hindustan Times", "description": "Suniel Shetty says he’s pitched the idea that the Dhadkan sequel should star his and Akshay Kumar’s sons, Ahan and Aarav, to the producer.", "url": "https://www.hindustantimes.com/bollywood/suniel-shetty-says-dhadkan-sequel-should-star-his-and-akshay-kumar-s-sons-ahan-and-aarav/story-otPBbTUVjvwepoDM8byDYN.html", "urlToImage": null, "publishedAt": "2020-04-25T13:57:38Z", "content": "Actor Suniel Shetty feels that both him and Akshay Kumar are too old to appear in a sequel to their 2000 film, Dhadkan, but that their sons, Ahan and Aarav, could take on the mantle. Dhadkan, directed by Dharmesh Darshan, also starred Shilpa Shetty.\r\nSuniel t… [+1192 chars]"}, {"source": {"id": null, "name": "Tellychakkar.com"}, "author": "Tellychakkar Team", "title": "Did Kavita Kaushik just take a dig at Arnab Goswami? - Tellychakkar", "description": "MUMBAI: Journalist and anchor Arnab Goswami recently claimed that some goons attacked his car when he was travelling back home.", "url": "https://www.tellychakkar.com/tv/tv-news/did-kavita-kaushik-just-take-dig-arnab-goswami-200425", "urlToImage": null, "publishedAt": "2020-04-25T13:53:00Z", "content": "MUMBAI: Journalist and anchor Arnab Goswami recently claimed that some goons attacked his car when he was travelling back home. He revealed that he was with his wife when the incident took place. He later took to social media to post a video calling out a pol… [+1274 chars]"}, {"source": {"id": null, "name": "Iwmbuzz.com"}, "author": "Editorial Team", "title": "OMG: No theatre release for Akshay Kumar and Kiara Advani starrer Laxmmi Bomb? - IWMBuzz", "description": "IWMBuzz tells you about the possible OTT release of Laxmmi Bomb. Read the story for more details", "url": "https://www.iwmbuzz.com/movies/news-movies/omg-no-theatre-release-akshay-kumar-kiara-advani-starrer-laxmmi-bomb/2020/04/25", "urlToImage": null, "publishedAt": "2020-04-25T13:30:38Z", "content": "Akshay Kumar and Kiara Advani’s Laxmmi Bomb happened to be one of the biggest releases that Akki and Kiara were looking forward to.\r\nHowever seems like due to the Covid-19 pandemic, things have taken a hit. As per media reports, Laxmmi Bomb might not have a t… [+213 chars]"}, {"source": {"id": null, "name": "Desimartini.com"}, "author": "Sandip Pal", "title": "5 Times Extraction Star Randeep Hooda Experimented With Roles And Emerged A Winner - Desimartini", "description": "Randeep Hooda is surely one of the most underrated actors of Bollywood. The actor lets his work do the talking and is not much bothered about anything else. We don’t quite see Hooda in many advertisem", "url": "https://www.desimartini.com/news/martini-shots/trending/5-times-extraction-star-randeep-hooda-experimented-with-roles-and-emerged-a-winner-article140801.htm", "urlToImage": null, "publishedAt": "2020-04-25T13:05:28Z", "content": "Randeep Hooda is surely one of the most underrated actors of Bollywood. The actor lets his work do the talking and is not much bothered about anything else. We don’t quite see Hooda in many advertisements which imply he steers clear of promoting products be i… [+4048 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Salman Khan looks suave and handsome sporting a beard in THIS latest picture - Times of India", "description": "Salman Khan is currently spending the quarantine period at his farmhouse in Panvel. The actor is spending time with", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/salman-khan-looks-suave-and-handsome-sporting-a-beard-in-this-latest-picture/articleshow/75378474.cms", "urlToImage": null, "publishedAt": "2020-04-25T12:53:00Z", "content": null}, {"source": {"id": null, "name": "Bollywoodhungama.com"}, "author": "Bollywood Hungama", "title": "Disha Patani says she hates pampering herself in a salon - Bollywood Hungama", "description": "Disha Patani says she hates pampering herself in a salon . Latest Bollywood News, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News at Bollywood Hungama.com", "url": "https://www.bollywoodhungama.com/news/features/disha-patani-says-hates-pampering-salon/", "urlToImage": null, "publishedAt": "2020-04-25T12:31:40Z", "content": "Talking to a daily, Disha said that she is very lazy when it comes to beauty treatments. However, with the lockdown in place, the actress is utilising the time doing facials. She said that she has been using face scrubs and masks. The Baaghi 2 actress said th… [+272 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Uday Bhatia", "title": "Film review: ‘Extraction’ on Netflix is a joyless slab of action cinema - Livemint", "description": "Chris Hemsworth lays waste to Dhaka in order to save an Indian drug lord’s kidnapped son in this Netflix film written by Joe Russo", "url": "https://www.livemint.com/mint-lounge/features/film-review-extraction-on-netflix-is-a-joyless-slab-of-action-cinema-11587817372674.html", "urlToImage": null, "publishedAt": "2020-04-25T12:29:38Z", "content": "Sometimes the smallest detail can trip up your experience of a movie. Forty minutes into Extraction, Tyler (Chris Hemsworth) and Ovi (Rudhraksh Jaiswal) are dodging gunmen in a Dhaka building. They break into an apartment, and the famous intro to Didi Tera De… [+3823 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "IANS", "title": "Suriya’s ‘Soorarai Pottru’ could be banned, if Jyothika’s ‘Pon Magal Vandhal’ releases directly on OTT - The Hindu", "description": "Tamil Nadu Theatre And Multiplex Owners’ Association respond to expected release of Jyothika’s film on Amazon Prime next month", "url": "https://www.thehindu.com/entertainment/movies/suriyas-soorarai-pottru-could-be-banned-if-jyothikas-pon-magal-vandhal-releases-directly-on-ott/article31432944.ece", "urlToImage": null, "publishedAt": "2020-04-25T12:25:03Z", "content": "The Tamil Nadu Theatre And Multiplex Owners Association have threatened to ban films starring Suriya, as well as the films produced by his production company 2D films. The decision comes after the news that the film Pon Magal Vandhal, produced by Suriya and s… [+1831 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Malaika Arora Shares Sun Kissed Selfie, Wonders 'What Awaits Us' - News18", "description": "Malaika Arora treated her social media family by sharing a gorgeous picture of her basking in the sun. She keeps sharing pictures from her daily routine.", "url": "https://www.news18.com/news/movies/malaika-arora-shares-sun-kissed-selfie-wonders-what-awaits-us-2592565.html", "urlToImage": null, "publishedAt": "2020-04-25T12:23:25Z", "content": "Bollywood actor Malaika Arora has shared a stunning sun-kissed selfie with her Instagram family.\r\nIn the photo, one can see the wind in her hair, sunlight striking her forehead as she looks up to the camera. Captioning the post, which till now has got over tw… [+1090 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Tom Cruise will be 60 years old by the time Mission Impossible 8 is released, will have played Ethan... - Hindustan Times", "description": "Tom Cruise will be 60 years old, and will have played Ethan Hunt for over a quarter-of-a-century by the time the now delayed Mission: Impossible 8 hits theatres.", "url": "https://www.hindustantimes.com/hollywood/tom-cruise-will-be-60-years-old-by-the-time-mission-impossible-8-is-released-will-have-played-ethan-hunt-for-over-quarter-century/story-y8wlOd2s6rcRKkNXLPTdOJ.html", "urlToImage": null, "publishedAt": "2020-04-25T11:16:00Z", "content": "The theatrical release of Mission: Impossible 7 and Mission: Impossible 8 has been delayed by Paramount, which means that when the eighth film opens in 2022, Tom Cruise will be 60 years old. The seventh instalment in the franchise was initially set to hit the… [+1328 chars]"}, {"source": {"id": null, "name": "Tellychakkar.com"}, "author": "Tellychakkar Team", "title": "Munmun Dutta reports fake TikTok account; shares shocking details - Tellychakkar", "description": "Munmun Dutta shocked to see several TikTok accounts were there by her real and reel name.", "url": "https://www.tellychakkar.com/tv/tv-news/munmun-dutta-reports-fake-tik-tok-account-shares-shocking-details-200425", "urlToImage": null, "publishedAt": "2020-04-25T11:07:00Z", "content": "MUMBAI: Munmun Dutta is currently seen as Babita Krishnan Iyer in SAB TV's longest-running show Taarak Mehta Ka Ooltah Chashma. The show has made the bong beauty a household name.\r\nMunmun enjoys a great fan following on Instagram and keeps sharing all the lat… [+836 chars]"}, {"source": {"id": null, "name": "Koimoi.com"}, "author": null, "title": "Shah Rukh Khan Career Review – Tracing Footsteps: We Don’t Call Him King Of Hearts For No Reason - Koimoi", "description": "Shah Rukh Khan Career Review: If there is one actor who has broken major stereotypes in Bollywood, it has to be King Khan.", "url": "https://www.koimoi.com/bollywood-news/shah-rukh-khan-career-review-tracing-footsteps-we-dont-call-him-king-of-hearts-for-no-reason/", "urlToImage": null, "publishedAt": "2020-04-25T10:34:23Z", "content": "If there is one actor who has broken major stereotypes in Bollywood, it has to be Shah Rukh Khan. Even today when popular TV actors are struggling to make a successful transition to the big screen, SRK had done the unthinkable almost three decades ago. After … [+5525 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Malayalam actor Ravi Vallathol dies at 67 in Thiruvananthapuram - India Today", "description": "Film and television actor Ravi Vallathol died of age-related ailments at his residence in Thiruvananthapuram, Kerala.", "url": "https://www.indiatoday.in/movies/regional-cinema/story/malayalam-actor-ravi-vallathol-dies-at-67-in-thiruvananthapuram-1670968-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T10:31:01Z", "content": "Malayalam actor Ravi Vallathol, aged 67, breathed his last at his residence in Thiruvananthapuram, Kerala. Reportedly, he was unwell for a couple of years and had succumbed to age-related illness today (April 25).\r\nThe actor had stopped doing films and Malaya… [+1359 chars]"}, {"source": {"id": null, "name": "Bollywoodhungama.com"}, "author": "Bollywood Hungama", "title": "Ajay Devgn releases song ‘Thahar Ja’ that urges people to stay calm and happy - Bollywood Hungama", "description": "Ajay Devgn releases song ‘Thahar Ja’ that urges people to stay calm and happy. Latest Bollywood News, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News at Bollywood Hungama.com", "url": "https://www.bollywoodhungama.com/news/bollywood/ajay-devgn-releases-song-thahar-ja-urges-people-stay-calm-happy/", "urlToImage": null, "publishedAt": "2020-04-25T10:27:12Z", "content": "The song that features Ajay Devgn was shot at home by him. The song also features his 9-year-old son Yug. Talking about the song, Ajay said that the song was penned by Anil Verma who has written songs for Tanhaji:The Unsung Warrior as well. Ajay said that the… [+469 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Hindustan Times", "title": "Kanye West officially now a billionaire: Forbes - Hindustan Times", "description": "Forbes magazine has finally included Kanye West on their list of billionaires of the world. The magazine said West has been pressing them to be listed for years.", "url": "https://www.hindustantimes.com/music/kanye-west-officially-now-a-billionaire-forbes/story-RrYr70DZ4f0uj9m6UF4MdJ.html", "urlToImage": null, "publishedAt": "2020-04-25T10:26:06Z", "content": "Rapper Kanye West is now a billionaire thanks largely to the basketball shoes bearing his name that he developed with Adidas, Forbes magazine said Friday. The rough figure of the wealth of Kim Kardashian’s hubby is $1.3 billion, the magazine said in announcin… [+1011 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Sussanne Khan Shares Adorable Family Pic With Hrithik Roshan And Their Kids; See Here - News18", "description": "Sussanne Khan took to her social media to share a candid picture of her ex-husband Hrithik Roshan with their sons Hrehaan and Hridhaan.", "url": "https://www.news18.com/news/movies/sussanne-khan-shares-adorable-family-pic-with-hrithik-roshan-and-their-kids-see-here-2592287.html", "urlToImage": null, "publishedAt": "2020-04-25T09:35:56Z", "content": "Ever since designer Sussanne Khan moved in with ex-husband Hrithik Roshan, to be with their kids during quarantine, her online family has been keenly expecting a glimpse of them together on her feed.\r\nRecently, Sussane took to her social media to share a cand… [+1063 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Milind Soman says Ankita Konwar was cool with his sex scenes in Four More Shots Please!: ‘She was actually... - Hindustan Times", "description": "Days after they celebrated their second wedding anniversary, Milind Soman talks about wife Ankita Konwar’s reaction to his intimate scenes in web series, Four More Shots Please!.", "url": "https://www.hindustantimes.com/bollywood/milind-soman-says-ankita-konwar-was-cool-with-his-sex-scenes-in-four-more-shots-please-she-was-actually-very-excited/story-XmiImsEdVfK5pmksvrTdyN.html", "urlToImage": null, "publishedAt": "2020-04-25T09:27:00Z", "content": "Actor Milind Soman has revealed wife Ankita Konwar was “very excited” about his sex scenes from the web series Four More Shots Please! which also featured him walking in underwear.\r\nMilind told Pinkvilla in an interview, “She was very cool with it (intimate s… [+1598 chars]"}, {"source": {"id": null, "name": "Soompi.com"}, "author": "jeeelim5", "title": "Kim Go Eun And Lee Min Ho Are Closer Than Ever Before In “The King: Eternal Monarch” - soompi", "description": "SBS’s Friday-Saturday drama “The King: Eternal Monarch” has shared new stills of Kim Go Eun and Lee Min Ho closer than ever before. “The King: Eternal Monarch” tells the story of Emperor Lee Gon (Lee Min Ho) and detective Jung Tae Eul (Kim Go Eun), who live i…", "url": "https://www.soompi.com/article/1396589wpp/kim-go-eun-and-lee-min-ho-are-closer-than-ever-before-in-the-king-eternal-monarch", "urlToImage": null, "publishedAt": "2020-04-25T09:03:26Z", "content": "SBSs Friday-Saturday drama The King: Eternal Monarch has shared new stills of Kim Go Eun and Lee Min Ho closer than ever before.\r\nThe King: Eternal Monarch tells the story of Emperor Lee Gon (Lee Min Ho) and detective Jung Tae Eul (Kim Go Eun), who live in pa… [+1251 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Prithviraj on his 9th wedding anniversary with Supriya: Apart for now, but together forever - India Today", "description": "Prithviraj took to Twitter to share an adorable photo with his wife, Supriya Menon, on his 9th wedding anniversary.", "url": "https://www.indiatoday.in/movies/regional-cinema/story/prithviraj-on-his-9th-wedding-anniversary-with-supriya-apart-for-now-but-together-forever-1670931-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T08:48:45Z", "content": "Malayalam actor Prithviraj Sukumaran, who had gone to Jordon for the shooting of Aadujeevitham, is stuck there with the entire team. Today (April 25), the actor is celebrating his ninth wedding anniversary with his wife, Supriya Menon.\r\nOn this special day, P… [+1402 chars]"}, {"source": {"id": null, "name": "Tellychakkar.com"}, "author": "Tellychakkar Team", "title": "Mahira Sharma reveals why she is not in touch with Sidharth Shukla - Tellychakkar", "description": "Mahira Sharma has her own reason to not be in contact with Sidharth Shukla.", "url": "https://www.tellychakkar.com/tv/tv-news/mahira-sharma-reveals-why-she-not-touch-sidharth-shukla-200425", "urlToImage": null, "publishedAt": "2020-04-25T08:40:00Z", "content": "MUMBAI: Mahira Sharma and Paras Chhabra grabbed a lot of attention for their growing closeness in the Bigg Boss 13 house.\r\nWhile both have maintained 'just good friends' status, fans are constantly linking them.\r\nWe all know Sidharth Shukla and Paras Chhabra … [+603 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Anushka Sharma’s Small Gesture During Virat Kohli’s Live Chat Leaves Him Blushing, Watch Here - News18", "description": "Virat Kohli was having an Instagram Live session when his wife helped him by turning on the lights of the room.", "url": "https://www.news18.com/news/movies/anushka-sharmas-small-gesture-during-virat-kohlis-live-chat-leaves-him-blushing-watch-here-2592223.html", "urlToImage": null, "publishedAt": "2020-04-25T08:34:28Z", "content": "Lovebirds Anushka Sharma and Virat Kohli are spending the lockdown time together at their home. The duo is having quite fun in their day to day routine, making each day special for each other.\r\nThe Indian cricket team captain recently had a live chat session … [+1684 chars]"}, {"source": {"id": null, "name": "Koimoi.com"}, "author": null, "title": "’83: Streaming Giant Offers Rs 143 Crore To The Makers Of This Ranveer Singh Starrer To Release Digitally? - Koimoi", "description": "If now the reports are to be believed, a streaming giant with worldwide reach has offered the makers of Ranveer Singh's '83...", "url": "https://www.koimoi.com/bollywood-news/83-streaming-giant-offers-rs-143-crore-to-the-makers-of-this-ranveer-singh-starrer-to-release-digitally/", "urlToImage": null, "publishedAt": "2020-04-25T07:05:06Z", "content": "The Novel Coronavirus outbreak has brought everything to stand still. With cinema halls being closed and everyone practising social distancing, many films have faced the wrath as their release stand postponed. If now the reports are to be believed, a streamin… [+2224 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Pushpa: Bobby Simhaa replaces Vijay Sethupathi in Allu Arjun's film? - India Today", "description": "Bobby Simhaa is said to have replaced Vijay Sethupathi in Allu Arjun's upcoming film, Pushpa, directed by Sukumar.", "url": "https://www.indiatoday.in/movies/regional-cinema/story/pushpa-bobby-simhaa-replaces-vijay-sethupathi-in-allu-arjun-s-film-1670901-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T06:34:15Z", "content": "After the mammoth success of Ala Vaikuntapurramloo, actor Allu Arjun is thrilled about his upcoming film, Pushpa. Directed by Sukumar, the film is based on the lives of red sandalwood smugglers. Earlier, Vijay Sethupathi was rumoured to play the antagonist in… [+1371 chars]"}, {"source": {"id": null, "name": "Hollywoodlife.com"}, "author": "Jade Boren", "title": "Gigi Hadid & Zayn Share Romantic Hug On Her Birthday: It Was ‘The Sweetest Day’ — See Pic - HollywoodLife", "description": "Gigi Hadid and Zayn Malik looked like they'll never let go of one another in this sweet PDA photo, which was snapped on Gigi's 25th birthday. The model couldn't stop gushing about the 'special' day spent with her 'quarantine family.'", "url": "https://hollywoodlife.com/2020/04/25/gigi-hadid-zayn-malik-hug-birthday-photo-pda/", "urlToImage": null, "publishedAt": "2020-04-25T05:34:45Z", "content": "Gigi Hadid and Zayn Malik looked like they’ll never let go of one another in this sweet PDA photo, which was snapped on Gigi’s 25th birthday. The model couldn’t stop gushing about the ‘special’ day spent with her ‘quarantine family.’\r\nZayn Malik, 27, made a c… [+4046 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Asim Riaz Can't Stop Gushing Over Himanshi As She Wishes 'Ramadan Mubarak' With Stunning Pic - News18", "description": "On Friday, Himanshi shared a gorgeous picture of herself to wish fans on the occasion of the onset of the holy month of Ramzan.", "url": "https://www.news18.com/news/movies/asim-riaz-cant-stop-gushing-over-himanshi-khurana-as-she-wishes-ramadan-mubarak-with-stunning-pic-2591913.html", "urlToImage": null, "publishedAt": "2020-04-25T03:44:44Z", "content": "They first met inside the Bigg Boss 13 house and since then Asim Riaz and Himanshi Khurana have been head-over-heels in love with each other. On Friday, Himanshi shared a gorgeous picture of herself to wish fans on the occasion of the onset of the holy month … [+1041 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18.com", "title": "Sobhita Dhulipala Issues Clarification After Being Accused of Lying About 'Self-Clicked' Cover - News18", "description": "Sobhita's statement comes after a series of her behind-the-scenes pictures from the shoot were surfaced online.", "url": "https://www.news18.com/news/lifestyle/sobhita-dhulipala-releases-statement-after-being-accused-of-lying-about-self-clicked-cover-2591861.html", "urlToImage": null, "publishedAt": "2020-04-25T02:46:09Z", "content": "Actress Sobhita Dhulipala has released a statement regarding her \"self-timed\" magazine cover after being accused of lying about clicking them by herself.\r\nSobhita's statement comes after a series of her behind-the-scenes pictures from her Cosmopolitan magazin… [+2087 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Shakir Khan", "title": "New version of Teri Mitti dedicated to COVID-19 warriors leaves netizens teary eyed - Republic World - Republic World", "description": "'Teri Mitti's' new version has left fans teary eyed. This reprised version from the film 'Kesari' has touched the hearts of many. Watch", "url": "https://www.republicworld.com/entertainment-news/music/new-version-of-teri-mitti-dedicated-to-covid-19-warriors.html", "urlToImage": null, "publishedAt": "2020-04-24T11:01:55Z", "content": "The film fraternity has joined hands to spread awareness through various medium to spread awareness on the COVID-19 pandemic. May it be in the form of a video anthem or a song, artists are going all out to spread the message of positivity during this global c… [+2051 chars]"}]}