{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Dr. Prem Kumar Sharma & Manisha Koushik", "title": "Horoscope Today: Astrological prediction for April 25, what’s in store for Aries, Leo, Virgo, Sagittarius... - Hindustan Times", "description": "Horoscope Today: Are the stars lined up in your favour? Find out the astrological prediction for Aries, Leo, Virgo, Sagittarius and other zodiac signs for April 25.", "url": "https://www.hindustantimes.com/more-lifestyle/horoscope-today-astrological-prediction-for-april-25-what-s-in-store-for-aries-leo-virgo-sagittarius-and-other-zodiac-signs/story-kn3yXIPuBA1khSA1MqVbNK.html", "urlToImage": null, "publishedAt": "2020-04-25T02:08:00Z", "content": "The 12 signs of the zodiac have their separate personality traits. Horoscopes have the ability to offer an insight into our life and what will happen in the future. Read on to find out whether the odds will be in your favour today:\r\n*Aries (March 21-April 20)… [+7787 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Samir Jain", "title": "Horoscope Today, 24 April 2020: Check astrological prediction for Leo, Virgo, Libra, Scorpio and other si - Times of India", "description": "Horoscope(Old) News: Wondering whether it will be a power-packed day or a dull, cumbersome one? We have you covered.", "url": "https://timesofindia.indiatimes.com/astrology/horoscope/horoscope-today-24-april-2020-check-astrological-prediction-for-leo-virgo-libra-scorpio-and-other-signs/articleshow/75315676.cms", "urlToImage": null, "publishedAt": "2020-04-25T00:46:52Z", "content": "Wondering whether it will be a power-packed day or a dull, cumbersome one? We have you covered. Read on to know what lies ahead today...Aries Today, you are blessed by moon, which may give you patience. Externally you may face some work related stress but you… [+4386 chars]"}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": "Rhea Bahrani", "title": "Hugh Jackman plans to get back at Ryan Reynolds after the Deadpool star takes a dig at him - PINKVILLA", "description": "Hugh Jackman resumes his fun feud with Ryan Reynolds and says he's planning to get back at him after the Deadpool actor spoiled his anniversary wish for his wife.", "url": "https://www.pinkvilla.com/entertainment/hollywood/hugh-jackman-plans-get-back-ryan-reynolds-after-deadpool-star-takes-dig-him-527185", "urlToImage": null, "publishedAt": "2020-04-24T23:48:14Z", "content": null}, {"source": {"id": null, "name": "Sportskeeda.com"}, "author": "Shruti Sadbhav", "title": "WWE SmackDown Preview: Former Money in the Bank winner to get a crucial second chance, Unexpected guests to interrupt Triple H’s 25th-anniversary celebration? (24th April 2020) - Sportskeeda", "description": "From epic celebrations to important title defenses, what can happen on the Blue brand tonight?", "url": "https://www.sportskeeda.com/wwe/wwe-smackdown-preview-former-money-in-the-bank-winner-to-get-a-crucial-second-chance-unexpected-guests-to-interrupt-triple-h-s-25th-anniversary-celebration", "urlToImage": null, "publishedAt": "2020-04-24T18:03:41Z", "content": "Triple H has an important celebration lined up\r\nWe are set for this week’s episode of SmackDown which has a lot of interesting things in store for us. From Money in the Bank qualifying matches to the much-awaited celebration of Triple H’s 25th anniversary wit… [+1772 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Hindustan Times", "title": "Ekta Kapoor brings together TV stars Sidharth Shukla, Shehnaaz Gill for Bigg Boss-style lockdown video.... - Hindustan Times", "description": "Ekta Kapoor brought together TV stars such as Sidharth Shukla, Shehnaaz Gill, Divyanka Tripathi, Anita Hassanandani, Karan V. Grover, Erica Fernandes and others for Bigg Boss-style lockdown video.", "url": "https://www.hindustantimes.com/tv/ekta-kapoor-brings-together-tv-stars-sidharth-shukla-shehnaaz-gill-for-bigg-boss-style-lockdown-video-watch/story-8ZEVMZZXnV01z1JSJL7CcJ.html", "urlToImage": null, "publishedAt": "2020-04-24T17:55:17Z", "content": "Bigg Boss 13 hit couple Sidharth Shukla and Shehnaz Gill, along with a slew of TV actors including Mouni Roy, Divyanka Tripathi, Anita Hassanandani, Karan V. Grover, Erica Fernandes and Karishma Tanna, are among celebrities who have come together for a specia… [+988 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Police Complaint Against Kangana Ranaut Over Alleged Misuse Of Fame To Promote Hatred In Country - News18", "description": "The complaint accused the actress and her sister-cum-manager Rangoli of \"misusing their stardom, fanbase, fame, money, power and influence with an aim and intent to promote hatred, disbalance, fights in the country.\"", "url": "https://www.news18.com/news/movies/police-complaint-against-kangana-ranaut-over-alleged-misuse-of-fame-to-promote-hatred-in-country-2590487.html", "urlToImage": null, "publishedAt": "2020-04-24T17:51:15Z", "content": "A police complaint has been filed against Bollywood actress Kangana Ranaut for allegedly referring to people of a particular community as \"terrorist\" and coming out in support of her sister Rangoli Chandel, whose Twitter account recently got suspended for all… [+1334 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Bigg Boss 13's Himanshi Khurana wishes 'Ramadan Mubarak' with a beautiful picture; BF Asim Riaz can't sto - Times of India", "description": "Bigg Boss 13's Himanshi Khurana, who is currently with her family in Chandigarh shared a beautiful picture on her I", "url": "https://timesofindia.indiatimes.com/tv/news/hindi/bigg-boss-13s-himanshi-khurana-wishes-ramadan-mubarak-with-a-beautiful-picture-bf-asim-riaz-cant-stop-gushing/articleshow/75360461.cms", "urlToImage": null, "publishedAt": "2020-04-24T17:30:00Z", "content": null}, {"source": {"id": null, "name": "Bollywoodhungama.com"}, "author": "Bollywood Hungama", "title": "Taarak Mehta Ka Ooltah Chashmah’s Palak Sidhwani aka Sonu responds to fan who asked her if she is dating Kush aka Goli - Bollywood Hungama", "description": "Taarak Mehta Ka Ooltah Chashmah’s Palak Sidhwani aka Sonu responds to fan who asked her if she is dating Kush aka Goli. Latest Bollywood News, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News at Bollywood Hungama.com", "url": "https://www.bollywoodhungama.com/news/features/taarak-mehta-ka-ooltah-chashmahs-palak-sidhwani-aka-sonu-responds-fan-asked-dating-kush-aka-goli/", "urlToImage": null, "publishedAt": "2020-04-24T17:10:08Z", "content": "Actress Palak Sidhwani, who plays the character of Sonu in the show, recently had an interaction with her fans through a fun live session. During this interaction, a fan asked the actress whether she is dating Kush Shah, who essays the character of Goli in Ta… [+198 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "With 427% jump in search, Covid-19 blocked out other queries: Yahoo report - Hindustan Times", "description": "Before the lockdown, navigational searches for ‘WhatsApp web’ and ‘YouTube’ were the most searched tools for communication, after the lockdown searches for ‘Zoom’, ‘Skype’, ‘Google Hangouts’, ‘Microsoft Teams’ and ‘GoToMeeting’ took over.", "url": "https://www.hindustantimes.com/india-news/with-427-jump-in-search-covid-19-blocked-out-other-queries-yahoo-report/story-O2khsGT07RRwGfLB8V6HHN.html", "urlToImage": null, "publishedAt": "2020-04-24T17:10:00Z", "content": "A month into the lockdown, search queries for coronavirus-related matters saw a whopping jump of 427%, a report by search engine Yahoo revealed. \r\nThe ‘Search in the Lockdown’ report reveals that while search terms for news events such as ‘Delhi election resu… [+1653 chars]"}, {"source": {"id": null, "name": "Thenewsminute.com"}, "author": null, "title": "Samantha roped in for 'Dia' remake? - The News Minute", "description": "A few days ago, it was reported that there is a huge demand for the remake rights of the Kannada film Dia. The film, which is on Amazon Prime, is currently a hit among the netizens. Dia’s producer D Krishna Chaitanya had said in an interview that he has been …", "url": "https://www.thenewsminute.com/article/samantha-roped-dia-remake-123269", "urlToImage": null, "publishedAt": "2020-04-24T17:09:29Z", "content": "Dias producer had said in an interview that he has been getting calls from filmmakers in various languages enquiring about the remake rights but he is still undecided.A few days ago, it was reported that there is a huge demand for the remake rights of the Kan… [+1732 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Alok Nayak", "title": "“His Opinion Counted”- WWE Hall of Famer Reveals the Truth Behind John Cena’s “Golden Shovel” - Essentially Sports", "description": "Jim Ross gives his verdict on the influence John Cena had in the backstage, on the career of Bella Twins and other superstars", "url": "https://www.essentiallysports.com/wwe-news-his-opinion-counted-wwe-hall-of-famer-reveals-the-truth-behind-john-cena-s-golden-shovel/", "urlToImage": null, "publishedAt": "2020-04-24T16:32:00Z", "content": "One of the most accomplished and loved superstars in the history of WWE, John Cena had a huge influence on the Attitude era and the PG era of the organization. The 16 time WWE champion was the main attraction of countless PPVs. One of the most loved superstar… [+2118 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "When Shah Rukh Khan warned Aamir Khan to not work with Kajol: ‘She is very bad, unfocused’ - Hindustan Times", "description": "Before they came to be known as one of Bollywood’s best romantic pairs, actors Shah Rukh Khan and Kajol got off on the wrong foot.", "url": "https://www.hindustantimes.com/bollywood/when-shah-rukh-khan-warned-aamir-khan-to-not-work-with-kajol-she-is-very-bad-unfocused/story-ohHuC9ZVW9pUEacCoSFHQK.html", "urlToImage": null, "publishedAt": "2020-04-24T16:23:00Z", "content": "They’re known as one of Bollywood’s finest romantic pairs, but did you know that Shah Rukh Khan and Kajol got off on the wrong foot when they first met? In fact, Shah Rukh confessed that he’d even warned Aamir Khan about her, calling her unfocused and ‘very b… [+1544 chars]"}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": "mrinal gujare", "title": "Tamannaah Bhatia shares a fun throwback picture with brother Anand; Says she misses annoying him - PINKVILLA", "description": "The Petromax actress wrote in her Instagram post that she misses annoying her brother Anand and wished that he would be in the country.", "url": "https://www.pinkvilla.com/entertainment/south/tamannaah-bhatia-shares-fun-throwback-picture-brother-anand-says-she-misses-annoying-him-527286", "urlToImage": null, "publishedAt": "2020-04-24T16:16:44Z", "content": null}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Krishna Shroff, Eban Hyams make the most of quarantine, snuggle together in new pic. See here - Hindustan Times", "description": "Krishna Shroff and her boyfriend Eban Hyams are making the best use of their time together in quarantine. Check out their new picture.", "url": "https://www.hindustantimes.com/bollywood/krishna-shroff-eban-hyams-make-the-most-of-quarantine-snuggle-together-in-new-pic-see-here/story-AJHx1IIorfmtMtRt4Kkz5J.html", "urlToImage": null, "publishedAt": "2020-04-24T16:15:24Z", "content": "Actor Tiger Shroff’s sister, Krishna, is making the best use of her time with boyfriend Eban Hyams, during the nationwide coronavirus lockdown. Eban took to Instagram stories on Friday and shared a picture of the two of them enjoying themselves on the couch. … [+1133 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Unseen picture of Arun Govil aka Ram and Arvind Trivedi aka Raavan shaking hands from the Ramayan sets - Times of India", "description": "In the image, Arun Govil, who played Lord Ram can be seen shaking hands with Raavan aka Arvind Trivedi. The picture", "url": "https://timesofindia.indiatimes.com/tv/news/hindi/unseen-picture-of-arun-govil-aka-ram-and-arvind-trivedi-aka-raavan-shaking-hands-from-the-ramayan-sets/articleshow/75358544.cms", "urlToImage": null, "publishedAt": "2020-04-24T16:13:00Z", "content": null}, {"source": {"id": null, "name": "Tellychakkar.com"}, "author": "Tellychakkar Team", "title": "Ananya Panday tries to copy Tara Sutaria - Tellychakkar", "description": "Ananya Panday tried to act like Tara Sutaria. What happened next is worth a watch.", "url": "https://www.tellychakkar.com/movie/movie-news/ananya-panday-tries-copy-tara-sutaria-200424", "urlToImage": null, "publishedAt": "2020-04-24T15:17:00Z", "content": "MUMBAI: Ananya Panday, who debuted last year, showed immense potential right from her first movie. The actress went on to win hearts with her second movie titled Pati Patni Aur Woh, which was a hit at the box office.\r\nAnanya, with her cuteness and her acting … [+1040 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "How 'Extraction' Leaps Into Action | Anatomy of a Scene - The New York Times", "description": "When a Hollywood stunt coordinator sets out to direct his first feature, he knows that the stunts had better be great. Sam Hargrave aimed to make it so by br...", "url": "https://www.youtube.com/watch?v=_M6DabJ7GYM", "urlToImage": null, "publishedAt": "2020-04-24T15:00:18Z", "content": "When a Hollywood stunt coordinator sets out to direct his first feature, he knows that the stunts had better be great. Sam Hargrave aimed to make it so by bringing the camera along for the wild ride in his Netflix thriller Extraction, starring Chris Hemsworth… [+1158 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Paras Chhabra Refutes Rumours of Being in a Cold War with Bigg Boss 13 Winner Sidharth Shukla - News18", "description": "Bigg Boss 13 finalist Paras Chhabra recently addressed rumours that he was in a cold war with the show's winner Sidharth Shukla.", "url": "https://www.news18.com/news/movies/paras-chhabra-refutes-rumours-of-being-in-a-cold-war-with-bigg-boss-13-winner-sidharth-shukla-2591519.html", "urlToImage": null, "publishedAt": "2020-04-24T14:48:41Z", "content": "TV actor Paras Chhabra has ruled out reports of being engaged in a cold war with Bigg Boss 13 winner Sidharth Shukla. Both the actors were participants in the reality show. There were multiple reports about the actors being on not so good terms ever since the… [+1259 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Karisma Kapoor Shares Throwback Still From Song Featuring Govinda, Check It Out - News18", "description": "The shot is from the song Mohabbat Ki Nahin Jaati from 1997 comedy Hero No.1, directed by David Dhawan. Karisma is dancing with her co-star Govinda in the song.", "url": "https://www.news18.com/news/movies/karisma-kapoor-shares-throwback-still-from-song-featuring-govinda-check-it-out-2591471.html", "urlToImage": null, "publishedAt": "2020-04-24T14:48:36Z", "content": "Actress Karisma Kapoor was one of the reigning actresses in Bollywood during the 90s. Recently, Karisma logged into her Instagram account to share a throwback from her heydays. In the image shared by the 45-year-old actress, we see her posing in front of the … [+1152 chars]"}, {"source": {"id": null, "name": "Koimoi.com"}, "author": null, "title": "Chris Hemsworth Is Worthy Of Thor’s Hammer BUT It Seems Wife Elsa Pataky Isn’t Happy About The Same - Koimoi", "description": "Extraction starring Chris Hemsworth released today on Netflix. The buzz around the film is crazy and his fans just can’t stop praising him seeing the film.", "url": "https://www.koimoi.com/hollywood-2/chris-hemsworth-is-worthy-of-thors-hammer-but-it-seems-wife-elsa-pataky-isnt-happy-about-the-same/", "urlToImage": null, "publishedAt": "2020-04-24T14:43:11Z", "content": "Chris Hemsworth Is Worthy Of Thor’s Hammer BUT It Seems Wife Elsa Pataky Isn’t Happy About The Same\r\nExtraction starring Chris Hemsworth released today on Netflix. The buzz around the film is crazy and his fans just cant stop praising him seeing the film. Dir… [+1777 chars]"}, {"source": {"id": null, "name": "Thenewsminute.com"}, "author": null, "title": "Revisiting 'Amarkalam', the film that brought Ajith and Shalini together - The News Minute", "description": "It would be an understatement to say that Amarkalam was an important film in Ajith's career. Not only did the 1999 film directed by Saran pave the way for the actor to do more action films, it was also on the sets of Amarkalam that Ajith fell in love with his…", "url": "https://www.thenewsminute.com:443/article/revisiting-amarkalam-film-brought-ajith-and-shalini-together-123255", "urlToImage": null, "publishedAt": "2020-04-24T14:14:05Z", "content": "The couple completes 20 years of marriage on April 24.It would be an understatement to say that Amarkalam was an important film in Ajith's career. Not only did the 1999 film directed by Saran pave the way for the actor to do more action films, it was also on … [+5298 chars]"}, {"source": {"id": null, "name": "Telugucinema.com"}, "author": "tc editor", "title": "Rajamouli is in, end of chances for Vamshi Paidipally! - Telugu Cinema", "description": "The much-awaited combination of superstar Mahesh Babu and top director Rajamouli has officially been announced. Rajamouli has been reiterating in every interview that he’d take up Mahesh Babu’s film after wrapping up ‘RRR’. So, this project has been sealed.  …", "url": "https://www.telugucinema.com/news/rajamouli-end-chances-vamshi-paidipally", "urlToImage": null, "publishedAt": "2020-04-24T14:06:11Z", "content": "The much-awaited combination of superstar Mahesh Babu and top director Rajamouli has officially been announced. Rajamouli has been reiterating in every interview that hed take up Mahesh Babus film after wrapping up RRR. So, this project has been sealed. \r\nBes… [+782 chars]"}, {"source": {"id": null, "name": "Telugucinema.com"}, "author": "tc editor", "title": "Speculations begin about Koratala's next movie - Telugu Cinema", "description": "In a recent interview, Koratala Siva mentioned that he’d not wait for big stars to give him dates for his next film. He said he’d start a film with whoever is readily available to work with him then. He was miffed with Chiranjeevi’s ‘Acharya’ getting delayed …", "url": "https://www.telugucinema.com/news/speculations-begin-about-koratalas-next-movie", "urlToImage": null, "publishedAt": "2020-04-24T14:06:08Z", "content": "In a recent interview, Koratala Siva mentioned that hed not wait for big stars to give him dates for his next film. He said hed start a film with whoever is readily available to work with him then. He was miffed with Chiranjeevis Acharya getting delayed for v… [+495 chars]"}, {"source": {"id": null, "name": "Swarajyamag.com"}, "author": null, "title": "Vijay Fan Killed By Rajinikanth Fan After Argument Over Which Actor Donated More For Covid-19 Relief - Swarajya", "description": "", "url": "https://swarajyamag.com/insta/vijay-fan-killed-by-rajinikanth-fan-after-argument-over-which-actor-donated-more-for-covid-19-relief", "urlToImage": null, "publishedAt": "2020-04-24T13:41:56Z", "content": null}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Yashika Sharma", "title": "Chiranjeevis niece Niharika Konidela finally opens up about wedding rumours with Prabhas - Republic World - Republic World", "description": "Actor Chiranjeevi's niece Niharika Konidela finally spoke about all the wedding allegations with Baahubali actor Prabhas surfacing on social media. Read.", "url": "https://www.republicworld.com/entertainment-news/regional-indian-cinema/chiranjeevi-niece-niharika-konidela-opens-up-wedding-rumours-prabhas.html", "urlToImage": null, "publishedAt": "2020-04-24T13:40:37Z", "content": "The superstar of South Indian films, Prabas, has been linked with actor Chiranjeevi's niece Niharika Konidela quite a number of times. They had also become a fan-favourite and the audience approved of the prospect of them coming together in marriage. But it s… [+2054 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Saif Ali Khan says son Taimur will be devastated when lockdown ends as he makes a cameo in another ... - Hindustan Times", "description": "Saif Ali Khan’s son Taimur made an adorable appearance in yet another interview of the actor. Here’s what the actor said about him.", "url": "https://www.hindustantimes.com/bollywood/saif-ali-khan-says-son-taimur-will-be-devastated-when-lockdown-ends-as-he-makes-a-cameo-in-another-interview/story-0rdhaQXkKenwyZjLzbu1mN.html", "urlToImage": null, "publishedAt": "2020-04-24T13:37:08Z", "content": "Actor Saif Ali Khan knows his son Taimur will be devastated when the lockdown finally lifts. Thought the little boy misses playing with his friends, he will miss his parently dearly when they return to work. \r\nSpeaking to Rajeev Masand in an interview, Saif s… [+1238 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Sonal Singh", "title": "Akshay Kumar-Karan Johar re-create `Teri Mitti` song amid pandemic crisis, pay tribute to frontline warrior... - Zee News", "description": "Dharma Productions, Cape Of Good Films along with Zee Studios and Azure Entertainment have paid a tribute to these heroes who fight every day to keep us alive and healthy by putting their lives at risk.", "url": "https://zeenews.india.com/music/akshay-kumar-karan-johar-re-create-teri-mitti-song-amid-pandemic-crisis-pay-tribute-to-frontline-warriors-watch-2278713.html", "urlToImage": null, "publishedAt": "2020-04-24T13:19:37Z", "content": "New Delhi: Amid the global health crisis emerging due to the deadly novel coronavirus outbreak, our frontline warriors - doctors, police, sanitation workers and everyone who's working so that others can stay safe need a word of appreciation and support. \r\nThe… [+949 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Bigg Boss 7 fame Ajaz Khan gets bail; tweets ‘justice has prevailed’ - Times of India", "description": "Actor Ajaz Khan was on Friday (April 24) granted bail by Bandra Metropolitan Magistrate court on a surety of Rs 1 l", "url": "https://timesofindia.indiatimes.com/tv/news/hindi/bigg-boss-7-fame-ajaz-khan-gets-bail-tweets-justice-has-prevailed/articleshow/75353668.cms", "urlToImage": null, "publishedAt": "2020-04-24T13:15:00Z", "content": null}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Danny Cyril D Cruze", "title": "Aarogya Setu App: How Bluetooth helps in identifying Covid-19 suspects - Livemint", "description": "The government-owned application is being posed as the primary contact tracing tool in India.Many organisations are planning to include the app in their daily operations to identify potential cases", "url": "https://www.livemint.com/technology/tech-news/aarogya-setu-app-how-bluetooth-helps-in-identifying-covid-19-suspects-11587730877077.html", "urlToImage": null, "publishedAt": "2020-04-24T12:51:31Z", "content": "Many food-delivery services have mandated the use of Aarogya Setu app for their delivery personnel. The government-owned application is being posed as the primary contact tracing tool in India. During Prime Minister Narendra Modis address to the nation, while… [+2367 chars]"}, {"source": {"id": null, "name": "Indiaglitz.com"}, "author": "IndiaGlitz", "title": "Jyothika's speech forces collector to take immediate action - Tamil News - IndiaGlitz.com", "description": "Jyothika the evergreen heroine of Tamil cinema recently spoke at an awards function that when she visited the Tanjore temple", "url": "https://www.indiaglitz.com/jyothikas-speech-forces-collector-to-take-immediate-action-tamil-news-258870", "urlToImage": null, "publishedAt": "2020-04-24T12:21:59Z", "content": "Jyothika the evergreen heroine of Tamil cinema recently spoke at an awards function that when she visited the Tanjore temple she was fascinated by it and appreciated how the government is maintaining it like a palace. On the other hand she pointed out that wh… [+803 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "NewsClicks", "title": "Amala Paul's beach photos goes viral! - NewsClicks", "description": "Actress Amala Paul has been the limelight ever since was seen in a daring function within the film ‘Aadai’ directed by Ratna kumar. While the beautiful actress was within the information just lately for the alleged marriage photos of hers, the younger and pro…", "url": "https://timesofindia.indiatimes.com/entertainment/tamil/movies/news/amala-pauls-beach-photos-goes-viral/articleshow/75342680.cms", "urlToImage": null, "publishedAt": "2020-04-24T11:42:09Z", "content": "Actress Amala Paul has been the limelight ever since was seen in a daring function within the film ‘Aadai’ directed by Ratna kumar. While the beautiful actress was within the information just lately for the alleged marriage photos of hers, the younger and pro… [+1200 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "Shreya Basak", "title": "This Was the First-ever Video Uploaded on YouTube. It's 15 Years Old Now - News18", "description": "In the video titled, 'Me at the Zoo', Karim is seen speaking to the camera, while talking about the elephants standing right behind him.", "url": "https://www.news18.com/news/buzz/this-was-the-first-ever-video-uploaded-on-youtube-its-15-years-old-now-2591065.html", "urlToImage": null, "publishedAt": "2020-04-24T11:16:09Z", "content": "Fifteen years ago, YouTube saw its first video upload featuring co-founder Jawed Karim, standing outside the San Diego Zoo. \r\nAlthough only 18-seconds-long and shot in relatively poor quality by today's standards, it is the video that marked the beginning of … [+964 chars]"}, {"source": {"id": null, "name": "Mirchi9.com"}, "author": "Sridhar Raavi", "title": "First Telugu Movie To Go Digital Release Way - Mirchi9", "description": "Amrutha Ramam Is The First Telugu Movie To Go Digital Release Way - The industry will be watching keenly on how the audience has reacted to the movie. It will be especially crucial for the smaller ones who might be having similar thoughts.", "url": "https://www.mirchi9.com/movienews/amrutha-ramam-is-the-first-telugu-movie-to-go-digital-release-way/", "urlToImage": null, "publishedAt": "2020-04-24T11:05:03Z", "content": null}, {"source": {"id": null, "name": "Koimoi.com"}, "author": null, "title": "Avengers: Endgame: Neither Iron Man Nor Captain America, Fans Think THIS Superhero Should’ve Snapped Fingers To Kill Thanos! - Koimoi", "description": "To save the world from Thanos' evil intentions once again, Iron Man sacrificed his life in Avengers: Endgame. In the climax, Robert Downey Jr", "url": "https://www.koimoi.com/hollywood-2/avengers-endgame-neither-iron-man-nor-captain-america-fans-think-this-superhero-shouldve-snapped-fingers-to-kill-thanos/", "urlToImage": null, "publishedAt": "2020-04-24T10:56:26Z", "content": "Avengers: Endgame: Neither Iron Man Nor Captain America, Fans Think THIS Superhero Should’ve Snapped Fingers To Kill Thanos!\r\nTo save the world from Thanos’ evil intentions once again, Iron Man sacrificed his life in Avengers: Endgame. In the climax, Robert D… [+2158 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Amir Khollam", "title": "Anushka Sharma’s first web series ‘Paatal Lok’s teaser will send chills down the spine - Republic World - Republic World", "description": "Anushka Sharma's production house Clean Slate Films will be venturing into the digital space with 'Paatal Lok', a web series. Check out the teaser below", "url": "https://www.republicworld.com/entertainment-news/bollywood-news/anushka-sharmas-first-web-series.html", "urlToImage": null, "publishedAt": "2020-04-24T10:42:40Z", "content": "Anushka Sharma's production house Clean Slate Films is all set to make its digital debut with the series Paatal Lok which will be an Amazon Prime Video special. The actor recently took to her social media and released the first teaser for Paatal Lok. The teas… [+1892 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Sanya Budhiraja", "title": "Amitabh Bachchan spotted 11 tigers in this picture. How many can you see? - Hindustan Times", "description": "If you like a good optical illusion challenge, this game is for you.", "url": "https://www.hindustantimes.com/it-s-viral/amitabh-bachchan-spotted-11-tigers-in-this-picture-how-many-can-you-see/story-m4hrLkKjO1pfaZcihu1wfI.html", "urlToImage": null, "publishedAt": "2020-04-24T10:04:00Z", "content": "With the recent popularity of Tiger King, it looks like our favourite big cats are everywhere on the Internet nowadays. But this time around, they’re here to boggle your mind in a much-less-provocative manner.\r\nOn April 23, a Twitter user posted this picture … [+1788 chars]"}, {"source": {"id": null, "name": "Koimoi.com"}, "author": null, "title": "Avengers: Endgame: This Latest Theory Suggests Hulk Met Black Widow When He Snapped His Fingers, Here’s How - Koimoi", "description": "In Avengers: Endgame, we witnessed the deaths of two best superheroes - Black Widow (Scarlett Johansson) and Iron Man (Robert Downey Jr).", "url": "https://www.koimoi.com/hollywood-2/avengers-endgame-this-latest-theory-suggests-hulk-met-black-widow-when-he-snapped-his-fingers-heres-how/", "urlToImage": null, "publishedAt": "2020-04-24T09:39:47Z", "content": "Avengers: Endgame: This Latest Theory Suggests Hulk Met Black Widow When He Snapped His Fingers, Here’s How\r\nIn Avengers: Endgame, we witnessed the deaths of two best superheroes – Black Widow (Scarlett Johansson) and Iron Man (Robert Downey Jr). It will be a… [+1521 chars]"}, {"source": {"id": null, "name": "Vogue.in"}, "author": "Garima Gupta", "title": "Worn with a maang tikka, Kim Kardashian West’s crop top + skirt makes a great alternative to lehengas - VOGUE India", "description": "Posted just a few hours ago, Kim Kardashian West’s latest throwback photo sees her in a form-fitting crop top and maxi skirt set styled with traditional accessories", "url": "https://www.vogue.in/wedding-wardrobe/collection/kim-kardashian-west-grey-crop-top-skirt-gold-maangtikka-bangles-lehenga-rick-owens-throwback-picture-self-isolation-home/", "urlToImage": null, "publishedAt": "2020-04-24T09:37:28Z", "content": "Everything Kim Kardashian West wears creates a reaction. From inviting trolls and unsolicited speculation to generating admiration and fast-fashion knockoffs within hours, the influencers outfits never go unnoticed. Most recently, the look in question is one … [+2154 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Malayalam actress Jyothirmayi goes bald during lockdown. See new look - India Today", "description": "Jyothirmayi, who was on a break from social media, went bald during lockdown. Her director-husband, Amal Neerad, took to Instagram to share her new look.", "url": "https://www.indiatoday.in/movies/regional-cinema/story/malayalam-actress-jyothirmayi-goes-bald-during-lockdown-see-new-look-1670535-2020-04-24", "urlToImage": null, "publishedAt": "2020-04-24T08:50:49Z", "content": null}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Hrishikesh Gawade", "title": "Hina Khan shares post-workout photos, says I feel prettiest when I sweat - Republic World - Republic World", "description": "Recent, Hina Khan took to her official Instagram handle and posted a series of photo. Read on to know more about these post-workout photos here.", "url": "https://www.republicworld.com/entertainment-news/bollywood-news/hina-khan-shares-post-workout-photos-says-i-feel-prettiest.html", "urlToImage": null, "publishedAt": "2020-04-24T08:41:17Z", "content": "Hina Khan, who is widely known for Yeh Rishta Kya Kehlata Hai and Bigg Boss, is making the hay while the sun shines. She has been spending her time exercising, cleaning, and cooking amidst the lockdown. Recently, she took to her official social media handle a… [+1663 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Entertainment Desk", "title": "Shilpa Shetty and husband Raj Kundra ace the ‘happy dance’ challenge - The Indian Express", "description": "While Shilpa Shetty was the solo performer in one video, in another video, the Bollywood actor was joined by husband Raj Kundra.", "url": "https://indianexpress.com/article/entertainment/bollywood/shilpa-shetty-raj-kundra-happy-dance-challenge-tiktok-6376885/", "urlToImage": null, "publishedAt": "2020-04-24T07:48:32Z", "content": "Shilpa Shetty and Raj Kundra are loving the world of TikTok. (Photo: Shilpa SHetty/Instagram)Shilpa Shetty has been upping her social media game during the lockdown period. With TikTok and Instagram, Shilpa makes sure to stay connected with her fans. Recently… [+1319 chars]"}, {"source": {"id": null, "name": "Asianetnews.com"}, "author": null, "title": "Kareena Kapoor thinks this about cousin Ranbir Kapoor's girlfriend Alia Bhatt - Asianet News English", "description": "Kareena Kapoor recently talked highly about her cousin brother Ranbir Kapoor's girlfriend Alia Bhatt", "url": "https://newsable.asianetnews.com/gallery/entertainment/kareena-kapoor-thinks-this-about-cousin-ranbir-kapoor-s-girlfriend-alia-bhatt-q9a7x2", "urlToImage": null, "publishedAt": "2020-04-24T07:40:23Z", "content": "Johar said whenever and if ever it has to happen, both Kareena and him \"will be exceptionally happy and we will be standing there with a thali! I do hope, eventually, whenever you do kind of get into that zone, you will actually handle and treat your career l… [+26 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Sania Kader", "title": "Deepika Padukone and Ranveer Singhs healthy diet plan costs a fortune - Republic World - Republic World", "description": "Deepika Padukone and Ranveer Singh's healthy diet plan comes at a huge amount as it is optimised. Have a look at the amount and details on the plan here.", "url": "https://www.republicworld.com/entertainment-news/bollywood-news/deepika-padukone-and-ranveer-singhs-healthy-diet-costs-a-fortune.html", "urlToImage": null, "publishedAt": "2020-04-24T07:26:52Z", "content": "Deepika Padukone and Ranveer Singh reportedly spend a huge amount on their healthy diet to keep fit and fine. They have opted for Personal Optimised Diet Supply which helps them maintain their health at all times. According to an entertainment portal, the mea… [+2103 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "AFP", "title": "You've got mail: Tom Hanks writes to bullied boy called 'Corona' - Livemint", "description": "Tom Hanks and his wife Rita Wilson contracted Covid-19 in March.Eight-year-old Corona De Vries sent a letter to Hanks asking after his health", "url": "https://www.livemint.com/news/world/you-ve-got-mail-tom-hanks-writes-to-bullied-boy-called-corona-11587712686667.html", "urlToImage": null, "publishedAt": "2020-04-24T07:26:46Z", "content": "Hollywood megastar and coronavirus survivor Tom Hanks has written a comforting letter to a bullied Australian boy called Corona and gifted him a cherished typewriter bearing the same name.Hanks and his wife Rita Wilson contracted COVID-19, the disease caused … [+976 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Warda Khan Nadiadwala opens up on Sajid Nadiadwala’s former wife Divya Bharti - Times of India", "description": "Actress Divya Bharti bid adieu to the world at the tender age of 19. She was married producer Sajid Nadiadwala. Aft", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/warda-khan-nadiadwala-opens-up-on-sajid-nadiadwalas-ex-wife-divya-bharti/articleshow/75344050.cms", "urlToImage": null, "publishedAt": "2020-04-24T07:19:00Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Mahabharat and Ramayan's success makes advertisers flock the series - Times of India", "description": "DD relaunched two of its very successful series, Ramayan and Mahabharat, to keep the viewers entertained during pan", "url": "https://timesofindia.indiatimes.com/tv/news/hindi/mahabharat-and-ramayans-success-makes-advertisers-flock-the-series/articleshow/75343640.cms", "urlToImage": null, "publishedAt": "2020-04-24T07:02:00Z", "content": null}, {"source": {"id": null, "name": "Gulte.com"}, "author": null, "title": "Farah Khan Once Wanted To Marry Karan Johar - Gulte", "description": "The ace choreographer Farah Khan, who made a huge number of hit songs in Bollywood, has always maint", "url": "https://www.gulte.com/trends/1692/farah-khan-once-wanted-to-marry-karan-johar", "urlToImage": null, "publishedAt": "2020-04-24T06:13:56Z", "content": "The ace choreographer Farah Khan, who made a huge number of hit songs in Bollywood, has always maintained a good rapport with film fraternity. Among her vast number of close friends is filmmaker Karan Johar. The duo has been maintaining an enviable friendship… [+1420 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Jiya Chulet", "title": "Anushka Sharma fails at Instagram challenge, husband Virat Kohli comes to rescue - Republic World - Republic World", "description": "Actor Anushka Sharma recently attempted a trending online challenge but in vain; husband Virat Kohli came to her rescue and guessed the right answers. Watch.", "url": "https://www.republicworld.com/entertainment-news/bollywood-news/anushka-sharma-fails-at-guessthegibberish-virat-kohli-rescues.html", "urlToImage": null, "publishedAt": "2020-04-24T05:57:12Z", "content": "The current pandemic situation has confined people to homes. Amid the nationwide lockdown, various online challenges are keeping people entertained. But it seems like even stars are enjoying it, as recently, Bollywood actor Anushka Sharma tried a trending onl… [+1805 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Rapper Fred the Godson dies of coronavirus complications at 35 - Hindustan Times", "description": "New York rapper Fred the Godson has died of coronavirus at the age of 35.", "url": "https://www.hindustantimes.com/music/rapper-fred-the-godson-dies-of-coronavirus-complications-at-35/story-AVvrVNpQ5GP6fbrJixN2hL.html", "urlToImage": null, "publishedAt": "2020-04-24T04:35:07Z", "content": "New York rapper Fred the Godson has died of Covid-19 related complications. He was 35. \r\nNews of his death was confirmed by his friend DJ Self on Instagram. “(Fred) was loved by many never heard one bad thing about you RIP @fredthegodsonmusic Sleep Well my br… [+1150 chars]"}, {"source": {"id": null, "name": "Koimoi.com"}, "author": null, "title": "#FlashbackFriday: When Avengers: Endgame Actor Mark Ruffalo AKA Hulk Was ‘FIRED’ By MCU! - Koimoi", "description": "#FlashbackFriday: Mark Ruffalo's Hulk played a key role in Avengers: Endgame when he wore the infinity gauntlet to bring back", "url": "https://www.koimoi.com/hollywood-2/flashbackfriday-avengers-endgame-mark-ruffalo-hulk-fired-mcu/", "urlToImage": null, "publishedAt": "2020-04-24T03:46:26Z", "content": "#FlashbackFriday: When Avengers: Endgame Actor Mark Ruffalo AKA Hulk Was ‘FIRED’ By MCU!\r\n#FlashbackFriday: Mark Ruffalo’s Hulk played a key role in Avengers: Endgame when he wore the infinity gauntlet to bring back the dead heroes. In the process, Mark’s cha… [+2222 chars]"}, {"source": {"id": null, "name": "Mid-day.com"}, "author": null, "title": "Varun Dhawan and Natasha Dalal's romance is straight out of a storybook - entertainment - Mid-Day", "description": "Varun Dhawan and Natasha Dalal are said to tie the knot in an intimate ceremony later this year. But as the country is stuck with the deadly virus, the wedding shenanigans might be delayed. But, as Varun Dhawan turns a year older, let s take a look at Varun a…", "url": "https://www.mid-day.com/photos/varun-dhawan-and-natasha-dalals-romance-is-straight-out-of-a-storybook/83545", "urlToImage": null, "publishedAt": "2020-04-24T03:36:00Z", "content": "<li>The 33-year-old actor Varun Dhawan became a known face to many in a very short span. As the actor turns a year older today, let's take a look at his childhood love story with Natasha Dalal, whom he is said to tie the knot very soon. Considered as one of t… [+7121 chars]"}, {"source": {"id": null, "name": "Gadgetsnow.com"}, "author": "Gadgets Now Bureau", "title": "Coronavirus lockdown: 9 internet safety tips for kids - Gadgets Now", "description": "Advise them not to click on pop-ups, ads or any unknown links as it may result in downloading malware or stealing your personal details", "url": "https://www.gadgetsnow.com/slideshows/coronavirus-lockdown-9-internet-safety-tips-for-kids/Tell-them-to-strictly-not-click-on-pop-ups-ads-or-any-unknown-links/photolist/75340296.cms", "urlToImage": null, "publishedAt": "2020-04-24T03:34:00Z", "content": "The government has announced a nationwide lockdown\r\n to contain coronavirus\r\n. With schools closed, many kids are spending more time online. While the internet is a reservoir of information and brings it right on our fingertips, it also has its share of disad… [+317 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Sunny Leone on life with 3 kids in lockdown: ‘I just have one nanny, chores are divided between Daniel,... - Hindustan Times", "description": "Sunny Leone says her husband Daniel Weber, their nanny and she are taking care of her three kids during the lockdown.", "url": "https://www.hindustantimes.com/bollywood/sunny-leone-on-life-with-3-kids-in-lockdown-i-just-have-one-nanny-chores-are-divided-between-daniel-me-and-her/story-eqwkKHJhuIzex0MK8tEd2H.html", "urlToImage": null, "publishedAt": "2020-04-24T03:20:00Z", "content": "Life with three kids at home can be a task for any parent but even more so when the entire country is in lockdown. Actor Sunny Leone, who has a daughter and two sons, has made sure her family follows a daily plan to keep things and their lives in order.\r\nSpea… [+1601 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Vicky Kaushal shares poem by fan, it traces his journey from refusing job offer to featuring in Uri.... - Hindustan Times", "description": "Vicky Kaushal shares a heartfelt poem penned by a fan that traces his journey from his debut film Masaan to Uri: The Surgical Strike.", "url": "https://www.hindustantimes.com/bollywood/vicky-kaushal-shares-poem-by-fan-it-traces-his-journey-from-refusing-job-offer-to-featuring-in-uri-see-here/story-UXHoB8Yid9bXb9zixjH4ZO.html", "urlToImage": null, "publishedAt": "2020-04-24T03:00:35Z", "content": "Vicky Kaushal has shared a poem written by one of his fans about his journey as an actor from his debut film Masaan to his biggest blockbuster Uri: The Surgical Strike. Sharing the poem on Instagram along with a collage of his five characters from various fil… [+2114 chars]"}, {"source": {"id": null, "name": "Insider.com"}, "author": "Kirsten Acuna", "title": "'Parks and Recreation' will return to TV for one episode April 30 - Insider - INSIDER", "description": "The one-off special will reunite Chris Pratt, Amy Poehler, and more. It will focus on social distancing and help raise money for Feeding America.", "url": "https://www.insider.com/parks-and-recreation-returns-to-tv-2020-4", "urlToImage": null, "publishedAt": "2020-04-24T00:19:05Z", "content": "After five years, we're returning to Pawnee.\r\n\"Parks and Recreation\" is returning to TV for one new episode at the month's end. The original cast, including Amy Poehler and Chris Pratt, will star on a special 30-minute episode to help raise money for Feeding … [+2073 chars]"}, {"source": {"id": null, "name": "Greatandhra.com"}, "author": "GREATANDHRA BUREAU", "title": "PK's Bold Message To Rajamouli.. - Greatandhra.com", "description": "Prashanth Kumar is a lesser known director and producer in Tollywood who made the film Mithai in 2019.", "url": "https://www.greatandhra.com/movies/news/pks-bold-message-to-rajamouli-104201", "urlToImage": null, "publishedAt": "2020-04-23T19:21:02Z", "content": "Prashanth Kumar is a lesser known director and producer in Tollywood who made the film Mithai in 2019. But he is now popular with his sensible open letter to the Bahubalian director SS Rajamouli. \r\nIt is known that Rajamouli has been facing several online tro… [+2314 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "India TV Entertainment Desk", "title": "'Oh bhai maaro mujhe': Mahabharat memes storm internet as netizens confuse pillar design with cooler - India TV News", "description": "Pillar design or cooler? Netizens are ROFL-ing ever since they spotted an 'air cooler' in a scene of Mahabharat. The BR Chopra show is currently on rerun on Doordarshan amid lockdown. mukesh khanna bhishma pitamah cooler meme", "url": "https://www.indiatvnews.com/entertainment/tv/cooler-bhishma-pitamah-mahabharat-doordarshan-twitter-memes-610676", "urlToImage": null, "publishedAt": "2020-04-23T18:28:57Z", "content": "Memes flooded internet after netizens confused pillar design with cooler in Mahabharat\r\nBR Chopra's Mahabharat is one of the shows being re-telecast on Doordarshan amid lockdown. The old classics have sent the netizens down the memory lane when Sunday used to… [+1885 chars]"}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": "Pinkvilla Desk", "title": "Taarak Mehta Ka Ooltah Chashmah: Did you know Priya Ahuja aka Rita reporter is married to the show's director? - PINKVILLA", "description": "Taarak Mehta Ka Ooltah Chashmah fame Priya Ahuja aka Rita reporter recently revealed the biggest mistake of her life and it will leave you stunned. Take a look.", "url": "https://www.pinkvilla.com/tv/news-gossip/taarak-mehta-ka-ooltah-chashmah-did-you-know-priya-ahuja-aka-rita-reporter-married-shows-director-526802", "urlToImage": null, "publishedAt": "2020-04-23T18:01:55Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Bigg Boss 13's Rashami Desai warns ex-Arhaan Khan: I expect pictures, videos of our personal moments are - Times of India", "description": "Bigg Boss 13's Rashami Desai, who had an ugly break-up with Arhaan Khan recently took to social media to vent her e", "url": "https://timesofindia.indiatimes.com/tv/news/hindi/bigg-boss-13s-rashami-desai-warns-ex-arhaan-khan-i-expect-pictures-videos-of-our-personal-moments-are-not-used-for-publicity/articleshow/75332774.cms", "urlToImage": null, "publishedAt": "2020-04-23T17:51:00Z", "content": null}, {"source": {"id": null, "name": "Iwmbuzz.com"}, "author": "Editorial Team", "title": "Priyanka Chopra Jonas and Kim Kardashian look like SISTERS, Check Picture - IWMBuzz", "description": "IWMBuzz shows you a picture where Priyanka Chopra Jonas and Kim Kardashian look like real-life sisters. Check out the photo for more details", "url": "https://www.iwmbuzz.com/movies/celebrities-movies/priyanka-chopra-jonas-kim-kardashian-look-like-sisters-check-picture/2020/04/23", "urlToImage": null, "publishedAt": "2020-04-23T15:10:36Z", "content": "When it comes to the world of entertainment and cinema, Priyanka Chopra Jonas and Kim Kardashian are two of the biggest names. Priyanka’s Hollywood stint started on a high post which she also met music sensation, Nick Jonas, at the Met Gala. Since then, the d… [+495 chars]"}, {"source": {"id": null, "name": "Tellychakkar.com"}, "author": "Tellychakkar Team", "title": "Shefali Jariwala reveals THIS BB13 contestant is not in their WhatsApp group - Tellychakkar", "description": "MUMBAI: It's been a long time since Bigg Boss 13 has ended with Sidharth Shukla being declared as the winner of the show.", "url": "https://www.tellychakkar.com/tv/tv-news/shefali-jariwala-reveals-bb13-contestant-not-their-whatsapp-group-200423", "urlToImage": null, "publishedAt": "2020-04-23T15:07:00Z", "content": "MUMBAI: It's been a long time since Bigg Boss 13 has ended with Sidharth Shukla being declared as the winner of the show. However, the contestants of the show are still in the news for various reasons.  \r\nWe all know a lot of contestants shared cold vibes wit… [+741 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "After Ramayan, Ramanand Sagar's Shri Krishna to return to Doordarshan - India Today", "description": "Ramanand Sagar's Shri Krishna, starring Swappnil Joshi, is set to be back on DD National.", "url": "https://www.indiatoday.in/television/soaps/story/after-ramayan-ramanand-sagar-s-shri-krishna-to-return-on-doordarshan-1670255-2020-04-23", "urlToImage": null, "publishedAt": "2020-04-23T13:34:58Z", "content": null}, {"source": {"id": null, "name": "Gqindia.com"}, "author": "Yash Bharati", "title": "7 most-underrated shows on Amazon Prime Video to binge during the lockdown - GQ India", "description": "These underrated shows on amazon prime video will help you take a break from the regulars and are definitely worth a binge.", "url": "https://www.gqindia.com/binge-watch/collection/underrated-shows-on-amazon-prime-video-to-binge-during-the-lockdown/", "urlToImage": null, "publishedAt": "2020-04-23T12:53:49Z", "content": null}, {"source": {"id": null, "name": "Iwmbuzz.com"}, "author": "Editorial Team", "title": "Dhvani Bhanushali songs to listen to during quarantine - IWMBuzz", "description": "Dhvani Bhanushali the pop singer of today’s era has gained name and fame for her song rendition. And we pick her best work for this quarantine playloop.", "url": "https://www.iwmbuzz.com/music/snippets-music/dhvani-bhanushali-songs-listen-quarantine/2020/04/23", "urlToImage": null, "publishedAt": "2020-04-23T12:18:12Z", "content": "Dhvani Bhanushali is a glam-doll singer who has gained name and fame at a very young age. Her soothing vocals and great voice tonality puts her at the top in the elite group of singers.\r\nHer Live performances are a rage and an instant hit. Her songs are playe… [+469 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Complaint Filed Against Choti Sardaarni Actress Anita Raaj for Inviting Friends at Home, She Clarifies - News18", "description": "Reports claim that Actress Anita Raaj and her husband entertained a few guests at their Pali Hill residence recently, during the COVID-19 lockdown.", "url": "https://www.news18.com/news/movies/complaint-filed-against-choti-sardaarni-actress-anita-raaj-for-inviting-friends-at-home-she-clarifies-2589647.html", "urlToImage": null, "publishedAt": "2020-04-23T11:18:42Z", "content": "The ongoing coronavirus pandemic has made each of us extra cautious about the possible transmission of the virus. To flatten the curve, the health officials have asked people to stay inside their homes and avoid social gatherings of any kind.\r\nHowever, accord… [+1151 chars]"}, {"source": {"id": null, "name": "Koimoi.com"}, "author": null, "title": "Happy Birthday John Cena! 10 Times WWE Wrestler Took The Internet By Storm By Sharing Pics Of Shah Rukh Khan, Kapil Sharma & Other Indian Celebs - Koimoi", "description": "What makes John Cena so popular with the Indian audience? Besides being a much loved wrester from the WWE, the athlete-turned-actor-turned", "url": "https://www.koimoi.com/outside-bollywood/wwe/happy-birthday-john-cena-10-times-wwe-wrestler-internet-by-storm-pics-of-shah-rukh-khan-kapil-sharma-indian-celebs/", "urlToImage": null, "publishedAt": "2020-04-23T11:14:58Z", "content": "Happy Birthday John Cena! 10 Times WWE Wrestler Took The Internet By Storm By Sharing Pics Of Shah Rukh Khan, Kapil Sharma &amp; Other Indian Celebs\r\nWhat makes John Cena so popular within the Indian audience? Besides being a much loved wrester from the WWE, … [+3408 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "5 Alia Bhatt-Ranbir Kapoor moments which will make you root for them - Times of India", "description": "After multiple dinner dates and hush-hush sightings around the town, Bollywood’s new lovebirds Alia Bhatt and Ranbir Kapoor finally came out in public as a couple and since then there has been no looking back. The couple has been painting the town red with th…", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/5-alia-bhatt-ranbir-kapoor-moments-which-will-make-you-root-for-them/photostory/75315080.cms", "urlToImage": null, "publishedAt": "2020-04-23T10:09:49Z", "content": "After multiple dinner dates and hush-hush sightings around the town, Bollywood’s new lovebirds Alia Bhatt and Ranbir Kapoor finally came out in public as a couple and since then there has been no looking back. The couple has been painting the town red with th… [+196 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Srinivasa Ramanujam", "title": "Kamal Haasan releases new song ‘Arivum Anbum’, states that ‘knowledge and love’ is the need of the hour - The Hindu", "description": "The actor-politician talks about his new virtually-conceived project to spread positivity during the global lockdown", "url": "https://www.thehindu.com/entertainment/movies/kamal-haasan-releases-new-song-arivum-anbum-states-that-knowledge-and-love-is-the-need-of-the-hour/article31413543.ece", "urlToImage": null, "publishedAt": "2020-04-23T09:03:58Z", "content": "Actor Kamal Haasan is trying to spread hope through music. His latest creation, Arivum Anbum, a song that sees big names of the film industry teaming up, is a number to spread positivity in these troubled times.\r\nI hope this song is therapy, a calming factor … [+3454 chars]"}, {"source": {"id": null, "name": "Beebom.com"}, "author": "Subin B", "title": "YouTube Announces 11 New Free YouTube Originals - Beebom", "description": "YouTube has announced 11 new free YouTube Originals to help people pass the time while they are under the Coronavirus lockdown.", "url": "https://beebom.com/11-more-youtube-originals-free/", "urlToImage": null, "publishedAt": "2020-04-23T06:09:41Z", "content": "YouTube has announced 11 new YouTube Originals for free amidst this coronavirus pandemic. A few of them are available right now while the majority of the shows will be live later this month or next month.\r\n“Today we announced 11 free new #YouTubeOriginals to … [+1542 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Sonam Kapoor reveals how she fell in love with Anand Ahuja post Neerja release, he teases her for getting... - Hindustan Times", "description": "Sonam Kapoor has shared a picture from a photoshoot after Neerja. She has talked about falling in love with Anand Ahuja after the film’s release.", "url": "https://www.hindustantimes.com/bollywood/sonam-kapoor-reveals-how-she-fell-in-love-with-anand-ahuja-post-neerja-release-he-teases-her-for-getting-emotional-see-pic/story-Oy8jLR85GhgB3lI3vJaVNP.html", "urlToImage": null, "publishedAt": "2020-04-23T04:47:31Z", "content": "Sonam Kapoor has shared an emotional note from the days of the release of her award-winning film, Neerja. Sharing a picture from an old photo shoot, she wrote how she took a break after the film’s release to soak in the success and ended up falling in love wi… [+1656 chars]"}]}