{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Indiaglitz.com"}, "author": "IndiaGlitz", "title": "WOW! Tamannaah takes up the 'Pillow challenge' effortlessly - Malayalam News - IndiaGlitz.com", "description": "Tamannaah has surprised her fans by taking up this trending Pillow challenge as she shared a picture of herself wearing a white pillow.", "url": "https://www.indiaglitz.com/wow-tamannaah-takes-up-the-pillow-challenge-effortlessly-malayalam-news-258965", "urlToImage": null, "publishedAt": "2020-04-25T15:30:08Z", "content": "Amid the ongoing COVID-19 pandemic and lockdown, the latest challenge that's going viral on the internet is the 'Pillow Challenge' which is being aced by celebrities from across the globe. It seems like the Pillow Challenge has hit many of our Indian celebrit… [+812 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Irrfan's mother Saeeda Begum dies in Jaipur - India Today", "description": "Actor Irrfan's mother Saeeda Begum died due to natural causes in Jaipur.", "url": "https://www.indiatoday.in/movies/celebrities/story/irrfan-s-mother-saeeda-begum-dies-in-jaipur-1671060-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T14:25:02Z", "content": "Irrfan's mother Saeeda Begum took her last breath on Saturday (April 25) morning. According to a report in ANI, Saeeda was unwell for a long time and died due to natural causes. She resided at the Beniwal Kanta Krishna Colony in Jaipur.\r\nSaeeda belongs to a N… [+1221 chars]"}, {"source": {"id": null, "name": "Tellychakkar.com"}, "author": "Tellychakkar Team", "title": "Did Kavita Kaushik just take a dig at Arnab Goswami? - Tellychakkar", "description": "MUMBAI: Journalist and anchor Arnab Goswami recently claimed that some goons attacked his car when he was travelling back home.", "url": "https://www.tellychakkar.com/tv/tv-news/did-kavita-kaushik-just-take-dig-arnab-goswami-200425", "urlToImage": null, "publishedAt": "2020-04-25T13:53:00Z", "content": "MUMBAI: Journalist and anchor Arnab Goswami recently claimed that some goons attacked his car when he was travelling back home. He revealed that he was with his wife when the incident took place. He later took to social media to post a video calling out a pol… [+1274 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "6 Ways Doctor Strange 2 Could Be A Game-Changer For The MCU - CBR", "description": "Multiverse of Madness Could Change the MCU Forever SUBSCRIBE NOW to CBR! Click here: http://bit.ly/Subscribe-to-CBR We all know that the Infinity Saga was a ...", "url": "https://www.youtube.com/watch?v=_f0Jc21vK5Q", "urlToImage": null, "publishedAt": "2020-04-25T13:45:00Z", "content": "Multiverse of Madness Could Change the MCU ForeverSUBSCRIBE NOW to CBR! Click here: http://bit.ly/Subscribe-to-CBR\r\nWe all know that the Infinity Saga was a major game changer for the Marvel Cinematic Universe, but lets not forget about Phase Fours Doctor Str… [+1433 chars]"}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": "twinklekhanna", "title": "When Janhvi Kapoor and Khushi Kapoor’s offbeat yet stylish looks stole the show on the red carpet - PINKVILLA", "description": "Janhvi Kapoor and Khushi Kapoor have always rocked the red carpet with their style. In a throwback photo, both Janhvi and Khushi prove why they are the style icons of Gen-Y. Check it out.", "url": "https://www.pinkvilla.com/entertainment/news/when-janhvi-kapoor-and-khushi-kapoor-s-offbeat-yet-stylish-looks-stole-show-red-carpet-527471", "urlToImage": null, "publishedAt": "2020-04-25T13:05:39Z", "content": null}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Karan Johar Wants To Cry After Being Called An Elephant By Daughter Roohi, Watch Video - News18", "description": "Karan Johar filmed a video and shared with his online family where he is playing a game with his toddlers.", "url": "https://www.news18.com/news/movies/karan-johar-wants-to-cry-after-being-called-an-elephant-by-daughter-roohi-watch-video-2592577.html", "urlToImage": null, "publishedAt": "2020-04-25T13:02:52Z", "content": "Filmmaker Karan Johar came back with the second season of Lockdown with Johars after the first got exceptionally admired by the viewers. The Season 2 along with his kids, Yash and Roohi are now rolling in full swing.\r\nKaran filmed a video and shared with his … [+1294 chars]"}, {"source": {"id": null, "name": "Bollywoodhungama.com"}, "author": "Bollywood Hungama", "title": "Disha Patani says she hates pampering herself in a salon - Bollywood Hungama", "description": "Disha Patani says she hates pampering herself in a salon . Latest Bollywood News, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News at Bollywood Hungama.com", "url": "https://www.bollywoodhungama.com/news/features/disha-patani-says-hates-pampering-salon/", "urlToImage": null, "publishedAt": "2020-04-25T12:31:40Z", "content": "Talking to a daily, Disha said that she is very lazy when it comes to beauty treatments. However, with the lockdown in place, the actress is utilising the time doing facials. She said that she has been using face scrubs and masks. The Baaghi 2 actress said th… [+272 chars]"}, {"source": {"id": null, "name": "Tellychakkar.com"}, "author": "Tellychakkar Team", "title": "Paras Chhabra’s LOSS is Mahira Sharma’s GAIN! - Tellychakkar", "description": "MUMBAI: Actors Mahira Sharma and Paras Chhabra's friendship was undoubtedly one of the sweetest bonds inside the Bigg Boss 13 house.", "url": "https://www.tellychakkar.com/tv/tv-news/paras-chhabra-s-loss-mahira-sharma-s-gain-200425", "urlToImage": null, "publishedAt": "2020-04-25T12:31:00Z", "content": "MUMBAI: Actors Mahira Sharma and Paras Chhabra's friendship was undoubtedly one of the sweetest bonds inside the Bigg Boss 13 house.\r\nThe duo has always maintained that they are friends but their close bond has often been the topic of discussion among their f… [+570 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Uday Bhatia", "title": "Film review: ‘Extraction’ on Netflix is a joyless slab of action cinema - Livemint", "description": "Chris Hemsworth lays waste to Dhaka in order to save an Indian drug lord’s kidnapped son in this Netflix film written by Joe Russo", "url": "https://www.livemint.com/mint-lounge/features/film-review-extraction-on-netflix-is-a-joyless-slab-of-action-cinema-11587817372674.html", "urlToImage": null, "publishedAt": "2020-04-25T12:29:38Z", "content": "Sometimes the smallest detail can trip up your experience of a movie. Forty minutes into Extraction, Tyler (Chris Hemsworth) and Ovi (Rudhraksh Jaiswal) are dodging gunmen in a Dhaka building. They break into an apartment, and the famous intro to Didi Tera De… [+3823 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "IANS", "title": "Suriya’s ‘Soorarai Pottru’ could be banned, if Jyothika’s ‘Pon Magal Vandhal’ releases directly on OTT - The Hindu", "description": "Tamil Nadu Theatre And Multiplex Owners’ Association respond to expected release of Jyothika’s film on Amazon Prime next month", "url": "https://www.thehindu.com/entertainment/movies/suriyas-soorarai-pottru-could-be-banned-if-jyothikas-pon-magal-vandhal-releases-directly-on-ott/article31432944.ece", "urlToImage": null, "publishedAt": "2020-04-25T12:25:03Z", "content": "The Tamil Nadu Theatre And Multiplex Owners Association have threatened to ban films starring Suriya, as well as the films produced by his production company 2D films. The decision comes after the news that the film Pon Magal Vandhal, produced by Suriya and s… [+1831 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Vicky Kaushal Celebrates Homecoming Of COVID-19 Warrior Along With Neighbours - News18", "description": "Vicky Kaushal shared a homecoming video of an 11-year-old girl who was tested positive of for the coronavirus. On her return, residents gave her a round of applause.", "url": "https://www.news18.com/news/movies/vicky-kaushal-celebrates-homecoming-of-covid-19-warrior-along-with-neighbours-2592345.html", "urlToImage": null, "publishedAt": "2020-04-25T12:00:50Z", "content": "Bollywood actor Vicky Kaushal recently joined his fellow residents who gathered at the complexs entrance to welcome a COVID-19 warrior. The Raazi actor shared a video on his Instagram to share the glimpses from the moment.\r\nLike a ray of sunshine on a gloomy … [+1320 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "How to use Instagram's new Challenges stickers in your stories - Hindustan Times", "description": "You can nominate your friends and also rise up to a challenge you have been nominated for with the appropriate stickers", "url": "https://www.hindustantimes.com/tech/how-to-use-instagram-s-new-challenges-stickers-in-your-stories/story-Z93NUNIMRf5i5HrvFNNT4J.html", "urlToImage": null, "publishedAt": "2020-04-25T11:53:25Z", "content": "Instagram has launched a new ‘Challenges’ sticker in the Stories gallery. Starting this Saturday, Instagram is testing this feature that makes it easy to join challenges through a sticker, via the stories text tool, or from nominations from friends.\r\n“We’ve s… [+1662 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Chetna Kapoor", "title": "Why can’t women fart or burp in public?, asks Neena Gupta in her Quarantine video; Watch - Republic World - Republic World", "description": "In the video, Gupta says, \"Women never have gas, they never have acidity, they do not burp. There is not much to do during lockdown.\" Watch the video —", "url": "https://www.republicworld.com/entertainment-news/bollywood-news/why-cant-women-fart-or-burp-asks-neena-gupta-latest-quarantine.html", "urlToImage": null, "publishedAt": "2020-04-25T11:48:34Z", "content": "In her latest Quarantine video, Neena Gupta talks about how women live under pressure and don't do things men openly do — like burp or fart in public.\r\nIn the video, Gupta says, \"Women never have gas, they never have acidity, they do not burp. There is not mu… [+1648 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Instagrammer of the Week: Pavitra Rishta fame Asha Negi’s style statements are chic and glamorous - Times of India", "description": "You might be seeing Asha Negi on-screen in simple salwar-kameez in her TV show Baarish, but off-screen her style statements are quite chic and glamorous. This week, we have her as our social media style maker. Take a look:", "url": "https://timesofindia.indiatimes.com/tv/news/hindi/instagrammer-of-the-week-pavitra-rishta-fame-asha-negis-style-statements-are-chic-and-glamorous/photostory/75358318.cms", "urlToImage": null, "publishedAt": "2020-04-25T11:30:00Z", "content": null}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Tom Cruise will be 60 years old by the time Mission Impossible 8 is released, will have played Ethan... - Hindustan Times", "description": "Tom Cruise will be 60 years old, and will have played Ethan Hunt for over a quarter-of-a-century by the time the now delayed Mission: Impossible 8 hits theatres.", "url": "https://www.hindustantimes.com/hollywood/tom-cruise-will-be-60-years-old-by-the-time-mission-impossible-8-is-released-will-have-played-ethan-hunt-for-over-quarter-century/story-y8wlOd2s6rcRKkNXLPTdOJ.html", "urlToImage": null, "publishedAt": "2020-04-25T11:16:00Z", "content": "The theatrical release of Mission: Impossible 7 and Mission: Impossible 8 has been delayed by Paramount, which means that when the eighth film opens in 2022, Tom Cruise will be 60 years old. The seventh instalment in the franchise was initially set to hit the… [+1328 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Mugdha Godse opens up about equation with Rahul Dev's son for the first time - Hindustan Times", "description": "Mugdha Godse, who has been with Rahul Dev for seven years, has spoken about her equation with his son.", "url": "https://www.hindustantimes.com/bollywood/mughda-godse-opens-up-about-equation-with-rahul-dev-s-son-for-the-first-time/story-mQ7Yyu2WdmaMIZTYr9cAJP.html", "urlToImage": null, "publishedAt": "2020-04-25T11:13:00Z", "content": "Actor Mugdha Godse has spoken about her equation with partner Rahul Dev’s son, Siddharth, from a previous relationship. Mugdha and Rahul have been dating for seven years. \r\n“It (our equation) is very good. He is such a kind and loving boy. He is very well bro… [+1258 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Rishabh Suri", "title": "Raveena Tandon: Doctors and nurses are out there for us, and it's disheartening to see some ungrateful people attack them - Hindustan Times", "description": "The actor has started a new campaign which aims at curbing the spread of rumours and urging everyone to not attack medical professionals", "url": "https://www.hindustantimes.com/bollywood/raveena-tandon-doctors-and-nurses-are-out-there-for-us-and-it-s-disheartening-to-see-some-ungrateful-people-attack-them/story-uwbDZbVd9F3wigbw7k9xCI.html", "urlToImage": null, "publishedAt": "2020-04-25T10:47:00Z", "content": "Actor Raveena Tandon has always been vocal about different issues, be it talking about climate change, or even requesting people to not abandon their pet animals in this coronavirus situation. And now, she has come up with a new initiative titled #JeetegaIndi… [+1665 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Shruti Mukherjee", "title": "Shaheen Bhatt shares a list of things thatll happen in the future, Parineeti is shaken - Republic World - Republic World", "description": "Shaheen Bhatt on Instagram has shared a list of things that she expects will happen in the future and this has left Parineeti Chopra \"shaken\". Read on to know", "url": "https://www.republicworld.com/entertainment-news/bollywood-news/shaheen-bhatt-shares-a-list-of-things-thatll-happen-in-the-future.html", "urlToImage": null, "publishedAt": "2020-04-25T10:46:48Z", "content": "As many know already, Shaheeh Bhatt is the second of Mahesh Bhatt's daughter, elder sister of Alia Bhatt and half-sister of Pooja Bhatt. However, she chose to stay away from the acting world and recently became popular for her book on overcoming depression. S… [+2197 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Nikki Bella poses with Aishwarya Rai Bachchan in throwback pic from 'incredible and unforgettable' Mumbai trip. See here - Hindustan Times", "description": "WWE wrestler Nikki Bella has shared a throwback picture from her 2007 trip to Mumbai with sister Brie, when they met actor Aishwarya Rai Bachchan.", "url": "https://www.hindustantimes.com/bollywood/nikki-bella-poses-with-aishwarya-rai-bachchan-in-throwback-pic-from-incredible-and-unforgettable-mumbai-trip-see-here/story-Y3eu4J5iia8rESInBAv5rI.html", "urlToImage": null, "publishedAt": "2020-04-25T10:43:30Z", "content": "WWE wrestler Nikki Bella has shared throwback pictures with her sister, Brie, from the time they met Aishwarya Rai Bachchan in Mumbai during a work trip in 2007. The Bella sisters were in town to shoot a commercial with Aishwarya. \r\nSharing 10 pictures on Ins… [+1386 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Malayalam actor Ravi Vallathol dies at 67 in Thiruvananthapuram - India Today", "description": "Film and television actor Ravi Vallathol died of age-related ailments at his residence in Thiruvananthapuram, Kerala.", "url": "https://www.indiatoday.in/movies/regional-cinema/story/malayalam-actor-ravi-vallathol-dies-at-67-in-thiruvananthapuram-1670968-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T10:31:01Z", "content": "Malayalam actor Ravi Vallathol, aged 67, breathed his last at his residence in Thiruvananthapuram, Kerala. Reportedly, he was unwell for a couple of years and had succumbed to age-related illness today (April 25).\r\nThe actor had stopped doing films and Malaya… [+1359 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Anil Kapoor gets beefed up in lockdown, says 'I have not taken any kind of supplements in this process'. See pics - Hindustan Times", "description": "Anil Kapoor has shared his new beefed up look along with an encouraging note for his fans on Instagram.", "url": "https://www.hindustantimes.com/bollywood/anil-kapoor-gets-beefed-up-in-lockdown-says-i-have-not-taken-any-kind-of-supplements-in-this-process-see-pics/story-TA4O3CPZ3z0fKmuUY8F6uN.html", "urlToImage": null, "publishedAt": "2020-04-25T10:01:38Z", "content": "Anil Kapoor has once again emerged as a fitness inspiration as he shared a glimpse of his biceps on Instagram. The actor revealed that he has been utilising his free time to work on his body and encouraged his fans to do the same. \r\nSharing a few pictures of … [+1770 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Throwback: When Mahabharat actors got emotional on the last day of shoot - Times of India", "description": "Mahabharat's rerun has been welcomed by telly viewers during the coronavirus lockdown. Such is the interest in the mythological show that every episode and sequence of the show is discussed on social media. Recently, a video surfaced online from the last day …", "url": "https://timesofindia.indiatimes.com/tv/news/hindi/throwback-when-mahabharat-actors-got-emotional-on-the-last-day-of-shoot/photostory/75374401.cms", "urlToImage": null, "publishedAt": "2020-04-25T09:37:52Z", "content": null}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Hrithik Roshan’s mom Pinkie shares tips for a perfect fitness regime, watch videos - Hindustan Times", "description": "Check out the inspirational fitness videos that Hrithik Roshan’s mother Pinkie Roshan has shared on Instagram.", "url": "https://www.hindustantimes.com/bollywood/hrithik-roshan-s-mom-pinkie-shares-tips-for-a-perfect-fitness-regime-watch-videos/story-DSJWQHoAlbPdSees83FvPL.html", "urlToImage": null, "publishedAt": "2020-04-25T09:30:13Z", "content": "Bollywood actor Hrithik Roshan’s mother Pinkie Roshan - who is quite a fitness freak - has shared new videos that is sure to give you the perfect inspiration required to keep it going even amid a lockdown. \r\nOne of the videos shows Pinkie walking, with her fa… [+1586 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Milind Soman says Ankita Konwar was cool with his sex scenes in Four More Shots Please!: ‘She was actually... - Hindustan Times", "description": "Days after they celebrated their second wedding anniversary, Milind Soman talks about wife Ankita Konwar’s reaction to his intimate scenes in web series, Four More Shots Please!.", "url": "https://www.hindustantimes.com/bollywood/milind-soman-says-ankita-konwar-was-cool-with-his-sex-scenes-in-four-more-shots-please-she-was-actually-very-excited/story-XmiImsEdVfK5pmksvrTdyN.html", "urlToImage": null, "publishedAt": "2020-04-25T09:27:00Z", "content": "Actor Milind Soman has revealed wife Ankita Konwar was “very excited” about his sex scenes from the web series Four More Shots Please! which also featured him walking in underwear.\r\nMilind told Pinkvilla in an interview, “She was very cool with it (intimate s… [+1598 chars]"}, {"source": {"id": null, "name": "Asianetnews.com"}, "author": null, "title": "Candid pics of Abhishek Bachchan, Aishwarya Rai Bachchan show pure love - Asianet News English", "description": "Given the fact Aishwarya Rai Bachchan and Abhishek Bachchan share an amazing relationship and continue to give people major relationship goals, here are a few throwback candid photos of the couple.", "url": "https://newsable.asianetnews.com/gallery/entertainment/candid-pics-of-abhishek-bachchan-aishwarya-rai-bachchan-show-pure-love-q9c6wy", "urlToImage": null, "publishedAt": "2020-04-25T09:14:37Z", "content": "During the promotions of his film Happy New Year, Abhishek Bachchan opened up about his strong bond with Aishwarya Rai saying, \"Shes very down-to-earth, rooted, simple and real. Shes very beautiful, which everyone knows. But as a person, she is far more beaut… [+179 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Kaushal Ladhad", "title": "Kim Kardashian can pull off anything & these pics in Indian outfits is proof - Republic World - Republic World", "description": "Kim Kardashian is a supermodel who can pull off any kind of outfit and & these pics in Indian outfits is proof. Take a look at Kim in Indian outfits here.", "url": "https://www.republicworld.com/entertainment-news/hollywood-news/kim-kardashian-can-pull-off-anything-here-is-the-proof.html", "urlToImage": null, "publishedAt": "2020-04-25T09:06:43Z", "content": "Coronavirus has brought several places all around the world to a halt. People are urged to stay home to curb the spread of the virus and practice social distancing too. Celebrities are spending time in quarantine with their family and close ones. Kim Kardashi… [+2384 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Kashmira Patil", "title": "Kanika Kapoor missing from her apartment in Lucknow? Read deets - Republic World - Republic World", "description": "After being treated for COVID-19, Bollywood singer Kanika Kapoor has reportedly gone missing from her residence in Lucknow. Read to know more.", "url": "https://www.republicworld.com/entertainment-news/television-news/kanika-kapoor-has-gone-missing-from-her-apartment-in-lucknow.html", "urlToImage": null, "publishedAt": "2020-04-25T09:05:58Z", "content": "Bollywood singer Kanika Kapoor was tested positive for Coronavirus after she returned from London on March 9. The singer had also attended a few high profile parties after returning. Recently, it was reported that the singer has been discharged from Sanjay Ga… [+2204 chars]"}, {"source": {"id": null, "name": "Soompi.com"}, "author": "jeeelim5", "title": "Kim Go Eun And Lee Min Ho Are Closer Than Ever Before In “The King: Eternal Monarch” - soompi", "description": "SBS’s Friday-Saturday drama “The King: Eternal Monarch” has shared new stills of Kim Go Eun and Lee Min Ho closer than ever before. “The King: Eternal Monarch” tells the story of Emperor Lee Gon (Lee Min Ho) and detective Jung Tae Eul (Kim Go Eun), who live i…", "url": "https://www.soompi.com/article/1396589wpp/kim-go-eun-and-lee-min-ho-are-closer-than-ever-before-in-the-king-eternal-monarch", "urlToImage": null, "publishedAt": "2020-04-25T09:03:26Z", "content": "SBSs Friday-Saturday drama The King: Eternal Monarch has shared new stills of Kim Go Eun and Lee Min Ho closer than ever before.\r\nThe King: Eternal Monarch tells the story of Emperor Lee Gon (Lee Min Ho) and detective Jung Tae Eul (Kim Go Eun), who live in pa… [+1251 chars]"}, {"source": {"id": null, "name": "Spotboye.com"}, "author": "Neeki Singh", "title": "Shaheer Sheikh On Mahabharat: 'Couldn't Speak To Anyone For 10-15 Days After Shooting The Draupadi Cheer-Haran Scene, Made Me Terribly Sad'- EXCLUSIVE - SpotboyE", "description": "STAR Plus' Mahabharat, starring Shaheer Sheikh as Arjun, is being rerun currently. We spoke to the actor about the show and also about the memories attached with the character which brought him to the limelight", "url": "https://www.spotboye.com/television/tv-interviews/shaheer-sheikh-on-mahabharat-couldn-t-speak-to-anyone-for-10-15-days-after-shooting-the-draupadi-cheer-haran-scene-made-me-terribly-sad-exclusive/5ea3f51374f5ce660a22570f", "urlToImage": null, "publishedAt": "2020-04-25T08:35:29Z", "content": "Don't MissKundali Bhagya: Mahira Sharma, Shraddha Arya And Anjum Fakih Flaunt Their Killer Moves In This Throwback Video"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Anushka Sharma’s Small Gesture During Virat Kohli’s Live Chat Leaves Him Blushing, Watch Here - News18", "description": "Virat Kohli was having an Instagram Live session when his wife helped him by turning on the lights of the room.", "url": "https://www.news18.com/news/movies/anushka-sharmas-small-gesture-during-virat-kohlis-live-chat-leaves-him-blushing-watch-here-2592223.html", "urlToImage": null, "publishedAt": "2020-04-25T08:34:28Z", "content": "Lovebirds Anushka Sharma and Virat Kohli are spending the lockdown time together at their home. The duo is having quite fun in their day to day routine, making each day special for each other.\r\nThe Indian cricket team captain recently had a live chat session … [+1684 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Thahar Ja: Ajay Devgn gets teary-eyed as he urges people to stay home with new song, son Yug makes cameo.... - Hindustan Times", "description": "Ajay Devgn has released a new song titled Thahar Ja to encourage his fans to stay home amid coronavirus outbreak.", "url": "https://www.hindustantimes.com/bollywood/thahar-ja-ajay-devgn-gets-teary-eyed-as-he-urges-people-to-stay-home-with-new-song-son-yug-makes-cameo-watch/story-72ZuV33NjqBAq28PJaaPXN.html", "urlToImage": null, "publishedAt": "2020-04-25T08:14:04Z", "content": "Ajay Devgn has released a new song titled Thahar Ja through which he makes an emotional appeal to his fans to stay at home amid coronavirus lockdown. His son Yug also makes an appearance at the end of the music video. \r\nProduced by Ajay, the song has been sun… [+1800 chars]"}, {"source": {"id": null, "name": "Bollywoodhungama.com"}, "author": "Bollywood Hungama", "title": "Malaika Arora shares a sun-kissed selfie, pens a note of gratitude amid lock-down - Bollywood Hungama", "description": "Malaika Arora shares a sun-kissed selfie, pens a note of gratitude amid lock-down. Latest Bollywood News, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News at Bollywood Hungama.com", "url": "https://www.bollywoodhungama.com/news/features/malaika-arora-shares-a-sun-kissed-selfie-pens-a-note-of-gratitude-amid-lock-down/", "urlToImage": null, "publishedAt": "2020-04-25T08:04:03Z", "content": "Malaika Arora, who is spending the lock-down with beau Arjun Kapoor, is indulging in cooking, working out from home or is plain chilling. On Instagram, she shared a sun-kissed selfie of herself, expressing gratitude about the fact that she is safe amid this c… [+474 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Kanye West officially now a billionaire: Forbes - India Today", "description": "Forbes said that Kanye West has been pressing the magazine for years to be listed as one of its mega-rich but that it declined.", "url": "https://www.indiatoday.in/lifestyle/celebrity/story/kanye-west-officially-now-a-billionaire-forbes-1670924-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T07:54:05Z", "content": "Rapper Kanye West is now a billionaire, thanks largely to the basketball shoes bearing his name that he developed with Adidas, Forbes magazine said on Friday.\r\nThe rough figure of the wealth of Kim Kardashian's hubby is USD 1.3 billion, the magazine said in a… [+1074 chars]"}, {"source": {"id": null, "name": "Ibtimes.co.in"}, "author": "Pramod Gaikwad", "title": "Deepika Padukone should stop interfering in my life and concentrate on her work: Kangana Ranaut [Throwback] - International Business Times, India Edition", "description": "Deepika Padukone and Kangana Ranaut have been at loggerheads ever since Deepika won the Best Actress award for her performance in Happy New Year over Kangana's role in Queen at an award function in 2014.", "url": "https://www.ibtimes.co.in/deepika-padukone-should-stop-interfering-my-life-concentrate-her-work-kangana-ranaut-throwback-818381", "urlToImage": null, "publishedAt": "2020-04-25T07:52:34Z", "content": "Kangana Ranaut had never shied away from expressing her dislike for Deepika Padukone on a public platform. The two have been at loggerheads ever since Deepika won the Best Actress award for her performance in Happy New Year over Kangana's role in Queen at an … [+2312 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Adil Khan", "title": "Who has Triple H dated before marrying WWE Chairmans daughter Stephanie McMahon? - Republic World - Republic World", "description": "Who has Triple H dated? Before dating Stephanie McMahon, Triple H was dating his D-Generation X teammate and former Diva's champion, Chyna.", "url": "https://www.republicworld.com/sports-news/wwe-news/who-has-triple-h-dated-before-marrying-stephanie-mcmahon.html", "urlToImage": null, "publishedAt": "2020-04-25T07:28:53Z", "content": "Paul Levesque aka Triple H and Stephanie McMahon are seemingly the most powerful couple in WWE, right next to Vince and Linda McMahon. Triple H and Stephanie McMahon have been together for more than a decade and have dominated WWE in the ring and in the manag… [+2757 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Akshay Kumar's Laxmmi Bomb To Skip Theatrical Release And Premiere on Disney+Hotstar? - News18", "description": "The global viral scare reportedly seems to persuade Bollywood filmmakers and producers to release their upcoming titles on OTT platforms rather than delaying them.", "url": "https://www.news18.com/news/movies/akshay-kumars-laxmmi-bomb-to-skip-theatrical-release-and-premiere-on-disneyhotstar-2592117.html", "urlToImage": null, "publishedAt": "2020-04-25T07:11:35Z", "content": "It's a dreadful time for the film industry as cinema halls across the world remain closed amid the coronavirus crisis. The global viral scare reportedly seems to persuade Bollywood filmmakers and producers to release their upcoming titles on OTT platforms rat… [+1773 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Vijay Deverakonda takes up Real Man challenge, makes mango ice cream for family. Watch video - India Today", "description": "Vijay Deverakonda took part in the #BeTheRealMan challenge and shared a three-minute-long video, giving a glimpse of his routine in lockdown.", "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-takes-up-real-man-challenge-makes-mango-ice-cream-for-family-watch-video-1670909-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T07:02:47Z", "content": "Director Sandeep Reddy Vanga's #BeTheRealMan challenge is going viral among Tollywood celebrities. Jr NTR, Ram Charan, Chiranjeevi, SS Rajamouli, Venkatesh are some of the stars who have attempted the challenge.\r\nVijay Deverakonda is the latest celebrity to j… [+1870 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "admin", "title": "Ramazan 2020: Dipika Kakar wishes Chand mubarak, shares glimpse of her first sehri. See pics, video - Jimmys Post", "description": "", "url": "https://www.hindustantimes.com/tv/ramazan-2020-dipika-kakar-wishes-chand-mubarak-shares-glimpse-of-her-first-sehri-see-pics-video/story-B3wGDrTzmhG6O5tTXPjYVP.html/", "urlToImage": null, "publishedAt": "2020-04-25T07:02:18Z", "content": "Dipika Kakar and husband Shoaib Ibrahim are all geared up to celebrate the month of Ramzan and took to social media to wish their fans on the occasion. Dipika also shared a picture as she sat to savour her first sehri before dawn on Saturday. \r\nSharing a happ… [+1577 chars]"}, {"source": {"id": null, "name": "Indiaglitz.com"}, "author": "IndiaGlitz", "title": "9th wedding anniversary: Prithviraj's wife pens an emotional note - Malayalam News - IndiaGlitz.com", "description": "As actor Prithviraj Sukumaran remains stranded in Jordan, the actor and his wife Supriya couldn't celebrate their wedding anniversary together this year.", "url": "https://www.indiaglitz.com/9th-wedding-anniversary-prithvirajs-wife-pens-an-emotional-note-malayalam-news-258915", "urlToImage": null, "publishedAt": "2020-04-25T06:46:12Z", "content": "As actor Prithviraj Sukumaran remains stranded in Jordan, the actor and his wife Supriya couldn't celebrate their wedding anniversary together this year. The lovely couple got married nine years ago on this very same day in a private ceremony in Palakkad on A… [+896 chars]"}, {"source": {"id": null, "name": "Tellychakkar.com"}, "author": "Tellychakkar Team", "title": "Shaheer Sheikh REVEALS why he is not doing a web project - Tellychakkar", "description": "Popular TV actor Shaheer Sheikh speaks about digital medium.", "url": "https://www.tellychakkar.com/tv/tv-news/shaheer-sheikh-reveals-why-he-not-doing-web-project-200425", "urlToImage": null, "publishedAt": "2020-04-25T06:37:00Z", "content": "MUMBAI:Shaheer Sheikh is one of the most popular television actors. The handsome hunk has impressed the audience with his charming personality and amazing acting skills. He has a huge fan following. \r\nThe actor who is currently seen playing the role of Abir o… [+813 chars]"}, {"source": {"id": null, "name": "Scroll.in"}, "author": "Nandini Ramnath", "title": "‘Hundred’ review: Lara Dutta and Rinku Rajguru steer a fun run to the crease - Scroll.in", "description": "In the Disney+ Hotstar web series, Lara Dutta is a police officer who uses Rinku Rajguru’s terminally ill government employee to save her job.", "url": "https://scroll.in/reel/960181/hundred-review-lara-dutta-and-rinku-rajguru-steer-a-fun-run-to-the-crease", "urlToImage": null, "publishedAt": "2020-04-25T06:34:00Z", "content": "Hundred is a web series that revolves around two women. One is going to die. The other is barely surviving. But dont you ever make the mistake of feeling sorry for Nethra or Saumya. \r\nNethra (Rinku Rajguru) has recently learnt that she has a galloping brain t… [+5002 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "'Stylish Star' Allu Arjun Dancing to 'Ramuloo Ramulaa' is a Treat to Watch - News18", "description": "Video of Allu Arjun dancing to the song Ramuloo Ramulaa from Ala Vaikunthapurramloo is making rounds on the Internet. Watch it here.", "url": "https://www.news18.com/news/movies/stylish-star-allu-arjun-dancing-to-ramuloo-ramulaa-is-a-treat-to-watch-2592063.html", "urlToImage": null, "publishedAt": "2020-04-25T05:50:13Z", "content": "Video of actor Allu Arjun dancing to song Ramuloo Ramulaa is making rounds on the Internet. The song featured in his recently released film Ala Vaikunthapurramloo (2020) which opened to critical acclaim and commercial praise and went on to be a blockbuster.\r\n… [+1311 chars]"}, {"source": {"id": null, "name": "Thenewsminute.com"}, "author": null, "title": "Nithiin-Rashmika starrer ‘Bheeshma’ now streaming online - The News Minute", "description": "Nithiin and Rashmika fans rejoice! The duo’s last film, Bheeshma has been released online and is now streaming on Netflix and Sun NXT. Bheeshma is a romantic action comedy that was met with positive reviews upon its release. The film revolves around the prota…", "url": "https://www.thenewsminute.com/article/nithiin-rashmika-starrer-bheeshma-now-streaming-online-123314", "urlToImage": null, "publishedAt": "2020-04-25T05:46:31Z", "content": "The film released in February and was met with positive reviews.Nithiin and Rashmika fans rejoice! The duos last film, Bheeshma has been released online and is now streaming on Netflix and Sun NXT.\r\nBheeshma is a romantic action comedy that was met with posit… [+1670 chars]"}, {"source": {"id": null, "name": "Tellychakkar.com"}, "author": "Tellychakkar Team", "title": "Taarak Mehta Ka Ooltah Chashmah's director turns actor! - Tellychakkar", "description": "MUMBAI: Television’s longest running show Taarak Mehta Ka Ooltah Chashmah (SAB TV and Neela Telefilms) has been winning the hearts and charts for many years now.", "url": "https://www.tellychakkar.com/tv/tv-news/taarak-mehta-ka-ooltah-chashmahs-director-turns-actor-200425", "urlToImage": null, "publishedAt": "2020-04-25T05:30:00Z", "content": null}, {"source": {"id": null, "name": "Bollywoodhungama.com"}, "author": "Bollywood Hungama", "title": "On his birthday, Varun Dhawan donates towards daily wage labourers of the film industry - Bollywood Hungama", "description": "On his birthday, Varun Dhawan donates towards daily wage labourers of the film industry. Latest Bollywood News, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News at Bollywood Hungama.com", "url": "https://www.bollywoodhungama.com/news/bollywood/birthday-varun-dhawan-donates-towards-daily-wage-labourers-film-industry/", "urlToImage": null, "publishedAt": "2020-04-25T05:02:27Z", "content": "Ashoke Pandit who is the president of Indian Film and TV directors Association took to Twitter to thank Varun Dhawan for his contribution. Sharing the video he wrote, \"@fwice_mum  thanks @Varun_dvn for donating towards the daily wage workers of the entertainm… [+993 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Ramayan's Sita aka Dipika Chikhalia's real life wedding was attended by this Bollywood superstar; see pic - Times of India", "description": "Ramayan's rerun has led to curiosity around the life of its lead actors. Several unseen pictures of them from back", "url": "https://timesofindia.indiatimes.com/tv/news/hindi/ramayans-sita-aka-dipika-chikhalias-real-life-wedding-was-attended-by-this-bollywood-superstar-see-pic/articleshow/75369401.cms", "urlToImage": null, "publishedAt": "2020-04-25T04:53:00Z", "content": null}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "I Trusted Arhaan But Didn't Know I'd Have To Pay Such A Big Price For It: Rashami Desai - News18", "description": "Rashami and Arhaan dated each other for over a year. However, things went haywire after they entered the Bigg Boss house last season.", "url": "https://www.news18.com/news/movies/i-trusted-arhaan-but-didnt-know-id-have-to-pay-such-a-big-price-for-it-rashami-desai-2591989.html", "urlToImage": null, "publishedAt": "2020-04-25T04:30:32Z", "content": "Rashami Desai got emotional while talking about her former boyfriend Arhaan Khan during an Instagram live session with fans. \r\nRashami and Arhaan dated each other for over a year. However, things went haywire after they entered the Bigg Boss house last season… [+1341 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Sonal Singh", "title": "Akshay Kumar-Karan Johar re-create `Teri Mitti` song amid pandemic crisis, pay tribute to frontline warrior... - Zee News", "description": "Dharma Productions, Cape Of Good Films along with Zee Studios and Azure Entertainment have paid a tribute to these heroes who fight every day to keep us alive and healthy by putting their lives at risk.", "url": "https://zeenews.india.com/music/akshay-kumar-karan-johar-re-create-teri-mitti-song-amid-pandemic-crisis-pay-tribute-to-frontline-warriors-watch-2278713.html", "urlToImage": null, "publishedAt": "2020-04-25T04:08:39Z", "content": "New Delhi: Amid the global health crisis emerging due to the deadly novel coronavirus outbreak, our frontline warriors - doctors, police, sanitation workers and everyone who's working so that others can stay safe need a word of appreciation and support. \r\nThe… [+949 chars]"}, {"source": {"id": null, "name": "Bollywoodlife.com"}, "author": "Nirali Kanabar", "title": "It's expensive: When Katrina Kaif splurged Rs. 92,000 to look gorgeous at rumoured ex-boyfriend, Salman Khan' - Bollywood Life", "description": "Today, we are taking you back to Salman Khan's grand birthday bash where Katrina Kaif grabbed eyeballs for all the right reasons.", "url": "https://www.bollywoodlife.com/style/its-expensive-when-katrina-kaif-splurged-rs-92000-to-look-gorgeous-at-rumoured-ex-boyfriend-salman-khans-birthday-bash-1611259/", "urlToImage": null, "publishedAt": "2020-04-25T03:47:56Z", "content": "There's a dearth of Bollywood events due to the coronavirus lockdown. We haven't seen pictures of our celebrities flaunting their fashion ka jalwa for the longest time now. Hence, we are revisiting the times they made head turns in public because of their sar… [+2226 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Sobhita Dhulipala accused of lying about clicking her own pics for magazine shoot, issues clarification: 'It is upsetting' - Hindustan Times", "description": "Actor Sobhita Dhulipala recently shared pictures from a magazine photoshoot, saying that she had clicked the pictures herself. Later, a picture of her getting clicked by a man on her terrace landed online.", "url": "https://www.hindustantimes.com/bollywood/sobhita-dhulipala-accused-of-lying-about-clicking-her-own-pics-for-magazine-shoot-issues-clarification-it-is-upsetting/story-fYdaCclRaGZ8BSXzAcd5hN.html", "urlToImage": null, "publishedAt": "2020-04-25T03:32:00Z", "content": "Actor Sobhita Dhulipala has issued a clarification after she was accused of lying about a new magazine photoshoot. Sobhita had shared multiple pictures from the latest issue of Cosmopolitan magazine over the last couple of days, saying that she styles herself… [+3087 chars]"}, {"source": {"id": null, "name": "Iwmbuzz.com"}, "author": "Editorial Team", "title": "Parth Samthaan, Zain Imam, Shaheer Sheikh, Mohsin Khan’s Best Shoe Style Moments - IWMBuzz", "description": "Best shoe style moments of these celebs will fall into your head", "url": "https://www.iwmbuzz.com/television/photos/parth-samthaan-zain-imam-shaheer-sheikh-mohsin-khans-best-shoe-style-moments/2020/04/25", "urlToImage": null, "publishedAt": "2020-04-25T03:14:57Z", "content": "Parth Samthaan moved on to win hearts on the daily soap on Star Plus called Kasautii Zindagii Kay is seen sharing screen space with Erica Fernandes. The actor is appreciated for his amazing work which includes his great acting skills and dialogue delivery. Th… [+1274 chars]"}, {"source": {"id": null, "name": "Sportskeeda.com"}, "author": "Raunak Jaiswal", "title": "Roman Reigns takes a dig at tag team recently released by WWE - Sportskeeda", "description": "The former WWE tag team has been a thorn in Roman Reigns' side in the past.", "url": "https://www.sportskeeda.com/wwe/roman-reigns-takes-a-dig-at-tag-team-recently-released-by-wwe", "urlToImage": null, "publishedAt": "2020-04-25T02:49:10Z", "content": "Roman Reigns wasn't holding back in this exchange\r\nIn a shocking turn of events, WWE released over 20 Superstars in addition to furloughing backstage staff last week. To everyone's surprise, The Good Brothers Luke Gallows &amp; Karl Anderson were also among t… [+1792 chars]"}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": "Pinkvilla Desk", "title": "Varun Dhawan has Natasha by his side as he virtually celebrates birthday with Sara Ali Khan, Arjun & others - PINKVILLA", "description": "Varun Dhawan celebrated his 33rd birthday virtually with Coolie No 1 co-star Sara Ali Khan, Arjun Kapoor, Karan Johar and others.", "url": "https://www.pinkvilla.com/entertainment/news/varun-dhawan-has-natasha-his-side-he-virtually-celebrates-birthday-sara-ali-khan-arjun-others-527329", "urlToImage": null, "publishedAt": "2020-04-25T02:47:09Z", "content": null}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": "Pinkvilla Desk", "title": "Kareena Kapoor Khan glam up her quarantine look in a mustard Kaftan as she twirls in her living room; WATCH - PINKVILLA", "description": "Kareena Kapoor Khan proves she is the queen of slow mo as she nails her quarantine look in a mustard Kaftan; WATCH", "url": "https://www.pinkvilla.com/entertainment/news/kareena-kapoor-khan-glam-her-quarantine-look-mustard-kaftan-she-twirls-her-living-room-watch-527328", "urlToImage": null, "publishedAt": "2020-04-25T02:24:43Z", "content": null}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Yami Gautam Revisits First Day at School, Shares Childhood Pic in Uniform - News18", "description": "If you want to see actress Yami Gautam in school uniform then head to her Instagram profile right away.", "url": "https://www.news18.com/news/movies/yami-gautam-revisits-first-day-at-school-shares-childhood-pic-in-uniform-2591829.html", "urlToImage": null, "publishedAt": "2020-04-25T02:19:10Z", "content": "If you want to see actress Yami Gautam in school uniform then head to her Instagram profile right away. She has posted a picture of her first day in school.\r\n\"My first day to school! I am sure I did not know what it meant, but was just so excited to get dress… [+627 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Dr. Prem Kumar Sharma & Manisha Koushik", "title": "Horoscope Today: Astrological prediction for April 25, what’s in store for Aries, Leo, Virgo, Sagittarius... - Hindustan Times", "description": "Horoscope Today: Are the stars lined up in your favour? Find out the astrological prediction for Aries, Leo, Virgo, Sagittarius and other zodiac signs for April 25.", "url": "https://www.hindustantimes.com/more-lifestyle/horoscope-today-astrological-prediction-for-april-25-what-s-in-store-for-aries-leo-virgo-sagittarius-and-other-zodiac-signs/story-kn3yXIPuBA1khSA1MqVbNK.html", "urlToImage": null, "publishedAt": "2020-04-25T02:08:00Z", "content": "The 12 signs of the zodiac have their separate personality traits. Horoscopes have the ability to offer an insight into our life and what will happen in the future. Read on to find out whether the odds will be in your favour today:\r\n*Aries (March 21-April 20)… [+7787 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Sara Ali Khan Brings Back Her Knock-knock Series with Brother Ibrahim, Watch Hilarious Video - News18", "description": "Sara Ali Khan reprised her iconic knock-knock series with her brother Ibrahim where she made bad jokes with hilarious results amid the Coronavirus lockdown.", "url": "https://www.news18.com/news/movies/sara-ali-khan-brings-back-her-knock-knock-series-with-brother-ibrahim-watch-hilarious-video-2591593.html", "urlToImage": null, "publishedAt": "2020-04-25T01:41:31Z", "content": "Actress Sara Ali Khan is known for her wit and sense of humour on social media. Be it her \"shayaris\", throwback videos or even her knock-knock jokes, Sara keeps her fans entertained. Recently, the actress reprised her iconic knock-knock series with her brothe… [+679 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Rachana Dubey", "title": "#CoronaCrisis: Cinemas gear up to tackle a post-lockdown world, with some restrictions - Times of India", "description": "Temperature checks, mandatory masks and cross-seating are some of the measures being thought over", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/coronacrisis-cinemas-gear-up-to-tackle-a-post-lockdown-world-with-some-restrictions/articleshow/75362123.cms", "urlToImage": null, "publishedAt": "2020-04-24T21:14:00Z", "content": null}, {"source": {"id": null, "name": "Thenewsminute.com"}, "author": null, "title": "Revisiting 'Amarkalam', the film that brought Ajith and Shalini together - The News Minute", "description": "It would be an understatement to say that Amarkalam was an important film in Ajith's career. Not only did the 1999 film directed by Saran pave the way for the actor to do more action films, it was also on the sets of Amarkalam that Ajith fell in love with his…", "url": "https://www.thenewsminute.com:443/article/revisiting-amarkalam-film-brought-ajith-and-shalini-together-123255", "urlToImage": null, "publishedAt": "2020-04-24T14:14:05Z", "content": "The couple completes 20 years of marriage on April 24.It would be an understatement to say that Amarkalam was an important film in Ajith's career. Not only did the 1999 film directed by Saran pave the way for the actor to do more action films, it was also on … [+5298 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Danny Cyril D Cruze", "title": "Aarogya Setu App: How Bluetooth helps in identifying Covid-19 suspects - Livemint", "description": "The government-owned application is being posed as the primary contact tracing tool in India.Many organisations are planning to include the app in their daily operations to identify potential cases", "url": "https://www.livemint.com/technology/tech-news/aarogya-setu-app-how-bluetooth-helps-in-identifying-covid-19-suspects-11587730877077.html", "urlToImage": null, "publishedAt": "2020-04-24T12:51:31Z", "content": "Many food-delivery services have mandated the use of Aarogya Setu app for their delivery personnel. The government-owned application is being posed as the primary contact tracing tool in India. During Prime Minister Narendra Modis address to the nation, while… [+2367 chars]"}, {"source": {"id": null, "name": "Indiaglitz.com"}, "author": "IndiaGlitz", "title": "Mahesh Babu gives solid feedback on 2-minute massage! - Telugu News - IndiaGlitz.com", "description": "Mahesh Babu's family time is productive.  The other day, Sitara turned into a head massage volunteer as her dad was busy watching Gautham play his game.", "url": "https://www.indiaglitz.com/mahesh-babu-gives-solid-feedback-on-2-minute-massage-telugu-news-258876", "urlToImage": null, "publishedAt": "2020-04-24T12:49:59Z", "content": "Mahesh Babu's family time is productive. The other day, Sitara turned into a head massage volunteer as her dad was busy watching Gautham play his game. \r\n\"Watching GG (Gautham Ghattamaneni) play his game! MB had a head massage volunteer only to finish in 2 mi… [+562 chars]"}, {"source": {"id": null, "name": "Indiaglitz.com"}, "author": "IndiaGlitz", "title": "Re-Imagining Money Heist With A Mollywood Cast - Malayalam News - IndiaGlitz.com", "description": "Well, we've been thinking of a Malayalam version of Mony Heist the entire star cast. From Prithviraj to Roshan Abdul Rahoof, check out M'Town actors who could be a perfect fit.", "url": "https://www.indiaglitz.com/re-imagining-money-heist-with-a-mollywood-cast-malayalam-news-258868", "urlToImage": null, "publishedAt": "2020-04-24T12:23:54Z", "content": null}, {"source": {"id": null, "name": "Bollywoodbubble.com"}, "author": "Simran Khanna", "title": "Deepika Padukone and Ranveer Singh’s monthly expenditure on food will leave you shell-shocked! - Bollywood Bubble", "description": "<p>Image Source – InstagramDeepika Padukone and Ranveer Singh are one of the most talked-about couples in Bollywood.  Everything about their life is super extravagant. So when you think about their daily food neds you know it is going to be exorbitant.  Did y…", "url": "https://www.bollywoodbubble.com/bollywood-news/deepika-padukone-ranveer-singh-monthly-expenditure-food/", "urlToImage": null, "publishedAt": "2020-04-24T12:13:36Z", "content": "Deepika Padukone and Ranveer Singh are one of the most talked-about couples in Bollywood.  Everything about their life is super extravagant. So when you think about their daily food neds you know it is going to be exorbitant.  Did you know the amount Deepika … [+1195 chars]"}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": "Pinkvilla Desk", "title": "Priyanka Chopra Jonas' sun kissed photos have left husband Nick Jonas awestruck and us too - PINKVILLA", "description": "Priyanka Chopra Jonas recently shared a stunning sun-kissed photo and well, it has our attention for all the right reasons, and Nick Jonas' too. Check it out here.", "url": "https://www.pinkvilla.com/entertainment/hollywood/priyanka-chopra-jonas-sun-kissed-photos-have-left-husband-nick-jonas-awestruck-and-us-too-527027", "urlToImage": null, "publishedAt": "2020-04-24T11:15:54Z", "content": null}, {"source": {"id": null, "name": "Koimoi.com"}, "author": null, "title": "Avengers: Endgame: Neither Iron Man Nor Captain America, Fans Think THIS Superhero Should’ve Snapped Fingers To Kill Thanos! - Koimoi", "description": "To save the world from Thanos' evil intentions once again, Iron Man sacrificed his life in Avengers: Endgame. In the climax, Robert Downey Jr", "url": "https://www.koimoi.com/hollywood-2/avengers-endgame-neither-iron-man-nor-captain-america-fans-think-this-superhero-shouldve-snapped-fingers-to-kill-thanos/", "urlToImage": null, "publishedAt": "2020-04-24T10:56:26Z", "content": "Avengers: Endgame: Neither Iron Man Nor Captain America, Fans Think THIS Superhero Should’ve Snapped Fingers To Kill Thanos!\r\nTo save the world from Thanos’ evil intentions once again, Iron Man sacrificed his life in Avengers: Endgame. In the climax, Robert D… [+2158 chars]"}, {"source": {"id": null, "name": "Manoramaonline.com"}, "author": "Onmanorama Staff", "title": "Shah Rukh Khan-Gauri Khan's office converted into quarantine facility - Onmanorama", "description": "The work has been completed by Gauri's firm Gauri Khan Designs in collaboration with Meer Foundation.", "url": "https://english.manoramaonline.com/entertainment/entertainment-news/2020/04/24/shah-rukh-khan-gauri-khan-office-converted-into-quarantine-facility.html", "urlToImage": null, "publishedAt": "2020-04-24T09:42:05Z", "content": "Superstar Shah Rukh Khans wife Gauri Khan took to Instagram to share a glimpse of their office, which has now been converted into a quarantine facility amid the ongoing COVID-19 pandemic.\r\nAt the initial stage of the novel coronavirus outbreak in India, Shah … [+1338 chars]"}, {"source": {"id": null, "name": "Koimoi.com"}, "author": null, "title": "Avengers: Endgame: This Latest Theory Suggests Hulk Met Black Widow When He Snapped His Fingers, Here’s How - Koimoi", "description": "In Avengers: Endgame, we witnessed the deaths of two best superheroes - Black Widow (Scarlett Johansson) and Iron Man (Robert Downey Jr).", "url": "https://www.koimoi.com/hollywood-2/avengers-endgame-this-latest-theory-suggests-hulk-met-black-widow-when-he-snapped-his-fingers-heres-how/", "urlToImage": null, "publishedAt": "2020-04-24T09:39:47Z", "content": "Avengers: Endgame: This Latest Theory Suggests Hulk Met Black Widow When He Snapped His Fingers, Here’s How\r\nIn Avengers: Endgame, we witnessed the deaths of two best superheroes – Black Widow (Scarlett Johansson) and Iron Man (Robert Downey Jr). It will be a… [+1521 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Hindustan Times", "title": "Ramayan top entertainer, Kanika Kapoor beats Deepika Padukone and Priyanka Chopra to become most-searched female celeb - Hindustan Times", "description": "Coronavirus related search queries ruled Yahoo India and rose by 427%.Kanika Kapoor, Amitabh Bachchan and Rajinikanth were among the most searched celebrities.", "url": "https://www.hindustantimes.com/tv/ramayan-top-entertainer-kanika-kapoor-beats-deepika-padukone-and-priyanka-chopra-to-become-most-searched-female-celeb/story-O8TFXULeUYlYlOfZSTAdaO.html", "urlToImage": null, "publishedAt": "2020-04-24T08:59:56Z", "content": "Nearly a month into the nationwide lockdown announced by the Indian government to prevent the spread of Covid-19, online search trends on Yahoo India reflect the curiosity and anxiety that people are facing. Owing to the pandemic, novel coronavirus-related se… [+2299 chars]"}, {"source": {"id": null, "name": "Indiaglitz.com"}, "author": "IndiaGlitz", "title": "Police complaint against Kangana Ranaut for communal remark! - Tamil News - IndiaGlitz.com", "description": "Last week, actress Kangana Ranaut's sister, manager and spokesperson Rangoli Chandel's Twitter account was suspended after her hate speech on Twitter demanding shooting of mullahs and media", "url": "https://www.indiaglitz.com/police-complaint-against-kangana-ranaut-for-communal-remark-tamil-news-258850", "urlToImage": null, "publishedAt": "2020-04-24T08:49:52Z", "content": "Last week, actress Kangana Ranaut's sister, manager and spokesperson Rangoli Chandel's Twitter account was suspended after her hate speech on Twitter demanding shooting of mullahs and media. After this, Kangana Ranaut had released a video supporting her siste… [+555 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Warda Khan Nadiadwala opens up on Sajid Nadiadwala’s former wife Divya Bharti - Times of India", "description": "Actress Divya Bharti bid adieu to the world at the tender age of 19. She was married producer Sajid Nadiadwala. Aft", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/warda-khan-nadiadwala-opens-up-on-sajid-nadiadwalas-ex-wife-divya-bharti/articleshow/75344050.cms", "urlToImage": null, "publishedAt": "2020-04-24T07:19:00Z", "content": null}]}