{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Indianexpress.com"}, "author": "Express Web Desk", "title": "Horoscope Today, 23 April 2020: Aries, Taurus, Gemini, Cancer, Leo, Virgo, Libra, Scorpio, Capricorn, Sagittarius, other signs - The Indian Express", "description": "Horoscope Today, 23 April 2020: Libra, carry on with all-important professional moves, regardless of associates' potentially time-wasting or disruptive actions.", "url": "https://indianexpress.com/article/horoscope/horoscope-today-23-april-2020-aries-taurus-gemini-cancer-leo-virgo-libra-scorpio-sagtitarius-capricorn-pisces-horoscope-astrology-6374680/", "urlToImage": "https://images.indianexpress.com/2019/05/horoscope_2.jpg?w=759", "publishedAt": "2020-04-22T22:40:47Z", "content": "Horoscope Today, April 23, 2020: Scorpio, Leo, Virgo, Cancer, and other signs check the astrological predictionARIES (Mar 21 – Apr. 20)\r\nMars’ intriguing relationship with Neptune is pretty near perfect as far as all work and professional ambitions are concer… [+3720 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Gravitas: Earth Day: Lessons to be learnt - WION", "description": "'Earth Day' was first marked 50 years ago with a purpose to raise awareness about our roles in protecting the planet. But the world seems to have failed in p...", "url": "https://www.youtube.com/watch?v=PGmhJIF0z-c", "urlToImage": "https://i.ytimg.com/vi/PGmhJIF0z-c/maxresdefault.jpg", "publishedAt": "2020-04-22T19:57:30Z", "content": "'Earth Day' was first marked 50 years ago with a purpose to raise awareness about our roles in protecting the planet. But the world seems to have failed in performing this role. WION's Executive Editor Palki Sharma Upadhyay tells you how the Coronavirus may h… [+1170 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Tonight's April's full moon benefits these 3 zodiac signs immensely - Times of India", "description": "April 22 marks the sighting of a new full moon, which will be quite revolutionary and marks the beginning of a new lunar cycle, in the house of the bull sign, Taurus.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/de-stress/tonights-aprils-full-moon-benefits-these-3-zodiac-signs-immensely/photostory/75297955.cms", "urlToImage": "https://static.toiimg.com/photo/75298751.cms", "publishedAt": "2020-04-22T17:30:00Z", "content": "Capricorns are regarded as one of the most ambitious signs and when they have a goal set in mind, nothing can stop them before they get there, even if it means foregoing certain things or devoiding themselves of simple pleasures in life. The new moon, after a… [+393 chars]"}, {"source": {"id": null, "name": "Tecake.com"}, "author": null, "title": "Creators will not remove this Most Hated Money Heist Character, Here’s Why - The TeCake", "description": "Money Heist has taken the world by storm as people are binge-watching season four of La Casa De Papel amid COVID-19 lockdown that has forced people to", "url": "https://tecake.com/news/creators-will-not-remove-this-most-hated-money-heist-character-heres-why-292125.html", "urlToImage": "https://i1.wp.com/tecake.com/wp-content/uploads/2020/04/MoneyHeist-1.jpg?fit=1280%2C720&ssl=1", "publishedAt": "2020-04-22T17:14:54Z", "content": "Money Heist has taken the world by storm as people are binge-watching season four of La Casa De Papel amid COVID-19 lockdown that has forced people to stay in their home. The popularity of the Money Heist season 4 is such that it is on its way to becoming the… [+2377 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "Taapsee reveals how ‘coach’ Sandeep Singh punished her during Soorma, watch video - Hindustan Times", "description": "Taapsee Pannu shared a behind-the-scenes video from Soorma, showing the punishment that Sandeep Singh gave her.", "url": "https://www.hindustantimes.com/bollywood/taapsee-reveals-how-coach-sandeep-singh-punished-her-during-soorma-watch-video/story-HOKo2qmQS2kT0lVHFcQQhK.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/04/22/Pictures/_ce398140-84b6-11ea-a351-6978c1d205f3.jpg", "publishedAt": "2020-04-22T16:44:01Z", "content": "Taapsee Pannu has been regaling fans with interesting anecdotes from her shoots lately, to beat the lockdown blues. She has now recalled the time she was shooting for the 2018 sports biopic Soorma, which narrates the remarkable real-life story of Indian hocke… [+1534 chars]"}, {"source": {"id": null, "name": "Gulte.com"}, "author": "2", "title": "Why Chiranjeevi Snubbed Trivikram? - Gulte", "description": "Other day, Megastar Chiranjeevi has openly announced that he is doing films with Sujeeth (Lucifer remake), KS Bobby and Meher Ramesh after he wraps up his ongoing Acharya", "url": "https://www.gulte.com/movienews/84235/Why-Chiranjeevi-Snubbed-Trivikram", "urlToImage": "https://content.gulte.com/content/2020/04/news/1587543359-123.jpg", "publishedAt": "2020-04-22T16:30:44Z", "content": "Other day, Megastar Chiranjeevi has openly announced that he is doing films with Sujeeth (Lucifer remake), KS Bobby and Meher Ramesh after he wraps up his ongoing Acharya under Koratala Siva's direction. But that brings us to the question what happened to the… [+1078 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "Antara Kashyap", "title": "Alia Bhatt Turns Poet For Earth Day 2020, Watch Video - News18", "description": "Alia Bhatt took to Instagram to recite a poem that she wrote for Earth Day 2020. The actress pledged to celebrate Earth Day every day by taking care of the planet.", "url": "https://www.news18.com/news/movies/alia-bhatt-turns-poet-for-earth-day-2020-watch-video-2588505.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/04/1587568540_screenshot_20200422-202848_chrome_copy_875x583.jpg", "publishedAt": "2020-04-22T16:19:00Z", "content": "April 22nd is celebrated worldwide as Earth Day and even in the middle of a global pandemic, people have not forgotten to take a moment to appreciate the planet. Bollywood stars also did their part to make their tribute as creative as possible. After Alaya F … [+1084 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Tom Holland Dons Spidey 'Costume' on Jimmy Kimmel Show to Wish the Host's Son on Birthday - News18", "description": "Holland's appearance on Jimmy Kimmel Show coincided with the birthday of the host's three-year-old son Billy who is a massive Spiderman fan.", "url": "https://www.news18.com/news/buzz/tom-holland-dons-spidey-costume-on-jimmy-kimmel-show-to-wish-the-hosts-son-on-birthday-2588591.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/04/1587569130_spidey.jpg", "publishedAt": "2020-04-22T16:18:41Z", "content": "British actor Tom Holland appeared in the Jimmy Kimmel Live! Show on Tuesday via video call. Kimmel has been shooting the popular talk show at home.\r\nThe day coincided with the birthday of Kimmels three-year-old son Billy who is a massive Spiderman fan. When … [+963 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Sonu Nigam Sings Main Hoon Na With Coronavirus Twist in Latest Vlog - News18", "description": "Sonu Nigam, who is currently in Dubai because of the Coronavirus lockdown, shared some cleaning tips and sang a coronavirus-themed rendition of the hit Bollywood number Main Hoon Na.", "url": "https://www.news18.com/news/movies/sonu-nigam-sings-main-hoon-na-with-coronavirus-twist-in-latest-vlog-2588459.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/04/1587563868_screenshot_20200422-192639_chrome_copy_875x583.jpg", "publishedAt": "2020-04-22T16:18:36Z", "content": "Renowned singer Sonu Nigam found himself stranded in Dubai when India entered a phase of complete lockdown to help battle the spread of novel coronavirus.\r\nBut staying away from motherland has not stopped the singer from participating in acts of solidarity, s… [+1227 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "'Please Show Some Respect to Your Maid': Shibani Dandekar's Pasta Making Video Gets Bad Reviews - News18", "description": "Shibani Dandekar's cook forgot to boil pasta with salt and the actress made her disappointment clear in the video. Obviously, she got quite a slamming on Instagram.", "url": "https://www.news18.com/news/movies/please-show-some-respect-to-your-maid-shibani-dandekars-pasta-making-video-gets-bad-reviews-2588321.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/04/1587558168_shibani-dandekar-cooking.jpg", "publishedAt": "2020-04-22T16:14:57Z", "content": "Actress and anchor Shibani Dandekar decided to make pasta with mushrooms and cream sauce on Wednesday. The whole process was filmed by beau Farhan Akhtar, and later posted on Instagram. While Shibani herself confessed she isn't a good cook, the reviews she re… [+1890 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Ajay Devgn Calls Aarogya Setu 'Personal Bodyguard', Narendra Modi Endorses Actor's Statement - News18", "description": "Prime Minister Narendra Modi quoted Ajay Devgn's tweet and said that the Aarogya Setu app is there to protect the citizens.", "url": "https://www.news18.com/news/movies/ajay-devgn-calls-aarogya-setu-personal-bodyguard-narendra-modi-endorses-actors-statement-2588609.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2019/07/Ajay-Devgn.jpg", "publishedAt": "2020-04-22T15:47:30Z", "content": "On Wednesday, Bollywood actor Ajay Devgn posted a tweet in praise of the Aarogya Setu app. He wrote, \"Dhanyawad \r\n@PMOIndia @narendramodi for creating a personal bodyguard for every Indian to fight COVID-19. #SetuMeraBodyguard hai aur aapka bhi. Download @Set… [+926 chars]"}, {"source": {"id": null, "name": "Indiaglitz.com"}, "author": "IndiaGlitz", "title": "Red Hot! Vijay Sethupathi bringing Thalapathy Vijay's son Sanjay to Tamil cinema? - Tamil News - IndiaGlitz.com", "description": "Thalapathy Vijay and Vijay Sethupathi are acting together in 'Master' directed by Lokesh Kangaraj which is one of the hottest films in the trade awaiting release soon", "url": "https://www.indiaglitz.com/thalapathy-vijay-son-jason-sanjay-debut-movie-produced-by-vijay-sethupathi-tamil-news-258710", "urlToImage": "https://1847884116.rsc.cdn77.org/tamil/news/social/vs220420_2-870.jpg", "publishedAt": "2020-04-22T14:44:54Z", "content": "Thalapathy Vijay and Vijay Sethupathi are acting together in 'Master' directed by Lokesh Kangaraj which is one of the hottest films in the trade awaiting release soon after the coronavirus pandemic subsides. The two mass heroes have bonded like brothers durin… [+1007 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Gulshan Devaiah and Kallirroi Tziafeta get divorced, he says ‘we both are doing okay’ - Hindustan Times", "description": "Gulshan Devaiah and Kallirroi Tziafeta, who got married in 2012, are divorced now. He confirmed the news and said that the split was amicable.", "url": "https://www.hindustantimes.com/bollywood/gulshan-devaiah-and-kallirroi-tziafeta-get-divorced-he-says-we-both-are-doing-okay/story-RFJ95ZEkdOPYvlhp7aLlGJ.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/04/22/Pictures/_135073dc-84a4-11ea-bf89-3b987bd73d6a.PNG", "publishedAt": "2020-04-22T14:33:47Z", "content": "Actors Gulshan Devaiah and Kallirroi Tziafeta are divorced. Gulshan confirmed the news in a recent interview and said that their eight-year-long marriage ended on an amicable note.\r\n“We are amicably divorced! We both are doing okay. We did not put out a press… [+1644 chars]"}, {"source": {"id": null, "name": "Bollywoodhungama.com"}, "author": "Bollywood Hungama", "title": "Tiger Shroff calls stuntmen the real heroes, shares a behind-the-scenes video from Baaghi - Bollywood Hungama", "description": "Tiger Shroff calls stuntmen the real heroes, shares a behind-the-scenes video from Baaghi. Latest Bollywood News, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News at Bollywood Hungama.com", "url": "https://www.bollywoodhungama.com/news/features/tiger-shroff-calls-stuntmen-real-heroes-shares-behind-scenes-video-baaghi/", "urlToImage": "https://media2.bollywoodhungama.in/wp-content/uploads/2020/04/Tiger-Shroff-calls-the-stuntmen-real-heroes-shares-a-behind-the-scenes-video-from-Baaghi.jpg", "publishedAt": "2020-04-22T14:18:58Z", "content": "Earlier today, Tiger shared BTS footage from the sets of Baaghi showing him engaging in fights with stuntmen. The actor shared the post to appreciate stuntmen all over the world who are a part of action films calling them real heroes.\r\nTiger shared the post o… [+416 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Dulquer Salmaan Issues Apology After Woman Accuses Him of Using Her Pictures Without Consent - News18", "description": "Dulquer Salmaan was accused of using journalist Chetna Sharma's pictures in a weight-loss poster in two scenes from his film Varane Avashyamund, without her consent.", "url": "https://www.news18.com/news/movies/dulquer-salmaan-issues-apology-after-woman-accuses-him-of-using-her-pictures-without-consent-2588379.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2019/07/Dulquer-Salmaan.jpg", "publishedAt": "2020-04-22T13:41:21Z", "content": "A lot of artists and filmmakers often use content without formal consent or approval, which leads to trouble eventually. Mollywood actor Dulquer Salmaan faced a similar fate recently when a woman journalist accused him of using her images in his movie without… [+1765 chars]"}, {"source": {"id": null, "name": "Tellychakkar.com"}, "author": "Tellychakkar Team", "title": "OMG! Siddarth doesn't want to keep in touch with Shehnaaz - Tellychakkar", "description": "Siddarth once said that he cannot hate Shehnaaz but will not keep in touch with her", "url": "https://www.tellychakkar.com/tv/tv-news/omg-siddarth-doesnt-want-keep-touch-shehnaaz-200422", "urlToImage": "https://www.tellychakkar.com/sites/www.tellychakkar.com/files/images/story/2020/04/22/SIDNAAZ.jpg", "publishedAt": "2020-04-22T12:35:00Z", "content": "MUMBAI: One of the most popular shows, Bigg Boss 13 might be over but the contestants are still making headlines. The latest report revolves around the adorable duo Shehnaaz Gill and Sidharth Shukla.\r\nThe twos bond was one of the major highlights of Bigg Boss… [+1362 chars]"}, {"source": {"id": null, "name": "Tellychakkar.com"}, "author": "Tellychakkar Team", "title": "Babita aka Munmun Datta of Taarak Mehta Ka Ooltah Chashmah finds Tapu aka Raj Anadkat 'CUTE' - Tellychakkar", "description": "Babita aka Munmun finds Raj’s video cute.", "url": "https://www.tellychakkar.com/tv/tv-news/babita-aka-munmun-datta-of-taarak-mehta-ka-ooltah-chashmah-finds-tapu-aka-raj-anadkat", "urlToImage": "https://www.tellychakkar.com/sites/www.tellychakkar.com/files/images/story/2020/04/22/AWWBABITARAJ.jpg", "publishedAt": "2020-04-22T12:26:00Z", "content": "MUMBAI: Televisions longest-running show Taarak Mehta Ka Ooltah Chashmah (SAB TV and Neela Telefilms) has been winning hearts and charts for many years now. Its rib-tickling comical episodes along with the good messages that the show conveys has set an exampl… [+1034 chars]"}, {"source": {"id": null, "name": "Ibtimes.co.in"}, "author": "Ruchita", "title": "Salman Khan reveals why his wedding was called off despite invites being printed (Throwback) - International Business Times, India Edition", "description": "One of Bollywood's most eligible bachelors was ready to give up the tag back in the 90s as he was all set to marry Sangeeta Bijlani", "url": "https://www.ibtimes.co.in/salman-khan-reveals-why-his-wedding-was-called-off-despite-invites-being-printed-throwback-818144", "urlToImage": "https://data1.ibtimes.co.in/en/full/736445/salman-khan-sangeeta-bijlani.jpg", "publishedAt": "2020-04-22T12:25:00Z", "content": "B-town celebs attend special screening of Dhadak\r\nSalman Khan has romanced almost every heroine on the big screen in the last three decades. If his on-screen love stories made people go weak in the knees, his off-screen affairs have grabbed eyeballs too. From… [+2526 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Mithun Chakraborty’s father Basantakumar dies at 95 in Mumbai, actor stuck in Bengaluru - India Today", "description": "Mithun Chakraborty’s father Basantakumar Chakraborty passed away in Mumbai on Tuesday. Mithun, who is stuck in Bengaluru, is trying to get to Mumbai to perform the last rites.", "url": "https://www.indiatoday.in/movies/celebrities/story/mithun-chakraborty-s-father-basantakumar-dies-at-95-in-mumbai-actor-stuck-in-bengaluru-1669829-2020-04-22", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202004/mithun_1-647x363.jpeg?IQJ7BAz_0VelB8KHgSzm0N3.DB67fSsp", "publishedAt": "2020-04-22T11:52:48Z", "content": "Veteran actor Mithun Chakrabortys father Basantakumar Chakraborty passed away in Mumbai on Tuesday. He was 95 and had been battling age-related ailments for some time.\r\nMithun Chakraborty is currently stuck in Bengaluru due to the lockdown. He was there for a… [+1006 chars]"}, {"source": {"id": null, "name": "Iwmbuzz.com"}, "author": "Editorial Team", "title": "Prabhas With Anushka Shetty Or Pooja Hegde: Whose On-Screen Chemistry Is Best? - IWMBuzz", "description": "IWMBuzz asks you whose on-screen chemistry do you like more with Prabhas? Checkout the photos for more details", "url": "https://www.iwmbuzz.com/movies/celebrities-movies/prabhas-anushka-shetty-pooja-hegde-whose-screen-chemistry-best/2020/04/22", "urlToImage": "https://www.iwmbuzz.com/wp-content/uploads/2020/04/prabhas-with-anushka-shetty-or-pooja-hegde-whose-on-screen-chemistry-is-best.jpg", "publishedAt": "2020-04-22T11:52:09Z", "content": "South sensation Prabhas is a cult figure not just in the South of India but also throughout India. His claim to fame on a national level without any doubt happens to be the magnanimous spectacle Baahubali created by the veteran S.S Rajamouli. Baahubali starre… [+546 chars]"}, {"source": {"id": null, "name": "Indiaglitz.com"}, "author": "IndiaGlitz", "title": "Raashi Khanna's first date was cute & weird! - Telugu News - IndiaGlitz.com", "description": "Raashi Khanna may be single now but there was a time when she had a boyfriend.  The 'Prati Roju Pandage' actress was barely 16 when she went on her first date.", "url": "https://www.indiaglitz.com/raashi-khannas-first-date-was-cute-and-weird-telugu-news-258683", "urlToImage": "https://1847884116.rsc.cdn77.org/telugu/news/social/raashi-khanna-on-dating-9d5.jpg", "publishedAt": "2020-04-22T11:45:27Z", "content": "Raashi Khanna may be single now but there was a time when she had a boyfriend. The 'Prati Roju Pandage' actress was barely 16 when she went on her first date.\r\n\"It was my BF's birthday. He invited me over for a party and I attended it. We both went to McDonal… [+554 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Neha Maheshwri", "title": "Exclusive - Devoleena Bhattacharjee: Arhaan Khan took advantage of Rashami for her money and publicity - Times of India", "description": "Devoleena spoke exclusively to TOI and said, “Rashami is my friend and she is strong enough to fight on her own. I", "url": "https://timesofindia.indiatimes.com/tv/news/hindi/exclusive-devoleena-bhattacharjee-says-that-rashami-is-paying-for-trusting-a-fraudster/articleshow/75293672.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-75294295,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-186952/75294295.jpg", "publishedAt": "2020-04-22T11:31:00Z", "content": null}, {"source": {"id": null, "name": "Asianetnews.com"}, "author": null, "title": "Ranveer Singh, Deepika Padukone spend a whopping amount on their food every month - Asianet News English", "description": "Did you know how much Bollywood's star couple Ranveer Singh and Deepika Padukone spend on food every month? Hold on to your breath and read on", "url": "https://newsable.asianetnews.com/gallery/entertainment/ranveer-singh-deepika-padukone-spend-a-whopping-amount-on-their-food-every-month-q96t7i", "urlToImage": "https://static.asianetnews.com/images/01dk6bcjkxjn4xta9ymycst1zq/ranveer-deepika-770x433-webp_1200x630xt.jpg", "publishedAt": "2020-04-22T11:29:36Z", "content": "In an interview with the Times Of India, the co-founder of POD revealed that many Bollywood actors like Akshay Kumar, Anil Kapoor, Ranveer Singh, Deepika Padukone, and several others have taken monthly subscription of the POD supply."}, {"source": {"id": null, "name": "Koimoi.com"}, "author": null, "title": "Brad Pitt & Angelina Jolie’s Divorce Was Triggered By THIS Action Of Son Maddox? - Koimoi", "description": "Angelina Jolie and Brad Pitt were one of the most hyped celebrity couples in Hollywood. They two started dating on the sets of Mr. & Mrs. Smith", "url": "https://www.koimoi.com/hollywood-2/brad-pitt-angelina-jolies-divorce-was-triggered-by-this-action-of-son-maddox/", "urlToImage": "https://static-koimoi.akamaized.net/wp-content/new-galleries/2020/04/brad-pitt-angelina-jolies-divorce-was-triggered-by-this-action-of-son-maddox-001.jpg", "publishedAt": "2020-04-22T11:02:38Z", "content": "Brad Pitt &amp; Angelina Jolie’s Divorce Was Triggered By THIS Action Of Son Maddox?\r\nAngelina Jolie and Brad Pitt were one of the most hyped celebrity couples in Hollywood. They two started dating on the sets of Mr. &amp; Mrs. Smith and have six kids togethe… [+1655 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Stuck In Karjat Due to Lockdown, Arjun Rampal Prefers to Stay Put to Keep Baby Son Safe - News18", "description": "Arjun Rampal is spending the lockdown days at his second home in Karjat with partner Gabriella Demetriades and their baby son Arik.", "url": "https://www.news18.com/news/movies/stuck-in-karjat-due-to-lockdown-arjun-rampal-prefers-to-stay-put-to-keep-baby-son-safe-2588157.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/01/Arjun-Rampal.jpg", "publishedAt": "2020-04-22T10:42:59Z", "content": "Arjun Rampal was shooting in Karjat when the lockdown was announced and the actor chose to stay back as it is safe there. He owns a house is Karjat, where he is currently staying with partner Gabriella Demetriades and their baby son Arik.\r\nSo far Karjat has r… [+1049 chars]"}, {"source": {"id": null, "name": "Tellychakkar.com"}, "author": "Tellychakkar Team", "title": "Siddharth-Abhishek's amazing response on being asked about their relationship status by their mom - Tellychakkar", "description": "Nigam brothers' response to their mom when asked about their relationship status was quite amazing.", "url": "https://www.tellychakkar.com/tv/tv-news/siddharth-abhisheks-amazing-response-being-asked-about-their-relationship-status-their", "urlToImage": "https://www.tellychakkar.com/sites/www.tellychakkar.com/files/images/story/2020/04/22/abhi.jpg", "publishedAt": "2020-04-22T10:35:00Z", "content": "MUMBAI: Siddharth Nigam and Abhishek Nigam are one of the most popular brother jodis of the small screen. Both of them have established themselves in the showbiz world and are reaching new levels of success with every passing day.\r\nWhile Siddharth is currentl… [+994 chars]"}, {"source": {"id": null, "name": "Koimoi.com"}, "author": null, "title": "Avengers: Endgame: Opening Night Reaction To Iron Man Snapping His Fingers To Kill Thanos Will Give You Literal Chills! WATCH - Koimoi", "description": "Avengers: Endgame was full of surprises and WOW as well as WTF moments. Whether it was Hulk as Smart Hulk, Black Widow sacrificing", "url": "https://www.koimoi.com/hollywood-2/avengers-endgame-opening-night-reaction-to-iron-man-snapping-his-fingers-to-kill-thanos-will-give-you-literal-chills-watch/", "urlToImage": "https://static-koimoi.akamaized.net/wp-content/new-galleries/2020/04/avengers-endgame-opening-night-reaction-to-iron-man-snapping-his-fingers-to-kill-thanos-will-give-you-literal-chills-watch-001.jpg", "publishedAt": "2020-04-22T10:25:26Z", "content": "Avengers: Endgame: Opening Night Reaction To Iron Man Snapping His Fingers To Kill Thanos Will Give You Literal Chills! WATCH\r\nAvengers: Endgame was full of surprises and ‘WOW’ as well as ‘WTF’ moments. Whether it was Hulk as Smart Hulk, Black Widow sacrifici… [+1481 chars]"}, {"source": {"id": null, "name": "Koimoi.com"}, "author": null, "title": "Fan Chases Avengers: Endgame Actor Chris Hemsworth AKA Thor On A Bike, Actor Hires Him As A Body Double, WATCH! - Koimoi", "description": "The biggest proof of it remains to be the earth-shattering box office numbers of Avengers: Endgame. Thor fame actor Chris Hemsworth recently...", "url": "https://www.koimoi.com/hollywood-2/fan-chases-avengers-endgame-actor-chris-hemsworth-aka-thor-on-a-bike-actor-hires-him-as-a-body-double-watch/", "urlToImage": "https://static-koimoi.akamaized.net/wp-content/new-galleries/2020/04/fan-chases-avengers-endgame-actor-chris-hemsworth-aka-hulk-on-a-bike-actor-hires-him-as-a-body-double-watch-01.jpg", "publishedAt": "2020-04-22T10:25:09Z", "content": "Fan Chases Avengers: Endgame Actor Chris Hemsworth AKA Thor On A Bike, Actor Hires Him As A Body Double, WATCH!\r\nThe craze for Marvel superheroes be it Iron Man aka Robert Downey Jr, Mark Ruffalo aka Hulk or for that matter Chris Evanss Captain America across… [+1825 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Ekta Kapoor transfers money to Mumbai paparazzi's accounts: We all will get out of this - India Today", "description": "Ekta Kapoor has deposited money in the accounts of out-of-work entertainment photographers. They took to social media to thank the producer.", "url": "https://www.indiatoday.in/television/celebrity/story/ekta-kapoor-transfers-money-to-mumbai-paparazzi-s-accounts-we-all-will-get-out-of-this-1669768-2020-04-22", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202004/em_8-647x363.png?.z0xkZwPlEhtT7C7lVEGEmgWHxE8DNoA", "publishedAt": "2020-04-22T09:45:00Z", "content": "Ekta Kapoor has transferred money to the accounts of the Mumbai paparazzi. Viral Bhayani, Yogen Shah and Manav Manglani, who are some of the popular photographers took to social media to thank Ekta for helping their teams.\r\nViral praised Ekta Kapoor for helpi… [+1261 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Thalapathy Vijay donates Rs 1.3 crore to coronavirus relief efforts - India Today", "description": "Actor Vijay has contributed a sum of Rs 1.3 crore to PM-CARES Fund and Chief Minister's Relief Funds to combat the deadly coronavirus.", "url": "https://www.indiatoday.in/movies/regional-cinema/story/thalapathy-vijay-donates-rs-1-3-crore-to-coronavirus-relief-efforts-1669773-2020-04-22", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202004/Vijay_1-647x363.jpeg?omz3xLQ2w6rZguMq2jUCkarXpVT5RVUh", "publishedAt": "2020-04-22T09:45:00Z", "content": "The novel coronavirus outbreak has brought everyone's life to a standstill. Many film bodies requested actors for donation to help the daily wage workers. Recently, Thalapathy Vijay donated Rs 1.30 crore to PM-CARES and Chief Minister's Relief Funds of differ… [+1326 chars]"}, {"source": {"id": null, "name": "Scoopwhoop.com"}, "author": "Srishti Magan", "title": "Kartik Aaryan Made A Video About Hitting His Sister For Not Making Perfect Rotis. We Need To 'Rant' - ScoopWhoop", "description": "Kartik Aaryan shared a TikTok video on Instagram, in which he hits his sister for not making the perfect roti. It was meant to be funny but has now been deleted.", "url": "https://www.scoopwhoop.com/entertainment/dear-kartik-aaryan-domestic-violence-is-never-an-acceptable-topic-for-a-joke/", "urlToImage": "https://s4.scoopwhoop.com/anj2/5e9fde6518ac8111b319df27/a25a7278-1ddd-48f5-94e6-a1a7b9c1dd0a.jpg", "publishedAt": "2020-04-22T09:30:30Z", "content": "Kartik Aaryan is no stranger to misogynistic statements and monologues, but in the past, they've been attributed to his characters. \r\n This time around though, Kartik appears to have written and directed his own brand of misogyny. \r\nSource: India Today \r\nIn a… [+1063 chars]"}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": "Pinkvilla Desk", "title": "Karan Johar's twins Yash and Roohi turn diet police for father as they relish burgers; Watch VIDEO - PINKVILLA", "description": "Karan Johar's season 2 of Lockdown with the Johars along with Roohi and Yash has drawn our attention all over again. Check out this video right here.", "url": "https://www.pinkvilla.com/entertainment/news/karan-johars-twins-yash-and-roohi-turn-diet-police-father-they-relish-burgers-watch-video-526340", "urlToImage": "https://www.pinkvilla.com/files/styles/fbimagesection/public/kjowithtwinsdietpolce.jpg?itok=-xT-UMsj", "publishedAt": "2020-04-22T09:24:52Z", "content": null}, {"source": {"id": null, "name": "Wionews.com"}, "author": "WION Web Team", "title": "As Queen turns 94, Prince Charles, William and Kate share rare pictures of the monarch - WION", "description": "Currently in quarantine with husband Prince Philip at Windsor Castle, the British Queen, unlike previous times, was not seen with family members who huddle up to celebrate her big day.", "url": "https://www.wionews.com/entertainment/as-queen-turns-94-prince-charles-william-and-kate-share-rare-pictures-of-the-monarch-293914", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2020/04/22/137624-horizons-11.jpg", "publishedAt": "2020-04-22T09:00:58Z", "content": "Queen Elizabeth turned 94 as members of the British royal family wished her with some adorable throwback images. \r\nCurrently in quarantine with husband Prince Philip at Windsor Castle, the British Queen, unlike previous times, was not seen with family members… [+989 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Meghan Markle, Prince Harry and baby Archie wish Queen via video call on her 94th birthday - India Today", "description": "Meghan Markle and Prince Harry along with their baby boy Archie video-called the Queen on her 94th birthday.", "url": "https://www.indiatoday.in/lifestyle/celebrity/story/meghan-markle-prince-harry-and-baby-archie-wish-queen-via-video-call-on-her-94th-birthday-1669742-2020-04-22", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202004/meghan-647x363.png?4AKsbB40ftQzBK0BEmkb1sfmLpUSa4U5", "publishedAt": "2020-04-22T08:33:55Z", "content": "The Queen celebrated her 94th birthday yesterday while in isolation. To celebrate the occasion, Meghan Markle and Prince Harry along with their son Archie wished the Queen via video call.\r\nAccording to Bazaar.com, the Duke and the Duchess wished the Queen fro… [+1199 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "'Virtual wedding' a hit in the times of coronavirus - Times of India", "description": "India News:  The lockdown has prompted many couples to try the idea of 'virtual wedding'. Avinash and Kirti had an online wedding which was virtually attended by", "url": "https://timesofindia.indiatimes.com/india/virtual-wedding-a-hit-in-the-times-of-coronavirus/articleshow/75287209.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-75287250,width-1070,height-580,imgsize-995025,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2020-04-22T08:31:44Z", "content": "Subscribe\r\nStart Your Daily Mornings with Times of India Newspaper!Order Now"}, {"source": {"id": null, "name": "Ibtimes.co.in"}, "author": "Parismita Goswami", "title": "When Twinkle Khanna partied with ex-boyfriend without husband Akshay Kumar [Throwback] - International Business Times, India Edition", "description": "While a lot has had been written about Akshay Kumar and the actresses he dated before falling for Twinkle Khanna, not many are aware of Mrs Funnybones' past relationship.", "url": "https://www.ibtimes.co.in/when-twinkle-khanna-partied-ex-boyfriend-without-husband-akshay-kumar-throwback-818119", "urlToImage": "https://data1.ibtimes.co.in/en/full/736417/twinkle-khanna-partied-ex-boyfriend-without-akshay-kumar.jpg", "publishedAt": "2020-04-22T08:31:01Z", "content": "Akshay kumar's advice on quarantine \r\nTwinkle Khanna and Akshay Kumar are one of the strongest and most loved couples of Bollywood. The duo has been married for close to two decades now and are proud parents of two children.\r\nWhile a lot has had been written … [+1986 chars]"}, {"source": {"id": null, "name": "Tecake.com"}, "author": null, "title": "Chris Hemsworth Chased by Indian fan on Bike, Watch Viral Video - The TeCake", "description": "Chris Hemsworth is in India for the shooting of Extraction which is scheduled to launch in 2020. During the shoot, Chris got stunned when a fan started", "url": "https://tecake.com/news/chris-hemsworth-chased-by-indian-fan-on-bike-watch-viral-video-292060.html", "urlToImage": "https://i1.wp.com/tecake.com/wp-content/uploads/2020/04/chris_0-770x433-1.jpg?fit=770%2C433&ssl=1", "publishedAt": "2020-04-22T08:09:47Z", "content": "Chris Hemsworth is in India for the shooting of Extraction which is scheduled to launch in 2020. During the shoot, Chris got stunned when a fan started chasing him on his bike while Chris was in the backseat of the car. He told the rider to look ahead so he d… [+2710 chars]"}, {"source": {"id": null, "name": "Iwmbuzz.com"}, "author": "Editorial Team", "title": "Yeh Rishta Kya Kehlata Hai fame Mohsin Khan welcomes a special person’s entry on Instagram - IWMBuzz", "description": "Yeh Rishta Kya Kehlata Hai fame Mohsin Khan welcomes 'someone special' on Instagram", "url": "https://www.iwmbuzz.com/television/snippets/yeh-rishta-kya-kehlata-hai-fame-mohsin-khan-welcomes-special-persons-entry-instagram/2020/04/22", "urlToImage": "https://www.iwmbuzz.com/wp-content/uploads/2020/04/yeh-rishta-kya-kehlata-hai-fame-mohsin-khan-welcomes-a-special-persons-entry-on-instagram-2.jpg", "publishedAt": "2020-04-22T07:15:39Z", "content": "Handsome hunk Mohsin Khan, who is popularly known as Kartik from Yeh Rishta Kya Kehlata Hai, is mammas boy. The actor recently celebrated his mothers birthday during lockdown and today he welcomed her Instagram with a cute post.\r\nThe actor took to his Instagr… [+100 chars]"}, {"source": {"id": null, "name": "Indiaglitz.com"}, "author": "IndiaGlitz", "title": "Amala Paul clarifies about her second marriage - Tamil News - IndiaGlitz.com", "description": "Tollywood reports suggest that Amala Paul in an interview with a leading daily has opened up about her personal life.", "url": "https://www.indiaglitz.com/amala-paul-clarifies-about-her-second-marriage-tamil-news-258657", "urlToImage": "https://1847884116.rsc.cdn77.org/tamil/news/social/amala220420_4-b23.jpg", "publishedAt": "2020-04-22T06:38:56Z", "content": "Amala Paul ever since her breakthrough in Tamil cinema playing the title role of 'Mynaa' in 2010 has had a colorful decade starring in many super hit films in Tamil, Telugu and Malayalam. She has also built the reputation of taking up bold and challenging rol… [+1652 chars]"}, {"source": {"id": null, "name": "Koimoi.com"}, "author": null, "title": "Avengers: Endgame Trivia #28: Wondering Why Black Widow Didn’t Get A Funeral Like Iron Man? Here’s A Strange Reason! - Koimoi", "description": "In Avengers: Endgame, we witnessed the deaths of two superheroes - Iron Man and Black Widow. Played by Robert Downey Jr and Scarlett...", "url": "https://www.koimoi.com/hollywood-2/avengers-endgame-trivia-28-wondering-why-black-widow-didnt-get-a-funeral-like-iron-man-heres-a-strange-reason/", "urlToImage": "https://static-koimoi.akamaized.net/wp-content/new-galleries/2020/04/avengers-endgame-trivia-28-wondering-why-black-widow-didnt-get-a-funeral-like-iron-man-heres-a-strange-reason-001.jpg", "publishedAt": "2020-04-22T06:31:14Z", "content": "Avengers: Endgame Trivia #28: Wondering Why Black Widow Didn’t Get A Funeral Like Iron Man? Here’s A Strange Reason!\r\nIn Avengers: Endgame, we witnessed the deaths of two superheroes – Iron Man and Black Widow. Played by Robert Downey Jr and Scarlett Johansso… [+2263 chars]"}, {"source": {"id": null, "name": "Bollywoodlife.com"}, "author": "BollywoodLife", "title": "Mahesh Babu's daughter, Sitara's Instagram is as adorable as the little munchkin - Bollywood Life", "description": "Bollywood & Hollywood Photo Gallery – Check out latest bollywood & Hollywood actors, actress & movie images. Also explore pictures of celebrity photo-shoot, selfies, bollywood parties & events at Bollywoodlife.com", "url": "https://www.bollywoodlife.com/photos/celeb-mahesh-babu/mahesh-babus-daughter-sitaras-instagram-is-as-adorable-as-the-little-munchkin-1609704/", "urlToImage": "https://st1.bollywoodlife.com/wp-content/uploads/photos/mahesh-babus-daughter-sitaras-instagram-is-as-adorable-as-the-little-munchkin-202004-1609730.jpg", "publishedAt": "2020-04-22T06:06:49Z", "content": "Mahesh Babu and Namrata Shirodkar's daughter, Sitara Ghattamaneni, recently made her Instagram debut and the little one is quite popular already. Well, the Instagram account is actually handled by her mother, but the posts are as adorable as the little one. H… [+65 chars]"}, {"source": {"id": null, "name": "Asianetnews.com"}, "author": null, "title": "When rumours of Aishwarya Rai dating Anil Ambani came to light (major throwback) - Asianet News English", "description": "Back in 2004, Aishwarya had opened up on her link-up rumours with business tycoon Anil Ambani\n&nbsp;", "url": "https://newsable.asianetnews.com/gallery/entertainment/when-rumours-of-aishwarya-rai-dating-anil-ambani-came-to-light-major-throwback--q96d7w", "urlToImage": "https://static.asianetnews.com/images/01e4zac2z4ecbbtnw6zwp99j5d/ai-2-jpg_1200x630xt.jpg", "publishedAt": "2020-04-22T05:44:52Z", "content": "During the year 2004, when Aishwarya Rai was one of the rising stars after giving hits like Hum Dil De Chuke Sanam, Taal, Devdas, Mohabbatein, etc, she was every producers and directors dream to work with. And during that time, she was embroiled in many contr… [+12 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Priyanka Chopra helps provide 20,000 pairs of footwear to frontline COVID-19 healthcare workers in LA and - Times of India", "description": "Desi Girl Priyanka Chopra has been doing her bit to help aid COVID-19 relief efforts by contributing to various cha", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/priyanka-chopra-helps-provide-20000-pairs-of-footwear-to-frontline-covid-19-healthcare-workers-in-la-and-india/articleshow/75286577.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-75286579,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-150041/75286579.jpg", "publishedAt": "2020-04-22T05:37:00Z", "content": null}, {"source": {"id": null, "name": "Asianetnews.com"}, "author": null, "title": "Samantha Akkineni's absence on social media made fans think; is she pregnant? - Asianet News English", "description": "After taking a long break from social media, Samantha Akkineni is back with a picture&nbsp;", "url": "https://newsable.asianetnews.com/gallery/entertainment/samantha-akkineni-s-absence-on-social-media-made-fans-think-is-she-pregnant--q96cvo", "urlToImage": "https://static.asianetnews.com/images/01e3q7qzpcwg1npkwb8e5vpndr/5-jpg_1200x630xt.jpg", "publishedAt": "2020-04-22T05:36:03Z", "content": "According to reports, one of the sources close to her said, \"She feels that this is the time she can spend time with her husband Naga Chaitanya, so she has made it a completely private time, and is avoiding posts.\""}, {"source": {"id": null, "name": "Koimoi.com"}, "author": null, "title": "Hugh Jackman Would’ve Played Wolverine In Marvel Cinematic Universe But On THIS Condition - Koimoi", "description": "Hugh Jackman will always be loved for playing the amazing character, Wolverine in X-Men movies. He portrayed this role for almost two decades on the big screen. The actor", "url": "https://www.koimoi.com/hollywood-2/hugh-jackman-wouldve-played-wolverine-in-marvel-cinematic-universe-but-on-this-condition/", "urlToImage": "https://static-koimoi.akamaized.net/wp-content/new-galleries/2020/04/hugh-jackman-wouldve-played-wolverine-in-marvel-cinematic-universe-but-on-this-condition-0001.jpg", "publishedAt": "2020-04-22T05:35:27Z", "content": "Hugh Jackman Would’ve Played Wolverine In Marvel Cinematic Universe But On THIS Condition\r\nHugh Jackman will always be loved for playing the amazing character, Wolverine in X-Men movies. He portrayed this role for almost two decades on the big screen. The act… [+1528 chars]"}, {"source": {"id": null, "name": "Sify.com"}, "author": "MOVIEBUZZ", "title": "SRK dodges the question on joining hands with director Atlee! - Sify News", "description": "<p>Shah Rukh Khan replied: Is it alright if I can forward the scripts to you also</p>", "url": "https://www.sify.com/movies/srk-dodges-the-question-on-joining-hands-with-director-atlee-news-tamil-uewkRQjhedfhb.html", "urlToImage": "https://www.sify.com/uploads/Screen Shot 2020-04-22 at 10.05.58 AM_uewkRQjheffda.png", "publishedAt": "2020-04-22T05:23:52Z", "content": "In a recent chat with fans on Twitter, Shah Rukh Khan dodged the question of joining hands with Atlee. A netizen asked the actor when he is going to join hands with Atlee, Rajkumar Hirani, and Siddharth Anand.\r\nShah Rukh Khan quirkily replied: \"Is it alright … [+482 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "A fan asked Ileana D’Cruz how does he deal with his fiancé during periods, her answer is a pure gem! - Times of India", "description": "A fan asked Ileana D'Cruz for advice on dealing with his fiancé who is on her periods and her prompt reply is sure", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/a-fan-asked-ileana-dcruz-how-does-he-deal-with-his-fianc-during-periods-her-answer-is-a-pure-gem/articleshow/75286002.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-75286002,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-692064/75286002.jpg", "publishedAt": "2020-04-22T05:11:00Z", "content": null}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Vicky Kaushal reveals he has suffered sleep paralysis: ‘Experienced it couple of times, damn scary’ - Hindustan Times", "description": "Ahead of the OTT premiere of his horror film Bhoot Part One The Haunted Ship, Vicky Kaushal talks to fans and reveals his fears.", "url": "https://www.hindustantimes.com/bollywood/vicky-kaushal-reveals-he-has-suffered-sleep-paralysis-experienced-it-couple-of-times-damn-scary/story-hz6YDZXLu8R94RGZf4SkEL.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/04/22/Pictures/_45b0b602-844f-11ea-a351-6978c1d205f3.jpg", "publishedAt": "2020-04-22T04:47:44Z", "content": "Bollywood actor Vicky Kaushal has revealed he has experienced sleep paralysis quite a few times and added it is “damn scary”. He also revealed moments that scare him. Vicky conducted an AMA on Instagram and responded to all questions. \r\nOne of his fans asked,… [+1604 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Want to Join Friends Cast During the Reunion Special Episode? Here's How You Can Do it - News18", "description": "The cast of the hit TV comedy 'Friends' offered six fans the chance to join them for their upcoming reunion show. If you want to be on the original sets with them, this is what you need to do.", "url": "https://www.news18.com/news/movies/want-to-join-friends-cast-during-the-reunion-special-episode-heres-how-you-can-do-it-2587549.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/04/1587529929_friends-cast.jpg", "publishedAt": "2020-04-22T04:46:55Z", "content": "The cast of the hit TV comedy Friends on Tuesday offered six fans the chance to join them for their upcoming reunion show, which will raise funds for those worst-affected by the coronavirus epidemic.\r\nThe One Where You Meet the Entire Cast of Friends was the … [+1436 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Saif Ali Khan says no one expected Tanhaji to do so well, RadhaKrishn crew stranded at shoot locati... - Hindustan Times", "description": "From Saif Ali Khan’s latest comments on being a part of Aja Devgn’s Tanhaji to RadhaKrishn crew stranded at shoot location, here are the biggest news from the world of entertainment.", "url": "https://www.hindustantimes.com/bollywood/saif-ali-khan-says-no-one-expected-tanhaji-to-do-so-well-radhakrishn-crew-stranded-at-shoot-location/story-Tq1uNAaMw5Aqv2F82i4ZQN.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/04/22/Pictures/_71e4b166-844e-11ea-a351-6978c1d205f3.jpg", "publishedAt": "2020-04-22T04:32:26Z", "content": "Saif Ali Khan says no one expected Tanhaji to do so well, calls it ‘highly patriotic film’ that ticks all the boxes\r\nActor Saif Ali Khan has said that while he knew that Tanhaji: The Unsung Warrior would do well at the box office, no one expected it to do the… [+2487 chars]"}, {"source": {"id": null, "name": "Bollywoodhungama.com"}, "author": "Bollywood Hungama", "title": "Have Tiger Shroff and Disha Patani moved in during the lock-down? Krishna Shroff answers - Bollywood Hungama", "description": "Have Tiger Shroff and Disha Patani moved in during the lock-down? Krishna Shroff answers. Latest Bollywood News, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News at Bollywood Hungama.com", "url": "https://www.bollywoodhungama.com/news/features/have-tiger-shroff-and-disha-patani-moved-in-during-the-lock-down-krishna-shroff-answers/", "urlToImage": "https://stat1.bollywoodhungama.in/wp-content/uploads/2020/04/disha-tiger.jpg", "publishedAt": "2020-04-22T04:21:22Z", "content": "Opening up to a leading daily, Krishna revealed that Disha had not moved in with her brother. However, she added that Disha lived in the same vicinity and they would often catch up while buying groceries. You already know that Krishna and Disha are really clo… [+415 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Trishala Dutt remembers mother Richa Sharma with an UNSEEN picture from 1988 - Times of India", "description": "Sanjay Dutt and Richa Sharma’s daughter Trishala Dutt walked down memory lane and posted an adorable throwback on s", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/trishala-dutt-remembers-mother-richa-sharma-with-an-unseen-picture-from-1988/articleshow/75285452.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-75285452,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-390873/75285452.jpg", "publishedAt": "2020-04-22T04:17:00Z", "content": null}, {"source": {"id": null, "name": "Indiaglitz.com"}, "author": "IndiaGlitz", "title": "\"We must be ashamed!\" - Khushbu slams doctor burial denial! - Tamil News - IndiaGlitz.com", "description": "On Sunday, Doctor Simon Hercules who heads New Life hope hospital in Chennai had passed away due to cardiac arrest,", "url": "https://www.indiaglitz.com/khushbu-statement-on-denying-doctor-burial-tamil-news-258642", "urlToImage": "https://1847884116.rsc.cdn77.org/tamil/news/social/20992642_1423173864403831_4165065305219205391_n-e1f.jpg", "publishedAt": "2020-04-22T04:16:36Z", "content": "On Sunday, Doctor Simon Hercules who heads New Life hope hospital in Chennai had passed away due to cardiac arrest, after he had been diagnosed with Coronavirus infection. On Monday, there had been a huge issue over his burial.\r\nWhen doctors, medical officers… [+992 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "HBO Max streaming service to launch May 27 - CGTN", "description": "", "url": "https://news.cgtn.com/news/2020-04-22/HBO-Max-streaming-service-to-launch-May-27-PThBSwlVnO/index.html", "urlToImage": "https://news.cgtn.com/news/3049544e3049444f346b544f7a416a4d3163444f31457a6333566d54/img/6a59fb46f7a44db88f71f1af37402144/6a59fb46f7a44db88f71f1af37402144-1.jpg", "publishedAt": "2020-04-22T03:06:39Z", "content": "Streaming platform HBO Max expected to be a major player in the crowded online entertainment market will launch on May 27, WarnerMedia announced Tuesday.\r\nThe debut of the hotly anticipated service the new home of hit sitcoms \"Friends\" and \"The Big Bang Theor… [+1734 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "India TV Entertainment Desk", "title": "Singer Sunidhi Chauhan's marriage in trouble after 8 years? Husband Hitesh Sonik clarifies - India TV News", "description": "Sunidhi Chauhan and Hitesh Sonik tied the knot in 2012. The singer earlier got married at the age of 18 to director-choreographer Bobby Khan. Her first marriage lasted barely a year. Hitesh and Sunidhi welcomed their first child together on January 1, 2018.", "url": "https://www.indiatvnews.com/entertainment/celebrities/singer-sunidhi-chauhan-s-marriage-in-trouble-after-8-years-husband-hitesh-sonik-clarifies-610000", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2020/04/pjimage-2-1587519937.jpg", "publishedAt": "2020-04-22T02:31:37Z", "content": "Image Source : INSTAGRAMSinger Sunidhi Chauhan's marriage in trouble after 8 years? Husband Hitesh Sonik clarifies\r\nBollywood singer Sunidhi Chauhan's marriage appears to have hit the rocky road after eight years. According to the reports, it is said that Sun… [+1546 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Alok Nayak", "title": "Leaked Images of WWE Money In the Bank Set Promise a Thriller - Essentially Sports", "description": "Leaked images of the set for the Climb the corporate ladder match in upcoming WWE Money in the Bank have got the fans excited", "url": "https://www.essentiallysports.com/wwe-news-leaked-images-of-wwe-money-in-the-bank-set-promise-a-thriller/", "urlToImage": "https://image-cdn.essentiallysports.com/wp-content/uploads/20200422065423/34-15.jpg", "publishedAt": "2020-04-22T01:30:00Z", "content": "The novel Coronavirus has brought almost all the sporting events to halt for an indefinite time period. However, WWE is still putting on shows for his fans on a regular basis. Weeks ago, WWE made a monumental Wrestlemania possible amidst the pandemic to enter… [+1811 chars]"}, {"source": {"id": null, "name": "Jantakareporter.com"}, "author": "https://www.facebook.com/rifat.jawaid", "title": "Indian Idol judge Neha Kakkar drops bombshell on facing insults in Bollywood; weeks after being ridiculed by Kiku Sharda of The Kapil Sharma Show - Janta Ka Reporter", "description": "Indian Idol judge Neha Kakkar has dropped bombshell claiming that she faced insults in Bollywood. Her revelation came weeks after she was ridiculed by Kiku Sharda of The Kapil Sharma Show", "url": "http://www.jantakareporter.com/entertainment/indian-idol-judge-neha-kakkar-drops-bombshell-on-facing-insults-in-bollywood-weeks-after-being-ridiculed-by-kiku-sharda-of-the-kapil-sharma-show/288372/", "urlToImage": "http://www.jantakareporter.com/wp-content/uploads/2020/04/neha-kakkar-2.jpg", "publishedAt": "2020-04-22T00:53:57Z", "content": "Indian Idol judge Neha Kakkar has often earned plaudits for being sensitive to people in distress by volunteering to help those in need. Several weeks ago, she won million hearts by coming forward to help this year’s Indian Idol winner Sunny Hindustani with R… [+2909 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Alok Nayak", "title": "“You Want the Truth?”- CM Punk is Making His SmackDown Return Believes Mark Henry - Essentially Sports", "description": "Is the voice of the voiceless, CM Punk is about to drop some pipebombs in Friday Night SmackDown? WWE Hall of Famer, Mark henry believes so", "url": "https://www.essentiallysports.com/wwe-news-you-want-the-truth-cm-punk-is-making-his-smackdown-return-believes-mark-henry/", "urlToImage": "https://image-cdn.essentiallysports.com/wp-content/uploads/20200422052915/78-8.jpg", "publishedAt": "2020-04-22T00:06:00Z", "content": "Is CM Punk the Mystery Hacker of SMackdown? Well, according to WWE Hall of Famer, Mark Henry, CM Punk is back into action to reveal the truth yet again.\r\nThe Mystery Hacker storyline has been one of the most intriguing ones in SmackDown. Recently, he revealed… [+1694 chars]"}, {"source": {"id": null, "name": "Sportskeeda.com"}, "author": "Arunava Ghoshal", "title": "WWE News - RAW Superstar wants to be known as 'one of the key players' of this era - Sportskeeda", "description": "She also expressed her desire to win championships across all the three brands in #WWE.", "url": "https://www.sportskeeda.com/wwe/wwe-news-raw-superstar-wants-to-be-known-as-one-of-the-key-players-of-this-era", "urlToImage": "https://statics.sportskeeda.com/editor/2020/04/f6cee-15875051040537-800.jpg", "publishedAt": "2020-04-21T22:41:59Z", "content": "WWE RAW\r\nThe latest acquisition of the RAW roster, Bianca Belair, has been delivering impressive performances since joining the brand after WrestleMania 36. As she is currently associated with the Red brand, Belair aims at winning the RAW Women's Championship… [+1572 chars]"}, {"source": {"id": null, "name": "Siasat.com"}, "author": "Safoora", "title": "Rohit Shetty facilitates 8 hotels for cops fighting COVID-19 - The Siasat Daily", "description": "MUMBAI: Filmmaker Rohit Shetty has facilitated eight hotels across the city for on-duty policemen to rest and have meals amid the coronavirus pandemic. The news was shared by the official handle of Mumbai Police on Twitter, thanking the \"Singham\" filmmaker fo…", "url": "https://www.siasat.com/rohit-shetty-facilitates-8-hotels-cops-fighting-covid-19-1877655/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2020/04/Rohit-Shetty-Instagram.jpg", "publishedAt": "2020-04-21T21:42:44Z", "content": "MUMBAI: Filmmaker Rohit Shetty has facilitated eight hotels across the city for on-duty policemen to rest and have meals amid the coronavirus pandemic. The news was shared by the official handle of Mumbai Police on Twitter, thanking the “Singham” filmmaker fo… [+1620 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Alok Nayak", "title": "You Won’t Believe How Much Brock Lesnar Is Getting Paid in WWE - Essentially Sports", "description": "Brock Lesnar, Roman Reigns, Randy Orton among the top earners WWE superstars for 2019, Lesnar tops the list with $10 million", "url": "https://www.essentiallysports.com/wwe-news-you-wont-believe-how-much-brock-lesnar-is-getting-paid-in-wwe/", "urlToImage": "https://image-cdn.essentiallysports.com/wp-content/uploads/20200422023257/56-9.jpg", "publishedAt": "2020-04-21T21:23:00Z", "content": "It comes as no surprise that Brock Lesnar tops the list of top earners in WWE. The former WWE champion tops the list with a whopping $10 million.\r\nRecently, WWE faced a ton of criticism for releasing many superstars from the roaster including the likes of Kur… [+1925 chars]"}, {"source": {"id": null, "name": "Tecake.com"}, "author": null, "title": "Stranger Things drops stunning trailer to confirm the release of Season 4 - The TeCake", "description": "Geeks, it's official.  Stranger Things 4 is coming. It's occurring. It's validated. As well as now, it's been formally unveiled that Hopper, who allegedly", "url": "https://tecake.com/news/stranger-things-drops-stunning-trailer-to-confirm-the-release-of-season-4-292037.html", "urlToImage": "https://i0.wp.com/tecake.com/wp-content/uploads/2020/04/ST3-Production-Still-1-FEATURE-1024x650-1.jpg?fit=1024%2C650&ssl=1", "publishedAt": "2020-04-21T21:01:25Z", "content": "Geeks, it’s official.  Stranger Things 4 is coming. It’s occurring. It’s validated. As well as now, it’s been formally unveiled that Hopper, who allegedly died at the end of season 3, is ALIVE. It’s also been verified that Chief Receptacle is the American pri… [+2597 chars]"}, {"source": {"id": null, "name": "Koimoi.com"}, "author": null, "title": "Avengers: Endgame Director Joe Russo: “India Is Rarely Seen In Modern International…” - Koimoi", "description": "\"Avengers: Endgame\" co-director Joe Russo says India is a beautiful country but its locales are rarrely been tapped in modern international action films.", "url": "https://www.koimoi.com/hollywood-2/avengers-endgame-director-joe-russo-india-is-rarely-seen-in-modern-international/", "urlToImage": "https://static-koimoi.akamaized.net/wp-content/new-galleries/2020/04/joe-russo-india-rarely-seen-in-international-action-films-001.jpg", "publishedAt": "2020-04-21T16:51:49Z", "content": "Avengers: Endgame Director Joe Russo: “India Is Rarely Seen In Modern International…”\r\n“Avengers: Endgame” co-director Joe Russo says India is a beautiful country but its locales are rarely been tapped in modern international action films.\r\nRusso is glad that… [+1902 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "Sonu Nigam stuck in Dubai amid pandemic, netizens troll singer over old `Azaan` tweets - Zee News", "description": "Now, three years on, amid the COVID-19 pandemic, the singer is in Dubai and netizens have flooded the Twitter with the screenshots of his old tweets, calling it an irony.", "url": "https://zeenews.india.com/people/sonu-nigam-stuck-in-dubai-amid-pandemic-netizens-troll-singer-over-old-azaan-tweets-2278063.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2020/04/21/856159-sonu-nigam.jpg", "publishedAt": "2020-04-21T15:24:58Z", "content": "New Delhi: Bollywood singer Sonu Nigam decided to continue his stay in Dubai with wife and son amid the deadly novel coronavirus outbreak has become a hot topic on Twitter right now. Why? Well, the singer, who is no longer on Twitter became a top trend after … [+1596 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Deepika Padukone Announces Live Chat with WHO Chief, Fans Call Her 'Irresponsible' - News18", "description": "All the while there has been huge criticism of WHO and especially Director-General Dr Dr Tedros Adhanom Ghebereyesus as to how they have dealt with the situation.", "url": "https://www.news18.com/news/buzz/deepika-padukone-announces-live-chat-with-who-chief-fans-call-her-irresponsible-2587101.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/04/1587478368_ev-egshueai6423.jpg", "publishedAt": "2020-04-21T14:54:18Z", "content": "The coronavirus pandemic and the lockdown that has followed around the world has left governments and the medical fraternity scrambling as they look for ways to win the battle. \r\nAll the while there has been huge criticism of WHO and especially Director-Gener… [+2118 chars]"}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": "Priyanka Mody", "title": "Priyanka Chopra Jonas shares hair mask recipe which is a SECRET behind her voluminous, bouncy mane - PINKVILLA", "description": "Priyanka Chopra is resorting to home remedies during the quarantine and here’s what she has to say about her secret hair mask recipe. Check it out", "url": "https://www.pinkvilla.com/fashion/beauty/priyanka-chopra-jonas-shares-hair-mask-recipe-which-secret-behind-her-voluminous-bouncy-mane-526102", "urlToImage": "https://www.pinkvilla.com/files/styles/fbimagesection/public/62203090_145188993326773_8817513690941011053_n_1.jpg?itok=4rxOsfaZ", "publishedAt": "2020-04-21T13:44:12Z", "content": null}, {"source": {"id": null, "name": "Bollywoodlife.com"}, "author": "Nirali Kanabar", "title": "Rithvik Dhanjani shares cryptic posts amidst breakup reports with Asha Negi; says, 'Normal wasn't working' - Bollywood Life", "description": "For the unversed, Rithvik Dhanjani and Asha Negi fell in love with each on the sets of Pavitra Rishta. Following this, they won Nach Baliye 6 together.", "url": "https://www.bollywoodlife.com/tv/rithvik-dhanjani-shares-cryptic-posts-amidst-break-up-reports-with-asha-negi-says-normal-wasnt-working-1609187/", "urlToImage": "https://st1.bollywoodlife.com/wp-content/uploads/2019/08/asha-negi-and-rithvik.jpg", "publishedAt": "2020-04-21T13:09:04Z", "content": "Rithvik Dhanjani and Asha Negi, one of the most adored couples on Indian television, have apparently called it quits. After being in a relationship for six years, they seem to have made a decision to move on in their lives. The news of their breakup left thei… [+2197 chars]"}, {"source": {"id": null, "name": "Iwmbuzz.com"}, "author": "Editorial Team", "title": "Checkout: Aishwarya Rai and Abhishek Bachchan’s UNSEEN marriage pictures - IWMBuzz", "description": "Take a look at Aishwarya Rai and Abhishek Bachchan's unseen marriage pictures", "url": "https://www.iwmbuzz.com/movies/snippets-movies/checkout-aishwarya-rai-abhishek-bachchans-unseen-marriage-pictures/2020/04/21", "urlToImage": "https://www.iwmbuzz.com/wp-content/uploads/2020/04/checkout-aishwarya-rai-and-abhishek-bachchans-unseen-marriage-pictures.jpg", "publishedAt": "2020-04-21T11:04:16Z", "content": "Aishwarya Rai Bachchan and Abhishek Bachchan got married in a fairy tale ceremony in the presence of close friends and family members and their wedding is still considered as a dreamy one.\r\nThe wedding festivities were an epitome of glamour and grace as dotin… [+196 chars]"}, {"source": {"id": null, "name": "Indiaglitz.com"}, "author": "IndiaGlitz", "title": "WOW! Vijay's 'Master' to have a pan-India release - Malayalam News - IndiaGlitz.com", "description": "The movie 'Master' will have a pan-India release in 5 languages - Tamil, Telugu, Malayalam, Hindi, and Kannada.", "url": "https://www.indiaglitz.com/wow-vijays-master-to-have-a-pan-india-release-malayalam-news-258592", "urlToImage": "https://1847884116.rsc.cdn77.org/malayalam/news/social/master2142020mt-a0d.jpg", "publishedAt": "2020-04-21T10:23:51Z", "content": "Owing to the Coronavirus pandemic, the release dates of several films including Thalapathy Vijay's highly-anticipated action-thriller Master have been postponed. Master was slated to release at the silver screens on April 9, 2020, and the film was long-awaite… [+813 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Salman Khan’s Pyaar Karona music video gets rave reviews from Alia Bhatt, Shah Rukh Khan - Hindustan Times", "description": "Salman Khan has shared the music video of his new rap song, Pyaar Karona. The song has been sung and co-written by the actor amid coronavirus outbreak.", "url": "https://www.hindustantimes.com/bollywood/salman-khan-s-pyaar-karona-music-video-gets-rave-reviews-from-alia-bhatt-shah-rukh-khan/story-P6uYqWyr9FB5evwPk9jypM.html", "urlToImage": "https://www.hindustantimes.com/rf/image_size_960x540/HT/p2/2020/04/21/Pictures/_143ccbe8-8395-11ea-a351-6978c1d205f3.jpg", "publishedAt": "2020-04-21T07:02:40Z", "content": "Salman Khan has launched his new YouTube channel with the release of his new song, Pyaar Karona. The actor shared the audio of his new single on Monday and has now shared the music video on his channel. \r\nAlia Bhatt reacted to the video in her Instagram stori… [+1452 chars]"}]}