{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Pinkvilla.com"}, "author": "twinklekhanna", "title": "Thahar Ja Song: Ajay Devgn’s track with son Yug is a call for people to pause, reflect & pray amid Coronavirus - PINKVILLA", "description": "Ajay Devgn joined the likes of Akshay Kumar and Salman Khan & released a song Thahar Ja that he shot at home with son Yug. The song urges people to stop and reflect on life with family amid Coronavirus pandemic. Check it out.", "url": "https://www.pinkvilla.com/entertainment/news/ajay-devgn-s-song-thahar-ja-son-yug-call-people-pause-reflect-and-pray-amid-coronavirus-527402", "urlToImage": null, "publishedAt": "2020-04-25T09:49:27Z", "content": null}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Neena Gupta asks why women are expected to be perfect: ‘Women never have gas, acidity, they do not ... - Hindustan Times", "description": "Neena Gupta has asked why only men can fart in public and women are looked down upon for doing the same.", "url": "https://www.hindustantimes.com/bollywood/neena-gupta-asks-why-women-are-expected-to-be-perfect-women-never-have-gas-acidity-they-do-not-burp/story-t77aa0pgVR32zZg0Rp5iGJ.html", "urlToImage": null, "publishedAt": "2020-04-25T09:29:00Z", "content": "Neena Gupta has raised the issue of women living under the pressure of being the perfect beings at all times. Drawing attention to a particular topic, the actor has asked why only men have the right to fart in public while women are not expected to do the sam… [+1561 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Milind Soman says Ankita Konwar was cool with his sex scenes in Four More Shots Please!: ‘She was actually... - Hindustan Times", "description": "Days after they celebrated their second wedding anniversary, Milind Soman talks about wife Ankita Konwar’s reaction to his intimate scenes in web series, Four More Shots Please!.", "url": "https://www.hindustantimes.com/bollywood/milind-soman-says-ankita-konwar-was-cool-with-his-sex-scenes-in-four-more-shots-please-she-was-actually-very-excited/story-XmiImsEdVfK5pmksvrTdyN.html", "urlToImage": null, "publishedAt": "2020-04-25T09:27:00Z", "content": "Actor Milind Soman has revealed wife Ankita Konwar was “very excited” about his sex scenes from the web series Four More Shots Please! which also featured him walking in underwear.\r\nMilind told Pinkvilla in an interview, “She was very cool with it (intimate s… [+1598 chars]"}, {"source": {"id": null, "name": "Asianetnews.com"}, "author": null, "title": "Candid pics of Abhishek Bachchan, Aishwarya Rai Bachchan show pure love - Asianet News English", "description": "Given the fact Aishwarya Rai Bachchan and Abhishek Bachchan share an amazing relationship and continue to give people major relationship goals, here are a few throwback candid photos of the couple.", "url": "https://newsable.asianetnews.com/gallery/entertainment/candid-pics-of-abhishek-bachchan-aishwarya-rai-bachchan-show-pure-love-q9c6wy", "urlToImage": null, "publishedAt": "2020-04-25T09:14:37Z", "content": "During the promotions of his film Happy New Year, Abhishek Bachchan opened up about his strong bond with Aishwarya Rai saying, \"Shes very down-to-earth, rooted, simple and real. Shes very beautiful, which everyone knows. But as a person, she is far more beaut… [+179 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Kaushal Ladhad", "title": "Kim Kardashian can pull off anything & these pics in Indian outfits is proof - Republic World - Republic World", "description": "Kim Kardashian is a supermodel who can pull off any kind of outfit and & these pics in Indian outfits is proof. Take a look at Kim in Indian outfits here.", "url": "https://www.republicworld.com/entertainment-news/hollywood-news/kim-kardashian-can-pull-off-anything-here-is-the-proof.html", "urlToImage": null, "publishedAt": "2020-04-25T09:06:43Z", "content": "Coronavirus has brought several places all around the world to a halt. People are urged to stay home to curb the spread of the virus and practice social distancing too. Celebrities are spending time in quarantine with their family and close ones. Kim Kardashi… [+2384 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Kashmira Patil", "title": "Kanika Kapoor missing from her apartment in Lucknow? Read deets - Republic World - Republic World", "description": "After being treated for COVID-19, Bollywood singer Kanika Kapoor has reportedly gone missing from her residence in Lucknow. Read to know more.", "url": "https://www.republicworld.com/entertainment-news/television-news/kanika-kapoor-has-gone-missing-from-her-apartment-in-lucknow.html", "urlToImage": null, "publishedAt": "2020-04-25T09:05:58Z", "content": "Bollywood singer Kanika Kapoor was tested positive for Coronavirus after she returned from London on March 9. The singer had also attended a few high profile parties after returning. Recently, it was reported that the singer has been discharged from Sanjay Ga… [+2204 chars]"}, {"source": {"id": null, "name": "Manoramaonline.com"}, "author": "Onmanorama Staff", "title": "Malayalam actor Ravi Vallathol dies at 67 - Onmanorama", "description": "The actor was under treatment for Alzheimer's disease in a private hospital in Thiruvananthapuram.", "url": "https://english.manoramaonline.com/news/kerala/2020/04/25/malayalam-film-serial-actor-ravi-vallathol-dies-thiruvananthapuram.html", "urlToImage": null, "publishedAt": "2020-04-25T08:59:32Z", "content": "Thiruvanathapuram: Malayalam film and serial actor Ravi Vallathol passed away in Thiruvananthapuram on Saturday.\r\nThe actor was under treatment for Alzheimer's disease in a private hospital in Thiruvananthapuram. He was 67.\r\nIn a career spanning over three de… [+1722 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Alia Bhatt is surprised to see dad Mahesh Bhatt and mum Soni Razdan cooking together amid lockdown.... - Hindustan Times", "description": "Soni Razdan gave some cooking lessons to her husband and filmmaker Mahesh Bhatt that left their fans and daughter Alia Bhatt surprised.", "url": "https://www.hindustantimes.com/bollywood/alia-bhatt-is-surprised-to-see-dad-mahesh-bhatt-and-mum-soni-razdan-cooking-together-amid-lockdown-watch/story-JbeLYaUeWPsdY13NrcPx0J.html", "urlToImage": null, "publishedAt": "2020-04-25T08:37:57Z", "content": "Actor Alia Bhatt got a lovely treat on Saturday when her mother and veteran actor Soni Razdan shared a cute video on Instagram. The video showed her and filmmaker husband Mahesh Bhatt cooking together in their kitchen.\r\nIn the video, Mahesh is seen in a white… [+1603 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Happy birthday Arijit Singh: Fame Gurukul to rejected song in Saawariya, how he climbed the Bollywood... - Hindustan Times", "description": "As Arijit Singh turns 33, here is looking back at his incredible journey, from participating in a reality show to becoming one of the most successful singers in Bollywood.", "url": "https://www.hindustantimes.com/music/happy-birthday-arijit-singh-fame-gurukul-to-rejected-song-in-saawariya-how-he-climbed-the-bollywood-ladder-to-success/story-DqNegmbrHboXSN4z5yPp4N.html", "urlToImage": null, "publishedAt": "2020-04-25T08:37:52Z", "content": "With his smooth-as-butter voice and romantic ballads, Arijit Singh has been ruling Bollywood for a while now. Last year, the singer saw a high-point in his career, when he won the National Award for Best Male Playback Singer for the Padmaavat song Binte Dil.\r… [+1758 chars]"}, {"source": {"id": null, "name": "Spotboye.com"}, "author": "Neeki Singh", "title": "Shaheer Sheikh On Mahabharat: 'Couldn't Speak To Anyone For 10-15 Days After Shooting The Draupadi Cheer-Haran Scene, Made Me Terribly Sad'- EXCLUSIVE - SpotboyE", "description": "STAR Plus' Mahabharat, starring Shaheer Sheikh as Arjun, is being rerun currently. We spoke to the actor about the show and also about the memories attached with the character which brought him to the limelight", "url": "https://www.spotboye.com/television/tv-interviews/shaheer-sheikh-on-mahabharat-couldn-t-speak-to-anyone-for-10-15-days-after-shooting-the-draupadi-cheer-haran-scene-made-me-terribly-sad-exclusive/5ea3f51374f5ce660a22570f", "urlToImage": null, "publishedAt": "2020-04-25T08:35:29Z", "content": "Don't MissKundali Bhagya: Mahira Sharma, Shraddha Arya And Anjum Fakih Flaunt Their Killer Moves In This Throwback Video"}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": "Pinkvilla Desk", "title": "Priyanka Chopra has a novel way of feeding husband Nick Jonas some cake; Watch Video - PINKVILLA", "description": "While Priyanka Chopra attended quite a few Jonas Brothers concerts, there was one where the actress fed some cake to Nick and it was simply adorable.", "url": "https://www.pinkvilla.com/entertainment/hollywood/priyanka-chopra-has-novel-way-feeding-husband-nick-jonas-some-cake-watch-video-527237", "urlToImage": null, "publishedAt": "2020-04-25T08:26:33Z", "content": null}, {"source": {"id": null, "name": "Bollywoodlife.com"}, "author": "BollywoodLife", "title": "After Jennifer Winget's Beyhadh 2, two more shows to go off-air due to COVID-19? - Bollywood Life", "description": "After Jennifer Winget and Shivin Narang starrer Beyhadh 2 was pulled-off abruptly, two more shows will be going off-air due the coronavirus outbreak. Check out the whole story to find out more.", "url": "https://www.bollywoodlife.com/tv/after-jennifer-wingets-beyhadh-2-two-more-shows-to-go-off-air-due-to-covid-19-1611753/", "urlToImage": null, "publishedAt": "2020-04-25T08:24:09Z", "content": "Jennifer Winget, Shivin Narang and Ashish Chowdhry starrer Beyhadh 2 has been one of the most loved shows on television. Fans have been loving Jennifer Winget as Maya and are impressed with her spectacular performance. Shivin Narang who plays Rudra in the sho… [+2332 chars]"}, {"source": {"id": null, "name": "Bollywoodhungama.com"}, "author": "Bollywood Hungama", "title": "Malaika Arora shares a sun-kissed selfie, pens a note of gratitude amid lock-down - Bollywood Hungama", "description": "Malaika Arora shares a sun-kissed selfie, pens a note of gratitude amid lock-down. Latest Bollywood News, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News at Bollywood Hungama.com", "url": "https://www.bollywoodhungama.com/news/features/malaika-arora-shares-a-sun-kissed-selfie-pens-a-note-of-gratitude-amid-lock-down/", "urlToImage": null, "publishedAt": "2020-04-25T08:04:03Z", "content": "Malaika Arora, who is spending the lock-down with beau Arjun Kapoor, is indulging in cooking, working out from home or is plain chilling. On Instagram, she shared a sun-kissed selfie of herself, expressing gratitude about the fact that she is safe amid this c… [+474 chars]"}, {"source": {"id": null, "name": "Bollywoodhungama.com"}, "author": "Bollywood Hungama", "title": "Owing to the coronavirus pandemic, 67th National Film Awards delayed indefinitely - Bollywood Hungama", "description": "Owing to the coronavirus pandemic, 67th National Film Awards delayed indefinitely. Latest Bollywood News, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News at Bollywood Hungama.com", "url": "https://www.bollywoodhungama.com/news/bollywood/owing-coronavirus-pandemic-67th-national-film-awards-delayed-indefinitely/", "urlToImage": null, "publishedAt": "2020-04-25T08:03:36Z", "content": "Reportedly, the officials have not been discussing the 67th National Film Awards as they are currently focusing on tackling the coronavirus situation. Talking to a daily, filmmaker Rahul Rawail who was a part of the National Film Awards jury last year said th… [+633 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Prachi Arya", "title": "Akshay Kumar, Kiara Advanis Laxmmi Bomb to release on Disney+ Hotsar? - Republic World - Republic World", "description": "Amid rumors of theaters being shut for a long time, several reports of Akshay Kumar and Kiara Advani starrer Laxmmi Bomb releasing digitally are doing rounds.", "url": "https://www.republicworld.com/entertainment-news/bollywood-news/is-akshay-kumar-kiara-advani-starrer-laxmmi-bomb-to-release-digitally.html", "urlToImage": null, "publishedAt": "2020-04-25T08:02:20Z", "content": "Amid COVID-19 crisis, Bollywood fraternity seems to be severely affected by the infection as several films have been postponed owing to the theatre shut down. However, with the shutting down of cinemas, digital OTT platforms have become more popular now. Amid… [+2507 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Kanye West officially now a billionaire: Forbes - India Today", "description": "Forbes said that Kanye West has been pressing the magazine for years to be listed as one of its mega-rich but that it declined.", "url": "https://www.indiatoday.in/lifestyle/celebrity/story/kanye-west-officially-now-a-billionaire-forbes-1670924-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T07:54:05Z", "content": "Rapper Kanye West is now a billionaire, thanks largely to the basketball shoes bearing his name that he developed with Adidas, Forbes magazine said on Friday.\r\nThe rough figure of the wealth of Kim Kardashian's hubby is USD 1.3 billion, the magazine said in a… [+1074 chars]"}, {"source": {"id": null, "name": "Ibtimes.co.in"}, "author": "Pramod Gaikwad", "title": "Deepika Padukone should stop interfering in my life and concentrate on her work: Kangana Ranaut [Throwback] - International Business Times, India Edition", "description": "Deepika Padukone and Kangana Ranaut have been at loggerheads ever since Deepika won the Best Actress award for her performance in Happy New Year over Kangana's role in Queen at an award function in 2014.", "url": "https://www.ibtimes.co.in/deepika-padukone-should-stop-interfering-my-life-concentrate-her-work-kangana-ranaut-throwback-818381", "urlToImage": null, "publishedAt": "2020-04-25T07:52:34Z", "content": "Kangana Ranaut had never shied away from expressing her dislike for Deepika Padukone on a public platform. The two have been at loggerheads ever since Deepika won the Best Actress award for her performance in Happy New Year over Kangana's role in Queen at an … [+2312 chars]"}, {"source": {"id": null, "name": "Ibtimes.co.in"}, "author": "Parismita Goswami", "title": "When Dimple Kapadia warned Twinkle Khanna about 'gay' Akshay Kumar [Throwback] - International Business Times, India Edition", "description": "Twinkle Khanna said that her mother Dimple Kapadia told her of Akshay Kumar's sexual orientation when the actor had visited her house to ask for her hand in marriage.", "url": "https://www.ibtimes.co.in/when-dimple-kapadia-warned-twinkle-khanna-about-gay-akshay-kumar-throwback-818376", "urlToImage": null, "publishedAt": "2020-04-25T07:52:32Z", "content": "Akshay kumar's advice on quarantine \r\nAkshay Kumar and Twinkle Khanna are one of the most adorable couples of Bollywood. It is known that Twinkle is a witty person and her unapologetic and unabashed comments often leaves Khiladi actor embarrassed and it was w… [+1704 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Sussanne Khan shares glimpse of her life in lockdown with Hrithik Roshan and their sons. Watch video - India Today", "description": "Sussanne Khan shared a video of Hrithik Roshan and their sons Hridhaan and Hrehaan, spending quality time in lockdown.", "url": "https://www.indiatoday.in/movies/celebrities/story/sussanne-khan-shares-glimpse-of-her-life-in-lockdown-with-hrithik-roshan-and-their-sons-see-pic-1670917-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T07:52:30Z", "content": "Sussanne Khan moved in with ex-husband Hrithik Roshan to co-parent their sons Hridhaan and Hrehaan during this lockdown period. Both Hrithik and Sussanne are making the most of self-quarantine with their kids.\r\nRecently, Sussanne shared a glimpse of her life … [+3026 chars]"}, {"source": {"id": null, "name": "Givemesport.com"}, "author": "Oliver Browning", "title": "WWE news: Vince McMahon and Shawn Michaels appear on Smackdown to 'celebrate' Triple H - GIVEMESPORT", "description": "WWE news: Vince McMahon and Shawn Michaels appear on Smackdown to 'celebrate' Triple H", "url": "https://www.givemesport.com/1564745-wwe-news-vince-mcmahon-and-shawn-michaels-appear-on-smackdown-to-celebrate-triple-h", "urlToImage": null, "publishedAt": "2020-04-25T07:16:58Z", "content": "WWE 'celebrated' 25 years of Triple H on Smackdown this week. \r\nThe Game has been one of pro wrestling's biggest draws for a quarter of a century now and arguably, no one deserves to be honoured more than him. \r\nBut rather than a celebration, Triple H got a r… [+1664 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "India TV Entertainment Desk", "title": "Ramayan's Sita aka Dipika Chikhlia's wedding reception photo goes viral, Rajesh Khanna also attended - India TV News", "description": "Along with many unseen photos from the Ramayan sets, actress Dipika Chikhlia's wedding reception photo has gone viral on the internet. interestingly, the reception was attended by Bollywood superstar Rajesh Khanna as well.", "url": "https://www.indiatvnews.com/entertainment/tv/ramayan-sita-dipika-chikhlia-wedding-reception-photo-viral-rajesh-khanna-attended-611113", "urlToImage": null, "publishedAt": "2020-04-25T07:16:23Z", "content": "Image Source : TWITTERRamayan's Sita aka Dipika Chikhlia's wedding reception photo goes viral, Rajesh Khanna also attended\r\nTV actress and politician Dipika Chikhlia, who played the role of Sita in Ramanand Sagar's Ramayan, has been ruling the headlines for h… [+3535 chars]"}, {"source": {"id": null, "name": "Koimoi.com"}, "author": null, "title": "’83: Streaming Giant Offers Rs 143 Crore To The Makers Of This Ranveer Singh Starrer To Release Digitally? - Koimoi", "description": "If now the reports are to be believed, a streaming giant with worldwide reach has offered the makers of Ranveer Singh's '83...", "url": "https://www.koimoi.com/bollywood-news/83-streaming-giant-offers-rs-143-crore-to-the-makers-of-this-ranveer-singh-starrer-to-release-digitally/", "urlToImage": null, "publishedAt": "2020-04-25T07:05:06Z", "content": "The Novel Coronavirus outbreak has brought everything to stand still. With cinema halls being closed and everyone practising social distancing, many films have faced the wrath as their release stand postponed. If now the reports are to be believed, a streamin… [+2224 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "admin", "title": "Ramazan 2020: Dipika Kakar wishes Chand mubarak, shares glimpse of her first sehri. See pics, video - Jimmys Post", "description": "", "url": "https://www.hindustantimes.com/tv/ramazan-2020-dipika-kakar-wishes-chand-mubarak-shares-glimpse-of-her-first-sehri-see-pics-video/story-B3wGDrTzmhG6O5tTXPjYVP.html/", "urlToImage": null, "publishedAt": "2020-04-25T07:02:18Z", "content": "Dipika Kakar and husband Shoaib Ibrahim are all geared up to celebrate the month of Ramzan and took to social media to wish their fans on the occasion. Dipika also shared a picture as she sat to savour her first sehri before dawn on Saturday. \r\nSharing a happ… [+1577 chars]"}, {"source": {"id": null, "name": "Indiaglitz.com"}, "author": "IndiaGlitz", "title": "9th wedding anniversary: Prithviraj's wife pens an emotional note - Malayalam News - IndiaGlitz.com", "description": "As actor Prithviraj Sukumaran remains stranded in Jordan, the actor and his wife Supriya couldn't celebrate their wedding anniversary together this year.", "url": "https://www.indiaglitz.com/9th-wedding-anniversary-prithvirajs-wife-pens-an-emotional-note-malayalam-news-258915", "urlToImage": null, "publishedAt": "2020-04-25T06:46:12Z", "content": "As actor Prithviraj Sukumaran remains stranded in Jordan, the actor and his wife Supriya couldn't celebrate their wedding anniversary together this year. The lovely couple got married nine years ago on this very same day in a private ceremony in Palakkad on A… [+896 chars]"}, {"source": {"id": null, "name": "Ibtimes.co.in"}, "author": "Shefali Jha", "title": "Karan Johar called Priyanka Chopra spineless: 'Burst out like a pressure cooker at her' - International Business Times, India Edition", "description": "What went wrong between Karan Johar and Priyanka Chopra and how the duo patched up.", "url": "https://www.ibtimes.co.in/karan-johar-called-priyanka-chopra-spineless-burst-out-like-pressure-cooker-her-818340", "urlToImage": null, "publishedAt": "2020-04-25T06:42:16Z", "content": "The incident happened when apart from her movies, Priyanka Chopra was making news for her closeness to Shah Rukh Khan. Rumours of something brewing between the two was making headlines for more reasons than one. It was said that Karan Johar, who happens to be… [+1968 chars]"}, {"source": {"id": null, "name": "Telugucinema.com"}, "author": "tc editor", "title": "Sleeping 9 hours daily during the lockdown: Vijay Deverakonda - Telugu Cinema", "description": "Handsome hunk Vijay Deverakonda revealed that he’s sleeping nine and half hours daily on an average during this lockdown period as opposed to a six-hour sleep routine. He made a video of his daily routine during this period. Taking a cue from director Siva Ko…", "url": "https://www.telugucinema.com/news/sleeping-9-hours-daily-during-lockdown-vijay-deverakonda", "urlToImage": null, "publishedAt": "2020-04-25T06:31:16Z", "content": "Handsome hunk Vijay Deverakonda revealed that hes sleeping nine and half hours daily on an average during this lockdown period as opposed to a six-hour sleep routine. He made a video of his daily routine during this period.\r\nTaking a cue from director Siva Ko… [+621 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Chris Hemsworth Spoke One Bangla Phrase in Netflix's 'Extraction' and Every Bengali 'Flipped Out' - News18", "description": "The dialogue, which seemed like a jolt out of the blue, is enough to get Bengalis around the world talking.", "url": "https://www.news18.com/news/buzz/chris-hemsworth-spoke-one-bangla-phrase-in-netflixs-extraction-and-every-bengali-flipped-out-2591949.html", "urlToImage": null, "publishedAt": "2020-04-25T06:09:12Z", "content": "Spoilers Ahead. You have been warned. \r\nSam Hargrave's latest Netflix movie, Extraction, starring Chris Hemsworth, Randeep Hooda, Pankaj Tripathi in the lead roles is perhaps the action-packed film you're looking forward to this weekend. For those of you who … [+1589 chars]"}, {"source": {"id": null, "name": "Thenewsminute.com"}, "author": null, "title": "Nithiin-Rashmika starrer ‘Bheeshma’ now streaming online - The News Minute", "description": "Nithiin and Rashmika fans rejoice! The duo’s last film, Bheeshma has been released online and is now streaming on Netflix and Sun NXT. Bheeshma is a romantic action comedy that was met with positive reviews upon its release. The film revolves around the prota…", "url": "https://www.thenewsminute.com/article/nithiin-rashmika-starrer-bheeshma-now-streaming-online-123314", "urlToImage": null, "publishedAt": "2020-04-25T05:46:31Z", "content": "The film released in February and was met with positive reviews.Nithiin and Rashmika fans rejoice! The duos last film, Bheeshma has been released online and is now streaming on Netflix and Sun NXT.\r\nBheeshma is a romantic action comedy that was met with posit… [+1670 chars]"}, {"source": {"id": null, "name": "Indiaglitz.com"}, "author": "IndiaGlitz", "title": "No more Suriya movies in theatres - Theatre owners impose ban! - Tamil News - IndiaGlitz.com", "description": "Few days back, it was announced that the Jyothika starrer Ponmagal Vandhaal directed by debutant JJ", "url": "https://www.indiaglitz.com/no-more-suriya-movies-in-theatres-theatre-owners-impose-ban-tamil-news-258908", "urlToImage": null, "publishedAt": "2020-04-25T05:37:38Z", "content": "Few days back, it was announced that the Jyothika starrer Ponmagal Vandhaal directed by debutant JJ Frederick and produced by Suriya's 2D Entertainment will be released directly on Amazon prime and will not be released in theatres.\r\nWith the movie expected to… [+906 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Major relief for India's small shop owners | India Lockdown | Home Ministry - WION", "description": "Major relief for India's small shop owners | India Lockdown | Home Ministry The ministry's order comes just days after it gave the go-ahead for shops selling...", "url": "https://www.youtube.com/watch?v=KifG_GgEjcs", "urlToImage": null, "publishedAt": "2020-04-25T05:23:21Z", "content": null}, {"source": {"id": null, "name": "Bollywoodhungama.com"}, "author": "Bollywood Hungama", "title": "On his birthday, Varun Dhawan donates towards daily wage labourers of the film industry - Bollywood Hungama", "description": "On his birthday, Varun Dhawan donates towards daily wage labourers of the film industry. Latest Bollywood News, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News at Bollywood Hungama.com", "url": "https://www.bollywoodhungama.com/news/bollywood/birthday-varun-dhawan-donates-towards-daily-wage-labourers-film-industry/", "urlToImage": null, "publishedAt": "2020-04-25T05:02:27Z", "content": "Ashoke Pandit who is the president of Indian Film and TV directors Association took to Twitter to thank Varun Dhawan for his contribution. Sharing the video he wrote, \"@fwice_mum  thanks @Varun_dvn for donating towards the daily wage workers of the entertainm… [+993 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Rajeev Khandelwal claims casting couch isn’t rape, Chris Evans steps out of Captain America image in... - Hindustan Times", "description": "From Rajeev Khandelwal talking about casting couch and the MeToo movement to the release of Chris Evans’ Defending Jacob, here are top news from world of entertainment.", "url": "https://www.hindustantimes.com/bollywood/rajeev-khandelwal-claims-casting-couch-isn-t-rape-chris-evans-steps-out-of-captain-america-image-in-defending-jacob/story-fmuP4LDtpAxdHpff8p9mDO.html", "urlToImage": null, "publishedAt": "2020-04-25T04:51:40Z", "content": "Rajeev Khandelwal says casting couch is not rape: ‘The one who gives in is equally responsible’\r\nActor Rajeev Khandelwal has shared his views on the prevalence of casting couch in the glamour industry and believes those who fall prey to the practice always ha… [+2695 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Spider-Man: Into the Spider-Verse Sequel Delayed Five Months In 2022 - Screen Rant", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiQ2h0dHBzOi8vc2NyZWVucmFudC5jb20vc3BpZGVybWFuLXNwaWRlci12ZXJzZS0yLXJlbGVhc2UtZGF0ZS1kZWxheS_SAUdodHRwczovL3NjcmVlbnJhbnQuY29tL3NwaWRlcm1hbi1zcGlkZXItdmVyc2UtMi1yZWxlYXNlLWRhdGUtZGVsYXkvYW1wLw?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T03:58:19Z", "content": null}, {"source": {"id": null, "name": "Bollywoodlife.com"}, "author": "Nirali Kanabar", "title": "It's expensive: When Katrina Kaif splurged Rs. 92,000 to look gorgeous at rumoured ex-boyfriend, Salman Khan' - Bollywood Life", "description": "Today, we are taking you back to Salman Khan's grand birthday bash where Katrina Kaif grabbed eyeballs for all the right reasons.", "url": "https://www.bollywoodlife.com/style/its-expensive-when-katrina-kaif-splurged-rs-92000-to-look-gorgeous-at-rumoured-ex-boyfriend-salman-khans-birthday-bash-1611259/", "urlToImage": null, "publishedAt": "2020-04-25T03:47:56Z", "content": "There's a dearth of Bollywood events due to the coronavirus lockdown. We haven't seen pictures of our celebrities flaunting their fashion ka jalwa for the longest time now. Hence, we are revisiting the times they made head turns in public because of their sar… [+2226 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Hindustan Times", "title": "News updates from Hindustan Times: Delhi airport to reopen with new rules including mandatory masks... - Hindustan Times", "description": "Here are today’s top news, analysis and opinion at this hour. Know all about the latest news and other news updates from Hindustan Times.", "url": "https://www.hindustantimes.com/india-news/news-updates-from-hindustan-times-delhi-airport-to-reopen-with-new-rules-including-mandatory-masks-and-all-the-latest-news/story-O6eASX1KRVkja0iMYS1PiL.html", "urlToImage": null, "publishedAt": "2020-04-25T03:46:49Z", "content": "Here are today’s top news, analysis and opinion at this hour. Know all about the latest news and other news updates from Hindustan Times.\r\nMasks, social distancing, temperature screening: Delhi airport may reopen with new rules\r\nMandatory face masks for all t… [+2939 chars]"}, {"source": {"id": null, "name": "Iwmbuzz.com"}, "author": "Editorial Team", "title": "Kundali Bhagya: When Preeta confessed her feelings for Karan - IWMBuzz", "description": "Watch the moment when Preeta confessed her feelings for Karan in Kundali Bhagya.", "url": "https://www.iwmbuzz.com/television/snippets/kundali-bhagya-preeta-confessed-feelings-karan/2020/04/25", "urlToImage": null, "publishedAt": "2020-04-25T03:15:19Z", "content": "Kundali Bhagya couple Preeta and Karan played by Shraddha Arya and Dheeraj Dhoopar are undoubtedly the most popular jodi. It was the first time they met and had some fights and issues but later fell in love and their story started. The left no stones unturned… [+373 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Asian News International", "title": "Karan Johar’s daughter Roohi calls him an elephant after declaring him a ‘buddha’, Bollywood can’t laugh... - Hindustan Times", "description": "Karan Johar’s daughter Roohi called him an elephant in the latest video in their Lockdown With The Johars series.", "url": "https://www.hindustantimes.com/bollywood/karan-johar-s-daughter-roohi-calls-him-an-elephant-after-declaring-him-a-buddha-bollywood-can-t-laugh-more-watch/story-qYwA9lagXN2qFg78l5PPtL.html", "urlToImage": null, "publishedAt": "2020-04-25T03:04:42Z", "content": "Filmmaker Karan Johar on Friday shared an adorable video in which he plays a fun game with Yash And Roohi by asking them if they would have been born as an animal, which animal they would like to be. Apparently, at the end of the game, they ended up calling t… [+1696 chars]"}, {"source": {"id": null, "name": "Sportskeeda.com"}, "author": "Raunak Jaiswal", "title": "Roman Reigns takes a dig at tag team recently released by WWE - Sportskeeda", "description": "The former WWE tag team has been a thorn in Roman Reigns' side in the past.", "url": "https://www.sportskeeda.com/wwe/roman-reigns-takes-a-dig-at-tag-team-recently-released-by-wwe", "urlToImage": null, "publishedAt": "2020-04-25T02:49:10Z", "content": "Roman Reigns wasn't holding back in this exchange\r\nIn a shocking turn of events, WWE released over 20 Superstars in addition to furloughing backstage staff last week. To everyone's surprise, The Good Brothers Luke Gallows &amp; Karl Anderson were also among t… [+1792 chars]"}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": "Pinkvilla Desk", "title": "Varun Dhawan has Natasha by his side as he virtually celebrates birthday with Sara Ali Khan, Arjun & others - PINKVILLA", "description": "Varun Dhawan celebrated his 33rd birthday virtually with Coolie No 1 co-star Sara Ali Khan, Arjun Kapoor, Karan Johar and others.", "url": "https://www.pinkvilla.com/entertainment/news/varun-dhawan-has-natasha-his-side-he-virtually-celebrates-birthday-sara-ali-khan-arjun-others-527329", "urlToImage": null, "publishedAt": "2020-04-25T02:47:09Z", "content": null}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": "Pinkvilla Desk", "title": "Kareena Kapoor Khan glam up her quarantine look in a mustard Kaftan as she twirls in her living room; WATCH - PINKVILLA", "description": "Kareena Kapoor Khan proves she is the queen of slow mo as she nails her quarantine look in a mustard Kaftan; WATCH", "url": "https://www.pinkvilla.com/entertainment/news/kareena-kapoor-khan-glam-her-quarantine-look-mustard-kaftan-she-twirls-her-living-room-watch-527328", "urlToImage": null, "publishedAt": "2020-04-25T02:24:43Z", "content": null}, {"source": {"id": null, "name": "Iwmbuzz.com"}, "author": "Editorial Team", "title": "Aishwarya Rai Bachchan, Deepika Padukone, Anushka Sharma, Priyanka Chopra Jonas, Kareena Kapoor Khan: 8 Best Sabyasachi Casual Collection - IWMBuzz", "description": "IWMBuzz shows you gorgeous photos of these Bollywood beauties in Sabyasachi collection. Check out the photos below.", "url": "https://www.iwmbuzz.com/movies/celebrities-movies/aishwarya-rai-bachchan-deepika-padukone-anushka-sharma-priyanka-chopra-jonas-kareena-kapoor-khan-8-best-sabyasachi-casual-collection/2020/04/25", "urlToImage": null, "publishedAt": "2020-04-25T02:05:58Z", "content": null}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Sara Ali Khan Brings Back Her Knock-knock Series with Brother Ibrahim, Watch Hilarious Video - News18", "description": "Sara Ali Khan reprised her iconic knock-knock series with her brother Ibrahim where she made bad jokes with hilarious results amid the Coronavirus lockdown.", "url": "https://www.news18.com/news/movies/sara-ali-khan-brings-back-her-knock-knock-series-with-brother-ibrahim-watch-hilarious-video-2591593.html", "urlToImage": null, "publishedAt": "2020-04-25T01:41:31Z", "content": "Actress Sara Ali Khan is known for her wit and sense of humour on social media. Be it her \"shayaris\", throwback videos or even her knock-knock jokes, Sara keeps her fans entertained. Recently, the actress reprised her iconic knock-knock series with her brothe… [+679 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Rachana Dubey", "title": "#CoronaCrisis: Cinemas gear up to tackle a post-lockdown world, with some restrictions - Times of India", "description": "Temperature checks, mandatory masks and cross-seating are some of the measures being thought over", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/coronacrisis-cinemas-gear-up-to-tackle-a-post-lockdown-world-with-some-restrictions/articleshow/75362123.cms", "urlToImage": null, "publishedAt": "2020-04-24T21:14:00Z", "content": null}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Scott Mendelson", "title": "Tom Cruise’s ‘Mission: Impossible’ Has Shown Resilience Despite Release Date Delays And Long Waits - Forbes", "description": "History shows moviegoers will show up for Tom Cruise’s next Mission: Impossible sequels (now delayed to November of 2021 and 2022) for as long as it takes.", "url": "https://www.forbes.com/sites/scottmendelson/2020/04/24/mission-impossible-tom-cruise-rebecca-ferguson-box-office-delayed-coronavirus-james-bond-shazam/", "urlToImage": null, "publishedAt": "2020-04-24T20:12:19Z", "content": "Simon Pegg, Rebecca Ferguson, Tom Cruise and Ving Rhames in 'Mission Impossible Fallout'\r\nParamount\r\nHistory shows that moviegoers will show up for Tom Cruises next two Mission: Impossible sequels (which just got delayed to November of 2021 and 2022) for as l… [+5997 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Vicky Kaushal shares a video as an 11-year-old girl from his's society returns home after fighting COVID- - Times of India", "description": "Vicky Kaushal has been sharing updates about his day-to-day activities during the lockdown on his social media acco", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/vicky-kaushal-shares-a-video-as-an-11-year-old-girl-from-hiss-society-returns-home-after-fighting-covid-19-captions-ray-of-sunshine/articleshow/75360788.cms", "urlToImage": null, "publishedAt": "2020-04-24T17:33:00Z", "content": null}, {"source": {"id": null, "name": "Bollywoodhungama.com"}, "author": "Bollywood Hungama", "title": "Taarak Mehta Ka Ooltah Chashmah’s Palak Sidhwani aka Sonu responds to fan who asked her if she is dating Kush aka Goli - Bollywood Hungama", "description": "Taarak Mehta Ka Ooltah Chashmah’s Palak Sidhwani aka Sonu responds to fan who asked her if she is dating Kush aka Goli. Latest Bollywood News, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News at Bollywood Hungama.com", "url": "https://www.bollywoodhungama.com/news/features/taarak-mehta-ka-ooltah-chashmahs-palak-sidhwani-aka-sonu-responds-fan-asked-dating-kush-aka-goli/", "urlToImage": null, "publishedAt": "2020-04-24T17:10:08Z", "content": "Actress Palak Sidhwani, who plays the character of Sonu in the show, recently had an interaction with her fans through a fun live session. During this interaction, a fan asked the actress whether she is dating Kush Shah, who essays the character of Goli in Ta… [+198 chars]"}, {"source": {"id": null, "name": "Koimoi.com"}, "author": null, "title": "‘Wolverine’ Hugh Jackman Spells Out The Conditions For A Truce With ‘Deadpool’ Ryan Reynolds - Koimoi", "description": "'Wolverine' Hugh Jackman and 'Deadpool' Ryan Reynolds have maintained their stance of frenemies even outside films. We've seen some hilarious banter...", "url": "https://www.koimoi.com/hollywood-2/wolverine-hugh-jackman-conditions-deadpool-ryan-reynolds/", "urlToImage": null, "publishedAt": "2020-04-24T16:23:17Z", "content": "‘Wolverine’ Hugh Jackman Spells Out The Conditions For A Truce With ‘Deadpool’ Ryan Reynolds\r\n‘Wolverine‘ Hugh Jackman and ‘Deadpool‘ Ryan Reynolds have maintained their stance of frenemies even outside films. We’ve seen some hilarious banter between both onl… [+1104 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "When Shah Rukh Khan warned Aamir Khan to not work with Kajol: ‘She is very bad, unfocused’ - Hindustan Times", "description": "Before they came to be known as one of Bollywood’s best romantic pairs, actors Shah Rukh Khan and Kajol got off on the wrong foot.", "url": "https://www.hindustantimes.com/bollywood/when-shah-rukh-khan-warned-aamir-khan-to-not-work-with-kajol-she-is-very-bad-unfocused/story-ohHuC9ZVW9pUEacCoSFHQK.html", "urlToImage": null, "publishedAt": "2020-04-24T16:23:00Z", "content": "They’re known as one of Bollywood’s finest romantic pairs, but did you know that Shah Rukh Khan and Kajol got off on the wrong foot when they first met? In fact, Shah Rukh confessed that he’d even warned Aamir Khan about her, calling her unfocused and ‘very b… [+1544 chars]"}, {"source": {"id": null, "name": "Tellychakkar.com"}, "author": "Tellychakkar Team", "title": "Asim Riaz and Himanshi Khurana experience their first fight as a couple - Tellychakkar", "description": "MUMBAI: Asim Riaz and Himanshi Khurana seem to have had a lovers’ tiff.", "url": "https://www.tellychakkar.com/tv/tv-news/asim-riaz-and-himanshi-khurana-experience-their-first-fight-couple-200424", "urlToImage": null, "publishedAt": "2020-04-24T14:58:00Z", "content": "MUMBAI: Asim Riaz and Himanshi Khurana seem to have had a lovers tiff. Asim and Himanshi came out of Bigg Boss 13 as a couple and made their relationship official after the show concluded. Thanks to their social media PDA, Asim and Himanshi are pure couple go… [+721 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Karisma Kapoor Shares Throwback Still From Song Featuring Govinda, Check It Out - News18", "description": "The shot is from the song Mohabbat Ki Nahin Jaati from 1997 comedy Hero No.1, directed by David Dhawan. Karisma is dancing with her co-star Govinda in the song.", "url": "https://www.news18.com/news/movies/karisma-kapoor-shares-throwback-still-from-song-featuring-govinda-check-it-out-2591471.html", "urlToImage": null, "publishedAt": "2020-04-24T14:48:36Z", "content": "Actress Karisma Kapoor was one of the reigning actresses in Bollywood during the 90s. Recently, Karisma logged into her Instagram account to share a throwback from her heydays. In the image shared by the 45-year-old actress, we see her posing in front of the … [+1152 chars]"}, {"source": {"id": null, "name": "Thenewsminute.com"}, "author": null, "title": "Revisiting 'Amarkalam', the film that brought Ajith and Shalini together - The News Minute", "description": "It would be an understatement to say that Amarkalam was an important film in Ajith's career. Not only did the 1999 film directed by Saran pave the way for the actor to do more action films, it was also on the sets of Amarkalam that Ajith fell in love with his…", "url": "https://www.thenewsminute.com:443/article/revisiting-amarkalam-film-brought-ajith-and-shalini-together-123255", "urlToImage": null, "publishedAt": "2020-04-24T14:14:05Z", "content": "The couple completes 20 years of marriage on April 24.It would be an understatement to say that Amarkalam was an important film in Ajith's career. Not only did the 1999 film directed by Saran pave the way for the actor to do more action films, it was also on … [+5298 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Bigg Boss 7 fame Ajaz Khan gets bail; tweets ‘justice has prevailed’ - Times of India", "description": "Actor Ajaz Khan was on Friday (April 24) granted bail by Bandra Metropolitan Magistrate court on a surety of Rs 1 l", "url": "https://timesofindia.indiatimes.com/tv/news/hindi/bigg-boss-7-fame-ajaz-khan-gets-bail-tweets-justice-has-prevailed/articleshow/75353668.cms", "urlToImage": null, "publishedAt": "2020-04-24T13:15:00Z", "content": null}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Vijay Fan Dies in Altercation with Rajinikanth Devotee Over COVID-19 Donations - News18", "description": "A Thalaiva fan has allegedly killed an admirer of Vijay over which star contributed more to the COVID-19 relief fund.", "url": "https://www.news18.com/news/movies/vijay-fan-dies-in-altercation-with-rajinikanth-devotee-over-covid-19-donations-2591397.html", "urlToImage": null, "publishedAt": "2020-04-24T12:54:25Z", "content": "Two of the biggest names in the South Indian film industry, superstars Rajinikanth and Vijay, command a legion of fans many of whom can go to any length to prove their loyalty. \r\nIn one such instance, a Thalaiva fan has allegedly killed an admirer of Vijay ov… [+1224 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Danny Cyril D Cruze", "title": "Aarogya Setu App: How Bluetooth helps in identifying Covid-19 suspects - Livemint", "description": "The government-owned application is being posed as the primary contact tracing tool in India.Many organisations are planning to include the app in their daily operations to identify potential cases", "url": "https://www.livemint.com/technology/tech-news/aarogya-setu-app-how-bluetooth-helps-in-identifying-covid-19-suspects-11587730877077.html", "urlToImage": null, "publishedAt": "2020-04-24T12:51:31Z", "content": "Many food-delivery services have mandated the use of Aarogya Setu app for their delivery personnel. The government-owned application is being posed as the primary contact tracing tool in India. During Prime Minister Narendra Modis address to the nation, while… [+2367 chars]"}, {"source": {"id": null, "name": "Indiaglitz.com"}, "author": "IndiaGlitz", "title": "Mahesh Babu gives solid feedback on 2-minute massage! - Telugu News - IndiaGlitz.com", "description": "Mahesh Babu's family time is productive.  The other day, Sitara turned into a head massage volunteer as her dad was busy watching Gautham play his game.", "url": "https://www.indiaglitz.com/mahesh-babu-gives-solid-feedback-on-2-minute-massage-telugu-news-258876", "urlToImage": null, "publishedAt": "2020-04-24T12:49:59Z", "content": "Mahesh Babu's family time is productive. The other day, Sitara turned into a head massage volunteer as her dad was busy watching Gautham play his game. \r\n\"Watching GG (Gautham Ghattamaneni) play his game! MB had a head massage volunteer only to finish in 2 mi… [+562 chars]"}, {"source": {"id": null, "name": "Indiaglitz.com"}, "author": "IndiaGlitz", "title": "Re-Imagining Money Heist With A Mollywood Cast - Malayalam News - IndiaGlitz.com", "description": "Well, we've been thinking of a Malayalam version of Mony Heist the entire star cast. From Prithviraj to Roshan Abdul Rahoof, check out M'Town actors who could be a perfect fit.", "url": "https://www.indiaglitz.com/re-imagining-money-heist-with-a-mollywood-cast-malayalam-news-258868", "urlToImage": null, "publishedAt": "2020-04-24T12:23:54Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "NewsClicks", "title": "Amala Paul's beach photos goes viral! - NewsClicks", "description": "Actress Amala Paul has been the limelight ever since was seen in a daring function within the film ‘Aadai’ directed by Ratna kumar. While the beautiful actress was within the information just lately for the alleged marriage photos of hers, the younger and pro…", "url": "https://timesofindia.indiatimes.com/entertainment/tamil/movies/news/amala-pauls-beach-photos-goes-viral/articleshow/75342680.cms", "urlToImage": null, "publishedAt": "2020-04-24T11:42:09Z", "content": "Actress Amala Paul has been the limelight ever since was seen in a daring function within the film ‘Aadai’ directed by Ratna kumar. While the beautiful actress was within the information just lately for the alleged marriage photos of hers, the younger and pro… [+1200 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "Shreya Basak", "title": "This Was the First-ever Video Uploaded on YouTube. It's 15 Years Old Now - News18", "description": "In the video titled, 'Me at the Zoo', Karim is seen speaking to the camera, while talking about the elephants standing right behind him.", "url": "https://www.news18.com/news/buzz/this-was-the-first-ever-video-uploaded-on-youtube-its-15-years-old-now-2591065.html", "urlToImage": null, "publishedAt": "2020-04-24T11:16:09Z", "content": "Fifteen years ago, YouTube saw its first video upload featuring co-founder Jawed Karim, standing outside the San Diego Zoo. \r\nAlthough only 18-seconds-long and shot in relatively poor quality by today's standards, it is the video that marked the beginning of … [+964 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Chris Hemsworth Breaks Down 12 Minute Extraction Shot | Capital - Capital FM", "description": "Known primarily for his starring role as Thor in the Marvel Universe, Chris Hemsworth, dropped by The Capital Evening Show to talk about his new film, Extrac...", "url": "https://www.youtube.com/watch?v=1MJsvXYJN0U", "urlToImage": null, "publishedAt": "2020-04-24T10:13:12Z", "content": null}, {"source": {"id": null, "name": "Koimoi.com"}, "author": null, "title": "Avengers: Endgame: This Latest Theory Suggests Hulk Met Black Widow When He Snapped His Fingers, Here’s How - Koimoi", "description": "In Avengers: Endgame, we witnessed the deaths of two best superheroes - Black Widow (Scarlett Johansson) and Iron Man (Robert Downey Jr).", "url": "https://www.koimoi.com/hollywood-2/avengers-endgame-this-latest-theory-suggests-hulk-met-black-widow-when-he-snapped-his-fingers-heres-how/", "urlToImage": null, "publishedAt": "2020-04-24T09:39:47Z", "content": "Avengers: Endgame: This Latest Theory Suggests Hulk Met Black Widow When He Snapped His Fingers, Here’s How\r\nIn Avengers: Endgame, we witnessed the deaths of two best superheroes – Black Widow (Scarlett Johansson) and Iron Man (Robert Downey Jr). It will be a… [+1521 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Akshay Kumar shares new version of Kesari's Teri Mitti song: An ode to our heroes in white - India Today", "description": "Akshay Kumar took to Twitter to share the new version of Teri Mitti song and pay tribute to health care workers of the country,", "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-shares-new-version-of-kesari-s-teri-mitti-song-an-ode-to-our-heroes-in-white-1670531-2020-04-24", "urlToImage": null, "publishedAt": "2020-04-24T08:42:46Z", "content": "Akshay Kumar recently shared the song Teri Mitti on Twitter. A special version of Teri Mitti, which was first used in Akshay's 2019 film Kesari, has been released to pay tribute to the health workers of the country.\r\nThe video of the song shows doctors, nurse… [+1838 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Sania Kader", "title": "Deepika Padukone and Ranveer Singhs healthy diet plan costs a fortune - Republic World - Republic World", "description": "Deepika Padukone and Ranveer Singh's healthy diet plan comes at a huge amount as it is optimised. Have a look at the amount and details on the plan here.", "url": "https://www.republicworld.com/entertainment-news/bollywood-news/deepika-padukone-and-ranveer-singhs-healthy-diet-costs-a-fortune.html", "urlToImage": null, "publishedAt": "2020-04-24T07:26:52Z", "content": "Deepika Padukone and Ranveer Singh reportedly spend a huge amount on their healthy diet to keep fit and fine. They have opted for Personal Optimised Diet Supply which helps them maintain their health at all times. According to an entertainment portal, the mea… [+2103 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "AFP", "title": "You've got mail: Tom Hanks writes to bullied boy called 'Corona' - Livemint", "description": "Tom Hanks and his wife Rita Wilson contracted Covid-19 in March.Eight-year-old Corona De Vries sent a letter to Hanks asking after his health", "url": "https://www.livemint.com/news/world/you-ve-got-mail-tom-hanks-writes-to-bullied-boy-called-corona-11587712686667.html", "urlToImage": null, "publishedAt": "2020-04-24T07:26:46Z", "content": "Hollywood megastar and coronavirus survivor Tom Hanks has written a comforting letter to a bullied Australian boy called Corona and gifted him a cherished typewriter bearing the same name.Hanks and his wife Rita Wilson contracted COVID-19, the disease caused … [+976 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Warda Khan Nadiadwala opens up on Sajid Nadiadwala’s former wife Divya Bharti - Times of India", "description": "Actress Divya Bharti bid adieu to the world at the tender age of 19. She was married producer Sajid Nadiadwala. Aft", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/warda-khan-nadiadwala-opens-up-on-sajid-nadiadwalas-ex-wife-divya-bharti/articleshow/75344050.cms", "urlToImage": null, "publishedAt": "2020-04-24T07:19:00Z", "content": null}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Paatal Lok: Anushka Sharma serves a devilish teaser for upcoming Amazon Prime series. Watch - Hindustan Times", "description": "Paatal Lok teaser: Anushka Sharma has shared a delicious new video to get fans excited for her upcoming production. Watch it here.", "url": "https://www.hindustantimes.com/tv/paatal-lok-anushka-sharma-serves-a-devilish-teaser-for-upcoming-amazon-prime-series-watch/story-wp1FQpP6KOdOD7qQT6XNZJ.html", "urlToImage": null, "publishedAt": "2020-04-24T06:58:23Z", "content": "Actor Anushka Sharma has shared the title announcement video of her upcoming production, Paatal Lok. The Amazon Prime Video series stars Neeraj Kabi, Gul Panag and Jaideep Ahlawat in the lead. \r\n“#PaatalLok ke niyam alag hai. #NewSeriesOnPrime, May 15,” Anusk… [+2065 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Jiya Chulet", "title": "Anushka Sharma fails at Instagram challenge, husband Virat Kohli comes to rescue - Republic World - Republic World", "description": "Actor Anushka Sharma recently attempted a trending online challenge but in vain; husband Virat Kohli came to her rescue and guessed the right answers. Watch.", "url": "https://www.republicworld.com/entertainment-news/bollywood-news/anushka-sharma-fails-at-guessthegibberish-virat-kohli-rescues.html", "urlToImage": null, "publishedAt": "2020-04-24T05:57:12Z", "content": "The current pandemic situation has confined people to homes. Amid the nationwide lockdown, various online challenges are keeping people entertained. But it seems like even stars are enjoying it, as recently, Bollywood actor Anushka Sharma tried a trending onl… [+1805 chars]"}, {"source": {"id": null, "name": "Spotboye.com"}, "author": "Divya Ramnani", "title": "Amid Breakup Rumours, Rithvik Dhanjani Wishes Asha Negi For Upcoming Web Show; Lady Responds Cordially - SpotboyE", "description": "While the internet is buzzing with their breakup rumours, Rithvik Dhanjani promotes Asha Negi’s upcoming show on his Insta; check out her response", "url": "https://www.spotboye.com/television/television-news/amid-breakup-rumours-rithvik-dhanjani-wishes-asha-negi-for-upcoming-web-show-lady-responds-cordially/5ea27a6b74f5ce660a2255e4", "urlToImage": null, "publishedAt": "2020-04-24T05:37:50Z", "content": "After Rithvik Dhanjani, Asha Negi Shares Cryptic Post About Being Able To Grow; Posts Old Pic Of A Lovely Evening With Him"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "PTI", "title": "Police complaint against Kangana Ranaut over remark - Deccan Herald", "description": "A complaint has been filed with police against Bollywood actor Kangana Ranaut for allegedly referring to members of a particular community as terrorists in a video released in support of her sister Rangoli Chandel, an official said on Friday. The complaint wa…", "url": "https://www.deccanherald.com/entertainment/police-complaint-filed-against-kangana-ranaut-over-terrorist-remark-829229.html", "urlToImage": null, "publishedAt": "2020-04-24T05:28:32Z", "content": "A complaint has been filed with police against Bollywood actor Kangana Ranaut for allegedly referring to members of a particular community as terrorists in a video released in support of her sister Rangoli Chandel, an official said on Friday.\r\nThe complaint w… [+604 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Dr. Prem Kumar Sharma & Manisha Koushik", "title": "Horoscope Today: Astrological prediction for April 24, what’s in store for Aries, Leo, Virgo, Sagittarius... - Hindustan Times", "description": "Horoscope Today: Are the stars lined up in your favour? Find out the astrological prediction for Aries, Leo, Virgo, Sagittarius and other zodiac signs for April 24.", "url": "https://www.hindustantimes.com/more-lifestyle/horoscope-today-astrological-prediction-for-april-24-what-s-in-store-for-aries-leo-virgo-sagittarius-and-other-zodiac-signs/story-EZDrL2PXV50ThdTEjuQavJ.html", "urlToImage": null, "publishedAt": "2020-04-24T01:35:00Z", "content": "All 12 signs in the zodiac calendar have their own personality traits. Horoscopes give us a hint about how the day is going to fare for all of us. Read on to know whether the odds will be in your favour today:\r\n*Aries (March 21-April 20) A new project will pr… [+8088 chars]"}, {"source": {"id": null, "name": "Iwmbuzz.com"}, "author": "Editorial Team", "title": "Dhvani Bhanushali songs to listen to during quarantine - IWMBuzz", "description": "Dhvani Bhanushali the pop singer of today’s era has gained name and fame for her song rendition. And we pick her best work for this quarantine playloop.", "url": "https://www.iwmbuzz.com/music/snippets-music/dhvani-bhanushali-songs-listen-quarantine/2020/04/23", "urlToImage": null, "publishedAt": "2020-04-23T12:18:12Z", "content": "Dhvani Bhanushali is a glam-doll singer who has gained name and fame at a very young age. Her soothing vocals and great voice tonality puts her at the top in the elite group of singers.\r\nHer Live performances are a rage and an instant hit. Her songs are playe… [+469 chars]"}]}