{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Pinkvilla.com"}, "author": "Pinkvilla Desk", "title": "Priyanka Chopra has a novel way of feeding husband Nick Jonas some cake; Watch Video - PINKVILLA", "description": "While Priyanka Chopra attended quite a few Jonas Brothers concerts, there was one where the actress fed some cake to Nick and it was simply adorable.", "url": "https://www.pinkvilla.com/entertainment/hollywood/priyanka-chopra-has-novel-way-feeding-husband-nick-jonas-some-cake-watch-video-527237", "urlToImage": null, "publishedAt": "2020-04-25T08:26:33Z", "content": null}, {"source": {"id": null, "name": "Bollywoodhungama.com"}, "author": "Bollywood Hungama", "title": "Malaika Arora shares a sun-kissed selfie, pens a note of gratitude amid lock-down - Bollywood Hungama", "description": "Malaika Arora shares a sun-kissed selfie, pens a note of gratitude amid lock-down. Latest Bollywood News, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News at Bollywood Hungama.com", "url": "https://www.bollywoodhungama.com/news/features/malaika-arora-shares-a-sun-kissed-selfie-pens-a-note-of-gratitude-amid-lock-down/", "urlToImage": null, "publishedAt": "2020-04-25T08:04:03Z", "content": "Malaika Arora, who is spending the lock-down with beau Arjun Kapoor, is indulging in cooking, working out from home or is plain chilling. On Instagram, she shared a sun-kissed selfie of herself, expressing gratitude about the fact that she is safe amid this c… [+474 chars]"}, {"source": {"id": null, "name": "Bollywoodhungama.com"}, "author": "Bollywood Hungama", "title": "Ajay Devgn releases song ‘Thahar Ja’ that urges people to stay calm and happy - Bollywood Hungama", "description": "Ajay Devgn releases song ‘Thahar Ja’ that urges people to stay calm and happy. Latest Bollywood News, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News at Bollywood Hungama.com", "url": "https://www.bollywoodhungama.com/news/bollywood/ajay-devgn-releases-song-thahar-ja-urges-people-stay-calm-happy/", "urlToImage": null, "publishedAt": "2020-04-25T08:03:40Z", "content": "The song that features Ajay Devgn was shot at home by him. The song also features his 9-year-old son Yug. Talking about the song, Ajay said that the song was penned by Anil Verma who has written songs for Tanhaji:The Unsung Warrior as well. Ajay said that the… [+469 chars]"}, {"source": {"id": null, "name": "Bollywoodhungama.com"}, "author": "Bollywood Hungama", "title": "Owing to the coronavirus pandemic, 67th National Film Awards delayed indefinitely - Bollywood Hungama", "description": "Owing to the coronavirus pandemic, 67th National Film Awards delayed indefinitely. Latest Bollywood News, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News at Bollywood Hungama.com", "url": "https://www.bollywoodhungama.com/news/bollywood/owing-coronavirus-pandemic-67th-national-film-awards-delayed-indefinitely/", "urlToImage": null, "publishedAt": "2020-04-25T08:03:36Z", "content": "Reportedly, the officials have not been discussing the 67th National Film Awards as they are currently focusing on tackling the coronavirus situation. Talking to a daily, filmmaker Rahul Rawail who was a part of the National Film Awards jury last year said th… [+633 chars]"}, {"source": {"id": null, "name": "Ibtimes.co.in"}, "author": "Pramod Gaikwad", "title": "Deepika Padukone should stop interfering in my life and concentrate on her work: Kangana Ranaut [Throwback] - International Business Times, India Edition", "description": "Deepika Padukone and Kangana Ranaut have been at loggerheads ever since Deepika won the Best Actress award for her performance in Happy New Year over Kangana's role in Queen at an award function in 2014.", "url": "https://www.ibtimes.co.in/deepika-padukone-should-stop-interfering-my-life-concentrate-her-work-kangana-ranaut-throwback-818381", "urlToImage": null, "publishedAt": "2020-04-25T07:52:34Z", "content": "Kangana Ranaut had never shied away from expressing her dislike for Deepika Padukone on a public platform. The two have been at loggerheads ever since Deepika won the Best Actress award for her performance in Happy New Year over Kangana's role in Queen at an … [+2312 chars]"}, {"source": {"id": null, "name": "Ibtimes.co.in"}, "author": "Parismita Goswami", "title": "When Dimple Kapadia warned Twinkle Khanna about 'gay' Akshay Kumar [Throwback] - International Business Times, India Edition", "description": "Twinkle Khanna said that her mother Dimple Kapadia told her of Akshay Kumar's sexual orientation when the actor had visited her house to ask for her hand in marriage.", "url": "https://www.ibtimes.co.in/when-dimple-kapadia-warned-twinkle-khanna-about-gay-akshay-kumar-throwback-818376", "urlToImage": null, "publishedAt": "2020-04-25T07:52:32Z", "content": "Akshay kumar's advice on quarantine \r\nAkshay Kumar and Twinkle Khanna are one of the most adorable couples of Bollywood. It is known that Twinkle is a witty person and her unapologetic and unabashed comments often leaves Khiladi actor embarrassed and it was w… [+1704 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "admin", "title": "Sussanne Khan shares a family pic with Hrithik Roshan, sons Hrehaan and Hridhaan enjoying a scenic view,... - Jimmys Post", "description": "", "url": "https://www.hindustantimes.com/bollywood/sussanne-khan-shares-a-family-pic-with-hrithik-roshan-sons-hrehaan-and-hridhaan-enjoying-a-scenic-view-see-pic/story-bsU4Gmwc9fc1gNzt7IfDMK.html/", "urlToImage": null, "publishedAt": "2020-04-25T07:23:32Z", "content": "Actor Hrithik Roshans ex-wife Sussanne Khan has moved in with the actor through the coronavirus pandemic to co-parent their sons, Hrehaan and Hridhaan together. OnSaturday, she posted a relaxed family picture of the three of them.\r\nSharing the picture, she qu… [+1639 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Mystic Meg", "title": "Daily horoscope for Saturday April 25 — here’s what the stars have in store for you today - The Sun", "description": "", "url": "http://www.thesun.co.uk/fabulous/horoscopes/11468749/daily-horoscope-star-signs-april-25/", "urlToImage": null, "publishedAt": "2020-04-25T07:17:36Z", "content": "ARIES\r\nMarch 21 to April 20\r\nPLUTO'S reversal, starting today for the next five months, is a time of letting go and accepting what cant change.\r\nA personal test may not be over, but you can deal with it so well and really look forward.\r\nLove is ready to talk … [+5330 chars]"}, {"source": {"id": null, "name": "Koimoi.com"}, "author": null, "title": "’83: Streaming Giant Offers Rs 143 Crore To The Makers Of This Ranveer Singh Starrer To Release Digitally? - Koimoi", "description": "If now the reports are to be believed, a streaming giant with worldwide reach has offered the makers of Ranveer Singh's '83...", "url": "https://www.koimoi.com/bollywood-news/83-streaming-giant-offers-rs-143-crore-to-the-makers-of-this-ranveer-singh-starrer-to-release-digitally/", "urlToImage": null, "publishedAt": "2020-04-25T07:05:06Z", "content": "The Novel Coronavirus outbreak has brought everything to stand still. With cinema halls being closed and everyone practising social distancing, many films have faced the wrath as their release stand postponed. If now the reports are to be believed, a streamin… [+2224 chars]"}, {"source": {"id": null, "name": "Ibtimes.co.in"}, "author": "Shefali Jha", "title": "Karan Johar called Priyanka Chopra spineless: 'Burst out like a pressure cooker at her' - International Business Times, India Edition", "description": "What went wrong between Karan Johar and Priyanka Chopra and how the duo patched up.", "url": "https://www.ibtimes.co.in/karan-johar-called-priyanka-chopra-spineless-burst-out-like-pressure-cooker-her-818340", "urlToImage": null, "publishedAt": "2020-04-25T06:42:16Z", "content": "The incident happened when apart from her movies, Priyanka Chopra was making news for her closeness to Shah Rukh Khan. Rumours of something brewing between the two was making headlines for more reasons than one. It was said that Karan Johar, who happens to be… [+1968 chars]"}, {"source": {"id": null, "name": "Telugucinema.com"}, "author": "tc editor", "title": "Sleeping 9 hours daily during the lockdown: Vijay Deverakonda - Telugu Cinema", "description": "Handsome hunk Vijay Deverakonda revealed that he’s sleeping nine and half hours daily on an average during this lockdown period as opposed to a six-hour sleep routine. He made a video of his daily routine during this period. Taking a cue from director Siva Ko…", "url": "https://www.telugucinema.com/news/sleeping-9-hours-daily-during-lockdown-vijay-deverakonda", "urlToImage": null, "publishedAt": "2020-04-25T06:31:16Z", "content": "Handsome hunk Vijay Deverakonda revealed that hes sleeping nine and half hours daily on an average during this lockdown period as opposed to a six-hour sleep routine. He made a video of his daily routine during this period.\r\nTaking a cue from director Siva Ko… [+621 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Ramazan 2020: Dipika Kakar wishes Chand mubarak, shares glimpse of her first sehri. See pics, video - Hindustan Times", "description": "Dipika Kakar and husband Shoaib Ibrahim shared several pictures and videos as they celebrated the commencement of the month of Ramazan.", "url": "https://www.hindustantimes.com/tv/ramazan-2020-dipika-kakar-wishes-chand-mubarak-shares-glimpse-of-her-first-sehri-see-pics-video/story-B3wGDrTzmhG6O5tTXPjYVP.html", "urlToImage": null, "publishedAt": "2020-04-25T06:11:54Z", "content": "Dipika Kakar and husband Shoaib Ibrahim are all geared up to celebrate the month of Ramzan and took to social media to wish their fans on the occasion. Dipika also shared a picture as she sat to savour her first sehri before dawn on Saturday. \r\nSharing a happ… [+1493 chars]"}, {"source": {"id": null, "name": "Thenewsminute.com"}, "author": null, "title": "Nithiin-Rashmika starrer ‘Bheeshma’ now streaming online - The News Minute", "description": "Nithiin and Rashmika fans rejoice! The duo’s last film, Bheeshma has been released online and is now streaming on Netflix and Sun NXT. Bheeshma is a romantic action comedy that was met with positive reviews upon its release. The film revolves around the prota…", "url": "https://www.thenewsminute.com/article/nithiin-rashmika-starrer-bheeshma-now-streaming-online-123314", "urlToImage": null, "publishedAt": "2020-04-25T05:46:31Z", "content": "The film released in February and was met with positive reviews.Nithiin and Rashmika fans rejoice! The duos last film, Bheeshma has been released online and is now streaming on Netflix and Sun NXT.\r\nBheeshma is a romantic action comedy that was met with posit… [+1670 chars]"}, {"source": {"id": null, "name": "Indiaglitz.com"}, "author": "IndiaGlitz", "title": "No more Suriya movies in theatres - Theatre owners impose ban! - Tamil News - IndiaGlitz.com", "description": "Few days back, it was announced that the Jyothika starrer Ponmagal Vandhaal directed by debutant JJ", "url": "https://www.indiaglitz.com/no-more-suriya-movies-in-theatres-theatre-owners-impose-ban-tamil-news-258908", "urlToImage": null, "publishedAt": "2020-04-25T05:37:38Z", "content": "Few days back, it was announced that the Jyothika starrer Ponmagal Vandhaal directed by debutant JJ Frederick and produced by Suriya's 2D Entertainment will be released directly on Amazon prime and will not be released in theatres.\r\nWith the movie expected to… [+906 chars]"}, {"source": {"id": null, "name": "Tellychakkar.com"}, "author": "Tellychakkar Team", "title": "Akshay Kumar and Kiara Advani starrer Laxmmi Bomb to premiere on Disney Plus Hotstar? - Tellychakkar", "description": "Laxmmi Bomb, which stars Akshay Kumar and Kiara Advani, may not release in theatres. Read on to know the details.", "url": "https://www.tellychakkar.com/tv/tv-news/akshay-kumar-and-kiara-advani-starrer-laxmmi-bomb-premiere-disney-plus-hotstar-200425", "urlToImage": null, "publishedAt": "2020-04-25T05:15:00Z", "content": "MUMBAI: Akshay Kumar starrer Laxmmi Bomb is a much-awaited film. Fans of the star are eagerly waiting for its release. Now, according to the latest update, it seems the film will not release in theatres for obvious reasons.         \r\nWell, to ensure social di… [+1719 chars]"}, {"source": {"id": null, "name": "Manoramaonline.com"}, "author": "Onmanorama Staff", "title": "Prithviraj and Supriya on wedding anniversary: First time in 9 years spending the day apart - Onmanorama", "description": "Supriya also shared a wedding pic of them and her post revealed that she was badly missing Prithviraj.", "url": "https://english.manoramaonline.com/entertainment/entertainment-news/2020/04/25/prithviraj-supriya-on-wedding-anniversary-9-years-first-day-apart.html", "urlToImage": null, "publishedAt": "2020-04-25T05:11:14Z", "content": "Malayalam actor Prithviraj Sukumaran surprised many of his fans nine years ago on this very same day after he got married to Supriya Menon in a private ceremony in Palakkad on April 25, 2011.\r\nSince then, the audience have seen many ups and downs in the caree… [+1518 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Ramayan's Sita aka Dipika Chikhalia's real life wedding was attended by this Bollywood superstar; see pic - Times of India", "description": "Ramayan's rerun has led to curiosity around the life of its lead actors. Several unseen pictures of them from back", "url": "https://timesofindia.indiatimes.com/tv/news/hindi/ramayans-sita-aka-dipika-chikhalias-real-life-wedding-was-attended-by-this-bollywood-superstar-see-pic/articleshow/75369401.cms", "urlToImage": null, "publishedAt": "2020-04-25T04:53:00Z", "content": null}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Rajeev Khandelwal claims casting couch isn’t rape, Chris Evans steps out of Captain America image in... - Hindustan Times", "description": "From Rajeev Khandelwal talking about casting couch and the MeToo movement to the release of Chris Evans’ Defending Jacob, here are top news from world of entertainment.", "url": "https://www.hindustantimes.com/bollywood/rajeev-khandelwal-claims-casting-couch-isn-t-rape-chris-evans-steps-out-of-captain-america-image-in-defending-jacob/story-fmuP4LDtpAxdHpff8p9mDO.html", "urlToImage": null, "publishedAt": "2020-04-25T04:51:40Z", "content": "Rajeev Khandelwal says casting couch is not rape: ‘The one who gives in is equally responsible’\r\nActor Rajeev Khandelwal has shared his views on the prevalence of casting couch in the glamour industry and believes those who fall prey to the practice always ha… [+2695 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Spider-Man: Into the Spider-Verse Sequel Delayed Five Months In 2022 - Screen Rant", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiQ2h0dHBzOi8vc2NyZWVucmFudC5jb20vc3BpZGVybWFuLXNwaWRlci12ZXJzZS0yLXJlbGVhc2UtZGF0ZS1kZWxheS_SAUdodHRwczovL3NjcmVlbnJhbnQuY29tL3NwaWRlcm1hbi1zcGlkZXItdmVyc2UtMi1yZWxlYXNlLWRhdGUtZGVsYXkvYW1wLw?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T03:58:19Z", "content": null}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": "Pinkvilla Desk", "title": "Hugh Jackman jokes he is worried about Blake Lively; Says Quarantine with Ryan Reynolds 'Must Be Brutal' - PINKVILLA", "description": "Hugh Jackman takes a dig at Ryan Reynolds and says that Quarantining with the Deadpool star must be brutal for Blake Lively. Read on to know more.", "url": "https://www.pinkvilla.com/entertainment/hollywood/hugh-jackman-jokes-he-worried-about-blake-lively-says-quarantine-ryan-reynolds-must-be-brutal-527331", "urlToImage": null, "publishedAt": "2020-04-25T03:45:45Z", "content": null}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Asim Riaz Can't Stop Gushing Over Himanshi As She Wishes 'Ramadan Mubarak' With Stunning Pic - News18", "description": "On Friday, Himanshi shared a gorgeous picture of herself to wish fans on the occasion of the onset of the holy month of Ramzan.", "url": "https://www.news18.com/news/movies/asim-riaz-cant-stop-gushing-over-himanshi-khurana-as-she-wishes-ramadan-mubarak-with-stunning-pic-2591913.html", "urlToImage": null, "publishedAt": "2020-04-25T03:44:44Z", "content": "They first met inside the Bigg Boss 13 house and since then Asim Riaz and Himanshi Khurana have been head-over-heels in love with each other. On Friday, Himanshi shared a gorgeous picture of herself to wish fans on the occasion of the onset of the holy month … [+1041 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Asian News International", "title": "Karan Johar’s daughter Roohi calls him an elephant after declaring him a ‘buddha’, Bollywood can’t laugh... - Hindustan Times", "description": "Karan Johar’s daughter Roohi called him an elephant in the latest video in their Lockdown With The Johars series.", "url": "https://www.hindustantimes.com/bollywood/karan-johar-s-daughter-roohi-calls-him-an-elephant-after-declaring-him-a-buddha-bollywood-can-t-laugh-more-watch/story-qYwA9lagXN2qFg78l5PPtL.html", "urlToImage": null, "publishedAt": "2020-04-25T03:04:42Z", "content": "Filmmaker Karan Johar on Friday shared an adorable video in which he plays a fun game with Yash And Roohi by asking them if they would have been born as an animal, which animal they would like to be. Apparently, at the end of the game, they ended up calling t… [+1696 chars]"}, {"source": {"id": null, "name": "Sportskeeda.com"}, "author": "Raunak Jaiswal", "title": "Roman Reigns takes a dig at tag team recently released by WWE - Sportskeeda", "description": "The former WWE tag team has been a thorn in Roman Reigns' side in the past.", "url": "https://www.sportskeeda.com/wwe/roman-reigns-takes-a-dig-at-tag-team-recently-released-by-wwe", "urlToImage": null, "publishedAt": "2020-04-25T02:49:10Z", "content": "Roman Reigns wasn't holding back in this exchange\r\nIn a shocking turn of events, WWE released over 20 Superstars in addition to furloughing backstage staff last week. To everyone's surprise, The Good Brothers Luke Gallows &amp; Karl Anderson were also among t… [+1792 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18.com", "title": "Sobhita Dhulipala Issues Clarification After Being Accused of Lying About 'Self-Clicked' Cover - News18", "description": "Sobhita's statement comes after a series of her behind-the-scenes pictures from the shoot were surfaced online.", "url": "https://www.news18.com/news/lifestyle/sobhita-dhulipala-releases-statement-after-being-accused-of-lying-about-self-clicked-cover-2591861.html", "urlToImage": null, "publishedAt": "2020-04-25T02:46:09Z", "content": "Actress Sobhita Dhulipala has released a statement regarding her \"self-timed\" magazine cover after being accused of lying about clicking them by herself.\r\nSobhita's statement comes after a series of her behind-the-scenes pictures from her Cosmopolitan magazin… [+2087 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Sana Farzeen", "title": "Lara Dutta on Hundred: Finally got to know what Bollywood heroes feel in a film - The Indian Express", "description": "Actor Lara Dutta on her digital debut, surviving in Bollywood, life after lockdown and more.", "url": "https://indianexpress.com/article/entertainment/web-series/lara-dutta-on-hundred-bollywood-heroes-6378337/", "urlToImage": null, "publishedAt": "2020-04-25T02:32:24Z", "content": "Written by Sana Farzeen\r\n | Mumbai | \r\nPublished: April 25, 2020 7:57:43 am\r\nLara Dutta’s Hundred is streaming on Disney+ Hotstar.Model-turned-actor Lara Dutta has forayed into the digital space with Hundred. The Hotstar Specials original also stars Sairat fa… [+5566 chars]"}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": "Pinkvilla Desk", "title": "Kareena Kapoor Khan glam up her quarantine look in a mustard Kaftan as she twirls in her living room; WATCH - PINKVILLA", "description": "Kareena Kapoor Khan proves she is the queen of slow mo as she nails her quarantine look in a mustard Kaftan; WATCH", "url": "https://www.pinkvilla.com/entertainment/news/kareena-kapoor-khan-glam-her-quarantine-look-mustard-kaftan-she-twirls-her-living-room-watch-527328", "urlToImage": null, "publishedAt": "2020-04-25T02:24:43Z", "content": null}, {"source": {"id": null, "name": "Cbssports.com"}, "author": "Brent Brookhouse", "title": "WWE SmackDown results, recap, grades: Awkward Triple H celebration brings down an otherwise solid show - CBSSports.com", "description": "A fairly solid edition of SmackDown ended on a bad note after an awkward celebration of Triple H's 25 years in WWE", "url": "https://www.cbssports.com/wwe/news/wwe-smackdown-results-recap-grades-awkward-triple-h-celebration-brings-down-an-otherwise-solid-show/live/", "urlToImage": null, "publishedAt": "2020-04-25T02:18:00Z", "content": "With WWE continuing to build toward the May 10 Money in the Bank pay-per-view, SmackDown was a fairly solid show with good in-ring action. Unfortunately, the show ended on a bad note with a \"celebration\" of Triple H's 25 years in WWE. Joined by Shawn Michaels… [+6668 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Dr. Prem Kumar Sharma & Manisha Koushik", "title": "Horoscope Today: Astrological prediction for April 25, what’s in store for Aries, Leo, Virgo, Sagittarius... - Hindustan Times", "description": "Horoscope Today: Are the stars lined up in your favour? Find out the astrological prediction for Aries, Leo, Virgo, Sagittarius and other zodiac signs for April 25.", "url": "https://www.hindustantimes.com/more-lifestyle/horoscope-today-astrological-prediction-for-april-25-what-s-in-store-for-aries-leo-virgo-sagittarius-and-other-zodiac-signs/story-kn3yXIPuBA1khSA1MqVbNK.html", "urlToImage": null, "publishedAt": "2020-04-25T02:08:00Z", "content": "The 12 signs of the zodiac have their separate personality traits. Horoscopes have the ability to offer an insight into our life and what will happen in the future. Read on to find out whether the odds will be in your favour today:\r\n*Aries (March 21-April 20)… [+7787 chars]"}, {"source": {"id": null, "name": "Iwmbuzz.com"}, "author": "Editorial Team", "title": "Aishwarya Rai Bachchan, Deepika Padukone, Anushka Sharma, Priyanka Chopra Jonas, Kareena Kapoor Khan: 8 Best Sabyasachi Casual Collection - IWMBuzz", "description": "IWMBuzz shows you gorgeous photos of these Bollywood beauties in Sabyasachi collection. Check out the photos below.", "url": "https://www.iwmbuzz.com/movies/celebrities-movies/aishwarya-rai-bachchan-deepika-padukone-anushka-sharma-priyanka-chopra-jonas-kareena-kapoor-khan-8-best-sabyasachi-casual-collection/2020/04/25", "urlToImage": null, "publishedAt": "2020-04-25T02:05:58Z", "content": null}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Sara Ali Khan Brings Back Her Knock-knock Series with Brother Ibrahim, Watch Hilarious Video - News18", "description": "Sara Ali Khan reprised her iconic knock-knock series with her brother Ibrahim where she made bad jokes with hilarious results amid the Coronavirus lockdown.", "url": "https://www.news18.com/news/movies/sara-ali-khan-brings-back-her-knock-knock-series-with-brother-ibrahim-watch-hilarious-video-2591593.html", "urlToImage": null, "publishedAt": "2020-04-25T01:41:31Z", "content": "Actress Sara Ali Khan is known for her wit and sense of humour on social media. Be it her \"shayaris\", throwback videos or even her knock-knock jokes, Sara keeps her fans entertained. Recently, the actress reprised her iconic knock-knock series with her brothe… [+679 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Horoscope Today, April 25, 2020: Know what your stars have for you - India Today", "description": "Horoscope Today, April 25, 2020: Here's what the stars have in store for you on Saturday.", "url": "https://www.indiatoday.in/india/story/horoscope-today-april-25-2020-know-what-your-stars-have-for-you-1670847-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T00:01:38Z", "content": "Horoscope offers interesting and accurate insights. Let's find out what our stars have in store for us on Saturday, April 25.\r\nARIES Mar 21-Apr 20 Money will come your way from various sources and keeps your bank balance brimming. Though, you will not be in m… [+2355 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Rachana Dubey", "title": "#CoronaCrisis: Cinemas gear up to tackle a post-lockdown world, with some restrictions - Times of India", "description": "Temperature checks, mandatory masks and cross-seating are some of the measures being thought over", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/coronacrisis-cinemas-gear-up-to-tackle-a-post-lockdown-world-with-some-restrictions/articleshow/75362123.cms", "urlToImage": null, "publishedAt": "2020-04-24T21:14:00Z", "content": null}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Scott Mendelson", "title": "Tom Cruise’s ‘Mission: Impossible’ Has Shown Resilience Despite Release Date Delays And Long Waits - Forbes", "description": "History shows moviegoers will show up for Tom Cruise’s next Mission: Impossible sequels (now delayed to November of 2021 and 2022) for as long as it takes.", "url": "https://www.forbes.com/sites/scottmendelson/2020/04/24/mission-impossible-tom-cruise-rebecca-ferguson-box-office-delayed-coronavirus-james-bond-shazam/", "urlToImage": null, "publishedAt": "2020-04-24T20:12:19Z", "content": "Simon Pegg, Rebecca Ferguson, Tom Cruise and Ving Rhames in 'Mission Impossible Fallout'\r\nParamount\r\nHistory shows that moviegoers will show up for Tom Cruises next two Mission: Impossible sequels (which just got delayed to November of 2021 and 2022) for as l… [+5997 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Vicky Kaushal shares a video as an 11-year-old girl from his's society returns home after fighting COVID- - Times of India", "description": "Vicky Kaushal has been sharing updates about his day-to-day activities during the lockdown on his social media acco", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/vicky-kaushal-shares-a-video-as-an-11-year-old-girl-from-hiss-society-returns-home-after-fighting-covid-19-captions-ray-of-sunshine/articleshow/75360788.cms", "urlToImage": null, "publishedAt": "2020-04-24T17:33:00Z", "content": null}, {"source": {"id": null, "name": "Bollywoodhungama.com"}, "author": "Bollywood Hungama", "title": "Taarak Mehta Ka Ooltah Chashmah’s Palak Sidhwani aka Sonu responds to fan who asked her if she is dating Kush aka Goli - Bollywood Hungama", "description": "Taarak Mehta Ka Ooltah Chashmah’s Palak Sidhwani aka Sonu responds to fan who asked her if she is dating Kush aka Goli. Latest Bollywood News, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News at Bollywood Hungama.com", "url": "https://www.bollywoodhungama.com/news/features/taarak-mehta-ka-ooltah-chashmahs-palak-sidhwani-aka-sonu-responds-fan-asked-dating-kush-aka-goli/", "urlToImage": null, "publishedAt": "2020-04-24T17:10:08Z", "content": "Actress Palak Sidhwani, who plays the character of Sonu in the show, recently had an interaction with her fans through a fun live session. During this interaction, a fan asked the actress whether she is dating Kush Shah, who essays the character of Goli in Ta… [+198 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "With 427% jump in search, Covid-19 blocked out other queries: Yahoo report - Hindustan Times", "description": "Before the lockdown, navigational searches for ‘WhatsApp web’ and ‘YouTube’ were the most searched tools for communication, after the lockdown searches for ‘Zoom’, ‘Skype’, ‘Google Hangouts’, ‘Microsoft Teams’ and ‘GoToMeeting’ took over.", "url": "https://www.hindustantimes.com/india-news/with-427-jump-in-search-covid-19-blocked-out-other-queries-yahoo-report/story-O2khsGT07RRwGfLB8V6HHN.html", "urlToImage": null, "publishedAt": "2020-04-24T17:10:00Z", "content": "A month into the lockdown, search queries for coronavirus-related matters saw a whopping jump of 427%, a report by search engine Yahoo revealed. \r\nThe ‘Search in the Lockdown’ report reveals that while search terms for news events such as ‘Delhi election resu… [+1653 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "When Shah Rukh Khan warned Aamir Khan to not work with Kajol: ‘She is very bad, unfocused’ - Hindustan Times", "description": "Before they came to be known as one of Bollywood’s best romantic pairs, actors Shah Rukh Khan and Kajol got off on the wrong foot.", "url": "https://www.hindustantimes.com/bollywood/when-shah-rukh-khan-warned-aamir-khan-to-not-work-with-kajol-she-is-very-bad-unfocused/story-ohHuC9ZVW9pUEacCoSFHQK.html", "urlToImage": null, "publishedAt": "2020-04-24T16:23:00Z", "content": "They’re known as one of Bollywood’s finest romantic pairs, but did you know that Shah Rukh Khan and Kajol got off on the wrong foot when they first met? In fact, Shah Rukh confessed that he’d even warned Aamir Khan about her, calling her unfocused and ‘very b… [+1544 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Krishna Shroff, Eban Hyams make the most of quarantine, snuggle together in new pic. See here - Hindustan Times", "description": "Krishna Shroff and her boyfriend Eban Hyams are making the best use of their time together in quarantine. Check out their new picture.", "url": "https://www.hindustantimes.com/bollywood/krishna-shroff-eban-hyams-make-the-most-of-quarantine-snuggle-together-in-new-pic-see-here/story-AJHx1IIorfmtMtRt4Kkz5J.html", "urlToImage": null, "publishedAt": "2020-04-24T16:15:24Z", "content": "Actor Tiger Shroff’s sister, Krishna, is making the best use of her time with boyfriend Eban Hyams, during the nationwide coronavirus lockdown. Eban took to Instagram stories on Friday and shared a picture of the two of them enjoying themselves on the couch. … [+1133 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "How 'Extraction' Leaps Into Action | Anatomy of a Scene - The New York Times", "description": "When a Hollywood stunt coordinator sets out to direct his first feature, he knows that the stunts had better be great. Sam Hargrave aimed to make it so by br...", "url": "https://www.youtube.com/watch?v=_M6DabJ7GYM", "urlToImage": null, "publishedAt": "2020-04-24T15:00:18Z", "content": "When a Hollywood stunt coordinator sets out to direct his first feature, he knows that the stunts had better be great. Sam Hargrave aimed to make it so by bringing the camera along for the wild ride in his Netflix thriller Extraction, starring Chris Hemsworth… [+1158 chars]"}, {"source": {"id": null, "name": "Koimoi.com"}, "author": null, "title": "Chris Hemsworth Is Worthy Of Thor’s Hammer BUT It Seems Wife Elsa Pataky Isn’t Happy About The Same - Koimoi", "description": "Extraction starring Chris Hemsworth released today on Netflix. The buzz around the film is crazy and his fans just can’t stop praising him seeing the film.", "url": "https://www.koimoi.com/hollywood-2/chris-hemsworth-is-worthy-of-thors-hammer-but-it-seems-wife-elsa-pataky-isnt-happy-about-the-same/", "urlToImage": null, "publishedAt": "2020-04-24T14:43:11Z", "content": "Chris Hemsworth Is Worthy Of Thor’s Hammer BUT It Seems Wife Elsa Pataky Isn’t Happy About The Same\r\nExtraction starring Chris Hemsworth released today on Netflix. The buzz around the film is crazy and his fans just cant stop praising him seeing the film. Dir… [+1777 chars]"}, {"source": {"id": null, "name": "Thenewsminute.com"}, "author": null, "title": "Revisiting 'Amarkalam', the film that brought Ajith and Shalini together - The News Minute", "description": "It would be an understatement to say that Amarkalam was an important film in Ajith's career. Not only did the 1999 film directed by Saran pave the way for the actor to do more action films, it was also on the sets of Amarkalam that Ajith fell in love with his…", "url": "https://www.thenewsminute.com:443/article/revisiting-amarkalam-film-brought-ajith-and-shalini-together-123255", "urlToImage": null, "publishedAt": "2020-04-24T14:14:05Z", "content": "The couple completes 20 years of marriage on April 24.It would be an understatement to say that Amarkalam was an important film in Ajith's career. Not only did the 1999 film directed by Saran pave the way for the actor to do more action films, it was also on … [+5298 chars]"}, {"source": {"id": null, "name": "Telugucinema.com"}, "author": "tc editor", "title": "Speculations begin about Koratala's next movie - Telugu Cinema", "description": "In a recent interview, Koratala Siva mentioned that he’d not wait for big stars to give him dates for his next film. He said he’d start a film with whoever is readily available to work with him then. He was miffed with Chiranjeevi’s ‘Acharya’ getting delayed …", "url": "https://www.telugucinema.com/news/speculations-begin-about-koratalas-next-movie", "urlToImage": null, "publishedAt": "2020-04-24T14:06:08Z", "content": "In a recent interview, Koratala Siva mentioned that hed not wait for big stars to give him dates for his next film. He said hed start a film with whoever is readily available to work with him then. He was miffed with Chiranjeevis Acharya getting delayed for v… [+495 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "Antara Kashyap", "title": "Can You Find Hidden Tigers In This Image? B-Town Celebs Join the Bandwagon - News18", "description": "After Amitabh Bachchan shared a viral picture depicting optical illusions consisting of hidden tigers, many Bollywood actors joined the bandwagon to guess the right answer.", "url": "https://www.news18.com/news/movies/can-you-find-hidden-tigers-in-this-image-b-town-celebs-join-the-bandwagon-2591345.html", "urlToImage": null, "publishedAt": "2020-04-24T13:50:14Z", "content": "A twitter user uploaded an optical illusion image of tigers on Thursday, which left many people including Bollywood celebrities intrigued.\r\nCaptioning the image, the user asked, How Many Tigers You See In This Pic?\r\nA cursory glance at the picture just shows … [+810 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Bigg Boss 7 fame Ajaz Khan gets bail; tweets ‘justice has prevailed’ - Times of India", "description": "Actor Ajaz Khan was on Friday (April 24) granted bail by Bandra Metropolitan Magistrate court on a surety of Rs 1 l", "url": "https://timesofindia.indiatimes.com/tv/news/hindi/bigg-boss-7-fame-ajaz-khan-gets-bail-tweets-justice-has-prevailed/articleshow/75353668.cms", "urlToImage": null, "publishedAt": "2020-04-24T13:15:00Z", "content": null}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Vijay Fan Dies in Altercation with Rajinikanth Devotee Over COVID-19 Donations - News18", "description": "A Thalaiva fan has allegedly killed an admirer of Vijay over which star contributed more to the COVID-19 relief fund.", "url": "https://www.news18.com/news/movies/vijay-fan-dies-in-altercation-with-rajinikanth-devotee-over-covid-19-donations-2591397.html", "urlToImage": null, "publishedAt": "2020-04-24T12:54:25Z", "content": "Two of the biggest names in the South Indian film industry, superstars Rajinikanth and Vijay, command a legion of fans many of whom can go to any length to prove their loyalty. \r\nIn one such instance, a Thalaiva fan has allegedly killed an admirer of Vijay ov… [+1224 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Danny Cyril D Cruze", "title": "Aarogya Setu App: How Bluetooth helps in identifying Covid-19 suspects - Livemint", "description": "The government-owned application is being posed as the primary contact tracing tool in India.Many organisations are planning to include the app in their daily operations to identify potential cases", "url": "https://www.livemint.com/technology/tech-news/aarogya-setu-app-how-bluetooth-helps-in-identifying-covid-19-suspects-11587730877077.html", "urlToImage": null, "publishedAt": "2020-04-24T12:51:31Z", "content": "Many food-delivery services have mandated the use of Aarogya Setu app for their delivery personnel. The government-owned application is being posed as the primary contact tracing tool in India. During Prime Minister Narendra Modis address to the nation, while… [+2367 chars]"}, {"source": {"id": null, "name": "Ibtimes.co.in"}, "author": "Shruti Niraj", "title": "Karisma Kapoor's ex-husband said she married him as rebound after Abhishek Bachchan [Throwback] - International Business Times, India Edition", "description": "Karisma Kapoor was engaged to Abhishek Bachchan but after their break-up, she got married to businessman Sanjay Kapoor in 2003.", "url": "https://www.ibtimes.co.in/karisma-kapoors-ex-husband-said-she-married-him-rebound-after-abhishek-bachchan-throwback-818318", "urlToImage": null, "publishedAt": "2020-04-24T12:50:14Z", "content": "Girls just wanna have fun! Happiness is doing a video call with your bestie\r\nKarisma Kapoor has done many romantic movies and over the years, have enthralled the audience with her on-screen chemistry with co-stars. But in real life, her love stories did not h… [+2042 chars]"}, {"source": {"id": null, "name": "Indiaglitz.com"}, "author": "IndiaGlitz", "title": "Mahesh Babu gives solid feedback on 2-minute massage! - Telugu News - IndiaGlitz.com", "description": "Mahesh Babu's family time is productive.  The other day, Sitara turned into a head massage volunteer as her dad was busy watching Gautham play his game.", "url": "https://www.indiaglitz.com/mahesh-babu-gives-solid-feedback-on-2-minute-massage-telugu-news-258876", "urlToImage": null, "publishedAt": "2020-04-24T12:49:59Z", "content": "Mahesh Babu's family time is productive. The other day, Sitara turned into a head massage volunteer as her dad was busy watching Gautham play his game. \r\n\"Watching GG (Gautham Ghattamaneni) play his game! MB had a head massage volunteer only to finish in 2 mi… [+562 chars]"}, {"source": {"id": null, "name": "Indiaglitz.com"}, "author": "IndiaGlitz", "title": "Re-Imagining Money Heist With A Mollywood Cast - Malayalam News - IndiaGlitz.com", "description": "Well, we've been thinking of a Malayalam version of Mony Heist the entire star cast. From Prithviraj to Roshan Abdul Rahoof, check out M'Town actors who could be a perfect fit.", "url": "https://www.indiaglitz.com/re-imagining-money-heist-with-a-mollywood-cast-malayalam-news-258868", "urlToImage": null, "publishedAt": "2020-04-24T12:23:54Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "NewsClicks", "title": "Amala Paul's beach photos goes viral! - NewsClicks", "description": "Actress Amala Paul has been the limelight ever since was seen in a daring function within the film ‘Aadai’ directed by Ratna kumar. While the beautiful actress was within the information just lately for the alleged marriage photos of hers, the younger and pro…", "url": "https://timesofindia.indiatimes.com/entertainment/tamil/movies/news/amala-pauls-beach-photos-goes-viral/articleshow/75342680.cms", "urlToImage": null, "publishedAt": "2020-04-24T11:42:09Z", "content": "Actress Amala Paul has been the limelight ever since was seen in a daring function within the film ‘Aadai’ directed by Ratna kumar. While the beautiful actress was within the information just lately for the alleged marriage photos of hers, the younger and pro… [+1200 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "Shreya Basak", "title": "This Was the First-ever Video Uploaded on YouTube. It's 15 Years Old Now - News18", "description": "In the video titled, 'Me at the Zoo', Karim is seen speaking to the camera, while talking about the elephants standing right behind him.", "url": "https://www.news18.com/news/buzz/this-was-the-first-ever-video-uploaded-on-youtube-its-15-years-old-now-2591065.html", "urlToImage": null, "publishedAt": "2020-04-24T11:16:09Z", "content": "Fifteen years ago, YouTube saw its first video upload featuring co-founder Jawed Karim, standing outside the San Diego Zoo. \r\nAlthough only 18-seconds-long and shot in relatively poor quality by today's standards, it is the video that marked the beginning of … [+964 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Amir Khollam", "title": "Anushka Sharma’s first web series ‘Paatal Lok’s teaser will send chills down the spine - Republic World - Republic World", "description": "Anushka Sharma's production house Clean Slate Films will be venturing into the digital space with 'Paatal Lok', a web series. Check out the teaser below", "url": "https://www.republicworld.com/entertainment-news/bollywood-news/anushka-sharmas-first-web-series.html", "urlToImage": null, "publishedAt": "2020-04-24T10:42:40Z", "content": "Anushka Sharma's production house Clean Slate Films is all set to make its digital debut with the series Paatal Lok which will be an Amazon Prime Video special. The actor recently took to her social media and released the first teaser for Paatal Lok. The teas… [+1892 chars]"}, {"source": {"id": null, "name": "Koimoi.com"}, "author": null, "title": "Avengers: Endgame: This Latest Theory Suggests Hulk Met Black Widow When He Snapped His Fingers, Here’s How - Koimoi", "description": "In Avengers: Endgame, we witnessed the deaths of two best superheroes - Black Widow (Scarlett Johansson) and Iron Man (Robert Downey Jr).", "url": "https://www.koimoi.com/hollywood-2/avengers-endgame-this-latest-theory-suggests-hulk-met-black-widow-when-he-snapped-his-fingers-heres-how/", "urlToImage": null, "publishedAt": "2020-04-24T09:39:47Z", "content": "Avengers: Endgame: This Latest Theory Suggests Hulk Met Black Widow When He Snapped His Fingers, Here’s How\r\nIn Avengers: Endgame, we witnessed the deaths of two best superheroes – Black Widow (Scarlett Johansson) and Iron Man (Robert Downey Jr). It will be a… [+1521 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Shah Rukh-Gauri Khan to Varun Dhawan-Natasha Dalal: Bollywood's iconic couples who prove love is not dead - Times of India", "description": "In the glamorous world of Bollywood, we have all witnessed several relationships blossom into fairytale-like love stories and there have been times when we stood as silent spectators as a few fiery relationships burned to ash. In this list, we take a look at …", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/varun-dhawan-natasha-dalal-to-shah-rukh-khan-gauri-khan-bollywood-couples-who-prove-love-is-not-dead/photostory/75341506.cms", "urlToImage": null, "publishedAt": "2020-04-24T09:36:51Z", "content": "Unlike the others on this list, Abhishek Bachchan and Aishwarya Rai crossed paths many times before they finally gave in and let love take over. There were strong whispers that sparks flew for the first time between Ash and Abhishek on the sets of 'Kajra Re'.… [+281 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Akshay Kumar shares new version of Kesari's Teri Mitti song: An ode to our heroes in white - India Today", "description": "Akshay Kumar took to Twitter to share the new version of Teri Mitti song and pay tribute to health care workers of the country,", "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-shares-new-version-of-kesari-s-teri-mitti-song-an-ode-to-our-heroes-in-white-1670531-2020-04-24", "urlToImage": null, "publishedAt": "2020-04-24T08:42:46Z", "content": "Akshay Kumar recently shared the song Teri Mitti on Twitter. A special version of Teri Mitti, which was first used in Akshay's 2019 film Kesari, has been released to pay tribute to the health workers of the country.\r\nThe video of the song shows doctors, nurse… [+1838 chars]"}, {"source": {"id": null, "name": "Indiaglitz.com"}, "author": "IndiaGlitz", "title": "Jyothirmayi leaves fans shocked with her BALD look! - Malayalam News - IndiaGlitz.com", "description": "The Thalainagaram actress Jyothirmayi has gone bald and that is something unbelievable for her fans.", "url": "https://www.indiaglitz.com/jyothirmayi-leaves-fans-shocked-with-her-bald-look-malayalam-news-258840", "urlToImage": null, "publishedAt": "2020-04-24T07:45:42Z", "content": "Amid lockdown, while celebrities are experimenting with new things in their lives, actress Jyothirumayi has opted for a new look. The actress has gone bald and that is something unbelievable for her fans. The latest picture was released by her husband and dir… [+647 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Sania Kader", "title": "Deepika Padukone and Ranveer Singhs healthy diet plan costs a fortune - Republic World - Republic World", "description": "Deepika Padukone and Ranveer Singh's healthy diet plan comes at a huge amount as it is optimised. Have a look at the amount and details on the plan here.", "url": "https://www.republicworld.com/entertainment-news/bollywood-news/deepika-padukone-and-ranveer-singhs-healthy-diet-costs-a-fortune.html", "urlToImage": null, "publishedAt": "2020-04-24T07:26:52Z", "content": "Deepika Padukone and Ranveer Singh reportedly spend a huge amount on their healthy diet to keep fit and fine. They have opted for Personal Optimised Diet Supply which helps them maintain their health at all times. According to an entertainment portal, the mea… [+2103 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "AFP", "title": "You've got mail: Tom Hanks writes to bullied boy called 'Corona' - Livemint", "description": "Tom Hanks and his wife Rita Wilson contracted Covid-19 in March.Eight-year-old Corona De Vries sent a letter to Hanks asking after his health", "url": "https://www.livemint.com/news/world/you-ve-got-mail-tom-hanks-writes-to-bullied-boy-called-corona-11587712686667.html", "urlToImage": null, "publishedAt": "2020-04-24T07:26:46Z", "content": "Hollywood megastar and coronavirus survivor Tom Hanks has written a comforting letter to a bullied Australian boy called Corona and gifted him a cherished typewriter bearing the same name.Hanks and his wife Rita Wilson contracted COVID-19, the disease caused … [+976 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Warda Khan Nadiadwala opens up on Sajid Nadiadwala’s former wife Divya Bharti - Times of India", "description": "Actress Divya Bharti bid adieu to the world at the tender age of 19. She was married producer Sajid Nadiadwala. Aft", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/warda-khan-nadiadwala-opens-up-on-sajid-nadiadwalas-ex-wife-divya-bharti/articleshow/75344050.cms", "urlToImage": null, "publishedAt": "2020-04-24T07:19:00Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Mahabharat and Ramayan's success makes advertisers flock the series - Times of India", "description": "DD relaunched two of its very successful series, Ramayan and Mahabharat, to keep the viewers entertained during pan", "url": "https://timesofindia.indiatimes.com/tv/news/hindi/mahabharat-and-ramayans-success-makes-advertisers-flock-the-series/articleshow/75343640.cms", "urlToImage": null, "publishedAt": "2020-04-24T07:02:00Z", "content": null}, {"source": {"id": null, "name": "Spotboye.com"}, "author": "Divya Ramnani", "title": "Amid Breakup Rumours, Rithvik Dhanjani Wishes Asha Negi For Upcoming Web Show; Lady Responds Cordially - SpotboyE", "description": "While the internet is buzzing with their breakup rumours, Rithvik Dhanjani promotes Asha Negi’s upcoming show on his Insta; check out her response", "url": "https://www.spotboye.com/television/television-news/amid-breakup-rumours-rithvik-dhanjani-wishes-asha-negi-for-upcoming-web-show-lady-responds-cordially/5ea27a6b74f5ce660a2255e4", "urlToImage": null, "publishedAt": "2020-04-24T05:37:50Z", "content": "After Rithvik Dhanjani, Asha Negi Shares Cryptic Post About Being Able To Grow; Posts Old Pic Of A Lovely Evening With Him"}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "PTI", "title": "Police complaint against Kangana Ranaut over remark - Deccan Herald", "description": "A complaint has been filed with police against Bollywood actor Kangana Ranaut for allegedly referring to members of a particular community as terrorists in a video released in support of her sister Rangoli Chandel, an official said on Friday. The complaint wa…", "url": "https://www.deccanherald.com/entertainment/police-complaint-filed-against-kangana-ranaut-over-terrorist-remark-829229.html", "urlToImage": null, "publishedAt": "2020-04-24T05:28:32Z", "content": "A complaint has been filed with police against Bollywood actor Kangana Ranaut for allegedly referring to members of a particular community as terrorists in a video released in support of her sister Rangoli Chandel, an official said on Friday.\r\nThe complaint w… [+604 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Anushka Sharma is mighty impressed by Virat Kohli’s skills at guessing gibberish: ‘Ladke ko sab pata... - Hindustan Times", "description": "Anushka Sharma tried her hand at the viral Guess The Gibberish challenge on Instagram with some help from husband Virat Kohli.", "url": "https://www.hindustantimes.com/bollywood/anushka-sharma-is-mighty-impressed-by-virat-kohli-s-skills-at-guessing-gibberish-ladke-ko-sab-pata-hai/story-qyDxILQ7Fu09Zl0n6ZAQhO.html", "urlToImage": null, "publishedAt": "2020-04-24T05:24:00Z", "content": "If Virat Kohli ever gets bored of cricket, he can totally pursue a career as wife Anushka Sharma’s gibberish translator, considering how good he is at it. Like all of Instagram right now, Anushka is also obsessed with the ‘Guess The Gibberish’ challenge on th… [+1527 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Meghan Markle's privacy action against tabloid goes to London High Court - India Today", "description": "Meghan Markle is suing Associated Newspapers over articles that its Mail on Sunday newspaper had printed in February 2019.", "url": "https://www.indiatoday.in/lifestyle/celebrity/story/meghan-markle-s-privacy-action-against-tabloid-goes-to-london-high-court-1670393-2020-04-24", "urlToImage": null, "publishedAt": "2020-04-24T03:22:08Z", "content": "The first court hearing in a privacy case brought by Meghan Markle, Britain's Duchess of Sussex, against a tabloid newspaper for printing part of one of her letters will take place at London's High Court on Friday.\r\nMeghan, wife of Queen Elizabeth's grandson … [+2652 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Dr. Prem Kumar Sharma & Manisha Koushik", "title": "Horoscope Today: Astrological prediction for April 24, what’s in store for Aries, Leo, Virgo, Sagittarius... - Hindustan Times", "description": "Horoscope Today: Are the stars lined up in your favour? Find out the astrological prediction for Aries, Leo, Virgo, Sagittarius and other zodiac signs for April 24.", "url": "https://www.hindustantimes.com/more-lifestyle/horoscope-today-astrological-prediction-for-april-24-what-s-in-store-for-aries-leo-virgo-sagittarius-and-other-zodiac-signs/story-EZDrL2PXV50ThdTEjuQavJ.html", "urlToImage": null, "publishedAt": "2020-04-24T01:35:00Z", "content": "All 12 signs in the zodiac calendar have their own personality traits. Horoscopes give us a hint about how the day is going to fare for all of us. Read on to know whether the odds will be in your favour today:\r\n*Aries (March 21-April 20) A new project will pr… [+8088 chars]"}, {"source": {"id": null, "name": "Khaleejtimes.com"}, "author": "None", "title": "Anita Raaj in trouble for allegedly hosting party amid lockdown - wknd.", "description": "A complaint has been registered against actress Anita Raaj for allegedly throwing a party amid the ongoing COVID-19 lockdown....", "url": "https://www.khaleejtimes.com/citytimes/bollywood/anita-raaj-in-trouble-for-allegedly-hosting-party-amid-lockdown", "urlToImage": null, "publishedAt": "2020-04-23T23:08:27Z", "content": "A complaint has been registered against actress Anita Raaj for allegedly throwing a party amid the ongoing COVID-19 lockdown.\r\nAnita and her filmmaker husband Sunil Hingorani were reportedly accused by neighbours for hosting a party for their friends, reports… [+605 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Anthony D'Alessandro", "title": "‘Lion King’ Leaves Huge Paw Print As No. 3 On Deadline’s 2019 Most Valuable Blockbuster Tournament - Deadline", "description": "When it comes to evaluating the financial performance of top movies, it isn’t about what a film grosses at the box office. The true tale is told when production budgets, P&A, talent participations and other costs collide with box office grosses and ancillary …", "url": "https://deadline.com/2020/04/the-lion-king-movie-profit-2019-jon-favreau-1202916432/", "urlToImage": null, "publishedAt": "2020-04-23T21:30:50Z", "content": "When it comes to evaluating the financial performance of top movies, it isn’t about what a film grosses at the box office. The true tale is told when production budgets, P&amp;A, talent participations and other costs collide with box office grosses and ancill… [+2957 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Iconic TV shows Ramayan, Mahabharat rule the TRP charts - Times of India", "description": "Ramanand Sagar’s Ramayan and BR Chopra’s Mahabharat are the most viewed shows on TV. The lockdown period had done w", "url": "https://timesofindia.indiatimes.com/tv/news/hindi/iconic-tv-shows-ramayan-mahabharat-rule-the-trp-charts/articleshow/75326110.cms", "urlToImage": null, "publishedAt": "2020-04-23T13:51:00Z", "content": null}, {"source": {"id": null, "name": "Iwmbuzz.com"}, "author": "Editorial Team", "title": "Dhvani Bhanushali songs to listen to during quarantine - IWMBuzz", "description": "Dhvani Bhanushali the pop singer of today’s era has gained name and fame for her song rendition. And we pick her best work for this quarantine playloop.", "url": "https://www.iwmbuzz.com/music/snippets-music/dhvani-bhanushali-songs-listen-quarantine/2020/04/23", "urlToImage": null, "publishedAt": "2020-04-23T12:18:12Z", "content": "Dhvani Bhanushali is a glam-doll singer who has gained name and fame at a very young age. Her soothing vocals and great voice tonality puts her at the top in the elite group of singers.\r\nHer Live performances are a rage and an instant hit. Her songs are playe… [+469 chars]"}, {"source": {"id": null, "name": "Gqindia.com"}, "author": "rimi chakraborty", "title": "7 TV shows and movies on Netflix, Amazon Prime Video, ZEE5 that predicted the future - GQ India", "description": "Who said scriptwriters cannot predict the future? Here are 7 shows and movies on Netflix, Amazon Prime Video, ZEE5 that accurately predicted the future.", "url": "https://www.gqindia.com/binge-watch/collection/7-tv-shows-movies-on-netflix-amazon-prime-video-zee5-predicted-future/", "urlToImage": null, "publishedAt": "2020-04-23T11:35:14Z", "content": null}]}