{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Abplive.com"}, "author": "todaynewspaper.in", "title": "Ramadan 2020: Bigg Boss Winner Dipika Kakar, Hubby Shoaib Share Glimpses Of Their First Sehri Wishing Fans Chand Mubarak! - Todaynewspaper", "description": "The Sasural Simar Ka fame actress looks flawless in no makeup look while covering her head with a white dupatta. By : ABP News Bureau | 25 Apr 2020 01:29 PM (IST) As the Holy month of Ramadan began on April 23, former Bigg Boss winner & popular TV actress Dip…", "url": "https://news.abplive.com/entertainment/television/ramadan-2020-bigg-boss-winner-dipika-kakar-hubby-shoaib-share-glimpses-of-their-first-sehri-wishing-fans-chand-mubarak-1206087", "urlToImage": null, "publishedAt": "2020-04-25T13:52:55Z", "content": "As the Holy month of Ramadan began on April 23, former Bigg Boss winner &amp; popular TV actress Dipika Kakar and husband Shoaib Ibrahim shared several pictures and videos as they celebrated the commencement of the month of Ramzan. The TV couple took to socia… [+889 chars]"}, {"source": {"id": null, "name": "Telugucinema.com"}, "author": "tc editor", "title": "Sleeping 9 hours daily during the lockdown: Vijay Deverakonda - Telugu Cinema", "description": "Handsome hunk Vijay Deverakonda revealed that he’s sleeping nine and half hours daily on an average during this lockdown period as opposed to a six-hour sleep routine. He made a video of his daily routine during this period. Taking a cue from director Siva Ko…", "url": "https://www.telugucinema.com/news/sleeping-9-hours-daily-during-lockdown-vijay-deverakonda", "urlToImage": null, "publishedAt": "2020-04-25T13:33:29Z", "content": "Handsome hunk Vijay Deverakonda revealed that hes sleeping nine and half hours daily on an average during this lockdown period as opposed to a six-hour sleep routine. He made a video of his daily routine during this period.\r\nTaking a cue from director Siva Ko… [+621 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Arushi Jain", "title": "Hundred: 100 marks to Rinku Rajguru and Lara Dutta - The Indian Express", "description": "Watch Hundred for Rinku Rajguru and Lara Dutta's performance. Though not binge-watch worthy, it does provide some laughs.", "url": "https://indianexpress.com/article/entertainment/opinion-entertainment/hundred-hotstar-100-marks-to-rinku-rajguru-and-lara-dutta-6378956/", "urlToImage": null, "publishedAt": "2020-04-25T13:33:27Z", "content": "Written by Arushi Jain\r\n | New Delhi | \r\nPublished: April 25, 2020 6:58:41 pm\r\nHundred, starring Lara Dutta and Rinku Rajguru, is streaming on Disney Plus Hotstar.Hundred is about two women, Netra Patil (Rinku Rajguru) and Saumya Shukla (Lara Dutta). Netra, w… [+2368 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Irrfan Khan's mother Saeda Begum dies at 95, actor unable to fly back to India - Hindustan Times", "description": "Actor Irrfan Khan’s mother, Saeda Begum, has died at the age of 95. Irrfan isn’t in the country.", "url": "https://www.hindustantimes.com/bollywood/irrfan-khan-s-mother-saeda-begum-dies-at-95-actor-unable-to-fly-back-to-india/story-Sk4rI0b0sNIv57wv3VJTHL.html", "urlToImage": null, "publishedAt": "2020-04-25T13:09:25Z", "content": "Bollywood actor Irrfan Khan's mother Saeda Begum died on Saturday morning, according to ANI. She was 95.\r\nShe belonged to the Nawab family of Tonk, and was unwell for a long time. She died due to natural causes. Saeda resided in the Beniwal Kanta Krishna Colo… [+625 chars]"}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": "twinklekhanna", "title": "When Janhvi Kapoor and Khushi Kapoor’s offbeat yet stylish looks stole the show on the red carpet - PINKVILLA", "description": "Janhvi Kapoor and Khushi Kapoor have always rocked the red carpet with their style. In a throwback photo, both Janhvi and Khushi prove why they are the style icons of Gen-Y. Check it out.", "url": "https://www.pinkvilla.com/entertainment/news/when-janhvi-kapoor-and-khushi-kapoor-s-offbeat-yet-stylish-looks-stole-show-red-carpet-527471", "urlToImage": null, "publishedAt": "2020-04-25T13:05:39Z", "content": null}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Karan Johar Wants To Cry After Being Called An Elephant By Daughter Roohi, Watch Video - News18", "description": "Karan Johar filmed a video and shared with his online family where he is playing a game with his toddlers.", "url": "https://www.news18.com/news/movies/karan-johar-wants-to-cry-after-being-called-an-elephant-by-daughter-roohi-watch-video-2592577.html", "urlToImage": null, "publishedAt": "2020-04-25T13:02:52Z", "content": "Filmmaker Karan Johar came back with the second season of Lockdown with Johars after the first got exceptionally admired by the viewers. The Season 2 along with his kids, Yash and Roohi are now rolling in full swing.\r\nKaran filmed a video and shared with his … [+1294 chars]"}, {"source": {"id": null, "name": "Bollywoodhungama.com"}, "author": "Bollywood Hungama", "title": "Sobhita Dhulipala issues clarification after being accused of lying about self-shot images for magazine cover - Bollywood Hungama", "description": "Sobhita Dhulipala issues clarification after being accused of lying about self-shot images for magazine cover. Latest Bollywood News, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News at Bollywood Hungama.com", "url": "https://www.bollywoodhungama.com/news/features/sobhita-dhulipala-issues-clarification-accused-lying-self-shot-images-magazine-cover/", "urlToImage": null, "publishedAt": "2020-04-25T12:31:44Z", "content": "Sobhita in her post mentioned that she self-styled and shot her images for the magazine. However, when an image of her being clicked by another person surfaced online, people accused her of lying. The actress later issued a clarification on the same.\r\nTaking … [+1519 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Uday Bhatia", "title": "Film review: ‘Extraction’ on Netflix is a joyless slab of action cinema - Livemint", "description": "Chris Hemsworth lays waste to Dhaka in order to save an Indian drug lord’s kidnapped son in this Netflix film written by Joe Russo", "url": "https://www.livemint.com/mint-lounge/features/film-review-extraction-on-netflix-is-a-joyless-slab-of-action-cinema-11587817372674.html", "urlToImage": null, "publishedAt": "2020-04-25T12:29:38Z", "content": "Sometimes the smallest detail can trip up your experience of a movie. Forty minutes into Extraction, Tyler (Chris Hemsworth) and Ovi (Rudhraksh Jaiswal) are dodging gunmen in a Dhaka building. They break into an apartment, and the famous intro to Didi Tera De… [+3823 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "IANS", "title": "Suriya’s ‘Soorarai Pottru’ could be banned, if Jyothika’s ‘Pon Magal Vandhal’ releases directly on OTT - The Hindu", "description": "Tamil Nadu Theatre And Multiplex Owners’ Association respond to expected release of Jyothika’s film on Amazon Prime next month", "url": "https://www.thehindu.com/entertainment/movies/suriyas-soorarai-pottru-could-be-banned-if-jyothikas-pon-magal-vandhal-releases-directly-on-ott/article31432944.ece", "urlToImage": null, "publishedAt": "2020-04-25T12:25:03Z", "content": "The Tamil Nadu Theatre And Multiplex Owners Association have threatened to ban films starring Suriya, as well as the films produced by his production company 2D films. The decision comes after the news that the film Pon Magal Vandhal, produced by Suriya and s… [+1831 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "When Sunny Deol ripped his pants in anger after Shah Rukh Khan stole the limelight in Darr - Hindustan Times", "description": "Sunny Deol and Shah Rukh Khan were said to have had a falling out after Shah Rukh’s villainous character was given a more favourable portrayal in their 1993 film Darr.", "url": "https://www.hindustantimes.com/bollywood/when-sunny-deol-ripped-his-pants-in-anger-after-shah-rukh-khan-stole-the-limelight-in-darr/story-a8WZApceYKT72r0f67YUiL.html", "urlToImage": null, "publishedAt": "2020-04-25T12:20:00Z", "content": "Sunny Deol and Shah Rukh Khan didn’t speak to each other for 16 years after Shah Rukh, who played the antagonist in 1993’s Darr, was believed to have been a more fan-friendly portrayal in the film by director Yash Chopra. Sunny in an appearance on Aap Ki Adal… [+1854 chars]"}, {"source": {"id": null, "name": "Khaleejtimes.com"}, "author": "IANS", "title": "Popular Indian actor passes away at his residence - wknd.", "description": "Popular Malayalam TV serial actor Ravi Vallathol passed away at his residence, in Thiruvananthapuram on Saturday. He was 67 and is survived ...", "url": "https://www.khaleejtimes.com/citytimes/south-stars/popular-indian-actor-passes-away-at-his-residence", "urlToImage": null, "publishedAt": "2020-04-25T12:16:14Z", "content": "Popular Malayalam TV serial actor Ravi Vallathol passed away at his residence, in Thiruvananthapuram on Saturday. He was 67 and is survived by his wife.\r\nThough he began in the Malayalam film industry as a lyricist and then as an actor, he was a favourite amo… [+419 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "How to use Instagram's new Challenges stickers in your stories - Hindustan Times", "description": "You can nominate your friends and also rise up to a challenge you have been nominated for with the appropriate stickers", "url": "https://www.hindustantimes.com/tech/how-to-use-instagram-s-new-challenges-stickers-in-your-stories/story-Z93NUNIMRf5i5HrvFNNT4J.html", "urlToImage": null, "publishedAt": "2020-04-25T11:53:25Z", "content": "Instagram has launched a new ‘Challenges’ sticker in the Stories gallery. Starting this Saturday, Instagram is testing this feature that makes it easy to join challenges through a sticker, via the stories text tool, or from nominations from friends.\r\n“We’ve s… [+1662 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Virat Kohli thanks Anushka Sharma for switching on lights during live chat with AB de Villiers: 'Thanks my love' - Hindustan Times", "description": "Virat Kohli expressed his gratitude to wife Anushka Sharma after she turned on the lights during his live chat session on Friday.", "url": "https://www.hindustantimes.com/bollywood/virat-kohli-thanks-anushka-sharma-for-switching-on-lights-during-live-chat-with-ab-de-villiers-thanks-my-love/story-LEezrrdrYGBl9aUKEvvY3M.html", "urlToImage": null, "publishedAt": "2020-04-25T11:32:00Z", "content": "Actor Anushka Sharma is every bit a considerate wife to her cricketer husband Virat Kohli. It was evident on Friday when Virat was conducting an Instagram Live with AB de Villiers. A sweet gesture by Anushka made Virat smile. \r\nAs it grew dark out during thei… [+1612 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Instagrammer of the Week: Pavitra Rishta fame Asha Negi’s style statements are chic and glamorous - Times of India", "description": "You might be seeing Asha Negi on-screen in simple salwar-kameez in her TV show Baarish, but off-screen her style statements are quite chic and glamorous. This week, we have her as our social media style maker. Take a look:", "url": "https://timesofindia.indiatimes.com/tv/news/hindi/instagrammer-of-the-week-pavitra-rishta-fame-asha-negis-style-statements-are-chic-and-glamorous/photostory/75358318.cms", "urlToImage": null, "publishedAt": "2020-04-25T11:30:00Z", "content": null}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Mugdha Godse opens up about equation with Rahul Dev's son for the first time - Hindustan Times", "description": "Mugdha Godse, who has been with Rahul Dev for seven years, has spoken about her equation with his son.", "url": "https://www.hindustantimes.com/bollywood/mughda-godse-opens-up-about-equation-with-rahul-dev-s-son-for-the-first-time/story-mQ7Yyu2WdmaMIZTYr9cAJP.html", "urlToImage": null, "publishedAt": "2020-04-25T11:13:00Z", "content": "Actor Mugdha Godse has spoken about her equation with partner Rahul Dev’s son, Siddharth, from a previous relationship. Mugdha and Rahul have been dating for seven years. \r\n“It (our equation) is very good. He is such a kind and loving boy. He is very well bro… [+1258 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Shruti Mukherjee", "title": "Shaheen Bhatt shares a list of things thatll happen in the future, Parineeti is shaken - Republic World - Republic World", "description": "Shaheen Bhatt on Instagram has shared a list of things that she expects will happen in the future and this has left Parineeti Chopra \"shaken\". Read on to know", "url": "https://www.republicworld.com/entertainment-news/bollywood-news/shaheen-bhatt-shares-a-list-of-things-thatll-happen-in-the-future.html", "urlToImage": null, "publishedAt": "2020-04-25T10:46:48Z", "content": "As many know already, Shaheeh Bhatt is the second of Mahesh Bhatt's daughter, elder sister of Alia Bhatt and half-sister of Pooja Bhatt. However, she chose to stay away from the acting world and recently became popular for her book on overcoming depression. S… [+2197 chars]"}, {"source": {"id": null, "name": "Bollywoodhungama.com"}, "author": "Bollywood Hungama", "title": "Ajay Devgn releases song ‘Thahar Ja’ that urges people to stay calm and happy - Bollywood Hungama", "description": "Ajay Devgn releases song ‘Thahar Ja’ that urges people to stay calm and happy. Latest Bollywood News, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News at Bollywood Hungama.com", "url": "https://www.bollywoodhungama.com/news/bollywood/ajay-devgn-releases-song-thahar-ja-urges-people-stay-calm-happy/", "urlToImage": null, "publishedAt": "2020-04-25T10:27:12Z", "content": "The song that features Ajay Devgn was shot at home by him. The song also features his 9-year-old son Yug. Talking about the song, Ajay said that the song was penned by Anil Verma who has written songs for Tanhaji:The Unsung Warrior as well. Ajay said that the… [+469 chars]"}, {"source": {"id": null, "name": "Bollywoodhungama.com"}, "author": "Bollywood Hungama", "title": "SCOOP: A major OTT player offers Rs. 143 crore for 83? Reliances Shibhashish Sarkar clarifies - Bollywood Hungama", "description": "SCOOP: A major OTT player offers Rs. 143 crore for ’83? Reliance’s Shibhashish Sarkar clarifies. Latest Bollywood News, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News at Bollywood Hungama.com", "url": "https://www.bollywoodhungama.com/news/bollywood/scoop-major-ott-player-offers-rs-143-crore-83-reliances-shibhashish-sarkar-clarifies/", "urlToImage": null, "publishedAt": "2020-04-25T10:27:02Z", "content": "Recently, the trade circles was abuzz with reports that the much-awaited film '83, based on the spectacular victory of Indian cricket team in the 1983 World Cup, might not release in cinemas. According to the speculation, a big OTT platform with worldwide rea… [+2551 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Throwback: When Mahabharat actors got emotional on the last day of shoot - Times of India", "description": "Mahabharat's rerun has been welcomed by telly viewers during the coronavirus lockdown. Such is the interest in the mythological show that every episode and sequence of the show is discussed on social media. Recently, a video surfaced online from the last day …", "url": "https://timesofindia.indiatimes.com/tv/news/hindi/throwback-when-mahabharat-actors-got-emotional-on-the-last-day-of-shoot/photostory/75374401.cms", "urlToImage": null, "publishedAt": "2020-04-25T09:37:52Z", "content": null}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Milind Soman says Ankita Konwar was cool with his sex scenes in Four More Shots Please!: ‘She was actually... - Hindustan Times", "description": "Days after they celebrated their second wedding anniversary, Milind Soman talks about wife Ankita Konwar’s reaction to his intimate scenes in web series, Four More Shots Please!.", "url": "https://www.hindustantimes.com/bollywood/milind-soman-says-ankita-konwar-was-cool-with-his-sex-scenes-in-four-more-shots-please-she-was-actually-very-excited/story-XmiImsEdVfK5pmksvrTdyN.html", "urlToImage": null, "publishedAt": "2020-04-25T09:27:00Z", "content": "Actor Milind Soman has revealed wife Ankita Konwar was “very excited” about his sex scenes from the web series Four More Shots Please! which also featured him walking in underwear.\r\nMilind told Pinkvilla in an interview, “She was very cool with it (intimate s… [+1598 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Neena Gupta in new video: If men can burp in public, why can't women? - India Today", "description": "Neena Gupta shared a video on Instagram and asked why women can't burp in public if men can.", "url": "https://www.indiatoday.in/lifestyle/celebrity/story/neena-gupta-in-new-video-if-men-can-burp-in-public-why-can-t-women-1670941-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T09:20:45Z", "content": "Neena Gupta discussed a significant subject with her Instagram fans and followers on Saturday as she questioned the stigma around women \"farting\" and \"burping\" in public. \"Aurton ko gas nahi hoti (Women don't have gas),\" Neena Gupta said in a sarcastic remark… [+2650 chars]"}, {"source": {"id": null, "name": "Asianetnews.com"}, "author": null, "title": "Candid pics of Abhishek Bachchan, Aishwarya Rai Bachchan show pure love - Asianet News English", "description": "Given the fact Aishwarya Rai Bachchan and Abhishek Bachchan share an amazing relationship and continue to give people major relationship goals, here are a few throwback candid photos of the couple.", "url": "https://newsable.asianetnews.com/gallery/entertainment/candid-pics-of-abhishek-bachchan-aishwarya-rai-bachchan-show-pure-love-q9c6wy", "urlToImage": null, "publishedAt": "2020-04-25T09:14:37Z", "content": "During the promotions of his film Happy New Year, Abhishek Bachchan opened up about his strong bond with Aishwarya Rai saying, \"Shes very down-to-earth, rooted, simple and real. Shes very beautiful, which everyone knows. But as a person, she is far more beaut… [+179 chars]"}, {"source": {"id": null, "name": "Tellychakkar.com"}, "author": "Tellychakkar Team", "title": "Mahira Sharma reveals why she is not in touch with Sidharth Shukla - Tellychakkar", "description": "Mahira Sharma has her own reason to not be in contact with Sidharth Shukla.", "url": "https://www.tellychakkar.com/tv/tv-news/mahira-sharma-reveals-why-she-not-touch-sidharth-shukla-200425", "urlToImage": null, "publishedAt": "2020-04-25T08:40:00Z", "content": "MUMBAI: Mahira Sharma and Paras Chhabra grabbed a lot of attention for their growing closeness in the Bigg Boss 13 house.\r\nWhile both have maintained 'just good friends' status, fans are constantly linking them.\r\nWe all know Sidharth Shukla and Paras Chhabra … [+603 chars]"}, {"source": {"id": null, "name": "Spotboye.com"}, "author": "Neeki Singh", "title": "Shaheer Sheikh On Mahabharat: 'Couldn't Speak To Anyone For 10-15 Days After Shooting The Draupadi Cheer-Haran Scene, Made Me Terribly Sad'- EXCLUSIVE - SpotboyE", "description": "STAR Plus' Mahabharat, starring Shaheer Sheikh as Arjun, is being rerun currently. We spoke to the actor about the show and also about the memories attached with the character which brought him to the limelight", "url": "https://www.spotboye.com/television/tv-interviews/shaheer-sheikh-on-mahabharat-couldn-t-speak-to-anyone-for-10-15-days-after-shooting-the-draupadi-cheer-haran-scene-made-me-terribly-sad-exclusive/5ea3f51374f5ce660a22570f", "urlToImage": null, "publishedAt": "2020-04-25T08:35:29Z", "content": "Don't MissKundali Bhagya: Mahira Sharma, Shraddha Arya And Anjum Fakih Flaunt Their Killer Moves In This Throwback Video"}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": "Pinkvilla Desk", "title": "Hrithik Roshan chats with his sons as he enjoys ‘Summer of Lockdown’ while Sussanne Khan captures them; Watch - PINKVILLA", "description": "Sussanne Khan captures Hrithik Roshan and sons as they enjoy Lockdown sunsets; Take a look", "url": "https://www.pinkvilla.com/entertainment/news/hrithik-roshan-chats-his-sons-he-enjoys-summer-lockdown-while-sussanne-khan-captures-them-watch-527391", "urlToImage": null, "publishedAt": "2020-04-25T08:08:42Z", "content": null}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Eric Robinette", "title": "'Captain America': Chris Evans' Mom Convinced Him to Take Marvel's Iconic Steve Rogers Role - Showbiz Cheat Sheet", "description": "The last time audiences saw Chris Evans, people were making a big deal out of the very cozy-looking sweater he wore in the whodunit Knives Out, which", "url": "https://www.cheatsheet.com/entertainment/captain-america-chris-evans-mom-convinced-him-to-take-marvels-iconic-steve-rogers-role.html/", "urlToImage": null, "publishedAt": "2020-04-25T08:07:23Z", "content": "The last time audiences saw Chris Evans, people were making a big deal out of the very cozy-looking sweater he wore in the whodunit Knives Out, which turned out to be a refreshing stepping stone out from the long shadow of Steve Rogers in the Marvel Cinematic… [+3135 chars]"}, {"source": {"id": null, "name": "Bollywoodhungama.com"}, "author": "Bollywood Hungama", "title": "Malaika Arora shares a sun-kissed selfie, pens a note of gratitude amid lock-down - Bollywood Hungama", "description": "Malaika Arora shares a sun-kissed selfie, pens a note of gratitude amid lock-down. Latest Bollywood News, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News at Bollywood Hungama.com", "url": "https://www.bollywoodhungama.com/news/features/malaika-arora-shares-a-sun-kissed-selfie-pens-a-note-of-gratitude-amid-lock-down/", "urlToImage": null, "publishedAt": "2020-04-25T08:04:03Z", "content": "Malaika Arora, who is spending the lock-down with beau Arjun Kapoor, is indulging in cooking, working out from home or is plain chilling. On Instagram, she shared a sun-kissed selfie of herself, expressing gratitude about the fact that she is safe amid this c… [+474 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Kanye West officially now a billionaire: Forbes - India Today", "description": "Forbes said that Kanye West has been pressing the magazine for years to be listed as one of its mega-rich but that it declined.", "url": "https://www.indiatoday.in/lifestyle/celebrity/story/kanye-west-officially-now-a-billionaire-forbes-1670924-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T07:54:05Z", "content": "Rapper Kanye West is now a billionaire, thanks largely to the basketball shoes bearing his name that he developed with Adidas, Forbes magazine said on Friday.\r\nThe rough figure of the wealth of Kim Kardashian's hubby is USD 1.3 billion, the magazine said in a… [+1074 chars]"}, {"source": {"id": null, "name": "Ibtimes.co.in"}, "author": "Pramod Gaikwad", "title": "Deepika Padukone should stop interfering in my life and concentrate on her work: Kangana Ranaut [Throwback] - International Business Times, India Edition", "description": "Deepika Padukone and Kangana Ranaut have been at loggerheads ever since Deepika won the Best Actress award for her performance in Happy New Year over Kangana's role in Queen at an award function in 2014.", "url": "https://www.ibtimes.co.in/deepika-padukone-should-stop-interfering-my-life-concentrate-her-work-kangana-ranaut-throwback-818381", "urlToImage": null, "publishedAt": "2020-04-25T07:52:34Z", "content": "Kangana Ranaut had never shied away from expressing her dislike for Deepika Padukone on a public platform. The two have been at loggerheads ever since Deepika won the Best Actress award for her performance in Happy New Year over Kangana's role in Queen at an … [+2312 chars]"}, {"source": {"id": null, "name": "Ibtimes.co.in"}, "author": "Parismita Goswami", "title": "When Dimple Kapadia warned Twinkle Khanna about 'gay' Akshay Kumar [Throwback] - International Business Times, India Edition", "description": "Twinkle Khanna said that her mother Dimple Kapadia told her of Akshay Kumar's sexual orientation when the actor had visited her house to ask for her hand in marriage.", "url": "https://www.ibtimes.co.in/when-dimple-kapadia-warned-twinkle-khanna-about-gay-akshay-kumar-throwback-818376", "urlToImage": null, "publishedAt": "2020-04-25T07:52:32Z", "content": "Akshay kumar's advice on quarantine \r\nAkshay Kumar and Twinkle Khanna are one of the most adorable couples of Bollywood. It is known that Twinkle is a witty person and her unapologetic and unabashed comments often leaves Khiladi actor embarrassed and it was w… [+1704 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Adil Khan", "title": "Who has Triple H dated before marrying WWE Chairmans daughter Stephanie McMahon? - Republic World - Republic World", "description": "Who has Triple H dated? Before dating Stephanie McMahon, Triple H was dating his D-Generation X teammate and former Diva's champion, Chyna.", "url": "https://www.republicworld.com/sports-news/wwe-news/who-has-triple-h-dated-before-marrying-stephanie-mcmahon.html", "urlToImage": null, "publishedAt": "2020-04-25T07:28:53Z", "content": "Paul Levesque aka Triple H and Stephanie McMahon are seemingly the most powerful couple in WWE, right next to Vince and Linda McMahon. Triple H and Stephanie McMahon have been together for more than a decade and have dominated WWE in the ring and in the manag… [+2757 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Akshay Kumar's Laxmmi Bomb To Skip Theatrical Release And Premiere on Disney+Hotstar? - News18", "description": "The global viral scare reportedly seems to persuade Bollywood filmmakers and producers to release their upcoming titles on OTT platforms rather than delaying them.", "url": "https://www.news18.com/news/movies/akshay-kumars-laxmmi-bomb-to-skip-theatrical-release-and-premiere-on-disneyhotstar-2592117.html", "urlToImage": null, "publishedAt": "2020-04-25T07:11:35Z", "content": "It's a dreadful time for the film industry as cinema halls across the world remain closed amid the coronavirus crisis. The global viral scare reportedly seems to persuade Bollywood filmmakers and producers to release their upcoming titles on OTT platforms rat… [+1773 chars]"}, {"source": {"id": null, "name": "Indiaglitz.com"}, "author": "IndiaGlitz", "title": "9th wedding anniversary: Prithviraj's wife pens an emotional note - Malayalam News - IndiaGlitz.com", "description": "As actor Prithviraj Sukumaran remains stranded in Jordan, the actor and his wife Supriya couldn't celebrate their wedding anniversary together this year.", "url": "https://www.indiaglitz.com/9th-wedding-anniversary-prithvirajs-wife-pens-an-emotional-note-malayalam-news-258915", "urlToImage": null, "publishedAt": "2020-04-25T06:46:12Z", "content": "As actor Prithviraj Sukumaran remains stranded in Jordan, the actor and his wife Supriya couldn't celebrate their wedding anniversary together this year. The lovely couple got married nine years ago on this very same day in a private ceremony in Palakkad on A… [+896 chars]"}, {"source": {"id": null, "name": "Tellychakkar.com"}, "author": "Tellychakkar Team", "title": "THIS similarity between Divyanka Tripathi and Erica Fernandes will surprise you - Tellychakkar", "description": "There’s a similarity between Divyanka Tripathi and Erica Fernandes. Read on to know about it.", "url": "https://www.tellychakkar.com/tv/tv-news/similarity-between-divyanka-tripathi-and-erica-fernandes-will-surprise-you-200425", "urlToImage": null, "publishedAt": "2020-04-25T06:00:00Z", "content": "MUMBAI: Erica Fernandes and Divyanka Tripathi are two stunning TV actresses who never fail to mesmerize viewers. Both the ladies have been wooing audience with their acting chops and style statements. They enjoy an impressive fan following. But did you know t… [+1032 chars]"}, {"source": {"id": null, "name": "Thenewsminute.com"}, "author": null, "title": "Nithiin-Rashmika starrer ‘Bheeshma’ now streaming online - The News Minute", "description": "Nithiin and Rashmika fans rejoice! The duo’s last film, Bheeshma has been released online and is now streaming on Netflix and Sun NXT. Bheeshma is a romantic action comedy that was met with positive reviews upon its release. The film revolves around the prota…", "url": "https://www.thenewsminute.com/article/nithiin-rashmika-starrer-bheeshma-now-streaming-online-123314", "urlToImage": null, "publishedAt": "2020-04-25T05:46:31Z", "content": "The film released in February and was met with positive reviews.Nithiin and Rashmika fans rejoice! The duos last film, Bheeshma has been released online and is now streaming on Netflix and Sun NXT.\r\nBheeshma is a romantic action comedy that was met with posit… [+1670 chars]"}, {"source": {"id": null, "name": "Bollywoodhungama.com"}, "author": "Bollywood Hungama", "title": "On his birthday, Varun Dhawan donates towards daily wage labourers of the film industry - Bollywood Hungama", "description": "On his birthday, Varun Dhawan donates towards daily wage labourers of the film industry. Latest Bollywood News, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News at Bollywood Hungama.com", "url": "https://www.bollywoodhungama.com/news/bollywood/birthday-varun-dhawan-donates-towards-daily-wage-labourers-film-industry/", "urlToImage": null, "publishedAt": "2020-04-25T05:02:27Z", "content": "Ashoke Pandit who is the president of Indian Film and TV directors Association took to Twitter to thank Varun Dhawan for his contribution. Sharing the video he wrote, \"@fwice_mum  thanks @Varun_dvn for donating towards the daily wage workers of the entertainm… [+993 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Ramayan's Sita aka Dipika Chikhalia's real life wedding was attended by this Bollywood superstar; see pic - Times of India", "description": "Ramayan's rerun has led to curiosity around the life of its lead actors. Several unseen pictures of them from back", "url": "https://timesofindia.indiatimes.com/tv/news/hindi/ramayans-sita-aka-dipika-chikhalias-real-life-wedding-was-attended-by-this-bollywood-superstar-see-pic/articleshow/75369401.cms", "urlToImage": null, "publishedAt": "2020-04-25T04:53:00Z", "content": null}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Rajeev Khandelwal claims casting couch isn’t rape, Chris Evans steps out of Captain America image in... - Hindustan Times", "description": "From Rajeev Khandelwal talking about casting couch and the MeToo movement to the release of Chris Evans’ Defending Jacob, here are top news from world of entertainment.", "url": "https://www.hindustantimes.com/bollywood/rajeev-khandelwal-claims-casting-couch-isn-t-rape-chris-evans-steps-out-of-captain-america-image-in-defending-jacob/story-fmuP4LDtpAxdHpff8p9mDO.html", "urlToImage": null, "publishedAt": "2020-04-25T04:51:40Z", "content": "Rajeev Khandelwal says casting couch is not rape: ‘The one who gives in is equally responsible’\r\nActor Rajeev Khandelwal has shared his views on the prevalence of casting couch in the glamour industry and believes those who fall prey to the practice always ha… [+2695 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Spider-Man: Into the Spider-Verse Sequel Delayed Five Months In 2022 - Screen Rant", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiQ2h0dHBzOi8vc2NyZWVucmFudC5jb20vc3BpZGVybWFuLXNwaWRlci12ZXJzZS0yLXJlbGVhc2UtZGF0ZS1kZWxheS_SAUdodHRwczovL3NjcmVlbnJhbnQuY29tL3NwaWRlcm1hbi1zcGlkZXItdmVyc2UtMi1yZWxlYXNlLWRhdGUtZGVsYXkvYW1wLw?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T03:58:19Z", "content": null}, {"source": {"id": null, "name": "Bollywoodlife.com"}, "author": "Nirali Kanabar", "title": "It's expensive: When Katrina Kaif splurged Rs. 92,000 to look gorgeous at rumoured ex-boyfriend, Salman Khan' - Bollywood Life", "description": "Today, we are taking you back to Salman Khan's grand birthday bash where Katrina Kaif grabbed eyeballs for all the right reasons.", "url": "https://www.bollywoodlife.com/style/its-expensive-when-katrina-kaif-splurged-rs-92000-to-look-gorgeous-at-rumoured-ex-boyfriend-salman-khans-birthday-bash-1611259/", "urlToImage": null, "publishedAt": "2020-04-25T03:47:56Z", "content": "There's a dearth of Bollywood events due to the coronavirus lockdown. We haven't seen pictures of our celebrities flaunting their fashion ka jalwa for the longest time now. Hence, we are revisiting the times they made head turns in public because of their sar… [+2226 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Vicky Kaushal joins his neighbours to welcome a young resident: 'Our little warrior comes back home', watch - Hindustan Times", "description": "Vicky Kaushal posted a video from his building premises as a young girl got a warm welcome on her return. She seems to be the resident who had tested positive for Covid-19.", "url": "https://www.hindustantimes.com/bollywood/vicky-kaushal-joins-his-neighbours-to-welcome-a-young-resident-our-little-warrior-comes-back-home-watch/story-aAQ2AgpFDRWyoc0gyw81LK.html", "urlToImage": null, "publishedAt": "2020-04-25T03:46:26Z", "content": "Vicky Kaushal’s building was recently partially sealed after an 11-year-old resident tested positive for the novel coronavirus. The actor has now shared a video which shows the residents welcoming a young girl and a woman in the compound with a huge round of … [+2026 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Asim Riaz Can't Stop Gushing Over Himanshi As She Wishes 'Ramadan Mubarak' With Stunning Pic - News18", "description": "On Friday, Himanshi shared a gorgeous picture of herself to wish fans on the occasion of the onset of the holy month of Ramzan.", "url": "https://www.news18.com/news/movies/asim-riaz-cant-stop-gushing-over-himanshi-khurana-as-she-wishes-ramadan-mubarak-with-stunning-pic-2591913.html", "urlToImage": null, "publishedAt": "2020-04-25T03:44:44Z", "content": "They first met inside the Bigg Boss 13 house and since then Asim Riaz and Himanshi Khurana have been head-over-heels in love with each other. On Friday, Himanshi shared a gorgeous picture of herself to wish fans on the occasion of the onset of the holy month … [+1041 chars]"}, {"source": {"id": null, "name": "Iwmbuzz.com"}, "author": "Editorial Team", "title": "Yeh Rishtey Hain Pyaar Ke: Abir and Mishti’s HOT and SENSUOUS romance - IWMBuzz", "description": "Take a look at Abir and Mishti’s romantic sensuous sequence from Yeh Rishtey Hain Pyaar Ke", "url": "https://www.iwmbuzz.com/television/snippets/yeh-rishtey-hain-pyaar-ke-abir-mishtis-hot-sensuous-romance/2020/04/25", "urlToImage": null, "publishedAt": "2020-04-25T03:34:19Z", "content": "Yeh Rishtey Hain Pyaar Kes Abir and Mishtis jodi definitely would give strong competition to the other on-screen pairs in Indian television. The very warm and loving couple was welcomed and embraced by the loving fans of the show.\r\nIn the show, fans were trea… [+344 chars]"}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": "Pinkvilla Desk", "title": "Marvel’s Spider Man 3, Doctor Strange 2 and Thor: Love and Thunder shift release dates - PINKVILLA", "description": "Amid the ongoing Coronavirus pandemic, studios have shifted the date of Marvel’s Spider-Man 3 and Doctor Strange 2. Read on to know more.", "url": "https://www.pinkvilla.com/entertainment/hollywood/marvel-s-spider-man-3-doctor-strange-2-and-thor-love-and-thunder-shift-release-dates-527330", "urlToImage": null, "publishedAt": "2020-04-25T03:24:03Z", "content": null}, {"source": {"id": null, "name": "Iwmbuzz.com"}, "author": "Editorial Team", "title": "Parth Samthaan, Zain Imam, Shaheer Sheikh, Mohsin Khan’s Best Shoe Style Moments - IWMBuzz", "description": "Best shoe style moments of these celebs will fall into your head", "url": "https://www.iwmbuzz.com/television/photos/parth-samthaan-zain-imam-shaheer-sheikh-mohsin-khans-best-shoe-style-moments/2020/04/25", "urlToImage": null, "publishedAt": "2020-04-25T03:14:57Z", "content": "Parth Samthaan moved on to win hearts on the daily soap on Star Plus called Kasautii Zindagii Kay is seen sharing screen space with Erica Fernandes. The actor is appreciated for his amazing work which includes his great acting skills and dialogue delivery. Th… [+1274 chars]"}, {"source": {"id": null, "name": "Sportskeeda.com"}, "author": "Raunak Jaiswal", "title": "Roman Reigns takes a dig at tag team recently released by WWE - Sportskeeda", "description": "The former WWE tag team has been a thorn in Roman Reigns' side in the past.", "url": "https://www.sportskeeda.com/wwe/roman-reigns-takes-a-dig-at-tag-team-recently-released-by-wwe", "urlToImage": null, "publishedAt": "2020-04-25T02:49:10Z", "content": "Roman Reigns wasn't holding back in this exchange\r\nIn a shocking turn of events, WWE released over 20 Superstars in addition to furloughing backstage staff last week. To everyone's surprise, The Good Brothers Luke Gallows &amp; Karl Anderson were also among t… [+1792 chars]"}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": "Pinkvilla Desk", "title": "Varun Dhawan has Natasha by his side as he virtually celebrates birthday with Sara Ali Khan, Arjun & others - PINKVILLA", "description": "Varun Dhawan celebrated his 33rd birthday virtually with Coolie No 1 co-star Sara Ali Khan, Arjun Kapoor, Karan Johar and others.", "url": "https://www.pinkvilla.com/entertainment/news/varun-dhawan-has-natasha-his-side-he-virtually-celebrates-birthday-sara-ali-khan-arjun-others-527329", "urlToImage": null, "publishedAt": "2020-04-25T02:47:09Z", "content": null}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Yami Gautam Revisits First Day at School, Shares Childhood Pic in Uniform - News18", "description": "If you want to see actress Yami Gautam in school uniform then head to her Instagram profile right away.", "url": "https://www.news18.com/news/movies/yami-gautam-revisits-first-day-at-school-shares-childhood-pic-in-uniform-2591829.html", "urlToImage": null, "publishedAt": "2020-04-25T02:19:10Z", "content": "If you want to see actress Yami Gautam in school uniform then head to her Instagram profile right away. She has posted a picture of her first day in school.\r\n\"My first day to school! I am sure I did not know what it meant, but was just so excited to get dress… [+627 chars]"}, {"source": {"id": null, "name": "Iwmbuzz.com"}, "author": "Editorial Team", "title": "Aishwarya Rai Bachchan, Deepika Padukone, Anushka Sharma, Priyanka Chopra Jonas, Kareena Kapoor Khan: 8 Best Sabyasachi Casual Collection - IWMBuzz", "description": "IWMBuzz shows you gorgeous photos of these Bollywood beauties in Sabyasachi collection. Check out the photos below.", "url": "https://www.iwmbuzz.com/movies/celebrities-movies/aishwarya-rai-bachchan-deepika-padukone-anushka-sharma-priyanka-chopra-jonas-kareena-kapoor-khan-8-best-sabyasachi-casual-collection/2020/04/25", "urlToImage": null, "publishedAt": "2020-04-25T02:05:58Z", "content": null}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Sara Ali Khan Brings Back Her Knock-knock Series with Brother Ibrahim, Watch Hilarious Video - News18", "description": "Sara Ali Khan reprised her iconic knock-knock series with her brother Ibrahim where she made bad jokes with hilarious results amid the Coronavirus lockdown.", "url": "https://www.news18.com/news/movies/sara-ali-khan-brings-back-her-knock-knock-series-with-brother-ibrahim-watch-hilarious-video-2591593.html", "urlToImage": null, "publishedAt": "2020-04-25T01:41:31Z", "content": "Actress Sara Ali Khan is known for her wit and sense of humour on social media. Be it her \"shayaris\", throwback videos or even her knock-knock jokes, Sara keeps her fans entertained. Recently, the actress reprised her iconic knock-knock series with her brothe… [+679 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Samir Jain", "title": "Horoscope Today, 24 April 2020: Check astrological prediction for Leo, Virgo, Libra, Scorpio and other si - Times of India", "description": "Horoscope(Old) News: Wondering whether it will be a power-packed day or a dull, cumbersome one? We have you covered.", "url": "https://timesofindia.indiatimes.com/astrology/horoscope/horoscope-today-24-april-2020-check-astrological-prediction-for-leo-virgo-libra-scorpio-and-other-signs/articleshow/75315676.cms", "urlToImage": null, "publishedAt": "2020-04-25T00:46:52Z", "content": "Wondering whether it will be a power-packed day or a dull, cumbersome one? We have you covered. Read on to know what lies ahead today...Aries Today, you are blessed by moon, which may give you patience. Externally you may face some work related stress but you… [+4386 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Horoscope Today, April 25, 2020: Know what your stars have for you - India Today", "description": "Horoscope Today, April 25, 2020: Here's what the stars have in store for you on Saturday.", "url": "https://www.indiatoday.in/india/story/horoscope-today-april-25-2020-know-what-your-stars-have-for-you-1670847-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T00:01:38Z", "content": "Horoscope offers interesting and accurate insights. Let's find out what our stars have in store for us on Saturday, April 25.\r\nARIES Mar 21-Apr 20 Money will come your way from various sources and keeps your bank balance brimming. Though, you will not be in m… [+2355 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Rachana Dubey", "title": "#CoronaCrisis: Cinemas gear up to tackle a post-lockdown world, with some restrictions - Times of India", "description": "Temperature checks, mandatory masks and cross-seating are some of the measures being thought over", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/coronacrisis-cinemas-gear-up-to-tackle-a-post-lockdown-world-with-some-restrictions/articleshow/75362123.cms", "urlToImage": null, "publishedAt": "2020-04-24T21:14:00Z", "content": null}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Scott Mendelson", "title": "Tom Cruise’s ‘Mission: Impossible’ Has Shown Resilience Despite Release Date Delays And Long Waits - Forbes", "description": "History shows moviegoers will show up for Tom Cruise’s next Mission: Impossible sequels (now delayed to November of 2021 and 2022) for as long as it takes.", "url": "https://www.forbes.com/sites/scottmendelson/2020/04/24/mission-impossible-tom-cruise-rebecca-ferguson-box-office-delayed-coronavirus-james-bond-shazam/", "urlToImage": null, "publishedAt": "2020-04-24T20:12:19Z", "content": "Simon Pegg, Rebecca Ferguson, Tom Cruise and Ving Rhames in 'Mission Impossible Fallout'\r\nParamount\r\nHistory shows that moviegoers will show up for Tom Cruises next two Mission: Impossible sequels (which just got delayed to November of 2021 and 2022) for as l… [+5997 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "When Shah Rukh Khan warned Aamir Khan to not work with Kajol: ‘She is very bad, unfocused’ - Hindustan Times", "description": "Before they came to be known as one of Bollywood’s best romantic pairs, actors Shah Rukh Khan and Kajol got off on the wrong foot.", "url": "https://www.hindustantimes.com/bollywood/when-shah-rukh-khan-warned-aamir-khan-to-not-work-with-kajol-she-is-very-bad-unfocused/story-ohHuC9ZVW9pUEacCoSFHQK.html", "urlToImage": null, "publishedAt": "2020-04-24T16:23:00Z", "content": "They’re known as one of Bollywood’s finest romantic pairs, but did you know that Shah Rukh Khan and Kajol got off on the wrong foot when they first met? In fact, Shah Rukh confessed that he’d even warned Aamir Khan about her, calling her unfocused and ‘very b… [+1544 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Krishna Shroff, Eban Hyams make the most of quarantine, snuggle together in new pic. See here - Hindustan Times", "description": "Krishna Shroff and her boyfriend Eban Hyams are making the best use of their time together in quarantine. Check out their new picture.", "url": "https://www.hindustantimes.com/bollywood/krishna-shroff-eban-hyams-make-the-most-of-quarantine-snuggle-together-in-new-pic-see-here/story-AJHx1IIorfmtMtRt4Kkz5J.html", "urlToImage": null, "publishedAt": "2020-04-24T16:15:24Z", "content": "Actor Tiger Shroff’s sister, Krishna, is making the best use of her time with boyfriend Eban Hyams, during the nationwide coronavirus lockdown. Eban took to Instagram stories on Friday and shared a picture of the two of them enjoying themselves on the couch. … [+1133 chars]"}, {"source": {"id": null, "name": "Tellychakkar.com"}, "author": "Tellychakkar Team", "title": "Saif and Kareena Kapoor’s romantic picture is the best thing on the internet today - Tellychakkar", "description": "One of Bollywood's most talked couples, Bebo and Saif are setting an example of love to the world.", "url": "https://www.tellychakkar.com/movie/movie-news/saif-and-kareena-kapoor-s-romantic-picture-the-best-thing-the-internet-today-200424", "urlToImage": null, "publishedAt": "2020-04-24T15:26:00Z", "content": "MUMBAI: Kareena Kapoor has acted in several commercially successful films. She is also fondly called Bebo by her friends and family.\r\nShe is known in the Indian media for being outspoken and assertive, and is recognized for her contributions to the film indus… [+1459 chars]"}, {"source": {"id": null, "name": "Thenewsminute.com"}, "author": null, "title": "Revisiting 'Amarkalam', the film that brought Ajith and Shalini together - The News Minute", "description": "It would be an understatement to say that Amarkalam was an important film in Ajith's career. Not only did the 1999 film directed by Saran pave the way for the actor to do more action films, it was also on the sets of Amarkalam that Ajith fell in love with his…", "url": "https://www.thenewsminute.com:443/article/revisiting-amarkalam-film-brought-ajith-and-shalini-together-123255", "urlToImage": null, "publishedAt": "2020-04-24T14:14:05Z", "content": "The couple completes 20 years of marriage on April 24.It would be an understatement to say that Amarkalam was an important film in Ajith's career. Not only did the 1999 film directed by Saran pave the way for the actor to do more action films, it was also on … [+5298 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Danny Cyril D Cruze", "title": "Aarogya Setu App: How Bluetooth helps in identifying Covid-19 suspects - Livemint", "description": "The government-owned application is being posed as the primary contact tracing tool in India.Many organisations are planning to include the app in their daily operations to identify potential cases", "url": "https://www.livemint.com/technology/tech-news/aarogya-setu-app-how-bluetooth-helps-in-identifying-covid-19-suspects-11587730877077.html", "urlToImage": null, "publishedAt": "2020-04-24T12:51:31Z", "content": "Many food-delivery services have mandated the use of Aarogya Setu app for their delivery personnel. The government-owned application is being posed as the primary contact tracing tool in India. During Prime Minister Narendra Modis address to the nation, while… [+2367 chars]"}, {"source": {"id": null, "name": "Indiaglitz.com"}, "author": "IndiaGlitz", "title": "Mahesh Babu gives solid feedback on 2-minute massage! - Telugu News - IndiaGlitz.com", "description": "Mahesh Babu's family time is productive.  The other day, Sitara turned into a head massage volunteer as her dad was busy watching Gautham play his game.", "url": "https://www.indiaglitz.com/mahesh-babu-gives-solid-feedback-on-2-minute-massage-telugu-news-258876", "urlToImage": null, "publishedAt": "2020-04-24T12:49:59Z", "content": "Mahesh Babu's family time is productive. The other day, Sitara turned into a head massage volunteer as her dad was busy watching Gautham play his game. \r\n\"Watching GG (Gautham Ghattamaneni) play his game! MB had a head massage volunteer only to finish in 2 mi… [+562 chars]"}, {"source": {"id": null, "name": "Indiaglitz.com"}, "author": "IndiaGlitz", "title": "Re-Imagining Money Heist With A Mollywood Cast - Malayalam News - IndiaGlitz.com", "description": "Well, we've been thinking of a Malayalam version of Mony Heist the entire star cast. From Prithviraj to Roshan Abdul Rahoof, check out M'Town actors who could be a perfect fit.", "url": "https://www.indiaglitz.com/re-imagining-money-heist-with-a-mollywood-cast-malayalam-news-258868", "urlToImage": null, "publishedAt": "2020-04-24T12:23:54Z", "content": null}, {"source": {"id": null, "name": "Bollywoodbubble.com"}, "author": "Simran Khanna", "title": "Deepika Padukone and Ranveer Singh’s monthly expenditure on food will leave you shell-shocked! - Bollywood Bubble", "description": "<p>Image Source – InstagramDeepika Padukone and Ranveer Singh are one of the most talked-about couples in Bollywood.  Everything about their life is super extravagant. So when you think about their daily food neds you know it is going to be exorbitant.  Did y…", "url": "https://www.bollywoodbubble.com/bollywood-news/deepika-padukone-ranveer-singh-monthly-expenditure-food/", "urlToImage": null, "publishedAt": "2020-04-24T12:13:36Z", "content": "Deepika Padukone and Ranveer Singh are one of the most talked-about couples in Bollywood.  Everything about their life is super extravagant. So when you think about their daily food neds you know it is going to be exorbitant.  Did you know the amount Deepika … [+1195 chars]"}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": "Pinkvilla Desk", "title": "Priyanka Chopra Jonas' sun kissed photos have left husband Nick Jonas awestruck and us too - PINKVILLA", "description": "Priyanka Chopra Jonas recently shared a stunning sun-kissed photo and well, it has our attention for all the right reasons, and Nick Jonas' too. Check it out here.", "url": "https://www.pinkvilla.com/entertainment/hollywood/priyanka-chopra-jonas-sun-kissed-photos-have-left-husband-nick-jonas-awestruck-and-us-too-527027", "urlToImage": null, "publishedAt": "2020-04-24T11:15:54Z", "content": null}, {"source": {"id": null, "name": "Koimoi.com"}, "author": null, "title": "Avengers: Endgame: Neither Iron Man Nor Captain America, Fans Think THIS Superhero Should’ve Snapped Fingers To Kill Thanos! - Koimoi", "description": "To save the world from Thanos' evil intentions once again, Iron Man sacrificed his life in Avengers: Endgame. In the climax, Robert Downey Jr", "url": "https://www.koimoi.com/hollywood-2/avengers-endgame-neither-iron-man-nor-captain-america-fans-think-this-superhero-shouldve-snapped-fingers-to-kill-thanos/", "urlToImage": null, "publishedAt": "2020-04-24T10:56:26Z", "content": "Avengers: Endgame: Neither Iron Man Nor Captain America, Fans Think THIS Superhero Should’ve Snapped Fingers To Kill Thanos!\r\nTo save the world from Thanos’ evil intentions once again, Iron Man sacrificed his life in Avengers: Endgame. In the climax, Robert D… [+2158 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Amir Khollam", "title": "Anushka Sharma’s first web series ‘Paatal Lok’s teaser will send chills down the spine - Republic World - Republic World", "description": "Anushka Sharma's production house Clean Slate Films will be venturing into the digital space with 'Paatal Lok', a web series. Check out the teaser below", "url": "https://www.republicworld.com/entertainment-news/bollywood-news/anushka-sharmas-first-web-series.html", "urlToImage": null, "publishedAt": "2020-04-24T10:42:40Z", "content": "Anushka Sharma's production house Clean Slate Films is all set to make its digital debut with the series Paatal Lok which will be an Amazon Prime Video special. The actor recently took to her social media and released the first teaser for Paatal Lok. The teas… [+1892 chars]"}, {"source": {"id": null, "name": "Koimoi.com"}, "author": null, "title": "Avengers: Endgame: This Latest Theory Suggests Hulk Met Black Widow When He Snapped His Fingers, Here’s How - Koimoi", "description": "In Avengers: Endgame, we witnessed the deaths of two best superheroes - Black Widow (Scarlett Johansson) and Iron Man (Robert Downey Jr).", "url": "https://www.koimoi.com/hollywood-2/avengers-endgame-this-latest-theory-suggests-hulk-met-black-widow-when-he-snapped-his-fingers-heres-how/", "urlToImage": null, "publishedAt": "2020-04-24T09:39:47Z", "content": "Avengers: Endgame: This Latest Theory Suggests Hulk Met Black Widow When He Snapped His Fingers, Here’s How\r\nIn Avengers: Endgame, we witnessed the deaths of two best superheroes – Black Widow (Scarlett Johansson) and Iron Man (Robert Downey Jr). It will be a… [+1521 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Hindustan Times", "title": "Ramayan top entertainer, Kanika Kapoor beats Deepika Padukone and Priyanka Chopra to become most-searched female celeb - Hindustan Times", "description": "Coronavirus related search queries ruled Yahoo India and rose by 427%.Kanika Kapoor, Amitabh Bachchan and Rajinikanth were among the most searched celebrities.", "url": "https://www.hindustantimes.com/tv/ramayan-top-entertainer-kanika-kapoor-beats-deepika-padukone-and-priyanka-chopra-to-become-most-searched-female-celeb/story-O8TFXULeUYlYlOfZSTAdaO.html", "urlToImage": null, "publishedAt": "2020-04-24T08:59:56Z", "content": "Nearly a month into the nationwide lockdown announced by the Indian government to prevent the spread of Covid-19, online search trends on Yahoo India reflect the curiosity and anxiety that people are facing. Owing to the pandemic, novel coronavirus-related se… [+2299 chars]"}, {"source": {"id": null, "name": "Indiaglitz.com"}, "author": "IndiaGlitz", "title": "Police complaint against Kangana Ranaut for communal remark! - Tamil News - IndiaGlitz.com", "description": "Last week, actress Kangana Ranaut's sister, manager and spokesperson Rangoli Chandel's Twitter account was suspended after her hate speech on Twitter demanding shooting of mullahs and media", "url": "https://www.indiaglitz.com/police-complaint-against-kangana-ranaut-for-communal-remark-tamil-news-258850", "urlToImage": null, "publishedAt": "2020-04-24T08:49:52Z", "content": "Last week, actress Kangana Ranaut's sister, manager and spokesperson Rangoli Chandel's Twitter account was suspended after her hate speech on Twitter demanding shooting of mullahs and media. After this, Kangana Ranaut had released a video supporting her siste… [+555 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Akshay Kumar shares new version of Kesari's Teri Mitti song: An ode to our heroes in white - India Today", "description": "Akshay Kumar took to Twitter to share the new version of Teri Mitti song and pay tribute to health care workers of the country,", "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-shares-new-version-of-kesari-s-teri-mitti-song-an-ode-to-our-heroes-in-white-1670531-2020-04-24", "urlToImage": null, "publishedAt": "2020-04-24T08:42:46Z", "content": "Akshay Kumar recently shared the song Teri Mitti on Twitter. A special version of Teri Mitti, which was first used in Akshay's 2019 film Kesari, has been released to pay tribute to the health workers of the country.\r\nThe video of the song shows doctors, nurse… [+1838 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Warda Khan Nadiadwala opens up on Sajid Nadiadwala’s former wife Divya Bharti - Times of India", "description": "Actress Divya Bharti bid adieu to the world at the tender age of 19. She was married producer Sajid Nadiadwala. Aft", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/warda-khan-nadiadwala-opens-up-on-sajid-nadiadwalas-ex-wife-divya-bharti/articleshow/75344050.cms", "urlToImage": null, "publishedAt": "2020-04-24T07:19:00Z", "content": null}]}