{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Indiaglitz.com"}, "author": "IndiaGlitz", "title": "Thalapathy Vijay's 'Master' confirmed release on Amazon Prime but... - Tamil News - IndiaGlitz.com", "description": "The past few days the Kollywood film industry is in a tussle after Suriya deciding to stream his next movie 'Ponmagal Vandhal' starring Jyothika on Amazon Prime foregoing theatrical release", "url": "https://www.indiaglitz.com/thaapathy-vijay-master-release-in-amazon-prime-official-clarification-tamil-news-258975", "urlToImage": null, "publishedAt": "2020-04-26T05:48:01Z", "content": "The past few days the Kollywood film industry is in a tussle after Suriya deciding to stream his next movie 'Ponmagal Vandhal' starring Jyothika on Amazon Prime foregoing theatrical release. Theater owners are seeing red and are threatening to boycott the big… [+811 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Malaika Arora crashes Arjun Kapoor’s Instagram live, hilariously trolls him for ‘boring’ quarantine... - Hindustan Times", "description": "Arjun Kapoor’s girlfriend Malaika Arora made fun of his quarantine routine and sarcastically called it “very interesting”.", "url": "https://www.hindustantimes.com/bollywood/malaika-arora-crashes-arjun-kapoor-s-instagram-live-hilariously-trolls-him-for-boring-quarantine-routine/story-g5DKgeWOA2bA5GQSlR9EsL.html", "urlToImage": null, "publishedAt": "2020-04-26T05:44:55Z", "content": "Arjun Kapoor and Malaika Arora never miss a chance to pull each other’s leg, and it was no different on Saturday evening. She crashed her boyfriend’s Instagram live and poked fun at his daily routine during the lockdown.\r\nWith all shoots on hold due to the co… [+1678 chars]"}, {"source": {"id": null, "name": "Ibtimes.co.in"}, "author": "Pramod Gaikwad", "title": "Why has Deepika Padukone always refused to work with Salman Khan? - International Business Times, India Edition", "description": "There had been several occassions which could've brought Salman Khan and Deepika Padukone in a film together. But every time, Deepika rejected the offer to work opposite Salman.", "url": "https://www.ibtimes.co.in/why-has-deepika-padukone-always-refused-work-salman-khan-818444", "urlToImage": null, "publishedAt": "2020-04-26T05:24:12Z", "content": "Deepika Padukone may have gotten a dream launch in Bollywood opposite Shah Rukh Khan in Farah Khan's directorial Om Shanti Om, but she is ruling the industry only because of her bold choices of films. She has always been a part of films with female centric ch… [+2530 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "admin", "title": "Sanjivani actor Chandni Bhagwanani stuck in Australia amid lockdown, says blowing through savings to... - Jimmys Post", "description": "", "url": "https://www.hindustantimes.com/tv/sanjivani-actor-chandni-bhagwanani-stuck-in-australia-amid-lockdown-says-blowing-through-savings-to-survive/story-CcO9nRwAbYT6yNgUsiWWHL.html/", "urlToImage": null, "publishedAt": "2020-04-26T05:16:47Z", "content": "Television actor Chandni Bhagwanani is stranded in Australia due to the lockdown owing to the coronavirus pandemic, and is blowing through her savings to survive. Airlines across the world have cancelled flights and countries have sealed their borders to cont… [+1571 chars]"}, {"source": {"id": null, "name": "Indiaglitz.com"}, "author": "IndiaGlitz", "title": "WOW! Tamannaah takes up the 'Pillow challenge' effortlessly - Tamil News - IndiaGlitz.com", "description": "Tamannaah has surprised her fans by taking up this trending Pillow challenge as she shared a picture of herself wearing a white pillow.", "url": "https://www.indiaglitz.com/tamannaah-takes-up-the-pillow-challenge-effortlessly--tamil-news-258971", "urlToImage": null, "publishedAt": "2020-04-26T05:10:17Z", "content": "Amid the ongoing COVID-19 pandemic and lockdown, the latest challenge that's going viral on the internet is the 'Pillow Challenge' which is being aced by celebrities from across the globe. It seems like the Pillow Challenge has hit many of our Indian celebrit… [+812 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Priyanka Chopra Jonas wears a saree at home as she poses for a romantic picture with hubby Nick Jonas ami - Times of India", "description": "Lockdown has given ample time to our B-town celebrities to spend quality time with their loved ones. Every day we g", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/priyanka-chopra-jonas-wears-a-saree-at-home-as-she-poses-for-a-romantic-picture-with-hubby-nick-jonas-amid-the-lockdown/articleshow/75386442.cms", "urlToImage": null, "publishedAt": "2020-04-26T05:05:00Z", "content": null}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Akshay Kaushal", "title": "Kareena Kapoor Khan to Alia Bhatt: Celebs share their makeup-free selfies during quarantine - Hindustan Times", "description": "Makeup and vanity seem to be the last thing on the mind of these beauties during these testing times.", "url": "https://www.hindustantimes.com/fashion-and-trends/kareena-kapoor-khan-to-alia-bhatt-celebs-share-their-makeup-free-selfies-during-quarantine/story-AlVHIk2BoKZrkacfjVA7ZP.html", "urlToImage": null, "publishedAt": "2020-04-26T04:21:58Z", "content": "Bollywood beauties seem to have taken the au natural route during social distancing and self-isolation, while encouraging their fans on social media by putting their makeup-free selfies with messages worth introspecting. \r\nDuring the quarantine period due to … [+1404 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Netflix has secret codes for hidden movies, shows: Here’s the whole list - Hindustan Times", "description": "Netflix has a lot of shows that might not show up on your home page thanks to what you watch normally. Here’s how you can unlock a bigger treasure trove of content", "url": "https://www.hindustantimes.com/tech/netflix-has-secret-codes-for-hidden-movies-shows-here-s-the-whole-list/story-yUcZuWvhZr2g7SgLNHqcNM.html", "urlToImage": null, "publishedAt": "2020-04-26T04:07:45Z", "content": "We are certain you have been watching a LOT of Netflix lately and you might have just exhausted everything you think this streaming platform has to offer. Don’t worry, we have news for you. \r\nNetflix has a whole list of secret codes that you can use to find m… [+7648 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "Antara Kashyap", "title": "Amitabh Bachchan Jokes About Coronavirus And Netizens Aren't Happy - News18", "description": "Amitabh Bachchan took to Twitter to tell his fans that a bat had entered his room at his residence Jalsa. He joked how the coronavirus is trailing him.", "url": "https://www.news18.com/news/movies/amitabh-bachchan-jokes-about-coronavirus-and-netizens-arent-happy-2592947.html", "urlToImage": null, "publishedAt": "2020-04-26T03:38:37Z", "content": "Superstar Amitabh Bachchan is one of the most active social media users in the Hindi film industry. From motivational videos to viral challenges, the actor participates in most internet content, thereby entertaining his fans. However, his recent attempt at jo… [+2771 chars]"}, {"source": {"id": null, "name": "Bollywoodhungama.com"}, "author": "Bollywood Hungama", "title": "Shah Rukh Khan, Gauri Khan and son Aryan Khan attend Kajols Mehandi ceremony in this priceless throwback - Bollywood Hungama", "description": "Shah Rukh Khan, Gauri Khan and son Aryan Khan attend Kajol’s Mehandi ceremony in this priceless throwback. Latest Bollywood News, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News at Bollywood Hungama.com", "url": "https://www.bollywoodhungama.com/news/features/shah-rukh-khan-gauri-khan-son-aryan-khan-attend-kajols-mehandi-ceremony-priceless-throwback/", "urlToImage": null, "publishedAt": "2020-04-26T03:04:41Z", "content": "We just stumbled upon a million-dollar throwback photo, from Kajol's pre-wedding ceremonies. The photo has SRK, wife Gauri Khan and their eldest child Aryan Khan in attendance. Aryan, who must not be over a few years old in the photo, is tucked in his father'… [+509 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "Antara Kashyap", "title": "Karan Johar Apologises Over Posts Showcasing Privileges of Celebrities During Lockdown - News18", "description": "Karan Johar was recently moved by a viral video on  coronavirus called 'Thank You Celebrities' which made him apologise about some of his posts that might be seen an insensitive to many struggling in these times.", "url": "https://www.news18.com/news/movies/karan-johar-apologises-over-posts-showcasing-privileges-of-celebrities-during-coronavirus-lockdown-2592913.html", "urlToImage": null, "publishedAt": "2020-04-26T02:40:37Z", "content": "Karan Johar might have been entertaining fans amid the Coronavirus lockdown with the series \"Lockdown With The Johars,\" where his children poke fun at him, but one thing that is glaring in his post is that he is comfortable at a time when millions of people i… [+2769 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Dr Prem Kumar Sharma & Manisha Koushik", "title": "Horoscope Today: Astrological prediction for April 26, what’s in store for Aries, Leo, Virgo, Sagittarius... - Hindustan Times", "description": "Horoscope Today: Are the stars lined up in your favour? Find out the astrological prediction for Aries, Leo, Virgo, Sagittarius and other zodiac signs for April 26.", "url": "https://www.hindustantimes.com/more-lifestyle/horoscope-today-astrological-prediction-for-april-26-what-s-in-store-for-aries-leo-virgo-sagittarius-and-other-zodiac-signs/story-UZqIshfDA2z09RcKOo28hJ.html", "urlToImage": null, "publishedAt": "2020-04-26T02:39:30Z", "content": "The 12 zodiac signs have their own personality traits and characteristics. Horoscopes give us an insight into our daily life and how it will fare for all of us. Read on to know whether the odds will be in your favour today:\r\n*Aries (March 21-April 20) You wil… [+8191 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Varun-Natasha’s engagement announcement to Police complaint against Kangana Ranaut – here are the newsmakers of the week - Times of India", "description": "Bollywood celebrities are making sure to keep fans entertained through lockdown. From Kartik Aaryan posting videos on social media to Ileana D’Cruz winning the internet with her response to a fan – stars are hitting headlines for all things interesting. And a…", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/varun-natashas-engagement-announcement-to-police-complaint-against-kangana-ranaut-here-are-the-newsmakers-of-the-week/photostory/75383226.cms", "urlToImage": null, "publishedAt": "2020-04-26T02:30:00Z", "content": "Kangana Ranaut hit headlines this week following a police complaint against her. According to IANS, advocate Ali Kaashif Khan Deshmukh has filed a complaint against Kangana for allegedly referring to people of a particular community as \"terrorist\" and coming … [+341 chars]"}, {"source": {"id": null, "name": "Telanganatoday.com"}, "author": "Telangana Today", "title": "Irrfan Khan's mother passes away, actor stranded abroad - Telangana Today", "description": "Mumbai: Bollywood actor Irrfan Khan lost his mother Saeda Begum on Saturday morning. She was 95 and a resident of Jaipur. The actor is currently out of India and, owing to the ongoing COVID-19 lockdown, will not be able to fly back to the country for his moth…", "url": "https://telanganatoday.com/irrfan-khans-mother-passes-away-actor-stranded-abroad", "urlToImage": null, "publishedAt": "2020-04-26T02:00:17Z", "content": "Mumbai: Bollywood actor Irrfan Khan lost his mother Saeda Begum on Saturday morning. She was 95 and a resident of Jaipur.\r\nThe actor is currently out of India and, owing to the ongoing COVID-19 lockdown, will not be able to fly back to the country for his mot… [+863 chars]"}, {"source": {"id": null, "name": "Vogue.in"}, "author": "Nupur Sarvaiya", "title": "Aishwarya Rai Bachchan’s pink lehenga from her mehandi is for brides who love soothing hues - VOGUE India", "description": "Aishwarya Rai Bachchan chose a romantic pink lehenga for her pre-wedding celebrations back in 2007. Here's how you can get the look", "url": "https://www.vogue.in/wedding-wardrobe/collection/aishwarya-rai-bachchan-pink-mehandi-lehenga-neeta-lulla-long-blouse-floral-maangtikka-necklace-earrings-abhishek-bachchan/", "urlToImage": null, "publishedAt": "2020-04-26T01:12:38Z", "content": "For her wedding with Abhishek Bachchan back in April 2007, Aishwarya Rai Bachchan served up a good mix of traditional and contemporary bridal looks. While the star dressed in a pastel blue Abu Jani Sandeep Khosla lehenga for her sangeet, a regal gold silk sar… [+1517 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Alok Nayak", "title": "Former WWE Superstar Accuses CM Punk of Stealing His Finisher - Essentially Sports", "description": "GTS( Go to Sleep) a finishing maneuver that CM Punk made famous. However, it was not invented by Punk as per former WWE supertstar, KENTA", "url": "https://www.essentiallysports.com/wwe-news-former-wwe-superstar-accuses-cm-punk-of-stealing-his-finisher/", "urlToImage": null, "publishedAt": "2020-04-26T00:44:00Z", "content": "CM Punk has been away from the WWE ring for years now. However, fans in the arena never miss a chance to appreciate the Voice of the voiceless by chanting his name. CM Punk brought a revolution in WWE when he went against the Bossman, Vince McMahon, and start… [+1665 chars]"}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": "Pinkvilla Desk", "title": "Shaheer Sheikh urges everyone to pray at home during Ramzan with the sweetest photo ever; Check it out - PINKVILLA", "description": "Shaheer Sheikh shared a post on social media urging everyone to pray from home during Ramzan. Check out the post here.", "url": "https://www.pinkvilla.com/tv/serial-updates/shaheer-sheikh-urges-everyone-pray-home-during-ramzan-sweetest-photo-ever-check-it-out-527556", "urlToImage": null, "publishedAt": "2020-04-25T21:45:16Z", "content": null}, {"source": {"id": null, "name": "Tellychakkar.com"}, "author": "Tellychakkar Team", "title": "Shruti would neither stalk nor get stalked by ex - Tellychakkar", "description": "MUMBAI: Actress Shruti Haasan revealed on social media that she would neither stalk her ex nor be stalked by her ex.", "url": "https://www.tellychakkar.com/movie/movie-news/shruti-would-neither-stalk-nor-get-stalked-ex-200426", "urlToImage": null, "publishedAt": "2020-04-25T21:30:00Z", "content": "MUMBAI: Actress Shruti Haasan revealed on social media that she would neither stalk her ex nor be stalked by her ex.\r\nShruti on Thursday night was playing the \"Would you rather\" game on Instagram stories where two options were given to her by the automated fi… [+744 chars]"}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": "Pinkvilla Desk", "title": "Deepika Padukone smiles the brightest as she gets on a video call with her BFFs for a virtual birthday wish - PINKVILLA", "description": "Deepika Padukone has our attention with her social media once again. Have a look at her photo video calling her best friends.", "url": "https://www.pinkvilla.com/entertainment/news/deepika-padukone-smiles-brightest-she-gets-video-call-her-bffs-virtual-birthday-wish-527555", "urlToImage": null, "publishedAt": "2020-04-25T21:26:32Z", "content": null}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Bhavya Sukheja", "title": "Chris Hemsworth speaking Bangla in Netflixs Extraction leaves netizens flipped - Republic World - Republic World", "description": "One of the scenes from the action-packed film left viewers a little taken aback as Chris Hemsworth, known for 'Thor', spoke fairly fluent Bangla.", "url": "https://www.republicworld.com/entertainment-news/whats-viral/chris-hemsworth-speaking-bangla-leaves-netizens-flipped.html", "urlToImage": null, "publishedAt": "2020-04-25T19:34:34Z", "content": "One of the most awaited movies of 2020, Extraction, starring Chris Hemsworth, Randeep Hooda and Pankaj Tripathi recently released on Netflix and netizens were completely blown away within the first 90 minutes of the film. One of the scenes from the action-pac… [+2489 chars]"}, {"source": {"id": null, "name": "Abplive.com"}, "author": "ABP News Bureau", "title": "Did 'Nach Baliye 9' Winners END Their Friendship With Arhaan Because Of Rashami? - ABP Live", "description": "According to a recent grapevine, Prince and Yuvika have maintained a distance from Arhaan after they got to know about his reality.", "url": "https://news.abplive.com/entertainment/television/did-prince-narula-yuvika-chaudhary-end-their-friendship-with-arhaan-khan-because-of-rashami-desai-1206040", "urlToImage": null, "publishedAt": "2020-04-25T18:48:58Z", "content": "New Delhi: Salman Khans Bigg Boss 13 managed to become the talk of the town throughout its four-and-a-half month journey. Although, the popular reality show has ended two months back, the BB 13 contestants continue to remain in headlines. Small screens Tapasy… [+2043 chars]"}, {"source": {"id": null, "name": "Telugucinema.com"}, "author": "tc editor", "title": "Pic: Naga Chaitanya's quarantine look - Telugu Cinema", "description": "Naga Chaitanya and his wife Samantha have been kept themselves during this lockdown period. They have cut down posts on social media as well. After being silent on social media for more than two weeks, Samantha is now sharing a pic or two.  She now posted a n…", "url": "https://www.telugucinema.com/news/pic-naga-chaitanyas-quarantine-look", "urlToImage": null, "publishedAt": "2020-04-25T18:33:09Z", "content": "Naga Chaitanya and his wife Samantha have been kept themselves during this lockdown period. They have cut down posts on social media as well. After being silent on social media for more than two weeks, Samantha is now sharing a pic or two. \r\nShe now posted a … [+642 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Titas Chowdhury", "title": "The name ‘Arjun’ went on to give me everything that I dreamed of: Firoz Khan - Hindustan Times", "description": "Actor Firoz Khan reminisces about the time when producers confused him with Feroz Khan - the Qurbani actor", "url": "https://www.hindustantimes.com/bollywood/the-name-arjun-went-on-to-give-me-everything-that-i-dreamed-of-firoz-khan/story-qgUIbqqrE4ZvSQmcAhjlDP.html", "urlToImage": null, "publishedAt": "2020-04-25T18:12:29Z", "content": "With Mahabharat re-running on DD Bharati and grabbing a lot of eyeballs, actor Firoz Khan who’s known by the moniker Arjun, is on cloud nine. “It’s a proud moment to watch Mahabharat with the present generation. It’s a good opportunity for them to know more a… [+1748 chars]"}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": "Pinkvilla Desk", "title": "Mahira Sharma REVEALS she hasn’t been in touch with Sidharth Shukla after Bigg Boss 13 - PINKVILLA", "description": "Mahira Sharma and Sidharth Shukla shared a great bond during their stint on Bigg Boss 13.", "url": "https://www.pinkvilla.com/tv/news-gossip/mahira-sharma-reveals-she-hasn-t-been-touch-sidharth-shukla-after-bigg-boss-13-527546", "urlToImage": null, "publishedAt": "2020-04-25T17:15:15Z", "content": null}, {"source": {"id": null, "name": "Koimoi.com"}, "author": null, "title": "Avengers: Endgame: Memes Ft. Iron Man, Captain America, Thanos & Others Will Make You Go ROFL On Film’s 1st Anniversary! - Koimoi", "description": "A year ago, Avengers: Endgame released in theatres and it turned out to be the biggest blockbuster worldwide. It was the last time we", "url": "https://www.koimoi.com/hollywood-2/avengers-endgame-memes-iron-man-captain-america-thanos/", "urlToImage": null, "publishedAt": "2020-04-25T16:17:55Z", "content": "Avengers: Endgame: Memes Ft. Iron Man, Captain America, Thanos &amp; Others Will Make You Go ROFL On Film’s 1st Anniversary!\r\nA year ago, Avengers: Endgame released in theatres and it turned out to be the biggest blockbuster worldwide. It was the last time we… [+2963 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Amir Khollam", "title": "How many devices can use Amazon Prime Video on a single account? - Republic World - Republic World", "description": "How many devices can use Amazon Prime Video on a single account? has reportedly been a frequently searched question on the internet. Read to know the answer.", "url": "https://www.republicworld.com/technology-news/apps/how-many-devices-can-use-amazon-prime-video-on-a-single-account.html", "urlToImage": null, "publishedAt": "2020-04-25T15:08:00Z", "content": "Amazon Prime Video is one of the most famous streaming platforms in India and across the globe. As per reports, Amazon Prime Video itself has a subscriber base of over 100 million users. The video streaming platform has a number of movies and shows from vario… [+1943 chars]"}, {"source": {"id": null, "name": "Heroichollywood.com"}, "author": "Sebastian Peris", "title": "New Photos Of Robert Pattinson Show His Lean Physique For The Batman - Heroic Hollywood", "description": "New photos of Robert Pattinson jogging reveal give fans a better look at his lean physique for Warner Bros. and DC's 'The Batman'.", "url": "https://heroichollywood.com/robert-pattinson-the-batman-physique-lean-photos/", "urlToImage": null, "publishedAt": "2020-04-25T14:30:39Z", "content": "Newly-surfaced photos of The Batman star Robert Pattinson show off the actor’s physique for his role as Bruce Wayne.\r\nWhile production on Matt Reeves’ The Batman was initially underway in the United Kingdom, the ongoing coronavirus outbreak forced Warner Bros… [+1757 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "NewsClicks", "title": "Joker is ‘the first one’ in series, producer Bradley Cooper casually lets slip - NewsClicks", "description": "Before the discharge of Joker, director Todd Phillips and actor Joaquin Phoenix had maintained that the movie was a standalone story, they usually had no intention of turning it right into a franchise. But in the months that adopted, and the adore it obtained…", "url": "https://www.hindustantimes.com/hollywood/joker-is-the-first-one-in-series-producer-bradley-cooper-casually-lets-slip/story-YDeptiOGe46QVMPXLonjGK.html", "urlToImage": null, "publishedAt": "2020-04-25T14:01:35Z", "content": "Before the discharge of Joker, director Todd Phillips and actor Joaquin Phoenix had maintained that the movie was a standalone story, they usually had no intention of turning it right into a franchise. But in the months that adopted, and the adore it obtained… [+1967 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Suniel Shetty says Dhadkan sequel should star his and Akshay Kumar’s sons, Ahan and Aarav - Hindustan Times", "description": "Suniel Shetty says he’s pitched the idea that the Dhadkan sequel should star his and Akshay Kumar’s sons, Ahan and Aarav, to the producer.", "url": "https://www.hindustantimes.com/bollywood/suniel-shetty-says-dhadkan-sequel-should-star-his-and-akshay-kumar-s-sons-ahan-and-aarav/story-otPBbTUVjvwepoDM8byDYN.html", "urlToImage": null, "publishedAt": "2020-04-25T13:57:38Z", "content": "Actor Suniel Shetty feels that both him and Akshay Kumar are too old to appear in a sequel to their 2000 film, Dhadkan, but that their sons, Ahan and Aarav, could take on the mantle. Dhadkan, directed by Dharmesh Darshan, also starred Shilpa Shetty.\r\nSuniel t… [+1192 chars]"}, {"source": {"id": null, "name": "Tellychakkar.com"}, "author": "Tellychakkar Team", "title": "Did Kavita Kaushik just take a dig at Arnab Goswami? - Tellychakkar", "description": "MUMBAI: Journalist and anchor Arnab Goswami recently claimed that some goons attacked his car when he was travelling back home.", "url": "https://www.tellychakkar.com/tv/tv-news/did-kavita-kaushik-just-take-dig-arnab-goswami-200425", "urlToImage": null, "publishedAt": "2020-04-25T13:53:00Z", "content": "MUMBAI: Journalist and anchor Arnab Goswami recently claimed that some goons attacked his car when he was travelling back home. He revealed that he was with his wife when the incident took place. He later took to social media to post a video calling out a pol… [+1274 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Salman Khan looks suave and handsome sporting a beard in THIS latest picture - Times of India", "description": "Salman Khan is currently spending the quarantine period at his farmhouse in Panvel. The actor is spending time with", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/salman-khan-looks-suave-and-handsome-sporting-a-beard-in-this-latest-picture/articleshow/75378474.cms", "urlToImage": null, "publishedAt": "2020-04-25T12:53:00Z", "content": null}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Vijay Deverakonda Takes Up the Real Man Challenge, Makes Mango Ice Cream - News18", "description": "The World Famous Lover star told fans that the video was documented by younger brother Anand Deverakonda, who is also an actor. Vijay then tagged actor Dulquer Salman for the #BeARealMan challenge.", "url": "https://www.news18.com/news/movies/vijay-deverakonda-takes-up-the-real-man-challenge-makes-mango-ice-cream-2592603.html", "urlToImage": null, "publishedAt": "2020-04-25T12:43:26Z", "content": "Southern heartthrob Vijay Deverakonda took the #BeARealMan challenge and documented his average lockdown routine recently. The challenge has become a trend after Arjun Reddy director Sandeep Vanga Reddy popularized it.\r\nPopular stars such as Chiranjeevi, Ram … [+1282 chars]"}, {"source": {"id": null, "name": "Bollywoodhungama.com"}, "author": "Bollywood Hungama", "title": "Sobhita Dhulipala issues clarification after being accused of lying about self-shot images for magazine cover - Bollywood Hungama", "description": "Sobhita Dhulipala issues clarification after being accused of lying about self-shot images for magazine cover. Latest Bollywood News, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News at Bollywood Hungama.com", "url": "https://www.bollywoodhungama.com/news/features/sobhita-dhulipala-issues-clarification-accused-lying-self-shot-images-magazine-cover/", "urlToImage": null, "publishedAt": "2020-04-25T12:31:44Z", "content": "Sobhita in her post mentioned that she self-styled and shot her images for the magazine. However, when an image of her being clicked by another person surfaced online, people accused her of lying. The actress later issued a clarification on the same.\r\nTaking … [+1519 chars]"}, {"source": {"id": null, "name": "Bollywoodhungama.com"}, "author": "Bollywood Hungama", "title": "Disha Patani says she hates pampering herself in a salon - Bollywood Hungama", "description": "Disha Patani says she hates pampering herself in a salon . Latest Bollywood News, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News at Bollywood Hungama.com", "url": "https://www.bollywoodhungama.com/news/features/disha-patani-says-hates-pampering-salon/", "urlToImage": null, "publishedAt": "2020-04-25T12:31:40Z", "content": "Talking to a daily, Disha said that she is very lazy when it comes to beauty treatments. However, with the lockdown in place, the actress is utilising the time doing facials. She said that she has been using face scrubs and masks. The Baaghi 2 actress said th… [+272 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "IANS", "title": "Suriya’s ‘Soorarai Pottru’ could be banned, if Jyothika’s ‘Pon Magal Vandhal’ releases directly on OTT - The Hindu", "description": "Tamil Nadu Theatre And Multiplex Owners’ Association respond to expected release of Jyothika’s film on Amazon Prime next month", "url": "https://www.thehindu.com/entertainment/movies/suriyas-soorarai-pottru-could-be-banned-if-jyothikas-pon-magal-vandhal-releases-directly-on-ott/article31432944.ece", "urlToImage": null, "publishedAt": "2020-04-25T12:25:03Z", "content": "The Tamil Nadu Theatre And Multiplex Owners Association have threatened to ban films starring Suriya, as well as the films produced by his production company 2D films. The decision comes after the news that the film Pon Magal Vandhal, produced by Suriya and s… [+1831 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Ajay Devgn asks fans to pause and reflect in new song Thahar Ja. Watch video - India Today", "description": "Ajay Devgn has released a new song called Thahar Ja. The song, which has been shot by the actor, marks the debut of his 9-year-old son Yug Devgn as an assistant director.", "url": "https://www.indiatoday.in/movies/celebrities/story/ajay-devgn-asks-fans-to-pause-and-reflect-in-new-song-thahar-ja-watch-video-1671020-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T12:22:30Z", "content": "While the world is grappling with the novel coronavirus pandemic, everyone is trying to stay positive. In this time, many celebrities are taking different means to help fans deal with the crisis.\r\nAjay Devgn has been taking to social media to keep people info… [+1953 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": "", "title": "Beyond Money Heist, ten international shows to watch during Coronavirus lockdown, from Kingdom to 3% - Firstpost", "description": "If you’re looking to explore different kinds of shows, made in different parts of the world, here is a list on what to get started with", "url": "https://www.firstpost.com/entertainment/beyond-money-heist-ten-international-shows-to-watch-during-coronavirus-lockdown-from-kingdom-to-3-8287201.html", "urlToImage": null, "publishedAt": "2020-04-25T12:03:54Z", "content": "For more recommendations on what to watch during the Coronavirus lockdown, click here.\r\n*\r\nWhen we talk about how much Netflix has pervaded into our lives and changed the way films are made, one of the first things that comes up is how films and shows are now… [+5688 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Vicky Kaushal Celebrates Homecoming Of COVID-19 Warrior Along With Neighbours - News18", "description": "Vicky Kaushal shared a homecoming video of an 11-year-old girl who was tested positive of for the coronavirus. On her return, residents gave her a round of applause.", "url": "https://www.news18.com/news/movies/vicky-kaushal-celebrates-homecoming-of-covid-19-warrior-along-with-neighbours-2592345.html", "urlToImage": null, "publishedAt": "2020-04-25T12:00:50Z", "content": "Bollywood actor Vicky Kaushal recently joined his fellow residents who gathered at the complexs entrance to welcome a COVID-19 warrior. The Raazi actor shared a video on his Instagram to share the glimpses from the moment.\r\nLike a ray of sunshine on a gloomy … [+1320 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Joel Kurian", "title": "After Kartik & Ayushmann, another actor recreates Professor look, netizens say perfect - Republic World - Republic World", "description": "After Kartik Aaryan & Ayushmann Khurrana, another actor recreated 'Money Heist' Professor's look. Netizens loved it and termed Annup Sonii's look  'perfect'", "url": "https://www.republicworld.com/entertainment-news/bollywood-news/money-heist-anup-soni-professor-netflix-watch-crime-patrol-films-host.html", "urlToImage": null, "publishedAt": "2020-04-25T11:48:39Z", "content": "Amid the lockdown, Money Heist has been one series that the viewers have been lapping up. Even celebrities from the film industry have expressed their admiration for the show, sharing memes and posts on it. The character that has caught the fascination of the… [+1989 chars]"}, {"source": {"id": null, "name": "Thenewsminute.com"}, "author": null, "title": "‘Love in the time of corona’: Prithviraj and Supriya complete 9 years of marriage - The News Minute", "description": "Prithiviraj and his wife Supriya have completed nine years of togetherness and are celebrating their wedding anniversary on Saturday. The actor has shared a special picture for his wife with the hashtag “Love In The Time Of Corona”.", "url": "https://www.thenewsminute.com/article/love-time-corona-prithviraj-and-supriya-complete-9-years-marriage-123331", "urlToImage": null, "publishedAt": "2020-04-25T11:47:56Z", "content": "Prithviraj's wife Supriya shared that this is the first time in these nine years that they are spending their wedding anniversary away from each other.Prithiviraj and his wife Supriya have completed nine years of togetherness and are celebrating their wedding… [+2206 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Virat Kohli thanks Anushka Sharma for switching on lights during live chat with AB de Villiers: ‘Thanks... - Hindustan Times", "description": "Virat Kohli expressed his gratitude to wife Anushka Sharma after she turned on the lights during his live chat session on Friday.", "url": "https://www.hindustantimes.com/bollywood/virat-kohli-thanks-anushka-sharma-for-switching-on-lights-during-live-chat-with-ab-de-villiers-thanks-my-love/story-LEezrrdrYGBl9aUKEvvY3M.html", "urlToImage": null, "publishedAt": "2020-04-25T11:32:00Z", "content": "Actor Anushka Sharma is every bit a considerate wife to her cricketer husband Virat Kohli. It was evident on Friday when Virat was conducting an Instagram Live with AB de Villiers. A sweet gesture by Anushka made Virat smile. \r\nAs it grew dark out during thei… [+1612 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Instagrammer of the Week: Pavitra Rishta fame Asha Negi’s style statements are chic and glamorous - Times of India", "description": "You might be seeing Asha Negi on-screen in simple salwar-kameez in her TV show Baarish, but off-screen her style statements are quite chic and glamorous. This week, we have her as our social media style maker. Take a look:", "url": "https://timesofindia.indiatimes.com/tv/news/hindi/instagrammer-of-the-week-pavitra-rishta-fame-asha-negis-style-statements-are-chic-and-glamorous/photostory/75358318.cms", "urlToImage": null, "publishedAt": "2020-04-25T11:30:00Z", "content": null}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Tom Cruise will be 60 years old by the time Mission Impossible 8 is released, will have played Ethan... - Hindustan Times", "description": "Tom Cruise will be 60 years old, and will have played Ethan Hunt for over a quarter-of-a-century by the time the now delayed Mission: Impossible 8 hits theatres.", "url": "https://www.hindustantimes.com/hollywood/tom-cruise-will-be-60-years-old-by-the-time-mission-impossible-8-is-released-will-have-played-ethan-hunt-for-over-quarter-century/story-y8wlOd2s6rcRKkNXLPTdOJ.html", "urlToImage": null, "publishedAt": "2020-04-25T11:16:00Z", "content": "The theatrical release of Mission: Impossible 7 and Mission: Impossible 8 has been delayed by Paramount, which means that when the eighth film opens in 2022, Tom Cruise will be 60 years old. The seventh instalment in the franchise was initially set to hit the… [+1328 chars]"}, {"source": {"id": null, "name": "Tellychakkar.com"}, "author": "Tellychakkar Team", "title": "Erica Fernandes finally fulfills her father’s dream - Tellychakkar", "description": "Erica shares a special bond with her father and finally she has made his dream come true", "url": "https://www.tellychakkar.com/tv/tv-news/erica-fernandes-finally-fulfills-her-father-s-dream-200425", "urlToImage": null, "publishedAt": "2020-04-25T10:44:00Z", "content": "MUMBAI: One of the most popular actresses in the telly land, Erica Fernandes has mesmerised the audience with her acting skills.\r\nThe actress is currently wooing the audience with her performance in Ekta Kapoor's show Kasautii Zindagii Kay. She is also popula… [+1229 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Malayalam actor Ravi Vallathol dies at 67 in Thiruvananthapuram - India Today", "description": "Film and television actor Ravi Vallathol died of age-related ailments at his residence in Thiruvananthapuram, Kerala.", "url": "https://www.indiatoday.in/movies/regional-cinema/story/malayalam-actor-ravi-vallathol-dies-at-67-in-thiruvananthapuram-1670968-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T10:31:01Z", "content": "Malayalam actor Ravi Vallathol, aged 67, breathed his last at his residence in Thiruvananthapuram, Kerala. Reportedly, he was unwell for a couple of years and had succumbed to age-related illness today (April 25).\r\nThe actor had stopped doing films and Malaya… [+1359 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Hindustan Times", "title": "Kanye West officially now a billionaire: Forbes - Hindustan Times", "description": "Forbes magazine has finally included Kanye West on their list of billionaires of the world. The magazine said West has been pressing them to be listed for years.", "url": "https://www.hindustantimes.com/music/kanye-west-officially-now-a-billionaire-forbes/story-RrYr70DZ4f0uj9m6UF4MdJ.html", "urlToImage": null, "publishedAt": "2020-04-25T10:26:06Z", "content": "Rapper Kanye West is now a billionaire thanks largely to the basketball shoes bearing his name that he developed with Adidas, Forbes magazine said Friday. The rough figure of the wealth of Kim Kardashian’s hubby is $1.3 billion, the magazine said in announcin… [+1011 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Anil Kapoor gets beefed up in lockdown, says ‘I have not taken any kind of supplements in this process’.... - Hindustan Times", "description": "Anil Kapoor has shared his new beefed up look along with an encouraging note for his fans on Instagram.", "url": "https://www.hindustantimes.com/bollywood/anil-kapoor-gets-beefed-up-in-lockdown-says-i-have-not-taken-any-kind-of-supplements-in-this-process-see-pics/story-TA4O3CPZ3z0fKmuUY8F6uN.html", "urlToImage": null, "publishedAt": "2020-04-25T10:01:38Z", "content": "Anil Kapoor has once again emerged as a fitness inspiration as he shared a glimpse of his biceps on Instagram. The actor revealed that he has been utilising his free time to work on his body and encouraged his fans to do the same. \r\nSharing a few pictures of … [+1770 chars]"}, {"source": {"id": null, "name": "Tellychakkar.com"}, "author": "Tellychakkar Team", "title": "THIS Star Plus’ show may not RETURN post the lockdown - Tellychakkar", "description": "Star Plus' Dadi Amma Dadi Amma Maan Jao to most probably not return post the lockdown.", "url": "https://www.tellychakkar.com/tv/tv-news/star-plus-show-may-not-return-post-the-lockdown-200425", "urlToImage": null, "publishedAt": "2020-04-25T10:00:00Z", "content": "MUMBAI: The lockdown has already hit the TV industry!\r\nRecently, there was news about Sony TV discontinuing three of their shows namely, Beyhadh 2, Ishaaron Ishaaron Mein and Patiala Babes. Yes, the channel has axed the shows and it wont return post the lockd… [+1108 chars]"}, {"source": {"id": null, "name": "Koimoi.com"}, "author": null, "title": "Brad Pitt & Jennifer Aniston Went To France For A Short Romantic Vacation In 2019? Truth Revealed! - Koimoi", "description": "Be it in the on-screen or off-screen, the dashing Hollywood star Brad Pitt and the gorgeous Jennifer Aniston never miss a chance to make head...", "url": "https://www.koimoi.com/hollywood-2/brad-pitt-jennifer-aniston-went-to-france-for-a-short-romantic-vacation-in-2019-truth-revealed/", "urlToImage": null, "publishedAt": "2020-04-25T09:51:22Z", "content": "Brad Pitt &amp; Jennifer Aniston Went To France For A Short Romantic Vacation In 2019? Truth Revealed!\r\nBe it in the on-screen or off-screen, the dashing Hollywood star Brad Pitt and the gorgeous Jennifer Aniston never miss a chance to make heads turn, be it … [+1253 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Throwback: When Mahabharat actors got emotional on the last day of shoot - Times of India", "description": "Mahabharat's rerun has been welcomed by telly viewers during the coronavirus lockdown. Such is the interest in the mythological show that every episode and sequence of the show is discussed on social media. Recently, a video surfaced online from the last day …", "url": "https://timesofindia.indiatimes.com/tv/news/hindi/throwback-when-mahabharat-actors-got-emotional-on-the-last-day-of-shoot/photostory/75374401.cms", "urlToImage": null, "publishedAt": "2020-04-25T09:37:52Z", "content": null}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": null, "title": "Kiara Advani's younger brother Mishaal is one handsome chap; Check out their photos - PINKVILLA", "description": "Kiara Advani is one popular diva of Bollywood. She is also a known celebrity in the South and has shared screen space with Ram Charan and Mahesh Babu. The stunning actress made her B-town debut with Fugly and was later seen opposite Sushant Singh Rajput in M.…", "url": "https://www.pinkvilla.com/photos/kiara-advani/kiara-advanis-younger-brother-mishaal-one-handsome-chap-check-out-their-photos-527441", "urlToImage": null, "publishedAt": "2020-04-25T09:21:00Z", "content": "Kiara Advani is one popular diva of Bollywood. She is also a known celebrity in the South and has shared screen space with Ram Charan and Mahesh Babu. The stunning actress made her B-town debut with Fugly and was later seen opposite Sushant Singh Rajput in M.… [+943 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Varun Dhawan Celebrates Birthday with Girlfriend Natasha Dalal - News18", "description": "Although Varun Dhawan couldn't get out to celebrate his birthday, his friends gathered on a video call to wish the actor.", "url": "https://www.news18.com/news/movies/varun-dhawan-celebrates-birthday-with-girlfriend-natasha-dalal-2592269.html", "urlToImage": null, "publishedAt": "2020-04-25T09:14:16Z", "content": "Coronavirus lockdown didn't stop Bollywood actor Varun Dhawan from having a birthday celebration. Although he couldn't get out to celebrate his birthday, his friends gathered on a video call to wish the actor. \r\nVarun shared a screenshot of the video call to … [+971 chars]"}, {"source": {"id": null, "name": "Ibtimes.co.in"}, "author": "Pramod Gaikwad", "title": "Deepika Padukone should stop interfering in my life and concentrate on her work: Kangana Ranaut [Throwback] - International Business Times, India Edition", "description": "Deepika Padukone and Kangana Ranaut have been at loggerheads ever since Deepika won the Best Actress award for her performance in Happy New Year over Kangana's role in Queen at an award function in 2014.", "url": "https://www.ibtimes.co.in/deepika-padukone-should-stop-interfering-my-life-concentrate-her-work-kangana-ranaut-throwback-818381", "urlToImage": null, "publishedAt": "2020-04-25T07:52:34Z", "content": "Kangana Ranaut had never shied away from expressing her dislike for Deepika Padukone on a public platform. The two have been at loggerheads ever since Deepika won the Best Actress award for her performance in Happy New Year over Kangana's role in Queen at an … [+2312 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Sussanne Khan shares glimpse of her life in lockdown with Hrithik Roshan and their sons. Watch video - India Today", "description": "Sussanne Khan shared a video of Hrithik Roshan and their sons Hridhaan and Hrehaan, spending quality time in lockdown.", "url": "https://www.indiatoday.in/movies/celebrities/story/sussanne-khan-shares-glimpse-of-her-life-in-lockdown-with-hrithik-roshan-and-their-sons-see-pic-1670917-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T07:52:32Z", "content": "Sussanne Khan moved in with ex-husband Hrithik Roshan to co-parent their sons Hridhaan and Hrehaan during this lockdown period. Both Hrithik and Sussanne are making the most of self-quarantine with their kids.\r\nRecently, Sussanne shared a glimpse of her life … [+3026 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Adil Khan", "title": "Who has Triple H dated before marrying WWE Chairmans daughter Stephanie McMahon? - Republic World - Republic World", "description": "Who has Triple H dated? Before dating Stephanie McMahon, Triple H was dating his D-Generation X teammate and former Diva's champion, Chyna.", "url": "https://www.republicworld.com/sports-news/wwe-news/who-has-triple-h-dated-before-marrying-stephanie-mcmahon.html", "urlToImage": null, "publishedAt": "2020-04-25T07:28:53Z", "content": "Paul Levesque aka Triple H and Stephanie McMahon are seemingly the most powerful couple in WWE, right next to Vince and Linda McMahon. Triple H and Stephanie McMahon have been together for more than a decade and have dominated WWE in the ring and in the manag… [+2757 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Akshay Kumar's Laxmmi Bomb To Skip Theatrical Release And Premiere on Disney+Hotstar? - News18", "description": "The global viral scare reportedly seems to persuade Bollywood filmmakers and producers to release their upcoming titles on OTT platforms rather than delaying them.", "url": "https://www.news18.com/news/movies/akshay-kumars-laxmmi-bomb-to-skip-theatrical-release-and-premiere-on-disneyhotstar-2592117.html", "urlToImage": null, "publishedAt": "2020-04-25T07:11:35Z", "content": "It's a dreadful time for the film industry as cinema halls across the world remain closed amid the coronavirus crisis. The global viral scare reportedly seems to persuade Bollywood filmmakers and producers to release their upcoming titles on OTT platforms rat… [+1773 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Pushpa: Bobby Simhaa replaces Vijay Sethupathi in Allu Arjun's film? - India Today", "description": "Bobby Simhaa is said to have replaced Vijay Sethupathi in Allu Arjun's upcoming film, Pushpa, directed by Sukumar.", "url": "https://www.indiatoday.in/movies/regional-cinema/story/pushpa-bobby-simhaa-replaces-vijay-sethupathi-in-allu-arjun-s-film-1670901-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T06:34:15Z", "content": "After the mammoth success of Ala Vaikuntapurramloo, actor Allu Arjun is thrilled about his upcoming film, Pushpa. Directed by Sukumar, the film is based on the lives of red sandalwood smugglers. Earlier, Vijay Sethupathi was rumoured to play the antagonist in… [+1371 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Uncharted Movie Release Date Moved Forward Three Months To July 2021 - Screen Rant", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiTGh0dHBzOi8vc2NyZWVucmFudC5jb20vdW5jaGFydGVkLW1vdmllLXJlbGVhc2UtZGF0ZS1tb3ZlZC1mb3J3YXJkLWp1bHktMjAyMS_SAVBodHRwczovL3NjcmVlbnJhbnQuY29tL3VuY2hhcnRlZC1tb3ZpZS1yZWxlYXNlLWRhdGUtbW92ZWQtZm9yd2FyZC1qdWx5LTIwMjEvYW1wLw?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T05:58:19Z", "content": null}, {"source": {"id": null, "name": "Hollywoodlife.com"}, "author": "Jade Boren", "title": "Gigi Hadid & Zayn Share Romantic Hug On Her Birthday: It Was ‘The Sweetest Day’ — See Pic - HollywoodLife", "description": "Gigi Hadid and Zayn Malik looked like they'll never let go of one another in this sweet PDA photo, which was snapped on Gigi's 25th birthday. The model couldn't stop gushing about the 'special' day spent with her 'quarantine family.'", "url": "https://hollywoodlife.com/2020/04/25/gigi-hadid-zayn-malik-hug-birthday-photo-pda/", "urlToImage": null, "publishedAt": "2020-04-25T05:34:45Z", "content": "Gigi Hadid and Zayn Malik looked like they’ll never let go of one another in this sweet PDA photo, which was snapped on Gigi’s 25th birthday. The model couldn’t stop gushing about the ‘special’ day spent with her ‘quarantine family.’\r\nZayn Malik, 27, made a c… [+4046 chars]"}, {"source": {"id": null, "name": "Bollywoodhungama.com"}, "author": "Bollywood Hungama", "title": "On his birthday, Varun Dhawan donates towards daily wage labourers of the film industry - Bollywood Hungama", "description": "On his birthday, Varun Dhawan donates towards daily wage labourers of the film industry. Latest Bollywood News, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News at Bollywood Hungama.com", "url": "https://www.bollywoodhungama.com/news/bollywood/birthday-varun-dhawan-donates-towards-daily-wage-labourers-film-industry/", "urlToImage": null, "publishedAt": "2020-04-25T05:02:27Z", "content": "Ashoke Pandit who is the president of Indian Film and TV directors Association took to Twitter to thank Varun Dhawan for his contribution. Sharing the video he wrote, \"@fwice_mum  thanks @Varun_dvn for donating towards the daily wage workers of the entertainm… [+993 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Ramayan's Sita aka Dipika Chikhalia's real life wedding was attended by this Bollywood superstar; see pic - Times of India", "description": "Ramayan's rerun has led to curiosity around the life of its lead actors. Several unseen pictures of them from back", "url": "https://timesofindia.indiatimes.com/tv/news/hindi/ramayans-sita-aka-dipika-chikhalias-real-life-wedding-was-attended-by-this-bollywood-superstar-see-pic/articleshow/75369401.cms", "urlToImage": null, "publishedAt": "2020-04-25T04:53:00Z", "content": null}, {"source": {"id": null, "name": "Sportskeeda.com"}, "author": "Raunak Jaiswal", "title": "Roman Reigns takes a dig at tag team recently released by WWE - Sportskeeda", "description": "The former WWE tag team has been a thorn in Roman Reigns' side in the past.", "url": "https://www.sportskeeda.com/wwe/roman-reigns-takes-a-dig-at-tag-team-recently-released-by-wwe", "urlToImage": null, "publishedAt": "2020-04-25T02:49:10Z", "content": "Roman Reigns wasn't holding back in this exchange\r\nIn a shocking turn of events, WWE released over 20 Superstars in addition to furloughing backstage staff last week. To everyone's surprise, The Good Brothers Luke Gallows &amp; Karl Anderson were also among t… [+1792 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Yami Gautam Revisits First Day at School, Shares Childhood Pic in Uniform - News18", "description": "If you want to see actress Yami Gautam in school uniform then head to her Instagram profile right away.", "url": "https://www.news18.com/news/movies/yami-gautam-revisits-first-day-at-school-shares-childhood-pic-in-uniform-2591829.html", "urlToImage": null, "publishedAt": "2020-04-25T02:19:10Z", "content": "If you want to see actress Yami Gautam in school uniform then head to her Instagram profile right away. She has posted a picture of her first day in school.\r\n\"My first day to school! I am sure I did not know what it meant, but was just so excited to get dress… [+627 chars]"}, {"source": {"id": null, "name": "Iwmbuzz.com"}, "author": "Editorial Team", "title": "Jannat Zubair’s Stylish Outfit Ideas for How to Wear High Heels - IWMBuzz", "description": "Learn how to slay in high heels from Jannat Zubair", "url": "https://www.iwmbuzz.com/digital/photos-digital/jannat-zubairs-stylish-outfit-ideas-wear-high-heels/2020/04/25", "urlToImage": null, "publishedAt": "2020-04-25T01:41:42Z", "content": null}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Horoscope Today, April 25, 2020: Know what your stars have for you - India Today", "description": "Horoscope Today, April 25, 2020: Here's what the stars have in store for you on Saturday.", "url": "https://www.indiatoday.in/india/story/horoscope-today-april-25-2020-know-what-your-stars-have-for-you-1670847-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T00:01:38Z", "content": "Horoscope offers interesting and accurate insights. Let's find out what our stars have in store for us on Saturday, April 25.\r\nARIES Mar 21-Apr 20 Money will come your way from various sources and keeps your bank balance brimming. Though, you will not be in m… [+2355 chars]"}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": "Pinkvilla Desk", "title": "Anushka Sharma and Virat Kohli: Here's how compatible Taurus and Scorpio are in a relationship - PINKVILLA", "description": "Find out whether the two are compatible or not, based on their zodiac sign.", "url": "https://www.pinkvilla.com/lifestyle/love-relationships/anushka-sharma-and-virat-kohli-heres-how-compatible-taurus-and-scorpio-are-relationship-527088", "urlToImage": null, "publishedAt": "2020-04-24T15:56:21Z", "content": null}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Danny Cyril D Cruze", "title": "Aarogya Setu App: How Bluetooth helps in identifying Covid-19 suspects - Livemint", "description": "The government-owned application is being posed as the primary contact tracing tool in India.Many organisations are planning to include the app in their daily operations to identify potential cases", "url": "https://www.livemint.com/technology/tech-news/aarogya-setu-app-how-bluetooth-helps-in-identifying-covid-19-suspects-11587730877077.html", "urlToImage": null, "publishedAt": "2020-04-24T12:51:31Z", "content": "Many food-delivery services have mandated the use of Aarogya Setu app for their delivery personnel. The government-owned application is being posed as the primary contact tracing tool in India. During Prime Minister Narendra Modis address to the nation, while… [+2367 chars]"}, {"source": {"id": null, "name": "Indiaglitz.com"}, "author": "IndiaGlitz", "title": "Mahesh Babu gives solid feedback on 2-minute massage! - Telugu News - IndiaGlitz.com", "description": "Mahesh Babu's family time is productive.  The other day, Sitara turned into a head massage volunteer as her dad was busy watching Gautham play his game.", "url": "https://www.indiaglitz.com/mahesh-babu-gives-solid-feedback-on-2-minute-massage-telugu-news-258876", "urlToImage": null, "publishedAt": "2020-04-24T12:49:59Z", "content": "Mahesh Babu's family time is productive. The other day, Sitara turned into a head massage volunteer as her dad was busy watching Gautham play his game. \r\n\"Watching GG (Gautham Ghattamaneni) play his game! MB had a head massage volunteer only to finish in 2 mi… [+562 chars]"}, {"source": {"id": null, "name": "Bollywoodbubble.com"}, "author": "Simran Khanna", "title": "Deepika Padukone and Ranveer Singh’s monthly expenditure on food will leave you shell-shocked! - Bollywood Bubble", "description": "<p>Image Source – InstagramDeepika Padukone and Ranveer Singh are one of the most talked-about couples in Bollywood.  Everything about their life is super extravagant. So when you think about their daily food neds you know it is going to be exorbitant.  Did y…", "url": "https://www.bollywoodbubble.com/bollywood-news/deepika-padukone-ranveer-singh-monthly-expenditure-food/", "urlToImage": null, "publishedAt": "2020-04-24T12:13:36Z", "content": "Deepika Padukone and Ranveer Singh are one of the most talked-about couples in Bollywood.  Everything about their life is super extravagant. So when you think about their daily food neds you know it is going to be exorbitant.  Did you know the amount Deepika … [+1195 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Shakir Khan", "title": "New version of Teri Mitti dedicated to COVID-19 warriors leaves netizens teary eyed - Republic World - Republic World", "description": "'Teri Mitti's' new version has left fans teary eyed. This reprised version from the film 'Kesari' has touched the hearts of many. Watch", "url": "https://www.republicworld.com/entertainment-news/music/new-version-of-teri-mitti-dedicated-to-covid-19-warriors.html", "urlToImage": null, "publishedAt": "2020-04-24T11:01:55Z", "content": "The film fraternity has joined hands to spread awareness through various medium to spread awareness on the COVID-19 pandemic. May it be in the form of a video anthem or a song, artists are going all out to spread the message of positivity during this global c… [+2051 chars]"}]}