{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Telanganatoday.com"}, "author": "Telangana Today", "title": "Vijay plans to generate employment through Deverakonda foundation - Telangana Today", "description": "Hyderabad: Actor Vijay Deverakonda thanked the Chief Minister K Chandrashekar Rao for various welfare activities taken up in these troubling times of coronavirus and lockdown. In a video released on Sunday, Vijay said, The government is doing such an incredib…", "url": "https://telanganatoday.com/vijay-plans-to-generate-employment-through-deverakonda-foundation", "urlToImage": null, "publishedAt": "2020-04-26T14:08:10Z", "content": "Hyderabad: Actor Vijay Deverakonda thanked the Chief Minister K Chandrashekar Rao for various welfare activities taken up in these troubling times of coronavirus and lockdown.\r\nIn a video released on Sunday, Vijay said, “The government is doing such an incred… [+2314 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Sanjay Mishra’s entry for ‘Me At 20’ trend is epic, watch him do the barati dance - Hindustan Times", "description": "Check out the video in which Sanjay Mishra can be seen dancing at a wedding ceremony-- doing exactly what most people do on such occasions.", "url": "https://www.hindustantimes.com/bollywood/sanjay-mishra-s-entry-for-me-at-20-trend-is-epic-watch-him-do-the-barati-dance/story-o9PRLgrAocCHuqStD3xKAO.html", "urlToImage": null, "publishedAt": "2020-04-26T13:10:18Z", "content": "Actor Sanjay Mishra has shared a throwback video in which he is seen doing the typical ‘baraati’ dance at a wedding ceremony. Sanjay decided to join the popular trend on social media where people post pictures and videos of themselves when they were 20 years … [+1758 chars]"}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": "Pinkvilla Desk", "title": "Taarak Mehta Ka Ooltah Chashmah fame Munmun Dutta aka Babita CLARIFIES she is NOT on TikTok - PINKVILLA", "description": "Taarak Mehta Ka Ooltah Chashmah actress Munmun Dutta aka Babita recently revealed that she is not using Tiktok and urged her fans to report fake accounts on the app. Read on.", "url": "https://www.pinkvilla.com/tv/news-gossip/taarak-mehta-ka-ooltah-chashmah-fame-munmun-dutta-aka-babita-clarifies-she-not-tiktok-527574", "urlToImage": null, "publishedAt": "2020-04-26T12:34:26Z", "content": null}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Karan Johar says sorry for social media posts: Have realised that I may have been insensitive - India Today", "description": "Karan Johar took to Twitter to apologies for his recent social media posts.", "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johar-says-sorry-for-social-media-posts-have-realised-that-i-may-have-been-insensitive-1671359-2020-04-26", "urlToImage": null, "publishedAt": "2020-04-26T12:33:59Z", "content": "Filmmaker Karan Johar on Sunday said he is apologetic for his social media posts, many of which may have come off as \"insensitive\", at a time when the world is fighting the coronavirus outbreak.\r\nJohar's post came as a reaction to Australian comedian Greta Le… [+2240 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Vatsala Devki Vats", "title": "Shaheer Sheikh Couldn't Speak To Anyone For Days After Shooting Draupadi's Cheer-Haran Scene - Indiatimes.com", "description": "Actor Shaheer Sheikh who brilliantly plays the character of Arjun in the rerun of Mahabharat feels the exact same way. After shooting Draupadi's cheer-haran scene, he was terribly sad.", "url": "https://www.indiatimes.com/entertainment/celebs/shaheer-sheikh-couldnt-speak-to-anyone-for-days-after-shooting-draupadis-cheer-haran-scene-511805.html", "urlToImage": null, "publishedAt": "2020-04-26T12:16:45Z", "content": "For anyone who has ever watched or read the epic Mahabharat, there is nothing as devastating and heartbreaking as Draupadi's Cheer-Haran.  That particular scene can only be described with unspeakable sadness and silence. \r\nActor Shaheer Sheikh who brilliantly… [+924 chars]"}, {"source": {"id": null, "name": "Thenewsminute.com"}, "author": null, "title": "'Kammatipaadam' actor Manikandan scales down wedding, donates to CMDRF instead - The News Minute", "description": "Actor Manikandan R Achari, best known for his debut role in the 2016 film Kammatipaadam, got married to Anjaly on Sunday morning. They had a small wedding, taking into consideration the COVID-19 situation, and the actor contributed the money earlier meant for…", "url": "https://www.thenewsminute.com/article/kammatipaadam-actor-manikandan-scales-down-wedding-donates-cmdrf-instead-123365", "urlToImage": null, "publishedAt": "2020-04-26T12:04:07Z", "content": "The actor got married to Anjaly at a temple in Tripunithura on Sunday.Actor Manikandan R Achari, best known for his debut role in the 2016 film Kammatipaadam, got married to Anjaly on Sunday morning. They had a small wedding, taking into consideration the COV… [+1665 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Mimansa Shekhar", "title": "Coronavirus impact explained: How India’s film industry got hit and is preparing for a new normal - The Indian Express", "description": "While the impact of the lockdown on the Indian film industry at large is still being evaluated, we take a look at how slim production and related fields have suffered in India over the past month.", "url": "https://indianexpress.com/article/explained/explained-how-will-coronavirus-impact-entertainment-industry-6370412/", "urlToImage": null, "publishedAt": "2020-04-26T11:50:50Z", "content": "Written by Mimansa Shekhar\r\n | New Delhi | \r\nUpdated: April 26, 2020 5:16:47 pm\r\nThe Indian film industry is going through its worst phase because of the lockdown necessitated by the coronavirus pandemic. (Express Photo By Pavan Khengre)Big releases postponed… [+16798 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "Omar Rashid", "title": "Every person I came in contact with tested negative, says singer Kanika Kapoor - The Hindu", "description": "In a statement issued on Sunday, she responded to allegations of not adhering to quarantine norms.", "url": "https://www.thehindu.com/entertainment/every-person-i-came-in-contact-with-tested-negative-says-singer-kanika-kapoor/article31437427.ece", "urlToImage": null, "publishedAt": "2020-04-26T11:44:57Z", "content": "Bollywood singer Kanika Kapoor on Sunday for the first time openly responded to allegations of not adhering to quarantine norms around the time she had returned from abroad and tested positive for COVID-19 last month.\r\n\"Every person that I have come in contac… [+1685 chars]"}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": "Pinkvilla Desk", "title": "WATCH: Sonakshi Sinha wants to steal THESE things from Alia Bhatt, Katrina Kaif, Salman Khan, Akshay Kumar - PINKVILLA", "description": "Sonakshi Sinha reveals everything she would like to steal from Alia Bhatt, Katrina Kaif, Deepika Padukone, Akshay Kumar, Taapsee Pannu, Salman Khan, Ranveer Singh, Vidya Balan and others.", "url": "https://www.pinkvilla.com/entertainment/news/watch-sonakshi-sinha-wants-steal-these-things-alia-bhatt-katrina-kaif-salman-khan-akshay-kumar-527615", "urlToImage": null, "publishedAt": "2020-04-26T11:03:26Z", "content": null}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Step inside Taapsee Pannu’s house in Mumbai, actor recalls how she made it home. Watch video - Hindustan Times", "description": "Taapsee Pannu, who has been sharing throwback pictures and videos, on Saturday, shared her experience about moving into her own apartment in Mumbai.", "url": "https://www.hindustantimes.com/bollywood/step-inside-taapsee-pannu-s-house-in-mumbai-actor-recalls-how-she-made-it-home-watch-video/story-oZ90qWQm4Um1TJOysIRiQI.html", "urlToImage": null, "publishedAt": "2020-04-26T11:02:24Z", "content": "Actor Taapsee Pannu has been sharing throwback images and videos, making her journey as an outsider in Bollywood. Her latest is about when she bought her flat in Mumbai and made it her own.\r\nSharing a picture, she wrote how the process coincided with her shoo… [+3591 chars]"}, {"source": {"id": null, "name": "Indiaglitz.com"}, "author": "IndiaGlitz", "title": "Suriya-Jyothika issue gets government intervention - Tamil News - IndiaGlitz.com", "description": "Suriya's 2D Entertainment has sold its upcoming movie 'Ponmagal Vanthaal' starring Jyothika and K. Bhagyaraj to Amazon Prime for a whopping 9 crores", "url": "https://www.indiaglitz.com/suriya-jyothika-movies-issue-with-theater-owners-government-to-intervene-kadambur-raju-tamil-news-258989", "urlToImage": null, "publishedAt": "2020-04-26T10:47:14Z", "content": "Suriya's 2D Entertainment has sold its upcoming movie 'Ponmagal Vanthaal' starring Jyothika and K. Bhagyaraj to Amazon Prime for a whopping 9 Crores and the film is all set to stream on the OTT in May foregoing the theatrical release. The Tamil Nadu theater o… [+801 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Subhash Ghai says Kartik Aaryan is working hard to be superstar like Aamir Khan and Salman Khan; shares a - Times of India", "description": "Filmmaker Subhash Ghai, who is known for his hit films and entertainers filled with romance, song and masala, has w", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/subhash-ghai-says-kartik-aaryan-is-working-hard-to-be-superstar-like-aamir-khan-and-salman-khan-shares-an-unseen-pic/articleshow/75389455.cms", "urlToImage": null, "publishedAt": "2020-04-26T10:08:00Z", "content": null}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": null, "title": "Brad Pitt turns Dr Fauci in new SNL At Home episode - khabrisala", "description": "", "url": "https://indianexpress.com/article/entertainment/television/brad-pitt-turns-dr-fauci-in-new-snl-at-home-episode-6379981/", "urlToImage": null, "publishedAt": "2020-04-26T09:35:00Z", "content": "By: PTI | Los Angeles |Published: April 26, 2020 2:06:25 pm \r\nBrad Pitts flip as Dr Anthony Fauci comes weeks after director of the National Institute of Allergy and Infectious Diseases was requested who he want to impersonate him on SNL.\r\nOscar winner Brad P… [+2575 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Neena Gupta bakes delicious cake with mangoes and cream in new video. Here's the basic recipe - India Today", "description": "Neena Gupta spent Saturday baking a cake with mangoes and cream. She shared a video on Instagram.", "url": "https://www.indiatoday.in/lifestyle/celebrity/story/neena-gupta-bakes-delicious-cake-with-mangoes-and-cream-in-new-video-here-s-the-basic-recipe-1671271-2020-04-26", "urlToImage": null, "publishedAt": "2020-04-26T09:07:29Z", "content": "It is the season of mangoes and if you are in the mood to bake a sweet delight with the king of fruits, turn to Neena Gupta's Instagram. The 60-year-old actress baked a delectable mango cake on Saturday and also shared a basic recipe of it with her fans and f… [+1593 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "The Kapil Sharma Show's Archana Puran Singh thanks fans for half a million followers on Instagram; apolog - Times of India", "description": "The Kapil Sharma Show's special judge Archana Puran Singh is extremely active on social media, especially Instagram", "url": "https://timesofindia.indiatimes.com/tv/news/hindi/the-kapil-sharma-shows-archana-puran-singh-thanks-fans-for-half-a-million-followers-on-instagram-apologises-for-not-being-able-to-reply-to-everyone/articleshow/75388801.cms", "urlToImage": null, "publishedAt": "2020-04-26T09:01:00Z", "content": null}, {"source": {"id": null, "name": "Spotboye.com"}, "author": "Vickey Lalwani", "title": "Hindustani Bhau: 'Big Deal That Asim Riaz Isn't A Part Of Bigg Boss 13 WhatsApp Group, Even Sidharth-Shehnaaz Aren't!'- EXCLUSIVE - SpotboyE", "description": "Hindustani Bhau is rather amused at the brouhaha that the WhatsApp Group of Bigg Boss 13 inmates made by him does not have Asim Riaz", "url": "https://www.spotboye.com/television/television-news/hindustani-bhau-big-deal-that-asim-riaz-isn-t-a-part-of-bigg-boss-13-whatsapp-group-even-sidharth-shehnaaz-aren-t-exclusive/5ea54abd74f5ce660a225788", "urlToImage": null, "publishedAt": "2020-04-26T08:49:02Z", "content": "Up NextBrad Pitt AKA Dr Fauci Takes On Donald Trump On Saturday Night Live; Finishes Off Saying, 'I'm Getting Fired'"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Joel Kurian", "title": "No government gave me any award; didnt get commercial films after Ramayan: Arun Govil - Republic World - Republic World", "description": "Arun Govil stated that no government, either central or state, gave him any award. The actor also said that he didn't get commercial films after 'Ramayan'.", "url": "https://www.republicworld.com/entertainment-news/television-news/ramayan-ram-actor-arun-govil-episode-sita-dd-time-films-awards-governm.html", "urlToImage": null, "publishedAt": "2020-04-26T08:42:02Z", "content": "One often sees artists achieving success in the initial phases of their careers, but failing to sustain it for a long time. The same had happened with Arun Govil, who is back in the news for the re-run of Ramayan. The actor, who played the role of Lord Ram in… [+2158 chars]"}, {"source": {"id": null, "name": "Indiaglitz.com"}, "author": "IndiaGlitz", "title": "Thala Ajith's personal request to fans regarding birthday celebrations - Tamil News - IndiaGlitz.com", "description": "May 1st is observed as the International Workers Day all around the world but to Ajith's fans numbering in millions its Thala Day", "url": "https://www.indiaglitz.com/thala-ajith-requests-fans-not-to-celebrate-birthday-due-to-coronavirus-pandemic-tamil-news-258981", "urlToImage": null, "publishedAt": "2020-04-26T08:16:58Z", "content": "May 1st is observed as the International Workers Day all around the world but to Ajith's fans numbering in millions its Thala Day which they celebrate with as much vigour on the the streets as they do on social media. With just four days to go Thala fans on t… [+1316 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "NewsClicks", "title": "Sunny Leone posts adorable video with Nisha, says she is a ‘lucky mommy’ to have a daughter who is ‘so... - NewsClicks", "description": "Actor Sunny Leone on Sunday posted an adorable video with her daughter Nisha. In the video, the mom and daughter pose for the digital camera with rose tiaras on their foreheads. Sharing the video, Sunny wrote: “Nisha is so so pretty!! I’m a lucky mommy! With …", "url": "https://www.hindustantimes.com/bollywood/sunny-leone-posts-adorable-video-with-nisha-says-she-is-a-lucky-mommy-to-have-a-daughter-who-is-so-so-pretty/story-aeT6RoohrY3hOa30WsS7LL.html", "urlToImage": null, "publishedAt": "2020-04-26T07:56:32Z", "content": "Actor Sunny Leone on Sunday posted an adorable video with her daughter Nisha. In the video, the mom and daughter pose for the digital camera with rose tiaras on their foreheads.\r\nSharing the video, Sunny wrote: Nisha is so so pretty!! Im a lucky mommy! With t… [+1901 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "This adorable viral video of a lion cub reminded the Internet of Simba from The Lion King. Watch - India Today", "description": "A super adorable video of a lion cub has gone crazy viral on social media after it was shared on Twitter.", "url": "https://www.indiatoday.in/trending-news/story/this-adorable-viral-video-of-a-lion-cub-reminded-the-internet-of-simba-from-the-lion-king-watch-1671244-2020-04-26", "urlToImage": null, "publishedAt": "2020-04-26T07:55:45Z", "content": "Wildlife lovers cannot get enough of a video of an adorable lion cub that has gone crazy viral on the internet. Social media is flooded with wildlife posts almost every other day but Twitter mostly obsesses over clips of animal cubs and babies.\r\nThis video of… [+1605 chars]"}, {"source": {"id": null, "name": "Bollywoodlife.com"}, "author": "Ganesh Aaglave", "title": "It's Awkward! These throwback pictures of Salman Khan and Janhvi Kapoor will provide a double dose of enterta - Bollywood Life", "description": "This time, stars like Salman Khan, Janhvi Kapoor, Malaika Arora, Ananya Panday and Kartik Aaryan have graced our ‘Awkward Pictures’ category.", "url": "https://www.bollywoodlife.com/news-gossip/its-awkward-these-throwback-pictures-of-salman-khan-and-janhvi-kapoor-will-provide-a-double-dose-of-entertainment-this-sunday-1611520/", "urlToImage": null, "publishedAt": "2020-04-26T07:53:37Z", "content": "We are staying at home and praying that the lockdown gets over soon. In the interim, we are counting the days and keeping ourselves busy by learning new activities and binge-watching our favourite shows on OTT platforms. Meanwhile, we have filtered some of th… [+2042 chars]"}, {"source": {"id": null, "name": "Asianetnews.com"}, "author": null, "title": "Did you know Shah Rukh Khan cheated wife Gauri on their honeymoon? - Asianet News English", "description": "In an event, Shah Rukh Khan revealed a hilarious story from his honeymoon, where he tricked his wife Gauri", "url": "https://newsable.asianetnews.com/gallery/entertainment/did-you-know-shah-rukh-khan-cheated-wife-gauri-on-their-honeymoon--q9dx5f", "urlToImage": null, "publishedAt": "2020-04-26T07:37:19Z", "content": "\"This is my favourite picture...When I got married, I was very poor while Gauri was middle class, well to do. So like how usually everyone does, I had promised her that after we get married, I'll take her to Paris and show her the Eiffel Tower. But obviously,… [+374 chars]"}, {"source": {"id": null, "name": "Telugucinema.com"}, "author": "tc editor", "title": "No second heroine in Allu Arjun's Pushpa - Telugu Cinema", "description": "That Nivetha Thomas has been roped in to play the second female lead in Sukumar’s recently launched action thriller ‘Pushpa’ has widely been reported. ‘Pushpa’ that features Allu Arjun in the lead role has been hitting the headlines of late. But sources close…", "url": "https://www.telugucinema.com/news/no-second-heroine-allu-arjuns-pushpa", "urlToImage": null, "publishedAt": "2020-04-26T07:17:03Z", "content": "That Nivetha Thomas has been roped in to play the second female lead in Sukumars recently launched action thriller Pushpa has widely been reported. Pushpa that features Allu Arjun in the lead role has been hitting the headlines of late. But sources close to t… [+688 chars]"}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": "Dishya Sharma", "title": "Stylish Zayn Malik steals our hearts away as he poses with Gigi Hadid and Bella Hadid - PINKVILLA", "description": "Zayn Malik looks straight out 2012 as he poses with girlfriend Gigi Hadid on her 25th birthday. The couple had Bella Hadid in tow.", "url": "https://www.pinkvilla.com/entertainment/hollywood/stylish-zayn-malik-steals-our-hearts-away-he-poses-gf-gigi-hadid-and-bella-hadid-527576", "urlToImage": null, "publishedAt": "2020-04-26T06:56:27Z", "content": null}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Irrfan Khan attends mother Saeda Begum’s funeral via video conferencing - Hindustan Times", "description": "Irrfan Khan’s mother Saeda Begum died on Saturday morning. The actor could not make it to her funeral, owing to the lockdown.", "url": "https://www.hindustantimes.com/bollywood/irrfan-khan-attends-mother-saeda-begum-s-funeral-via-video-conferencing/story-U1oaroYOIteMiIH1R9zxWO.html", "urlToImage": null, "publishedAt": "2020-04-26T06:37:04Z", "content": "Unable to travel to Rajasthan for his mother Saeda Begum’s last rites, Irrfan Khan was a part of the funeral through video conferencing. Her last rites were performed on Saturday evening at Chungi Naka graveyard on the outskirts of Jaipur. DNA reports that on… [+1143 chars]"}, {"source": {"id": null, "name": "Ibtimes.co.in"}, "author": "Tanvi Lad", "title": "'Do more movies than magazine covers', when Imran Khan criticized Sonam Kapoor - International Business Times, India Edition", "description": "Bollywood actor Imran Khan had openly taken a dig at Sonam Kapoor on national television. This definitely irked the leggy lass but she never reacted to the same.", "url": "https://www.ibtimes.co.in/do-more-movies-magazine-covers-when-imran-khan-criticized-sonam-kapoor-818439", "urlToImage": null, "publishedAt": "2020-04-26T06:26:43Z", "content": "Great validation for women in media: Sonam Kapoor on Veere Di Weddings success\r\nSonam Kapoor can never be untagged from being Bollywood's fashionista. But that's quite unfortunate that Sonam is widely known for her magnificent fashion sense rather than her ac… [+1388 chars]"}, {"source": {"id": null, "name": "Telanganatoday.com"}, "author": "Telangana Today", "title": "Samantha fans bowled over by Tamannaah Bhatia's tweet - Telangana Today", "description": "Hyderabad: It's a rare sight for anyone in Telugu cinema industry to have female stars praising each other. Samantha Akkineni fans went gaga over actor Tamannaah Bhatia' tweet, On an exceptionally special occasion, I’d like to reveal #SamanthaBirthdayCDP The …", "url": "https://telanganatoday.com/samantha-fans-bowled-over-by-tamannahs-tweet", "urlToImage": null, "publishedAt": "2020-04-26T06:20:00Z", "content": "Hyderabad: It’s a rare sight for anyone in Telugu cinema industry to have female stars praising each other. Samantha Akkineni fans went gaga over actor Tamannaah Bhatia’ tweet, “On an exceptionally special occasion, Id like to reveal #SamanthaBirthdayCDP The … [+1811 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "Vaishali Jain", "title": "Avengers Endgame 1 Year Anniversary: How a World Gripped with Fear of Covid-19 Can Relate to it Now More ... - News18", "description": "As the Hollywood blockbuster 'Avengers: Endgame' celebrates its one year anniversary, we look at how the movie holds water even today.", "url": "https://www.news18.com/news/movies/avengers-endgame-1-year-anniversary-how-a-world-gripped-with-fear-of-covid-19-can-relate-to-it-now-more-than-ever-2593117.html", "urlToImage": null, "publishedAt": "2020-04-26T06:17:22Z", "content": "Believe it or not, but one year has passed since Captain America (Chris Evans) led the entire Marvel Cinematic Universe in the fight against Thanos (Josh Brolin) and his alien army in Avengers: Endgame, which released in theaters on this day in 2019.\r\nThe Mar… [+3915 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Arushi Jain", "title": "Hundred: 100 marks to Rinku Rajguru and Lara Dutta - The Indian Express", "description": "Watch Hundred for Rinku Rajguru and Lara Dutta's performance. Though not binge-watch worthy, it does provide some laughs.", "url": "https://indianexpress.com/article/entertainment/opinion-entertainment/hundred-hotstar-100-marks-to-rinku-rajguru-and-lara-dutta-6378956/", "urlToImage": null, "publishedAt": "2020-04-26T06:17:08Z", "content": "Written by Arushi Jain\r\n | New Delhi | \r\nUpdated: April 26, 2020 11:43:55 am\r\nHundred, starring Lara Dutta and Rinku Rajguru, is streaming on Disney Plus Hotstar.Hundred is about two women, Netra Patil (Rinku Rajguru) and Saumya Shukla (Lara Dutta). Netra, wh… [+2367 chars]"}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": "Pinkvilla Desk", "title": "7 years of Aashiqui 2: Five reasons why Shraddha & Aditya's romantic drama still leaves an impact on our heart - PINKVILLA", "description": "As Aashiqui 2 starring Shraddha Kapoor and Aditya Roy Kapur completes 7 years, we would like to give you 5 reasons why this romantic drama still leaves an impact on the audience's heart.", "url": "https://www.pinkvilla.com/entertainment/news/7-years-aashiqui-2-five-reasons-why-shraddha-adityas-romantic-drama-still-leaves-impact-our-heart-527572", "urlToImage": null, "publishedAt": "2020-04-26T06:13:44Z", "content": null}, {"source": {"id": null, "name": "Pinkvilla.com"}, "author": "Pinkvilla Desk", "title": "Bigg Boss 13’s Asim Riaz showers love on girlfriend Himanshi Khurana as she dons the Punjabi bride avatar - PINKVILLA", "description": "Bigg Boss 13 fame Asim Riaz and Himanshi Khurana are seeing each other post the show. In a recent post, Himanshi stunned as the typical Punjabi bride and beau Asim couldn’t stop gushing over her. Check it out.", "url": "https://www.pinkvilla.com/tv/news-gossip/bigg-boss-13-s-asim-riaz-showers-love-girlfriend-himanshi-khurana-she-dons-punjabi-bride-avatar-527358", "urlToImage": null, "publishedAt": "2020-04-26T06:10:14Z", "content": null}, {"source": {"id": null, "name": "Indiaglitz.com"}, "author": "IndiaGlitz", "title": "Thalapathy Vijay's 'Master' confirmed release on Amazon Prime but... - Tamil News - IndiaGlitz.com", "description": "The past few days the Kollywood film industry is in a tussle after Suriya deciding to stream his next movie 'Ponmagal Vandhal' starring Jyothika on Amazon Prime foregoing theatrical release", "url": "https://www.indiaglitz.com/thalapathy-vijays-master-confirmed-release-on-amazon-prime-but-tamil-news-258975", "urlToImage": null, "publishedAt": "2020-04-26T05:48:01Z", "content": "The past few days the Kollywood film industry is in a tussle after Suriya deciding to stream his next movie 'Ponmagal Vandhal' starring Jyothika on Amazon Prime foregoing theatrical release. Theater owners are seeing red and are threatening to boycott the big… [+811 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Malaika Arora crashes Arjun Kapoor’s Instagram live, hilariously trolls him for ‘boring’ quarantine... - Hindustan Times", "description": "Arjun Kapoor’s girlfriend Malaika Arora made fun of his quarantine routine and sarcastically called it “very interesting”.", "url": "https://www.hindustantimes.com/bollywood/malaika-arora-crashes-arjun-kapoor-s-instagram-live-hilariously-trolls-him-for-boring-quarantine-routine/story-g5DKgeWOA2bA5GQSlR9EsL.html", "urlToImage": null, "publishedAt": "2020-04-26T05:44:55Z", "content": "Arjun Kapoor and Malaika Arora never miss a chance to pull each other’s leg, and it was no different on Saturday evening. She crashed her boyfriend’s Instagram live and poked fun at his daily routine during the lockdown.\r\nWith all shoots on hold due to the co… [+1678 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Deepika Padukone wishes her BFF on her birthday through a video call, shares a picture of their life 50 y - Times of India", "description": "Actress Deepika Padukone, who was looking forward to starting the shoot of her next with Shakun Batra, is currently", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/deepika-padukone-wishes-her-bff-on-her-birthday-through-a-video-call-shares-a-picture-of-their-life-50-years-from-now/articleshow/75386711.cms", "urlToImage": null, "publishedAt": "2020-04-26T05:36:00Z", "content": null}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Chris Pratt and Katherine Schwarzenegger are Expecting Their First Child Together - News18", "description": "Chris and Katherine wed in June last year and now they have revealed that they are expecting their first child together.", "url": "https://www.news18.com/news/movies/chris-pratt-and-katherine-schwarzenegger-are-expecting-their-first-child-together-2593055.html", "urlToImage": null, "publishedAt": "2020-04-26T05:19:26Z", "content": "Hollywood actor Chris Pratt and his partner, author Katherine Schwarzenegger are expecting their first child together. Katherine and Chris were seen riding bikes when her baby bump was visible and it became clear that she was pregnant with Chris' child. In an… [+829 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Karan Johar realises mistake after watching sarcastic videos on celebs, Amitabh Bachchan gives ‘breaking... - Hindustan Times", "description": "Top entertainment news: Karan Johar has apologised for sharing ‘insensitive’ posts during coronavirus crisis while Amitabh Bachchan on Saturday declared on social media that a bat had entered his home in Mumbai.", "url": "https://www.hindustantimes.com/bollywood/karan-johar-realises-mistake-after-sarcastic-videos-on-celebs-amitabh-bachchan-gives-breaking-news-from-jalsa/story-aydICNSMdMWh6XsbPfwLRM.html", "urlToImage": null, "publishedAt": "2020-04-26T05:15:02Z", "content": "Amitabh Bachchan has a crisis at home in Covid-19 times, says ‘Breaking news, a bat just entered my home’\r\nActor Amitabh Bachchan, who has been putting out motivational posts through out the coronavirus pandemic, felt the crisis up close and personal on Satur… [+2147 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Mahira Sharma’s mother Sania says she will ‘not oppose’ the actor if she wants to marry Paras Chhab... - Hindustan Times", "description": "Sania Sharma said that though her daughter Mahira Sharma is not dating Paras Chhabra, she will have no objections if they decide to get married in the future.", "url": "https://www.hindustantimes.com/tv/mahira-sharma-s-mother-sania-says-she-will-not-oppose-the-actor-if-she-wants-to-marry-paras-chhabra/story-0fTFjp8VIQl8uRePijhc5N.html", "urlToImage": null, "publishedAt": "2020-04-26T05:14:59Z", "content": "Even as rumours of Paras Chhabra and Mahira Sharma’s romance intensify, her mother Sania Sharma has said that if they decide to get married in the future, she will have no objection to it. She, however, insisted that her daughter is not in a relationship with… [+2095 chars]"}, {"source": {"id": null, "name": "Bollywoodhungama.com"}, "author": "Bollywood Hungama", "title": "Sachin Tendulkar addresses Ayushmann Khurrana as Professor from Money Heist - Bollywood Hungama", "description": "Sachin Tendulkar addresses Ayushmann Khurrana as Professor from Money Heist . Latest Bollywood News, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News at Bollywood Hungama.com", "url": "https://www.bollywoodhungama.com/news/features/sachin-tendulkar-addresses-ayushmann-khurrana-professor-money-heist/", "urlToImage": null, "publishedAt": "2020-04-26T05:10:43Z", "content": "Now, cricket legend Sachin Tendulkar addressed the Andhadhun actor as the Professor in a tweet. Tendulkar was replying to Ayushmann Khurrana wishing him on his birthday. In his tweet, Sachin wrote, \"Thanks for your prayers &amp; support over the years, 'Profe… [+693 chars]"}, {"source": {"id": null, "name": "Indiaglitz.com"}, "author": "IndiaGlitz", "title": "WOW! Tamannaah takes up the 'Pillow challenge' effortlessly - Tamil News - IndiaGlitz.com", "description": "Tamannaah has surprised her fans by taking up this trending Pillow challenge as she shared a picture of herself wearing a white pillow.", "url": "https://www.indiaglitz.com/tamannaah-takes-up-the-pillow-challenge-effortlessly--tamil-news-258971", "urlToImage": null, "publishedAt": "2020-04-26T05:10:17Z", "content": "Amid the ongoing COVID-19 pandemic and lockdown, the latest challenge that's going viral on the internet is the 'Pillow Challenge' which is being aced by celebrities from across the globe. It seems like the Pillow Challenge has hit many of our Indian celebrit… [+812 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Priyanka Chopra Jonas wears a saree at home as she poses for a romantic picture with hubby Nick Jonas ami - Times of India", "description": "Lockdown has given ample time to our B-town celebrities to spend quality time with their loved ones. Every day we g", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/priyanka-chopra-jonas-wears-a-saree-at-home-as-she-poses-for-a-romantic-picture-with-hubby-nick-jonas-amid-the-lockdown/articleshow/75386442.cms", "urlToImage": null, "publishedAt": "2020-04-26T05:05:00Z", "content": null}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Netflix has secret codes for hidden movies, shows: Here’s the whole list - Hindustan Times", "description": "Netflix has a lot of shows that might not show up on your home page thanks to what you watch normally. Here’s how you can unlock a bigger treasure trove of content", "url": "https://www.hindustantimes.com/tech/netflix-has-secret-codes-for-hidden-movies-shows-here-s-the-whole-list/story-yUcZuWvhZr2g7SgLNHqcNM.html", "urlToImage": null, "publishedAt": "2020-04-26T04:07:45Z", "content": "We are certain you have been watching a LOT of Netflix lately and you might have just exhausted everything you think this streaming platform has to offer. Don’t worry, we have news for you. \r\nNetflix has a whole list of secret codes that you can use to find m… [+7648 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Taimur Ali Khan bumps into father Saif Ali Khan’s interview yet again and it is just too cute for words - - Times of India", "description": "Kareena Kapoor Khan and Saif Ali Khan's son Taimur Ali Khan is one of the most loved star kids in Bollywood. He enj", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/taimur-ali-khan-bumps-into-father-saif-ali-khans-interview-yet-again-and-it-is-just-too-cute-for-words-watch/articleshow/75385828.cms", "urlToImage": null, "publishedAt": "2020-04-26T03:48:00Z", "content": null}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Eric Robinette", "title": "People Can't Get Over How Weird Tony Stark and Wanda's Relationship Is in the MCU - Showbiz Cheat Sheet", "description": "Trying to recall the nature of the relationship between Iron Man and Scarlet Witch in the Marvel Cinematic Universe is no easy task.", "url": "https://www.cheatsheet.com/entertainment/people-cant-get-over-how-weird-tony-stark-and-wandas-relationship-is-in-the-mcu.html/", "urlToImage": null, "publishedAt": "2020-04-26T02:45:28Z", "content": "Trying to recall the relationship between Iron Man and Scarlet Witch in the Marvel Cinematic Universe is no easy task. That’s not because their relationship is so strange – it’s that they barely have one. \r\nThe two characters share the screen for probably les… [+3882 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Varun-Natasha’s engagement announcement to Police complaint against Kangana Ranaut – here are the newsmakers of the week - Times of India", "description": "Bollywood celebrities are making sure to keep fans entertained through lockdown. From Kartik Aaryan posting videos on social media to Ileana D’Cruz winning the internet with her response to a fan – stars are hitting headlines for all things interesting. And a…", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/varun-natashas-engagement-announcement-to-police-complaint-against-kangana-ranaut-here-are-the-newsmakers-of-the-week/photostory/75383226.cms", "urlToImage": null, "publishedAt": "2020-04-26T02:30:00Z", "content": "Kangana Ranaut hit headlines this week following a police complaint against her. According to IANS, advocate Ali Kaashif Khan Deshmukh has filed a complaint against Kangana for allegedly referring to people of a particular community as \"terrorist\" and coming … [+341 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Samir Jain", "title": "Horoscope Today, 26 April 2020: Check astrological prediction for Aries, taurus, Gemini, Cancer and other - Times of India", "description": "Horoscope(Old) News: What do the stars foretell today? We have the answer… Aries Today is a good day for gains.", "url": "https://timesofindia.indiatimes.com/astrology/horoscope/horoscope-today-april-26-2020-check-astrological-prediction-for-sagittarius-capricorn-aquarius-pisces-and-other-signs/articleshow/75370185.cms", "urlToImage": null, "publishedAt": "2020-04-26T02:15:40Z", "content": "What do the stars foretell today? We have the answerAries Today is a good day for gains. You may make good plans to get good gain from your investments. You may likely to save money by avoiding spending on unnecessary stuff which may boost your savings. Love … [+4033 chars]"}, {"source": {"id": null, "name": "Vogue.in"}, "author": "Nupur Sarvaiya", "title": "Aishwarya Rai Bachchan’s pink lehenga from her mehandi is for brides who love soothing hues - VOGUE India", "description": "Aishwarya Rai Bachchan chose a romantic pink lehenga for her pre-wedding celebrations back in 2007. Here's how you can get the look", "url": "https://www.vogue.in/wedding-wardrobe/collection/aishwarya-rai-bachchan-pink-mehandi-lehenga-neeta-lulla-long-blouse-floral-maangtikka-necklace-earrings-abhishek-bachchan/", "urlToImage": null, "publishedAt": "2020-04-26T01:12:38Z", "content": "For her wedding with Abhishek Bachchan back in April 2007, Aishwarya Rai Bachchan served up a good mix of traditional and contemporary bridal looks. While the star dressed in a pastel blue Abu Jani Sandeep Khosla lehenga for her sangeet, a regal gold silk sar… [+1517 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Alok Nayak", "title": "Former WWE Superstar Accuses CM Punk of Stealing His Finisher - Essentially Sports", "description": "GTS( Go to Sleep) a finishing maneuver that CM Punk made famous. However, it was not invented by Punk as per former WWE supertstar, KENTA", "url": "https://www.essentiallysports.com/wwe-news-former-wwe-superstar-accuses-cm-punk-of-stealing-his-finisher/", "urlToImage": null, "publishedAt": "2020-04-26T00:44:00Z", "content": "CM Punk has been away from the WWE ring for years now. However, fans in the arena never miss a chance to appreciate the Voice of the voiceless by chanting his name. CM Punk brought a revolution in WWE when he went against the Bossman, Vince McMahon, and start… [+1665 chars]"}, {"source": {"id": null, "name": "Dawn.com"}, "author": "Images Staff", "title": "Imran Khan shares why the youth needs to watch Dirilis Ertugul - DAWN.com", "description": "The dubbed version of the Turkish drama is airing on PTV as per the Prime Minister's request.", "url": "https://images.dawn.com/news/1185146", "urlToImage": null, "publishedAt": "2020-04-26T00:09:51Z", "content": "Turkish dramas have always been rather popular here but it was a personal recommendation from Imran Khan that put Dirili Erturul on the top of everyone's must-watch list.\r\nIn fact, it was the Prime Minister's request that led to the drama being dubbed in Urdu… [+478 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Alok Nayak", "title": "“Top Five at Worst”- WWE Hall of Famer Makes a Huge Claim About John Cena - Essentially Sports", "description": "After winning WWE champion for record 16 times, should John Cena be on the Mt. Rushmore of WWE? Jim Ross gives his verdict", "url": "https://www.essentiallysports.com/wwe-news-top-five-at-worst-wwe-hall-of-famer-makes-a-huge-claim-about-john-cena/", "urlToImage": null, "publishedAt": "2020-04-25T23:23:00Z", "content": "When you are talking about the greatest pro wrestlers to ever step into the WWE ring the name John Cena comes to the table. Making his debut in the attitude era, John Cena instantly became a fan favorite thanks to his charismatic persona and his in-ring talen… [+1856 chars]"}, {"source": {"id": null, "name": "Telugucinema.com"}, "author": "tc editor", "title": "Pic: Naga Chaitanya's quarantine look - Telugu Cinema", "description": "Naga Chaitanya and his wife Samantha have been kept themselves during this lockdown period. They have cut down posts on social media as well. After being silent on social media for more than two weeks, Samantha is now sharing a pic or two.  She now posted a n…", "url": "https://www.telugucinema.com/news/pic-naga-chaitanyas-quarantine-look", "urlToImage": null, "publishedAt": "2020-04-25T18:33:09Z", "content": "Naga Chaitanya and his wife Samantha have been kept themselves during this lockdown period. They have cut down posts on social media as well. After being silent on social media for more than two weeks, Samantha is now sharing a pic or two. \r\nShe now posted a … [+642 chars]"}, {"source": {"id": null, "name": "Tecake.com"}, "author": null, "title": "Kylie Jenner no makeup photo is going viral! You won’t recognise her - The TeCake", "description": "Amid Coronavirus pandemic that has forced people to stay in lockdown in their homes, many celebrities have chosen to go with no makeup look. Celebrities", "url": "https://tecake.com/news/kylie-jenner-no-makeup-photo-is-going-viral-you-wont-recognise-her-292533.html", "urlToImage": null, "publishedAt": "2020-04-25T18:23:31Z", "content": "Amid Coronavirus pandemic that has forced people to stay in lockdown in their homes, many celebrities have chosen to go with no makeup look. Celebrities are sharing their photos of bare face and oh boy, they look a lot different without make. It would take yo… [+2682 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Titas Chowdhury", "title": "The name ‘Arjun’ went on to give me everything that I dreamed of: Firoz Khan - Hindustan Times", "description": "Actor Firoz Khan reminisces about the time when producers confused him with Feroz Khan - the Qurbani actor", "url": "https://www.hindustantimes.com/bollywood/the-name-arjun-went-on-to-give-me-everything-that-i-dreamed-of-firoz-khan/story-qgUIbqqrE4ZvSQmcAhjlDP.html", "urlToImage": null, "publishedAt": "2020-04-25T18:12:29Z", "content": "With Mahabharat re-running on DD Bharati and grabbing a lot of eyeballs, actor Firoz Khan who’s known by the moniker Arjun, is on cloud nine. “It’s a proud moment to watch Mahabharat with the present generation. It’s a good opportunity for them to know more a… [+1748 chars]"}, {"source": {"id": null, "name": "Digitalspy.com"}, "author": "Dan Seddon", "title": "Spider-Man star is hosting Marvel-themed Instagram quiz - digitalspy.com", "description": "Get involved via Instagram next week.", "url": "https://www.digitalspy.com/movies/a32276017/spider-man-tom-holland-marvel-virtual-quiz/", "urlToImage": null, "publishedAt": "2020-04-25T16:49:00Z", "content": "Spider-Manactor Tom Holland will be hosting a Marvel-themed quiz on Instagram during the coronavirus lockdown.\r\nIn conjunction with The Brothers Trust, which was set up by Holland's family to support various charities, this virtual quiz will take place next W… [+1432 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Amir Khollam", "title": "How many devices can use Amazon Prime Video on a single account? - Republic World - Republic World", "description": "How many devices can use Amazon Prime Video on a single account? has reportedly been a frequently searched question on the internet. Read to know the answer.", "url": "https://www.republicworld.com/technology-news/apps/how-many-devices-can-use-amazon-prime-video-on-a-single-account.html", "urlToImage": null, "publishedAt": "2020-04-25T15:08:00Z", "content": "Amazon Prime Video is one of the most famous streaming platforms in India and across the globe. As per reports, Amazon Prime Video itself has a subscriber base of over 100 million users. The video streaming platform has a number of movies and shows from vario… [+1943 chars]"}, {"source": {"id": null, "name": "Mirchi9.com"}, "author": "Saumya", "title": "Telugu Girl’s Small Mistake Magnified? - Mirchi9", "description": "picture surfaced showing a guy clicking one of the pictures that she uploaded. It looked like faking that she shot for the pics herself while she had help from a guy. Social distancing is the present norm and social media trolls weren't in a mood to forgive h…", "url": "https://www.mirchi9.com/movienews/sobhita-dhulipala-telugu-girls-small-mistake-magnified/", "urlToImage": null, "publishedAt": "2020-04-25T14:46:44Z", "content": null}, {"source": {"id": null, "name": "Tellychakkar.com"}, "author": "Tellychakkar Team", "title": "What? Prince Narula no longer talks to good friend Arhaan Khan - Tellychakkar", "description": "MUMBAI: Bigg Boss Season 13 was a huge hit. Contestants Rashami Desai and Arhaan Khan's relationship and breakup during the show made numerous headlines.", "url": "https://www.tellychakkar.com/tv/tv-news/what-prince-narula-no-longer-talks-good-friend-arhaan-khan-200425", "urlToImage": null, "publishedAt": "2020-04-25T13:54:00Z", "content": "MUMBAI: Bigg Boss Season 13 was a huge hit. Contestants Rashami Desai and Arhaan Khan's relationship and breakup during the show made numerous headlines. \r\nDuring Bigg Boss 13, Rashami and Arhaan made their relationship official. However, when Arhaan's secret… [+717 chars]"}, {"source": {"id": null, "name": "Tellychakkar.com"}, "author": "Tellychakkar Team", "title": "Did Kavita Kaushik just take a dig at Arnab Goswami? - Tellychakkar", "description": "MUMBAI: Journalist and anchor Arnab Goswami recently claimed that some goons attacked his car when he was travelling back home.", "url": "https://www.tellychakkar.com/tv/tv-news/did-kavita-kaushik-just-take-dig-arnab-goswami-200425", "urlToImage": null, "publishedAt": "2020-04-25T13:53:00Z", "content": "MUMBAI: Journalist and anchor Arnab Goswami recently claimed that some goons attacked his car when he was travelling back home. He revealed that he was with his wife when the incident took place. He later took to social media to post a video calling out a pol… [+1274 chars]"}, {"source": {"id": null, "name": "Iwmbuzz.com"}, "author": "Editorial Team", "title": "OMG: No theatre release for Akshay Kumar and Kiara Advani starrer Laxmmi Bomb? - IWMBuzz", "description": "IWMBuzz tells you about the possible OTT release of Laxmmi Bomb. Read the story for more details", "url": "https://www.iwmbuzz.com/movies/news-movies/omg-no-theatre-release-akshay-kumar-kiara-advani-starrer-laxmmi-bomb/2020/04/25", "urlToImage": null, "publishedAt": "2020-04-25T13:30:38Z", "content": "Akshay Kumar and Kiara Advani’s Laxmmi Bomb happened to be one of the biggest releases that Akki and Kiara were looking forward to.\r\nHowever seems like due to the Covid-19 pandemic, things have taken a hit. As per media reports, Laxmmi Bomb might not have a t… [+213 chars]"}, {"source": {"id": null, "name": "Bollywoodhungama.com"}, "author": "Bollywood Hungama", "title": "Disha Patani says she hates pampering herself in a salon - Bollywood Hungama", "description": "Disha Patani says she hates pampering herself in a salon . Latest Bollywood News, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News at Bollywood Hungama.com", "url": "https://www.bollywoodhungama.com/news/features/disha-patani-says-hates-pampering-salon/", "urlToImage": null, "publishedAt": "2020-04-25T12:31:40Z", "content": "Talking to a daily, Disha said that she is very lazy when it comes to beauty treatments. However, with the lockdown in place, the actress is utilising the time doing facials. She said that she has been using face scrubs and masks. The Baaghi 2 actress said th… [+272 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Uday Bhatia", "title": "Film review: ‘Extraction’ on Netflix is a joyless slab of action cinema - Livemint", "description": "Chris Hemsworth lays waste to Dhaka in order to save an Indian drug lord’s kidnapped son in this Netflix film written by Joe Russo", "url": "https://www.livemint.com/mint-lounge/features/film-review-extraction-on-netflix-is-a-joyless-slab-of-action-cinema-11587817372674.html", "urlToImage": null, "publishedAt": "2020-04-25T12:29:38Z", "content": "Sometimes the smallest detail can trip up your experience of a movie. Forty minutes into Extraction, Tyler (Chris Hemsworth) and Ovi (Rudhraksh Jaiswal) are dodging gunmen in a Dhaka building. They break into an apartment, and the famous intro to Didi Tera De… [+3823 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "IANS", "title": "Suriya’s ‘Soorarai Pottru’ could be banned, if Jyothika’s ‘Pon Magal Vandhal’ releases directly on OTT - The Hindu", "description": "Tamil Nadu Theatre And Multiplex Owners’ Association respond to expected release of Jyothika’s film on Amazon Prime next month", "url": "https://www.thehindu.com/entertainment/movies/suriyas-soorarai-pottru-could-be-banned-if-jyothikas-pon-magal-vandhal-releases-directly-on-ott/article31432944.ece", "urlToImage": null, "publishedAt": "2020-04-25T12:25:03Z", "content": "The Tamil Nadu Theatre And Multiplex Owners Association have threatened to ban films starring Suriya, as well as the films produced by his production company 2D films. The decision comes after the news that the film Pon Magal Vandhal, produced by Suriya and s… [+1831 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Ajay Devgn asks fans to pause and reflect in new song Thahar Ja. Watch video - India Today", "description": "Ajay Devgn has released a new song called Thahar Ja. The song, which has been shot by the actor, marks the debut of his 9-year-old son Yug Devgn as an assistant director.", "url": "https://www.indiatoday.in/movies/celebrities/story/ajay-devgn-asks-fans-to-pause-and-reflect-in-new-song-thahar-ja-watch-video-1671020-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T12:22:30Z", "content": "While the world is grappling with the novel coronavirus pandemic, everyone is trying to stay positive. In this time, many celebrities are taking different means to help fans deal with the crisis.\r\nAjay Devgn has been taking to social media to keep people info… [+1953 chars]"}, {"source": {"id": null, "name": "Firstpost.com"}, "author": "", "title": "Beyond Money Heist, ten international shows to watch during Coronavirus lockdown, from Kingdom to 3% - Firstpost", "description": "If you’re looking to explore different kinds of shows, made in different parts of the world, here is a list on what to get started with", "url": "https://www.firstpost.com/entertainment/beyond-money-heist-ten-international-shows-to-watch-during-coronavirus-lockdown-from-kingdom-to-3-8287201.html", "urlToImage": null, "publishedAt": "2020-04-25T12:03:54Z", "content": "For more recommendations on what to watch during the Coronavirus lockdown, click here.\r\n*\r\nWhen we talk about how much Netflix has pervaded into our lives and changed the way films are made, one of the first things that comes up is how films and shows are now… [+5688 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Tom Cruise will be 60 years old by the time Mission Impossible 8 is released, will have played Ethan... - Hindustan Times", "description": "Tom Cruise will be 60 years old, and will have played Ethan Hunt for over a quarter-of-a-century by the time the now delayed Mission: Impossible 8 hits theatres.", "url": "https://www.hindustantimes.com/hollywood/tom-cruise-will-be-60-years-old-by-the-time-mission-impossible-8-is-released-will-have-played-ethan-hunt-for-over-quarter-century/story-y8wlOd2s6rcRKkNXLPTdOJ.html", "urlToImage": null, "publishedAt": "2020-04-25T11:16:00Z", "content": "The theatrical release of Mission: Impossible 7 and Mission: Impossible 8 has been delayed by Paramount, which means that when the eighth film opens in 2022, Tom Cruise will be 60 years old. The seventh instalment in the franchise was initially set to hit the… [+1328 chars]"}, {"source": {"id": null, "name": "Koimoi.com"}, "author": null, "title": "Shah Rukh Khan Career Review – Tracing Footsteps: We Don’t Call Him King Of Hearts For No Reason - Koimoi", "description": "Shah Rukh Khan Career Review: If there is one actor who has broken major stereotypes in Bollywood, it has to be King Khan.", "url": "https://www.koimoi.com/bollywood-news/shah-rukh-khan-career-review-tracing-footsteps-we-dont-call-him-king-of-hearts-for-no-reason/", "urlToImage": null, "publishedAt": "2020-04-25T10:34:23Z", "content": "If there is one actor who has broken major stereotypes in Bollywood, it has to be Shah Rukh Khan. Even today when popular TV actors are struggling to make a successful transition to the big screen, SRK had done the unthinkable almost three decades ago. After … [+5525 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Malayalam actor Ravi Vallathol dies at 67 in Thiruvananthapuram - India Today", "description": "Film and television actor Ravi Vallathol died of age-related ailments at his residence in Thiruvananthapuram, Kerala.", "url": "https://www.indiatoday.in/movies/regional-cinema/story/malayalam-actor-ravi-vallathol-dies-at-67-in-thiruvananthapuram-1670968-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T10:31:01Z", "content": "Malayalam actor Ravi Vallathol, aged 67, breathed his last at his residence in Thiruvananthapuram, Kerala. Reportedly, he was unwell for a couple of years and had succumbed to age-related illness today (April 25).\r\nThe actor had stopped doing films and Malaya… [+1359 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Hindustan Times", "title": "Kanye West officially now a billionaire: Forbes - Hindustan Times", "description": "Forbes magazine has finally included Kanye West on their list of billionaires of the world. The magazine said West has been pressing them to be listed for years.", "url": "https://www.hindustantimes.com/music/kanye-west-officially-now-a-billionaire-forbes/story-RrYr70DZ4f0uj9m6UF4MdJ.html", "urlToImage": null, "publishedAt": "2020-04-25T10:26:06Z", "content": "Rapper Kanye West is now a billionaire thanks largely to the basketball shoes bearing his name that he developed with Adidas, Forbes magazine said Friday. The rough figure of the wealth of Kim Kardashian’s hubby is $1.3 billion, the magazine said in announcin… [+1011 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Sussanne Khan Shares Adorable Family Pic With Hrithik Roshan And Their Kids; See Here - News18", "description": "Sussanne Khan took to her social media to share a candid picture of her ex-husband Hrithik Roshan with their sons Hrehaan and Hridhaan.", "url": "https://www.news18.com/news/movies/sussanne-khan-shares-adorable-family-pic-with-hrithik-roshan-and-their-kids-see-here-2592287.html", "urlToImage": null, "publishedAt": "2020-04-25T09:35:56Z", "content": "Ever since designer Sussanne Khan moved in with ex-husband Hrithik Roshan, to be with their kids during quarantine, her online family has been keenly expecting a glimpse of them together on her feed.\r\nRecently, Sussane took to her social media to share a cand… [+1063 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Prithviraj on his 9th wedding anniversary with Supriya: Apart for now, but together forever - India Today", "description": "Prithviraj took to Twitter to share an adorable photo with his wife, Supriya Menon, on his 9th wedding anniversary.", "url": "https://www.indiatoday.in/movies/regional-cinema/story/prithviraj-on-his-9th-wedding-anniversary-with-supriya-apart-for-now-but-together-forever-1670931-2020-04-25", "urlToImage": null, "publishedAt": "2020-04-25T08:48:45Z", "content": "Malayalam actor Prithviraj Sukumaran, who had gone to Jordon for the shooting of Aadujeevitham, is stuck there with the entire team. Today (April 25), the actor is celebrating his ninth wedding anniversary with his wife, Supriya Menon.\r\nOn this special day, P… [+1402 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "Anushka Sharma’s Small Gesture During Virat Kohli’s Live Chat Leaves Him Blushing, Watch Here - News18", "description": "Virat Kohli was having an Instagram Live session when his wife helped him by turning on the lights of the room.", "url": "https://www.news18.com/news/movies/anushka-sharmas-small-gesture-during-virat-kohlis-live-chat-leaves-him-blushing-watch-here-2592223.html", "urlToImage": null, "publishedAt": "2020-04-25T08:34:28Z", "content": "Lovebirds Anushka Sharma and Virat Kohli are spending the lockdown time together at their home. The duo is having quite fun in their day to day routine, making each day special for each other.\r\nThe Indian cricket team captain recently had a live chat session … [+1684 chars]"}]}