{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Connie Liou", "title": "Who Plays Magda on 'Penny Dreadful: City of Angels'? Natalie Dormer Portrays Showtime's Latest Supernatural Antagonist - Showbiz Cheat Sheet", "description": "Who plays Magda, Elsa, Rio, and Alex on 'Penny Dreadful: City of Angels'? Here's Natalie Dormer's latest project after 'Game of Thrones'.", "url": "https://www.cheatsheet.com/entertainment/magda-penny-dreadful-city-of-angels-natalie-dormer-alex-rio-elsa.html/", "urlToImage": null, "publishedAt": "2020-04-25T04:33:27Z", "content": "ThePenny Dreadful spinoff, City of Angels, may not star Eva Green, but the shows cast still packs a powerful punch. The new Showtime original series includes fan-favorites such as Nathan Lane and Alex Rodriguez. But Natalie Dormer — who plays Magda, Elsa, Rio… [+4684 chars]"}, {"source": {"id": null, "name": "Yourtango.com"}, "author": "https://www.facebook.com/jayceelevinofficial/", "title": "Weekend Love Horoscopes + Pluto Retrograde Tarot Card Readings, By Zodiac Sign, Friday, April 24 - Sunday, April 26, 2020 - YourTango", "description": "Pluto turns retrograde in Capricorn this weekend!", "url": "https://www.yourtango.com/2020332968/pluto-retrograde-horoscopes-weekend-april-24-26-2020-all-zodiac-signs-astrology", "urlToImage": null, "publishedAt": "2020-04-25T04:31:36Z", "content": "Pluto turns retrograde in Capricorn this weekend!\r\nYourTango's free weekend astrology forecast is here with love horoscopes and a Pluto retrograde in Capricorn love tarot card reading to guide all zodiac signs over the weekend of Friday, April 24, Saturday, A… [+9821 chars]"}, {"source": {"id": null, "name": "Hollywoodreporter.com"}, "author": "Sharareh Drury", "title": "Jeff Goldblum Faces Social Media Backlash Over Islam Comments on 'RuPaul's Drag Race' - Hollywood Reporter", "description": "\"Is there something in this religion that is anti-homosexuality? And anti-woman?” the actor and special guest asked during Friday night's episode.", "url": "https://www.hollywoodreporter.com/news/jeff-goldblum-faces-social-media-backlash-islam-comments-rupauls-drag-race-1291882", "urlToImage": null, "publishedAt": "2020-04-25T03:49:21Z", "content": "Jeff Goldblum came under fire on social media for asking if Islam was \"anti-homosexuality\" and \"anti-woman\" during Friday night’s episode of RuPaul’s Drag Race.\r\nThe comments came after the seven remaining queens on the show, now in its 12th season, walked a … [+3523 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Tom Gillespie", "title": "Kanye West: Hip hop star and fashion designer becomes a billionaire - Sky News", "description": "The rapper, who has long coveted the status, has claimed he is worth more after his net worth was valued at $1.3bn (£1.05bn).", "url": "https://news.sky.com/story/kanye-west-hip-hop-star-and-fashion-designer-becomes-a-billionaire-11978510", "urlToImage": null, "publishedAt": "2020-04-25T03:39:04Z", "content": null}, {"source": {"id": null, "name": "Vulture.com"}, "author": "Halle Kiefer", "title": "Andrew Lloyd Webber’s Phantom of the Opera Sequel Love Never Dies Is Here, Inside Your Living Room - Vulture", "description": "It never made Broadway, but hopefully it will make your weekend.", "url": "https://www.vulture.com/2020/04/phantom-of-the-opera-sequel-love-never-dies-free-to-stream.html", "urlToImage": null, "publishedAt": "2020-04-25T02:40:33Z", "content": "In case you were unaware, Andrew Lloyd Webbers smash hit musical The Phantom of the Opera has a sequel. Love Never Dies, set ten years after the events of Phantom and located in 1907 Coney Island, made its West End debut in 2010, where it received, to put it … [+1123 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Jon Caramanica", "title": "Fred the Godson, Nimble New York Rapper, Dies at 41 - The New York Times", "description": "The Bronx musician was a forceful presence on mixtapes, filling his rhymes with clever punch lines.", "url": "https://www.nytimes.com/2020/04/24/arts/music/fred-the-godson-dead-coronavirus.html", "urlToImage": null, "publishedAt": "2020-04-25T02:39:03Z", "content": "This obituary is part of a series about people who have died in the coronavirus pandemic. Read about others here.\r\nFred the Godson, who for more than a decade was a respected figure in New York hip-hop, an understated master of wordplay with a signature flow,… [+2831 chars]"}, {"source": {"id": null, "name": "Wesh.com"}, "author": "National Desk Staff", "title": "Disneyland, Disney World may not reopen until 2021, independent financial report says - WESH Orlando", "description": "Disney theme parks may stay closed for the rest of this year, according to an analyst.", "url": "https://www.wesh.com/article/disneyland-disney-world-may-not-reopen-until-2021-independent-financial-report-says/32273537", "urlToImage": null, "publishedAt": "2020-04-25T02:14:00Z", "content": "Disney theme parks may stay closed for the rest of this year.\r\nThats the newest advice from financial firm UBS for Disneyland in California and Walt Disney World in Florida.\r\nUBS said it now expects the parks to open Jan. 1 at 50% capacity for the first six m… [+1157 chars]"}, {"source": {"id": null, "name": "Cinemablend.com"}, "author": "Laura Hurley", "title": "Blue Bloods Actor Nick Cordero's Wife Says He Should Have Woken From Coma By Now - CinemaBlend", "description": "Amanda Kloots provides an update on her husband's condition.", "url": "https://www.cinemablend.com/television/2495108/blue-bloods-actor-nick-corderos-wife-says-he-should-have-woken-from-coma-by-now", "urlToImage": null, "publishedAt": "2020-04-25T00:23:14Z", "content": "Blue Bloods actor and popular TV guest star Nick Cordero has been fighting for his life after a diagnosis with COVID-19, and his wife Amanda Kloots has been providing regular updates on his condition. Her updates have provided a window into the illness as wel… [+2833 chars]"}, {"source": {"id": "bleacher-report", "name": "Bleacher Report"}, "author": "The Doctor Chris Mueller", "title": "WWE SmackDown Results: Winners, Grades, Reaction and Highlights from April 24 - Bleacher Report", "description": "This week's episode of SmackDown was all about celebrating  Triple H 's 25-year anniversary with  WWE . His first televised match took place on April 30, 1995, on Wrestling Challenge...", "url": "https://bleacherreport.com/articles/2888528-wwe-smackdown-results-winners-grades-reaction-and-highlights-from-april-24", "urlToImage": null, "publishedAt": "2020-04-25T00:20:00Z", "content": "The show opened with a short video package featuring Triple H's biggest moments. The New Day kicked things off in the Performance Center with a celebration.\r\nKofi Kingston put over Big E as the reason they are eight-time tag team champions. Big E ribbed Kings… [+1304 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Raechal Shewfelt", "title": "Scarlett Johansson says she's 'basically made a career out of being second choice' - Yahoo Entertainment", "description": "Scarlett Johansson talks playing Black Widow and the qualities she most appreciates in fiancé Colin Jost.", "url": "https://www.yahoo.com/entertainment/scarlett-johansson-career-second-choice-colin-jost-235828644.html", "urlToImage": null, "publishedAt": "2020-04-25T00:10:50Z", "content": "Scarlett Johansson is such a hit in Hollywood that she was nominated for two Oscars this year. In August, she topped Forbess list of the highest-earning actresses for the second year in a row.\r\nBut she doesnt always feel like such a success, like when she ini… [+1680 chars]"}, {"source": {"id": null, "name": "Npr.org"}, "author": "Andrew Limbong", "title": "Fans Struggle With Ticketmaster, Live Nation And AEG Coronavirus Refund Policies - NPR", "description": "Entertainment companies Live Nation and AEG have modified their refund policies for postponed events. Getting money back would depend on whether a concert or a game has a firm rescheduled date.", "url": "https://www.npr.org/2020/04/24/844301434/why-ticket-holders-are-struggling-to-get-refunds-for-concerts-and-live-events", "urlToImage": null, "publishedAt": "2020-04-25T00:07:34Z", "content": "The U.S. leg of Weezer's Hella Mega tour with Green Day and Fall Out Boy has yet to be canceled due to the coronavirus, leaving fans who purchased tickets in limbo when it comes to refunds.\r\nAngela Weiss/AFP via Getty Images\r\nUpdatedat 4:21 p.m. ET.\r\nThe coro… [+4600 chars]"}, {"source": {"id": null, "name": "Consequenceofsound.net"}, "author": "Alex Young", "title": "Watch Post Malone Perform Nirvana Covers with Travis Barker - Consequence of Sound", "description": "Post Malone delivered a rousing set of Nirvana covers as part of a YouTube livestream benefiting COVID-19 relief. Watch the replay here.", "url": "https://consequenceofsound.net/2020/04/post-malone-nirvana-covers-video/", "urlToImage": null, "publishedAt": "2020-04-24T23:42:06Z", "content": "Here we are now, entertain us: Post Malone delivered a rousing set of Nirvana covers as part of a YouTube livestream benefiting COVID-19 relief. Watch the full replay below\r\nPlaying live from his home in Salt Lake City on Friday, Posty ripped through a varied… [+1257 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Joshua Barone", "title": "How the Met Opera Is Throwing a Gala Concert With Smartphones - The New York Times", "description": "Closed by the coronavirus, the company is streaming its biggest stars, performing live across nine time zones.", "url": "https://www.nytimes.com/2020/04/24/arts/music/met-opera-at-home-gala.html", "urlToImage": null, "publishedAt": "2020-04-24T23:29:06Z", "content": "Is this enough light? asked the baritone Peter Mattei.\r\nHe was in the living room of his home outside Stockholm, speaking over Skype with a small group of Metropolitan Opera staff members who were giving him directions to prepare for the companys At-Home Gala… [+7069 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "David Moye", "title": "Tom Hanks Gives Typewriter To Boy Bullied Because His Name Is Corona - HuffPost", "description": "The actor told Corona DeVries, 8, “I thought this typewriter would suit you... Ask a grown-up how it works. And use it to write me back.”", "url": "https://www.huffpost.com/entry/tom-hanks-corona-typewriter-corona-devries_n_5ea35af6c5b669fd8924e00a", "urlToImage": null, "publishedAt": "2020-04-24T23:21:58Z", "content": "An 8-year-old boy named Corona has got a friend in Tom Hanks  as well as a gift stemming from the actors offbeat hobby of collecting typewriters.\r\nIt all started when Corona De Vries of Queensland, Australia, sent a get-well letter after the actor, who he kne… [+1551 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Curtis M. Wong", "title": "Matt Damon Adopts Irish Seaside Town As Lockdown Home Amid Coronavirus Crisis - HuffPost", "description": "Residents of Dalkey, Ireland, are proud of their new resident, who came to town for a movie but opted to stick around as stay-at-home restrictions took hold.", "url": "https://www.huffpost.com/entry/matt-damon-ireland-lockdown_n_5ea3145cc5b6f96398143c36", "urlToImage": null, "publishedAt": "2020-04-24T23:16:26Z", "content": "Matt Damon has established a new home away from home during the coronavirus pandemic.\r\nIn March, the “Good Will Hunting” star touched down in Dalkey, Ireland, where he was slated to shoot scenes for Ridley Scott’s “The Last Duel.” Filming was quickly halted, … [+1605 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Karen Han", "title": "Extraction review: Netflix thriller overloads Hemsworth’s charm with action - Polygon", "description": "Former Captain America stunt double Sam Hargrave directs this thriller starring Chris Hemsworth as mercenary Tyler Rake. His mission to rescue a kidnapped boy goes sideways, and also becomes extremely bloody. Streaming on Netflix now.", "url": "https://www.polygon.com/2020/4/24/21235001/extraction-review-chris-hemsworth-netflix-streaming", "urlToImage": null, "publishedAt": "2020-04-24T23:05:43Z", "content": "Chris Hemsworths best roles to date have tapped into his charm. His turn as a handsome but clueless assistant in the Ghostbusters reboot was a revelation, and Thor: Ragnarok wisely replaced the somber aspects of the god of thunder with a puppylike eagerness. … [+4452 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Marina Fang", "title": "The Largest US Movie Theater Chain Won't Reopen Even If States Say It Can - HuffPost", "description": "Some states are allowing theaters to resume operations, even though public health experts advise against it. But there aren't even any new movies to show.", "url": "https://www.huffpost.com/entry/amc-movie-theaters-reopening_n_5ea334d5c5b6d376358f3f7d", "urlToImage": null, "publishedAt": "2020-04-24T23:04:41Z", "content": "Although states are slowly starting to allow movie theaters to resume operations against the recommendations of public health experts, AMC Theatres, the largest movie theater chain in the U.S., won’t reopen its locations until at least this summer.\r\n“As we pl… [+2804 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Fox News", "title": "Sheriff denies police cover-up of 'Tiger King' star's missing husband - New York Post ", "description": "The Florida county sheriff investigating a suspicious, decades-old disappearance, revived by the Netflix series “Tiger King: Murder, Mayhem and Madness,” said that h…", "url": "https://nypost.com/2020/04/24/sheriff-denies-police-cover-up-of-tiger-king-stars-missing-husband/", "urlToImage": null, "publishedAt": "2020-04-24T22:59:10Z", "content": "The Florida county sheriff investigating a suspicious, decades-old disappearance, revived by the Netflix series “Tiger King: Murder, Mayhem and Madness,” said that his police department is not involved in a cover-up related to the case.\r\nAmong the cast of biz… [+3117 chars]"}, {"source": {"id": null, "name": "Eonline.com"}, "author": "Mike Vulpo", "title": "Hannah Brown & Tyler Cameron's Chemistry Is Undeniable in Latest Video - E! NEWS", "description": "Hannah Brown and Tyler Cameron's latest Instagram Live reminds fans that their chemistry is undeniable. Watch the sweet moments unfold for yourself.", "url": "https://www.eonline.com/news/1144733/watching-hannah-brown-and-tyler-cameron-tease-each-other-proves-their-chemistry-is-undeniable", "urlToImage": null, "publishedAt": "2020-04-24T22:53:56Z", "content": "You just can't deny chemistry these days!\r\nWe know, we know. Both Hannah Brown and Tyler Cameron are the first to admit they are single and not dating anyone during the Coronavirus pandemic. But as they continue to stay in touch and document their friendship … [+603 chars]"}, {"source": {"id": "entertainment-weekly", "name": "Entertainment Weekly"}, "author": "Anonymous", "title": "'Seinfeld,' 'Star Trek' actor Gene Dynarski dies at 86 - The-Latest News", "description": "Gene Dynarski, a character actor known for his roles on Seinfeld and in Steven Spielberg's Close Encounters of the Third Kind, has died. He was 86. Dynarski died Feb. 27 in a rehabilitation center in Studio City, Calif., according to The Hollywood Reporter, w…", "url": "https://ew.com/tv/gene-dynarski-dead-seinfeld-star-trek-actor-obit/", "urlToImage": null, "publishedAt": "2020-04-24T22:49:15Z", "content": "Gene Dynarski, a character actor known for his roles Seinfeld and in Steven Spielberg‘s Close Encounters of the Third Kind, has expired. He had been 86. \r\nDynarski expired Feb. 27 in a rehab center in Studio City, Calif., based on The Hollywood Reporter, whic… [+1454 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Julia Alexander", "title": "Sony delays Spider-Man films, forcing Marvel to move Doctor Strange and Thor sequels again - The Verge", "description": "Spider-Man: Into the Spider-Verse and the third movie in the Spider-Man: Homecoming trilogy are getting delayed as Sony messes with its release schedule. As a result, Doctor Strange into the Multiverse and Thor: Love and Thunder have been delayed for a second…", "url": "https://www.theverge.com/2020/4/24/21235283/spider-man-spiderverse-homecoming-delay-release-date-trilogy-marvel-venom-doctor-strange-thor", "urlToImage": null, "publishedAt": "2020-04-24T22:45:42Z", "content": "But Uncharted gets an early release date\r\nPhoto: Sony Pictures Entertainment\r\nLike almost every other studio, Sony is moving around its film schedule because of the novel coronavirus. That means its two biggest Spider-Man movies will be delayed. \r\nThe sequel … [+1662 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By George Stark For Dailymail.com", "title": "Will & Grace stars Debra Messing and Megan Mullally's rumored feud gets addressed - Daily Mail", "description": "Will & Grace creators David Kohan and Max Mutchnick have added fuel to the rumours the co-stars Debra Messing and Meghan Mullally have harbored a secret feud with each other.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8255239/Will-Grace-stars-Debra-Messing-Megan-Mullallys-rumored-feud-gets-addressed.html", "urlToImage": null, "publishedAt": "2020-04-24T22:32:15Z", "content": "Will &amp; Grace creators David Kohan and Max Mutchnick have added fuel to the rumours the co-stars Debra Messing, 51, and Megan Mullally, 61, have harbored a secret feud with each other.\r\nKohan and Mutchnick were asked about the alleged clash in a recent Q&a… [+2240 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "How the Latest Clone Wars Broke Fans' Hearts! (Nerdist News w/ Dan Casey) - Nerdist", "description": "Could this week's heartbreaking episode of The Clone Wars be one of the series best? Dan takes a closer look in today's episode of Nerdist News! What's your ...", "url": "https://www.youtube.com/watch?v=CmU8SWLI97k", "urlToImage": null, "publishedAt": "2020-04-24T22:31:09Z", "content": null}, {"source": {"id": null, "name": "Bloody-disgusting.com"}, "author": "https://facebook.com/freddyinspace", "title": "Sam Raimi's 'Doctor Strange in the Multiverse of Madness' Moves from 2021 to 2022 - Bloody Disgusting", "description": "Sam Raimi‘s Doctor Strange in the Multiverse of Madness was originally set for release in May 2021 before being bumped to November 2021, and now it’s already been bumped again. Raimi’s return to the world of Marvel will now release on March 25, 2022. Benedict…", "url": "https://bloody-disgusting.com/movie/3614321/sam-raimis-doctor-strange-multiverse-madness-moves-2021-2022/", "urlToImage": null, "publishedAt": "2020-04-24T22:13:32Z", "content": "Sam Raimi‘s Doctor Strange in the Multiverse of Madness was originally set for release in May 2021 before being bumped to November 2021, and now it’s already been bumped again.\r\nRaimi’s return to the world of Marvel will now release on March 25, 2022.\r\nBenedi… [+231 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lisa Respers France, CNN", "title": "Alicia Keys debuts powerful anthem in partnership with CNN - CNN", "description": "If you find yourself in tears watching the visual for Alicia Keys' new song, know that the singer had the same reaction the first time she saw it.", "url": "https://www.cnn.com/2020/04/23/entertainment/alicia-keys-cnn-song/index.html", "urlToImage": null, "publishedAt": "2020-04-24T22:05:48Z", "content": null}, {"source": {"id": null, "name": "Salon.com"}, "author": "Melanie McFarland", "title": "In taut legal drama \"Defending Jacob,\" Chris Evans shows up as the daddy America needs - Salon", "description": "The latest Apple TV+ family drama is a crisply tailored crime and courtroom mystery. It's also an Evans showcase", "url": "https://www.salon.com/2020/04/24/in-taut-legal-drama-defending-jacob-chris-evans-shows-up-as-the-daddy-america-needs/", "urlToImage": null, "publishedAt": "2020-04-24T21:52:17Z", "content": "\"Any man can be a father, but it takes a hot, middle-aged guy with a big job to be a daddy.\" A wise man once said that. Wait — no, my bad, it was Matt Damon. That doesn't make it any less true. The difference between a father and a daddy is significant and mi… [+6609 chars]"}, {"source": {"id": null, "name": "Vulture.com"}, "author": "Chris Murphy", "title": "Billy Kimmel’s Third Birthday Party Won Late Night This Week - Vulture", "description": "With surprise guest Spider-Man.", "url": "http://www.vulture.com/2020/04/this-week-in-late-night-billy-kimmel-birthday-tom-holland.html", "urlToImage": null, "publishedAt": "2020-04-24T21:32:46Z", "content": "Whats new, pussycats? Well, the president of the United States of America has suggested that people start injecting disinfectants, and I just started a 1,500-piece puzzle, which seems equally as futile and somehow twice as dangerous. As for late-night televis… [+5681 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Austen Goslin", "title": "Fortnite’s Travis Scott event drew over 12.3 million players at its premiere - Polygon", "description": "Travis Scott’s Astronomical Fortnite event garnered a new record number of concurrent players as 12.3 million people dropped into the game for the premiere.", "url": "https://www.polygon.com/fortnite/2020/4/24/21235017/fortnite-travis-scott-event-concert-astronomical-12-3-million-concurrent-players-record", "urlToImage": null, "publishedAt": "2020-04-24T21:31:04Z", "content": "Travis Scotts in-game Fortnite tour brought a record number of players online. Epic Games announced Friday that over 12.3 million concurrent players joined Scotts in-game concert. \r\nThe event started with a giant version of Scott performing some of his most r… [+969 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Tasha Robinson", "title": "Bad Education review: new HBO movie gives Hugh Jackman a chance to squirm - Polygon", "description": "Hugh Jackman and Allison Janney star in HBO’s true crime drama Bad Education, about a Long Island student who uncovers a massive embezzlement scandal in her school district. The best new movie to watch this week at home is on HBO GO and HBO NOW right now.", "url": "https://www.polygon.com/2020/4/24/21234625/bad-education-review-hbo-hugh-jackman-allison-janney-based-on-a-true-story", "urlToImage": null, "publishedAt": "2020-04-24T21:01:56Z", "content": "The inciting incident in Cory Finleys sharp, entertaining HBO drama Bad Education may strike some viewers as far too on-the-nose. When student journalist Rachel (Miracle Workers Geraldine Viswanathan) drops by the office of Long Island school superintendent F… [+6079 chars]"}, {"source": {"id": null, "name": "Blabbermouth.net"}, "author": "Blabbermouth", "title": "This Year's Louder Than Life Festival Is Officially Canceled - BLABBERMOUTH.NET", "description": "This year's Louder Than Life festival, which was scheduled to take place in September in Louisville, Kentucky, has been officially canceled due to the COVID-19 pandemic.\n\n\"Even though the festivals...", "url": "https://www.blabbermouth.net/news/this-years-louder-than-life-festival-is-officially-canceled/", "urlToImage": null, "publishedAt": "2020-04-24T20:56:39Z", "content": "This year's Louder Than Life festival, which was scheduled to take place in September in Louisville, Kentucky, has been officially canceled due to the COVID-19 pandemic.\r\n\"Even though the festivals are not until September, the advanced planning realities of p… [+2702 chars]"}, {"source": {"id": null, "name": "Timesofisrael.com"}, "author": null, "title": "Taylor Swift calls out Soros family's 'shameless greed' in beef with record co. - The Times of Israel", "description": "Pop superstar draws criticism as white supremacists seen associating her post with widespread anti-Semitic conspiracy theories about Soros", "url": "https://www.timesofisrael.com/taylor-swift-calls-out-soros-familys-shameless-greed-in-beef-with-record-co/", "urlToImage": null, "publishedAt": "2020-04-24T20:55:57Z", "content": "JTA — Taylor Swift is drawing criticism and apparent applause among her neo-Nazi fan base for calling out the Soros family in an Instagram post. Its the latest salvo in the pop superstars ongoing battle with her former record label.\r\nThe family long has been … [+2957 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Brian Flood", "title": "Andy Cohen says blood is 'boiling' because he can't donate plasma as a gay man: 'My blood could save a life' - Fox News", "description": "Bravo’s Andy Cohen, who recently recovered from coronavirus, said his blood  “could save a life but instead it’s over here boiling” because rules prevent him from donating plasma as a gay man.", "url": "https://www.foxnews.com/entertainment/andy-cohen-blood-boiling-cant-donate-plasma", "urlToImage": null, "publishedAt": "2020-04-24T20:45:13Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox.  Sign up here.\r\nBravo’s Andy Cohen, who recently recovered from coronavirus, said his “blood could save a life but instead it’s over here boiling” because rules prevent him from do… [+1802 chars]"}, {"source": {"id": null, "name": "Bravotv.com"}, "author": "Jenny Berg", "title": "Kristen Doute's New Fixer Upper House: See Living Room Decor | Style & Living - Bravo", "description": "When Kristen Doute spoke to The Daily Dish Podcast about her Valley Village home, which she bought about a year ago, she described it as \"a1939 fixer-upper.\" (Watch the clip above to hear part of Kristen's interview.) But the Vanderpump Rules beauty has alrea…", "url": "https://www.bravotv.com/vanderpump-rules/style-living/kristen-doutes-new-fixer-upper-house-see-living-room-decor", "urlToImage": null, "publishedAt": "2020-04-24T20:43:51Z", "content": "When Kristen Doute spoke to The Daily Dish Podcast about her Valley Village home, which she bought about a year ago, she described it as \"a1939 fixer-upper.\" (Watch the clip above to hear part of Kristen's interview.) But the Vanderpump Rules beauty has alrea… [+1512 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Allyson Payer", "title": "Jennifer Lopez's Bralette-and-Shorts Outfit Proves Cutoffs Have Been Replaced - Yahoo Lifestyle", "description": "J.Lo knows best.", "url": "https://www.yahoo.com/lifestyle/jennifer-lopezs-bralette-shorts-outfit-203700600.html", "urlToImage": null, "publishedAt": "2020-04-24T20:37:00Z", "content": "Does anyone else miss Jennifer Lopez's epic street style moments right about now? You know we do. But until red carpets and street style are a thing again, we have Instagram and the occasional walk around the neighborhood as our opportunities to see what cele… [+1971 chars]"}, {"source": {"id": "entertainment-weekly", "name": "Entertainment Weekly"}, "author": "Samantha Highfill", "title": "'Friday Night Lights' cast reunites to watch the pilot for Together At Home - Entertainment Weekly", "description": "Adrianne Palicki, Scott Porter, and more cast members reunited via Zoom.", "url": "https://ew.com/tv/friday-night-lights-cast-reunion-watch-pilot/", "urlToImage": null, "publishedAt": "2020-04-24T20:36:34Z", "content": "Clear eyes, full hearts, can't Zoom?\r\nAs part of Global Citizen's \"Together At Home\" series, which raises money for the World Health Organization amid the coronavirus pandemic, a handful of cast members from Friday Night Lights staged a virtual reunion to re-… [+810 chars]"}, {"source": {"id": null, "name": "Vulture.com"}, "author": "Justin Curto", "title": "Which Moment in This New Kids on the Block Video Will Break You? - Vulture", "description": "Put this in the quarantine museum.", "url": "https://www.vulture.com/2020/04/new-kids-on-the-block-house-party-video.html", "urlToImage": null, "publishedAt": "2020-04-24T20:16:45Z", "content": "As it was prophesied, the coronavirus has ushered in a new era of art, albeit marked by tone-deaf celebrity videos along with bathtubs, basements, and broken records. Add this video to the museum too. New Kids on the Block brought together their friends Boyz … [+1455 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Denise Petski", "title": "NBC Pushes ‘Blindspot’ Return, Shifts ‘Council Of Dads’ Thursday Debut To Make Way For ‘Parks And Recreation’ Special - Deadline", "description": "NBC has made some scheduling moves to accommodate the Parks and Recreation COVID-19 benefit special, which airs at 8:30 pm on April 30. Council of Dads, which was scheduled to air its second episode at 8 pm, will move to 10 pm ET/PT Thursday, April 30. It wil…", "url": "https://deadline.com/2020/04/nbc-shifts-council-of-dads-blindspot-parks-and-recreation-special-1202917331/", "urlToImage": null, "publishedAt": "2020-04-24T19:47:38Z", "content": "NBC has made some scheduling moves to accommodate the Parks and RecreationCOVID-19 benefit special, which airs at 8:30 pm on April 30.\r\nCouncil of Dads, which was scheduled to air its second episode at 8 pm, will move to 10 pm ET/PT Thursday, April 30. It wil… [+899 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Emily Tannenbaum", "title": "The Bachelor Fans Are Overwhelmingly Team Madi Over Peter Regarding Their New Instagram Beef - Yahoo Style", "description": "The Nation has spoken.", "url": "https://www.yahoo.com/lifestyle/bachelor-fans-overwhelmingly-team-madi-194100110.html", "urlToImage": null, "publishedAt": "2020-04-24T19:41:00Z", "content": "Okay, so it took a while to get here, but its happening: The Bachelor stars Peter Weber and Madison Prewett are fighting online.\r\nIt all started on April 21, when Prewett gave an interview about her breakup with Weber, and also the Kelley Flanagan drama, via … [+2709 chars]"}, {"source": {"id": null, "name": "Xxlmag.com"}, "author": "awoods", "title": "Lil Uzi Vert Says He's Dropping a New Song Today - XXLMAG.COM", "description": "Details here.", "url": "https://www.xxlmag.com/news/2020/04/lil-uzi-vert-new-song-2/", "urlToImage": null, "publishedAt": "2020-04-24T19:35:00Z", "content": "Lil Uzi Vert fans could be in for a treat, as the rapper has doubled down on his statement about releasing new music.\r\nUzi wrote on Twitter on Friday (April 24) that he is dropping a new song today. In a tweet to the Philadelphia rapper, a fan asked for advic… [+1347 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Gary Dinges", "title": "Billy Porter speaks 'truth to power' in cover of Buffalo Springfield's 'For What It's Worth' - USA TODAY", "description": "A frequent critic of President Donald Trump, Porter says he was inspired by artists who recorded songs during times of conflict in U.S. history.", "url": "https://www.usatoday.com/story/entertainment/music/2020/04/24/billy-porter-covers-stephen-stills-classic-for-what-its-worth/5155035002/", "urlToImage": null, "publishedAt": "2020-04-24T19:32:25Z", "content": "Music producers battle with the Verzuz series as fans party along \r\nAP Entertainment\r\nBilly Porter is channeling the past by bringing you a message from the future.\r\nThe singer, actor and Broadway performer has covered Stephen Stills beloved Buffalo Springfie… [+2809 chars]"}, {"source": {"id": null, "name": "Eonline.com"}, "author": "Jess Cohen", "title": "Gigi Hadid Thanks Taylor Swift and Joe Alwyn for Birthday Flowers - E! NEWS", "description": "Gigi Hadid took to her Instagram Story to thank her pals Taylor Swift and Joe Alwyn for the birthday surprise. Click here to see the flowers!", "url": "https://www.eonline.com/news/1144590/gigi-hadid-thanks-taylor-swift-and-joe-alwyn-for-sending-beautiful-birthday-flowers", "urlToImage": null, "publishedAt": "2020-04-24T19:31:55Z", "content": "Gorgeous!\r\nGigi Hadid received a number of special deliveries for her 25th birthday on Thursday, including flowers from her loved ones. Taylor Swift, Joe Alwyn and Kendall Jenner were among the star-studded pals who sent the supermodel flowers on her special … [+763 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Denise Petski", "title": "Victoria Justice To Host Nickelodeon’s Rescheduled Kids’ Choice Awards, With Dwayne Johnson, Ariana Grande & More - Deadline", "description": "Nickelodeon is moving forward with its Kids’ Choice Awards with a new date, and with Victoria Justice as host. Initially scheduled for March 22, the awards ceremony was postponed indefinitely due to the coronavirus pandemic. The newly titled virtually-produce…", "url": "https://deadline.com/2020/04/victoria-justice-to-host-nickelodeons-rescheduled-kids-choice-awards-with-dwayne-johnson-ariana-grande-more-1202917237/", "urlToImage": null, "publishedAt": "2020-04-24T19:12:09Z", "content": "Nickelodeon is moving forward with its Kids’ Choice Awards with a new date, and with Victoria Justice as host. Initially scheduled for March 22, the awards ceremony was postponed indefinitely due to the coronavirus pandemic. The newly titled virtually-produce… [+1462 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Meghan Markle Case Against British Tabloid Set To Begin In London | TODAY - TODAY", "description": "Friday marks the first court hearing in a privacy case brought by Meghan Markle against the Daily Mail, a British tabloid, for publishing part of a letter sh...", "url": "https://www.youtube.com/watch?v=Cjuyow4ftc8", "urlToImage": null, "publishedAt": "2020-04-24T19:00:03Z", "content": "Friday marks the first court hearing in a privacy case brought by Meghan Markle against the Daily Mail, a British tabloid, for publishing part of a letter she wrote to her father. NBC's Kelly Cobiella reports for TODAY from London.» Subscribe to TODAY: http:/… [+845 chars]"}, {"source": {"id": null, "name": "Billboard.com"}, "author": "Gil Kaufman", "title": "Here's What Mick Jagger Has to Say to Paul McCartney's Beatles-vs.-Stones Thoughts - Billboard", "description": "", "url": "https://www.billboard.com/articles/columns/rock/9365433/mick-jagger-interview-living-in-a-ghost-town-origin-beatles-vs-rolling-stones", "urlToImage": null, "publishedAt": "2020-04-24T18:44:05Z", "content": "Sometimes you accidentally write a song that perfectly fits the moment. That's basically what Mick Jagger told Apple Music's Zane Lowe on Friday morning (April 24), in a chat that included the origin story of the eerily prescient new Rolling Stones single \"Li… [+3640 chars]"}, {"source": {"id": null, "name": "Jambase.com"}, "author": "Nate Todd", "title": "Trey Anastasio Talks Quarantine, Phish's 'Sigma Oasis,' Touring & More In New Interview - JamBase", "description": "Organizers of the Shambhala Music Festival canceled the 2020 event due to the coronavirus pandemic.", "url": "https://www.jambase.com/article/shambhala-2020-canceled-coronavirus", "urlToImage": null, "publishedAt": "2020-04-24T18:37:29Z", "content": "Shambhala Music Festival canceled its 2020 event due to the coronavirus COVID-19 outbreak. The festival was set to take place July 24 – 27 in Salmo, British Columbia, Canada.\r\nScheduled to perform at Shambhala 2020 were DJ Premier, Ekali, Rezz, RL Grime, Seve… [+1403 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lisa Respers France, CNN", "title": "Prince William's reason for not watching 'Tiger King' will make you laugh - CNN", "description": "Like the rest of us, Prince William is shut in and has time to binge-watch TV, but don't expect him to be watching \"Tiger King.\"", "url": "https://www.cnn.com/2020/04/24/entertainment/prince-william-tiger-king/index.html", "urlToImage": null, "publishedAt": "2020-04-24T18:35:39Z", "content": null}, {"source": {"id": null, "name": "Decider.com"}, "author": "Claire Spellberg", "title": "Dolly Parton's Company Produced 'Buffy the Vampire Slayer' And Fans Are Stunned - Decider", "description": "Slayin’ 9 to 5…", "url": "https://decider.com/2020/04/24/dolly-parton-buffy-the-vampire-slayer/", "urlToImage": null, "publishedAt": "2020-04-24T18:33:09Z", "content": "Does it still count as working “9 to 5” if the world doesn’t know about it? This week, the Independent reported that Dolly Parton was partially responsible for hit drama Buffy the Vampire Slayer, as she owns the company that executive produced the show, Sando… [+3155 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chloe Melas, CNN", "title": "Richard Gere and his wife welcome baby boy - CNN", "description": "Richard Gere and his wife, Alejandra Silva, have welcomed their second son, a rep for the actor confirms to CNN.", "url": "https://www.cnn.com/2020/04/24/entertainment/richard-gere-baby-boy-trnd/index.html", "urlToImage": null, "publishedAt": "2020-04-24T18:14:54Z", "content": "(CNN)Richard Gere and his wife, Alejandra Silva, have welcomed their second son, a rep for the actor confirms to CNN.\r\nGere, 70 and Silva, 37, already have 14-month-old Alexander. Gere also has a 20-year-old son from a previous marriage. Silva has a son with … [+419 chars]"}, {"source": {"id": null, "name": "Pagesix.com"}, "author": "Nicki Gostin", "title": "Cameron Diaz says Benji Madden is the 'best thing' that's ever happened to her - Page Six", "description": "Cameron Diaz is happy at home with hubby Benji Madden.", "url": "https://pagesix.com/2020/04/24/cameron-diaz-gushes-about-husband-benji-madden/", "urlToImage": null, "publishedAt": "2020-04-24T17:45:57Z", "content": "Cameron Diaz says hubby Benji Madden is the best thing thats ever happened to me.\r\nI love being married,” the Charlies Angels actress, 47, said in an interview, which was posted on Thursday, with her longtime makeup artist and pal Gucci Westman for the beauty… [+1111 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Carly Mallenbaum", "title": "Ellen Pompeo explains her old Harvey Weinstein comments that have come under fire - USA TODAY", "description": "Ellen Pompeo took to Twitter to clarify controversial comments she made in a 2018 panel about Harvey Weinstein and victims of sexual harassment.", "url": "https://www.usatoday.com/story/entertainment/celebrities/2020/04/23/ellen-pompeo-clarifies-controversial-harvey-weinstein-comments/3015938001/", "urlToImage": null, "publishedAt": "2020-04-24T17:27:59Z", "content": "Formerly powerful movie mogul Harvey Weinstein was indicted in May 2018 and charged with five sex crimes. He was found guilty on two charges.\r\nUSA TODAY\r\nEllen Pompeo is taking to Twitter to clarify Harvey Weinstein comments she made a couple of years ago.\r\nT… [+4853 chars]"}, {"source": {"id": null, "name": "Townandcountrymag.com"}, "author": "Chloe Foussianes", "title": "See How Queen Elizabeth's Style Has Evolved Since She Was Just a Princess - Yahoo Lifestyle", "description": "The British monarch's best dresses (and hats!) through the decades.", "url": "https://www.townandcountrymag.com/style/fashion-trends/g24676517/queen-elizabeths-style-evolution/", "urlToImage": null, "publishedAt": "2020-04-24T17:14:00Z", "content": "It's not easy to make fashion decisions when you're in the spotlight. Luckily, Queen Elizabeth II has had several decades of practice. From her first formal dresses as a child, to her 70's and 80's gowns, to today's coats and hats, we've rounded up the best o… [+53 chars]"}, {"source": {"id": null, "name": "Avclub.com"}, "author": "Erik Adams", "title": "Beastie Boys Story is no sure shot - The A.V. Club", "description": "Now here's a little story we've got to tell about three bad brothers you know so well.", "url": "https://film.avclub.com/beastie-boys-story-is-no-sure-shot-1843043901", "urlToImage": null, "publishedAt": "2020-04-24T17:00:00Z", "content": "What if they made a Beastie Boys movie and it wasnt any fun? If there were none of the rambunctious spirit that defined the New York trios music even after they abandoned the party-boy put-ons of License To Ill? If the surviving band members recollections of … [+5247 chars]"}, {"source": {"id": null, "name": "Hollywoodreporter.com"}, "author": "Borys Kit", "title": "Florence Pugh, Shia LaBeouf Set for Olivia Wilde 'Don't Worry Darling' - Hollywood Reporter", "description": "Wilde is directing, producing and starring in the 1950s psychological thriller for New Line.", "url": "https://www.hollywoodreporter.com/heat-vision/florence-pugh-shia-labeouf-set-olivia-wilde-dont-worry-darling-1291723", "urlToImage": null, "publishedAt": "2020-04-24T17:00:00Z", "content": "Details are being kept secret but the setting is an isolated, utopian community in the 1950s California desert and centers on a housewife who uncovers a disturbing truth about her seemingly perfect life.\r\nPugh is leading the ensemble, playing the housewife.\r\n… [+1512 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Ron Dicker", "title": "Kaley Cuoco Is Binge-Watching Sitcom Couple She Was Told To Avoid - HuffPost", "description": "\"The Big Bang Theory\" alum is catching up on her TV during the coronavirus pandemic.", "url": "https://www.huffpost.com/entry/kaley-cuoco-cheers-conan_n_5ea2f8e3c5b6f9639813bfba", "urlToImage": null, "publishedAt": "2020-04-24T16:31:23Z", "content": "Kaley Cuoco is now binge-watching the sitcom couple she and her costar, Johnny Galecki, were told not to emulate on “The Big Bang Theory.”\r\nThat would be Sam and Diane, the dumb jock and the snooty intellectual brilliantly played by Ted Danson and Shelley Lon… [+886 chars]"}, {"source": {"id": null, "name": "Mynews13.com"}, "author": "Ashley Carter", "title": "Universal to Enroll Furloughed Workers into Florida's Unemployment System - News 13 Orlando", "description": "Universal Orlando has been closed since mid-March", "url": "https://www.mynews13.com/fl/orlando/news/2020/04/24/universal-to-enroll-furloughed-workers-into-florida-unemployment-system", "urlToImage": null, "publishedAt": "2020-04-24T16:30:00Z", "content": "ORLANDO, Fla. Universal Orlando plans to auto-enroll its furloughed workers into Floridas troubled unemployment system\r\n, the company confirmed with Spectrum News on Friday.\r\nUniversal, which has been closed since mid-March because of the coronavirus pandemic… [+1445 chars]"}, {"source": {"id": null, "name": "Essence.com"}, "author": "Taiia Smart Young", "title": "2 Chainz To Reopen Atlanta Restaurants On Monday - Essence", "description": "Rapper 2 Chainz plans to reopen his Atlanta eateries for sit-down service next week amid a deadly pandemic, killing thousands of Americans.", "url": "http://www.essence.com/celebrity/2-chainz-reopen-atlanta-restaurants/", "urlToImage": null, "publishedAt": "2020-04-24T16:20:00Z", "content": "Rapper 2 Chainz plans to reopen his Atlanta eateries for sit-down service next week amid a deadly pandemic, killing thousands of Americans.\r\nStarting on Monday, both of his spots, Escobar Restaurant and Tapas, will invite the public in for meals, TMZ reports.… [+2091 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Dino-Ray Ramos", "title": "Western Thriller ‘True History Of Kelly Gang’ And ’60s Coming-Of-Age Drama ‘To The Stars’ Make Debuts – Specialty Streaming Preview - Deadline", "description": "The story of the notorious outlaw Ned Kelly is dropping on digital and on-demand today with the Justin Kurzel-directed True History of the Kelly Gang starring George MacKay (1917, Captain Fantastic), Russell Crowe (Boy Erased, The Loudest Voice) and Nicholas …", "url": "https://deadline.com/2020/04/true-history-of-kelly-gang-russell-crowe-justin-kurzel-to-the-stars-martha-stephens-specialty-streaming-preview-1202916073/", "urlToImage": null, "publishedAt": "2020-04-24T14:28:13Z", "content": "The story of the notorious outlaw Ned Kelly is dropping on digital and on-demand today with the Justin Kurzel-directed True History of the Kelly Gang starring George MacKay (1917, Captain Fantastic), Russell Crowe (Boy Erased, The Loudest Voice) and Nicholas … [+5477 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Kate Middleton Celebrates Prince Louis' 2nd Birthday With INSTAGRAM VS REALITY Pics! - Entertainment Tonight", "description": "Prince Louis is looking more and more like his mama, Kate Middleton in the new photos she shared to the family’s Kensington Royal Instagram account, in honor...", "url": "https://www.youtube.com/watch?v=RS1ClLjqOA4", "urlToImage": null, "publishedAt": "2020-04-24T14:00:12Z", "content": "Prince Louis is looking more and more like his mama, Kate Middleton in the new photos she shared to the familys Kensington Royal Instagram account, in honor of his second birthday.\r\nExclusives from #ETonline :https://www.youtube.com/playlist?list..."}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Brian Lowry, CNN", "title": "'Avengers: Endgame' premiered a year ago. A whole lot has changed since then - CNN", "description": "The Marvel blockbuster premiered one year ago, on April 26, 2019, although just imagining people crowding into theaters, it surely feels a whole lot longer. The movie went on to amass $2.8 billion worldwide, surpassing the benchmark set by \"Avatar.\"", "url": "https://www.cnn.com/2020/04/24/entertainment/avengers-endgame-one-year-later/index.html", "urlToImage": null, "publishedAt": "2020-04-24T13:55:01Z", "content": "(CNN)With what felt like a snap, \"Avengers: Endgame\" shattered opening-weekend box-office records, earning $357 million in North America -- roughly $100 million more than its predecessor. The movie went on to amass $2.8 billion worldwide, surpassing the bench… [+3766 chars]"}, {"source": {"id": null, "name": "Xxlmag.com"}, "author": "xxlstaff", "title": "New Juice Wrld and J. Cole Song on the Way? - XXLMAG.COM", "description": "Watch here.", "url": "https://www.xxlmag.com/news/2020/04/juice-wrld-j-cole-song/", "urlToImage": null, "publishedAt": "2020-04-24T12:59:00Z", "content": "Last night marked two important moments in Juice Wrld's posthumous career: the release of an official posthumous single and the possibility that a Juice and J. Cole collaboration exists.\r\nJuice's estate premiered the Nick Mira and Charlie Handsome-produced tr… [+1601 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Leah Asmelash, CNN", "title": "Eminem donated 'Mom's Spaghetti' to hospital workers fighting coronavirus in Detroit - CNN", "description": "Rapper Eminem gave back to Detroit health care workers this week by distributing \"Mom's Spaghetti,\" infamously referenced in his hit song \"Lose Yourself.\"", "url": "https://www.cnn.com/2020/04/24/us/eminem-moms-spaghetti-detroit-hospitals-trnd/index.html", "urlToImage": null, "publishedAt": "2020-04-24T11:55:00Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Faith Karimi, CNN", "title": "At these movie theaters, the shows have gone on despite the coronavirus pandemic - CNN", "description": "In some places, drive-in theaters have remained open even with restrictions on nonessential services.", "url": "https://www.cnn.com/2020/04/24/us/coronavirus-drive-in-movie-theater-trnd/index.html", "urlToImage": null, "publishedAt": "2020-04-24T09:44:48Z", "content": "(CNN)As movie theater screens fade to black nationwide during the coronavirus pandemic, people sheltering in place are turning to drive-ins for much-needed entertainment. \r\nPeople once drawn to the glare of regular movie theaters are finding themselves at dri… [+2555 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Guillermo & Russell Wilson Prep Joe Burrow for NFL Draft - Sponsored by Bose - Jimmy Kimmel Live", "description": "If you watched the NFL Draft on ABC, you know it was a big night for NFL hopeful Joe Burrow. Getting drafted from home is a tricky thing though, so to prep f...", "url": "https://www.youtube.com/watch?v=qr_TDbXsjPM", "urlToImage": null, "publishedAt": "2020-04-24T05:30:31Z", "content": null}, {"source": {"id": null, "name": "Pagesix.com"}, "author": "Sara Nathan", "title": "Ex-Vogue editor André Leon Talley says Anna Wintour is 'not capable' of 'human kindness' - Page Six", "description": "“When she goes home alone at night, is she miserable? Does she feel alone?”", "url": "https://pagesix.com/2020/04/23/andre-leon-talley-says-anna-wintour-is-not-capable-of-human-kindness/", "urlToImage": null, "publishedAt": "2020-04-24T01:35:58Z", "content": "Vogue veteran André Leon Talley has ripped into his former boss Anna Wintour, claiming she is not capable of human kindness and that she dumped him for being too old, too overweight, too uncool.\r\nTalley, 70, who was editor-at-large at the fashion bible for de… [+1656 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Disney Gallery: Star Wars The Mandalorian - Official Trailer (Jon Favreau, Taika Waititi) - IGN", "description": "In Disney Gallery: The Mandalorian, Executive Producer Jon Favreau invites the cast and crew to share an unprecedented look at the making of the series which...", "url": "https://www.youtube.com/watch?v=f_miMhjdvvs", "urlToImage": null, "publishedAt": "2020-04-23T20:30:02Z", "content": "In Disney Gallery: The Mandalorian, Executive Producer Jon Favreau invites the cast and crew to share an unprecedented look at the making of the series which quickly became a pop culture phenomenon after premiering in November.\r\nDebuting on the day that a wor… [+406 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The Masked Singer Season 3 | Episode 12 Spoilers, Clues & Guesses - CinemaBlend", "description": "The Masked Singer has captivated America, and it isn’t hard to see why. The elaborate costumes, the performances, and the big mystery behind the identities o...", "url": "https://www.youtube.com/watch?v=Tp_OTEMzpMI", "urlToImage": null, "publishedAt": "2020-04-23T19:26:16Z", "content": null}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Gael Fashingbauer Cooper", "title": "YouTube turns 15 today. Watch the first video it posted - CNET", "description": "One of the founders visited the zoo. Let's just say the video site's content has improved a lot since 2005.", "url": "https://www.cnet.com/news/youtube-turns-15-today-watch-the-first-video-it-posted/", "urlToImage": null, "publishedAt": "2020-04-23T19:02:24Z", "content": "The clip is just 18 seconds long, but 15 years ago, it kicked off an online video revolution.  Thursday marks the 15th anniversary of the first-ever YouTube video, which shows company co-founder Jawed Karim standing in front of an elephant enclosure at the Sa… [+1519 chars]"}, {"source": {"id": "entertainment-weekly", "name": "Entertainment Weekly"}, "author": "Sydney Bucksbaum", "title": "Jonas Brothers documentary Happiness Continues: Watch first trailer | EW.com - Entertainment Weekly", "description": "Need more Jonas Brothers in your life? Here's some good news: Kevin Jonas, Joe Jonas, and Nick Jonas teamed up with Amazon for a second documentary, 'Happiness Continues,' and the first trailer is already here.", "url": "https://ew.com/movies/jonas-brothers-happiness-continues-trailer/", "urlToImage": null, "publishedAt": "2020-04-23T18:42:17Z", "content": "Need more Jonas Brothers in your life? Then here's some good news: Kevin Jonas, Joe Jonas, and Nick Jonas teamed up with Amazon Prime Video for a follow-up documentary film, and the first trailer is already here. Happiness Continues: A Jonas Brothers Concert … [+1397 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Joan E. Solsman", "title": "HBO Max: Launch date, prices, shows and movies to expect - CNET", "description": "HBO Max will launch May 27 with HBO's programs and movies, licensed hits and exclusive originals (at least, the ones that aren't delayed by coronavirus).", "url": "https://www.cnet.com/news/hbo-max-launch-date-may-27-prices-shows-movies-free-trials-promos-friends/", "urlToImage": null, "publishedAt": "2020-04-23T17:56:54Z", "content": "HBO Max promises a lot.\r\nScreenshot by CNET\r\nHBO Max, the HBO-anchored streaming service finally announced to be launching May 27, has much in common with its competitors in the streaming wars like Disney Plus and Peacock, not to mention Netflix. Like those, … [+18823 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Ron Dicker", "title": "Chris Hemsworth Discovers A Python In His Helmet During Quarantine - HuffPost", "description": "The \"Extraction\" actor reached his hand in and quickly pulled it away.", "url": "https://www.huffpost.com/entry/chris-hemsworth-python_n_5ea18a77c5b6194c7be92658", "urlToImage": null, "publishedAt": "2020-04-23T15:12:59Z", "content": "What Chris Hemsworth found in his motorcycle helmet while self-isolating might be enough to scare even Thor. (Fast forward to 3:00 above.)\r\nThe Australian actor, who of course plays the hammer-wielding Marvel superhero, said Wednesday on “Jimmy Kimmel Live!” … [+948 chars]"}]}