{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Nytimes.com"}, "author": "Jon Caramanica", "title": "Fred the Godson, Nimble New York Rapper, Dies at 41 - The New York Times", "description": "The Bronx musician was a forceful presence on mixtapes, filling his rhymes with clever punch lines.", "url": "https://www.nytimes.com/2020/04/24/arts/music/fred-the-godson-dead-coronavirus.html", "urlToImage": null, "publishedAt": "2020-04-25T02:39:03Z", "content": "This obituary is part of a series about people who have died in the coronavirus pandemic. Read about others here.\r\nFred the Godson, who for more than a decade was a respected figure in New York hip-hop, an understated master of wordplay with a signature flow,… [+2831 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "AFP", "title": "Kanye West officially now a billionaire: Forbes - Yahoo News", "description": "Rapper Kanye West is now a billionaire thanks largely to the basketball shoes bearing his name that he developed with Adidas, Forbes magazine said Friday.  T...", "url": "https://news.yahoo.com/kanye-west-officially-now-billionaire-forbes-010303956.html", "urlToImage": null, "publishedAt": "2020-04-25T01:04:49Z", "content": "Washington (AFP) - Rapper Kanye West is now a billionaire thanks largely to the basketball shoes bearing his name that he developed with Adidas, Forbes magazine said Friday.\r\nThe rough figure of the wealth of Kim Kardashian's hubby is $1.3 billion, the magazi… [+901 chars]"}, {"source": {"id": null, "name": "Cinemablend.com"}, "author": "Laura Hurley", "title": "Blue Bloods Actor Nick Cordero's Wife Says He Should Have Woken From Coma By Now - CinemaBlend", "description": "Amanda Kloots provides an update on her husband's condition.", "url": "https://www.cinemablend.com/television/2495108/blue-bloods-actor-nick-corderos-wife-says-he-should-have-woken-from-coma-by-now", "urlToImage": null, "publishedAt": "2020-04-25T00:23:14Z", "content": "Blue Bloods actor and popular TV guest star Nick Cordero has been fighting for his life after a diagnosis with COVID-19, and his wife Amanda Kloots has been providing regular updates on his condition. Her updates have provided a window into the illness as wel… [+2833 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Fortnite x Travis Scott Concert Breaks Records - IGN Now - IGN", "description": "Fortnite and Travis Scott's collaboration saw 12 million people viewing simultaneously, besting Fortnite's last concert event by about 2 million. Fortnite al...", "url": "https://www.youtube.com/watch?v=mHVdhCkMbUA", "urlToImage": null, "publishedAt": "2020-04-24T23:59:04Z", "content": "Fortnite and Travis Scott's collaboration saw 12 million people viewing simultaneously, besting Fortnite's last concert event by about 2 million. Fortnite also saw episode's of Quibi's Punk'd play in-game earlier this month.\r\n#ign#gaming#fortnite"}, {"source": {"id": null, "name": "Vulture.com"}, "author": "Rebecca Alter", "title": "Florence Pugh and Chris Pine to Star in Olivia Wilde’s New Thriller - Vulture", "description": "Flossie Rose will play a 1950s housewife.", "url": "http://www.vulture.com/2020/04/florence-pugh-olivia-wildes-new-movies.html", "urlToImage": null, "publishedAt": "2020-04-24T23:52:21Z", "content": "Olivia Wilde seems to have a filmmaking M.O., and were all benefiting from it. Step one: She identifies a beloved, trendy breakout star in an acclaimed A24 movie. Step two: She casts them in a complex leading role worthy of their considerable talents. Step th… [+1019 chars]"}, {"source": {"id": null, "name": "Consequenceofsound.net"}, "author": "Alex Young", "title": "Watch Post Malone Perform Nirvana Covers with Travis Barker - Consequence of Sound", "description": "Post Malone delivered a rousing set of Nirvana covers as part of a YouTube livestream benefiting COVID-19 relief. Watch the replay here.", "url": "https://consequenceofsound.net/2020/04/post-malone-nirvana-covers-video/", "urlToImage": null, "publishedAt": "2020-04-24T23:42:06Z", "content": "Here we are now, entertain us: Post Malone delivered a rousing set of Nirvana covers as part of a YouTube livestream benefiting COVID-19 relief. Watch the full replay below\r\nPlaying live from his home in Salt Lake City on Friday, Posty ripped through a varied… [+1257 chars]"}, {"source": {"id": null, "name": "Ktla.com"}, "author": "Tracy Bloom", "title": "Disneyland may not reopen this year because of coronavirus, financial analyst predicts - KTLA Los Angeles", "description": "Disney theme parks in the U.S. have been shuttered since mid-March and could remain that way until the beginning of 2021 due to the ongoing coronavirus health emergency, according to one analyst at…", "url": "https://ktla.com/news/local-news/disneyland-may-not-reopen-this-year-because-of-coronavirus-financial-analyst-predicts/", "urlToImage": null, "publishedAt": "2020-04-24T23:32:19Z", "content": "Disney theme parks in the U.S. have been shuttered since mid-March and could remain that way until the beginning of 2021 due to the ongoing coronavirus health emergency, according to one analyst at global financial firm UBS. \r\nIn a report released to clients … [+1857 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Demi Lovato BREAKS SILENCE On Selena Gomez Drama! - Clevver News", "description": "More Celebrity News ►► http://bit.ly/SubClevverNews #demilovato #selenagomez #finsta Last week, Demi Lovato’s alleged ‘Finsta’ account that trashed Selena Go...", "url": "https://www.youtube.com/watch?v=OSpAjBo6njE", "urlToImage": null, "publishedAt": "2020-04-24T23:30:00Z", "content": "More Celebrity News http://bit.ly/SubClevverNews#demilovato#selenagomez#finsta\r\nLast week, Demi Lovatos alleged Finsta account that trashed Selena Gomez was leaked for the world to see, and now Demi is speaking out on the #Demilovatoisover party, cancel cultu… [+864 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "David Moye", "title": "Tom Hanks Gives Typewriter To Boy Bullied Because His Name Is Corona - HuffPost", "description": "The actor told Corona DeVries, 8, “I thought this typewriter would suit you... Ask a grown-up how it works. And use it to write me back.”", "url": "https://www.huffpost.com/entry/tom-hanks-corona-typewriter-corona-devries_n_5ea35af6c5b669fd8924e00a", "urlToImage": null, "publishedAt": "2020-04-24T23:21:58Z", "content": "An 8-year-old boy named Corona has got a friend in Tom Hanks  as well as a gift stemming from the actors offbeat hobby of collecting typewriters.\r\nIt all started when Corona De Vries of Queensland, Australia, sent a get-well letter after the actor, who he kne… [+1551 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Curtis M. Wong", "title": "Matt Damon Adopts Irish Seaside Town As Lockdown Home Amid Coronavirus Crisis - HuffPost", "description": "Residents of Dalkey, Ireland, are proud of their new resident, who came to town for a movie but opted to stick around as stay-at-home restrictions took h...", "url": "https://www.huffpost.com/entry/matt-damon-ireland-lockdown_n_5ea3145cc5b6f96398143c36", "urlToImage": null, "publishedAt": "2020-04-24T23:16:26Z", "content": "Matt Damon has established a new home away from home during the coronavirus pandemic.\r\nIn March, the Good Will Hunting star touched down in Dalkey, Ireland, where he was slated to shoot scenes for Ridley Scotts The Last Duel. Filming was quickly halted, howev… [+1922 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Jessica Napoli", "title": "Cameron Diaz gushes about husband Benji Madden: 'I love being married' - Fox News", "description": "Cameron Diaz couldn't have been cuter while talking about her relationship with Benji Madden.", "url": "https://www.foxnews.com/entertainment/cameron-diaz-gushes-husband-benji-madden", "urlToImage": null, "publishedAt": "2020-04-24T23:12:41Z", "content": "Cameron Diaz couldn't have been cuter while talking about her relationship with Benji Madden.\r\nThe 47-year-old \"Charlie's Angels\" star gushed about their marriage during a chat with makeup artist and pal Gucci Westman on her YouTube series “Makeup &amp; Frien… [+1674 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Karen Han", "title": "Extraction review: Netflix thriller overloads Hemsworth’s charm with action - Polygon", "description": "Former Captain America stunt double Sam Hargrave directs this thriller starring Chris Hemsworth as mercenary Tyler Rake. His mission to rescue a kidnapped boy goes sideways, and also becomes extremely bloody. Streaming on Netflix now.", "url": "https://www.polygon.com/2020/4/24/21235001/extraction-review-chris-hemsworth-netflix-streaming", "urlToImage": null, "publishedAt": "2020-04-24T23:05:43Z", "content": "Chris Hemsworths best roles to date have tapped into his charm. His turn as a handsome but clueless assistant in the Ghostbusters reboot was a revelation, and Thor: Ragnarok wisely replaced the somber aspects of the god of thunder with a puppylike eagerness. … [+4452 chars]"}, {"source": {"id": null, "name": "Comicbook.com"}, "author": "Patrick Cavanaugh", "title": "Doctor Strange in the Multiverse of Madness Delayed to 2022 - ComicBook.com", "description": "Earlier this year, Marvel Studios revealed a major shuffle to their release schedule due to the coronavirus pandemic, with the studio now confirming that Doctor Strange in the Multiverse of Madness will be hitting theaters on March 25, 2022. The most recent u…", "url": "https://comicbook.com/marvel/news/doctor-strange-2-release-date-delay-sam-raimi-march-2022/", "urlToImage": null, "publishedAt": "2020-04-24T23:03:40Z", "content": "Earlier this year, Marvel Studios revealed a major shuffle to their release schedule due to the coronavirus pandemic, with the studio now confirming that Doctor Strange in the Multiverse of Madness will be hitting theaters on March 25, 2022. The most recent u… [+2617 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Corinne Reichert", "title": "Disney reshuffles Marvel movie release dates out to 2022 - CNET", "description": "Doctor Strange and Thor have been moved, while Into the Spider-Verse has also been delayed by Sony.", "url": "https://www.cnet.com/news/disney-reshuffles-marvel-movie-release-dates-out-to-2022/", "urlToImage": null, "publishedAt": "2020-04-24T23:02:30Z", "content": "Disney\r\nWalt Disney Studios has moved around a few more release dates following the delay of movies amid COVID-19 lockdowns and quarantines, including two Marvel Cinematic Universe movies. The Doctor Strange sequel has been pushed from 2021 to 2022, Disney sa… [+849 chars]"}, {"source": {"id": null, "name": "Eonline.com"}, "author": "Mike Vulpo", "title": "Hannah Brown & Tyler Cameron's Chemistry Is Undeniable in Latest Video - E! NEWS", "description": "Hannah Brown and Tyler Cameron's latest Instagram Live reminds fans that their chemistry is undeniable. Watch the sweet moments unfold for yourself.", "url": "https://www.eonline.com/news/1144733/watching-hannah-brown-and-tyler-cameron-tease-each-other-proves-their-chemistry-is-undeniable", "urlToImage": null, "publishedAt": "2020-04-24T22:53:56Z", "content": "You just can't deny chemistry these days!\r\nWe know, we know. Both Hannah Brown and Tyler Cameron are the first to admit they are single and not dating anyone during the Coronavirus pandemic. But as they continue to stay in touch and document their friendship … [+603 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Julia Alexander", "title": "Sony delays Spider-Man films, forcing Marvel to move Doctor Strange and Thor sequels again - The Verge", "description": "Spider-Man: Into the Spider-Verse and the third movie in the Spider-Man: Homecoming trilogy are getting delayed as Sony messes with its release schedule. As a result, Doctor Strange into the Multiverse and Thor: Love and Thunder have been delayed for a second…", "url": "https://www.theverge.com/2020/4/24/21235283/spider-man-spiderverse-homecoming-delay-release-date-trilogy-marvel-venom-doctor-strange-thor", "urlToImage": null, "publishedAt": "2020-04-24T22:45:42Z", "content": "But Uncharted gets an early release date\r\nPhoto: Sony Pictures Entertainment\r\nLike almost every other studio, Sony is moving around its film schedule because of the novel coronavirus. That means its two biggest Spider-Man movies will be delayed. \r\nThe sequel … [+1662 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By George Stark For Dailymail.com", "title": "Will & Grace stars Debra Messing and Megan Mullally's rumored feud gets addressed - Daily Mail", "description": "Will & Grace creators David Kohan and Max Mutchnick have added fuel to the rumours the co-stars Debra Messing and Meghan Mullally have harbored a secret feud with each other.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8255239/Will-Grace-stars-Debra-Messing-Megan-Mullallys-rumored-feud-gets-addressed.html", "urlToImage": null, "publishedAt": "2020-04-24T22:32:15Z", "content": "Will &amp; Grace creators David Kohan and Max Mutchnick have added fuel to the rumours the co-stars Debra Messing, 51, and Megan Mullally, 61, have harbored a secret feud with each other.\r\nKohan and Mutchnick were asked about the alleged clash in a recent Q&a… [+2240 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "How the Latest Clone Wars Broke Fans' Hearts! (Nerdist News w/ Dan Casey) - Nerdist", "description": "Could this week's heartbreaking episode of The Clone Wars be one of the series best? Dan takes a closer look in today's episode of Nerdist News! What's your ...", "url": "https://www.youtube.com/watch?v=CmU8SWLI97k", "urlToImage": null, "publishedAt": "2020-04-24T22:31:09Z", "content": null}, {"source": {"id": null, "name": "Slashfilm.com"}, "author": "Chris Evangelista", "title": "AMC Theatres Plan to Reopen For Tenet and Mulan - /FILM", "description": "AMC Theatres have no plans to reopen until its time for Tenet and Mulan in July.", "url": "https://www.slashfilm.com/amc-theatres-reopen/", "urlToImage": null, "publishedAt": "2020-04-24T22:30:55Z", "content": "Georgia, and a few more states, are making headlines by planning to reopen some businesses including movie theaters sooner than expected. Yet while theatres in certain places will be allowed to open soon, many of them have no plans to take advantage of this o… [+2484 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Mat Elfring", "title": "WWE's New Day Was Inspired By A Surprising Tag Team - GameSpot", "description": "WWE's Big E talks about wrestlers that helped inspire New Day's moves in the ring, including a team from AEW, along with his feelings on the Usos and their evolution as superstars.", "url": "https://www.gamespot.com/articles/wwes-new-day-was-inspired-by-a-surprising-tag-team/1100-6476487/", "urlToImage": null, "publishedAt": "2020-04-24T21:54:33Z", "content": "For almost six years, Big E, Kofi Kingston, and Xavier Woods have delighted audiences and put on spectacular performances as the tag team The New Day. In modern-day wrestling, being on the same team for six years is a huge accomplishment, especially consideri… [+3052 chars]"}, {"source": {"id": null, "name": "Vulture.com"}, "author": "Chris Murphy", "title": "Billy Kimmel’s Third Birthday Party Won Late Night This Week - Vulture", "description": "With surprise guest Spider-Man.", "url": "http://www.vulture.com/2020/04/this-week-in-late-night-billy-kimmel-birthday-tom-holland.html", "urlToImage": null, "publishedAt": "2020-04-24T21:32:46Z", "content": "Whats new, pussycats? Well, the president of the United States of America has suggested that people start injecting disinfectants, and I just started a 1,500-piece puzzle, which seems equally as futile and somehow twice as dangerous. As for late-night televis… [+5681 chars]"}, {"source": {"id": "bleacher-report", "name": "Bleacher Report"}, "author": "Mike  Chiari", "title": "WWE's Velveteen Dream Denies Allegation He Sent Explicit Photos to Minors - Bleacher Report", "description": "WWE NXT Superstar  Velveteen Dream  released a statement Friday regarding an allegation that he had an inappropriate interaction with an underage fan...", "url": "https://bleacherreport.com/articles/2888512-wwes-velveteen-dream-denies-allegation-he-sent-explicit-photos-to-minors", "urlToImage": null, "publishedAt": "2020-04-24T21:21:23Z", "content": "Photo credit: WWE.com.\r\nWWE NXT Superstar Velveteen Dream released a statement Friday regarding an allegation that he had an inappropriate interaction with an underage fan. \r\nDream, who is portrayed by 24-year-old Patrick Clark, wrote the following on Twitter… [+1586 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Jessica Napoli", "title": "'Defending Jacob' showrunner and director talk working with Chris Evans, challenging aspect of adapting a book - Fox News", "description": "It was all fun and games on the \"Defending Jacob\" set outside Boston, according to writer-showrunner Mark Bomback and director Morten Tyldum.", "url": "https://www.foxnews.com/entertainment/defending-jacob-chris-evans-tv-family-crime", "urlToImage": null, "publishedAt": "2020-04-24T21:17:54Z", "content": "It was all fun and games on the \"Defending Jacob\" set outside Boston, according to writer-showrunner Mark Bomback and director Morten Tyldum.\r\nPing pong tournaments and listening to podcasts created a lighthearted dynamic despite the grim plot of the Apple TV… [+4577 chars]"}, {"source": {"id": null, "name": "Tmz.com"}, "author": "TMZ Staff", "title": "'AGT' Star and Comedian Grandma Lee Dead at 85 - TMZ", "description": "Comedian Grandma Lee, who cracked the top ten on season 4 of \"America's Got Talent,\" has died at 85.", "url": "https://www.tmz.com/2020/04/24/grandma-lee-comedian-americas-got-talent-dead-at-85/", "urlToImage": null, "publishedAt": "2020-04-24T21:10:00Z", "content": "Comedian Grandma Lee -- who cracked the top ten on Season 4 of \"America's Got Talent\" -- has died ... according to her family.\r\nLee's son, Kelly, tells TMZ ... she died Friday afternoon at her assisted living facility in Jacksonville, FL, but it was not relat… [+794 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Tasha Robinson", "title": "Bad Education review: new HBO movie gives Hugh Jackman a chance to squirm - Polygon", "description": "Hugh Jackman and Allison Janney star in HBO’s true crime drama Bad Education, about a Long Island student who uncovers a massive embezzlement scandal in her school district. The best new movie to watch this week at home is on HBO GO and HBO NOW right now.", "url": "https://www.polygon.com/2020/4/24/21234625/bad-education-review-hbo-hugh-jackman-allison-janney-based-on-a-true-story", "urlToImage": null, "publishedAt": "2020-04-24T21:01:56Z", "content": "The inciting incident in Cory Finleys sharp, entertaining HBO drama Bad Education may strike some viewers as far too on-the-nose. When student journalist Rachel (Miracle Workers Geraldine Viswanathan) drops by the office of Long Island school superintendent F… [+6079 chars]"}, {"source": {"id": null, "name": "Blabbermouth.net"}, "author": "Blabbermouth", "title": "This Year's Louder Than Life Festival Is Officially Canceled - BLABBERMOUTH.NET", "description": "This year's Louder Than Life festival, which was scheduled to take place in September in Louisville, Kentucky, has been officially canceled due to the COVID-19 pandemic.\n\n\"Even though the festivals...", "url": "https://www.blabbermouth.net/news/this-years-louder-than-life-festival-is-officially-canceled/", "urlToImage": null, "publishedAt": "2020-04-24T20:56:39Z", "content": "This year's Louder Than Life festival, which was scheduled to take place in September in Louisville, Kentucky, has been officially canceled due to the COVID-19 pandemic.\r\n\"Even though the festivals are not until September, the advanced planning realities of p… [+2702 chars]"}, {"source": {"id": null, "name": "Timesofisrael.com"}, "author": null, "title": "Taylor Swift calls out Soros family's 'shameless greed' in beef with record co. - The Times of Israel", "description": "Pop superstar draws criticism as white supremacists seen associating her post with widespread anti-Semitic conspiracy theories about Soros", "url": "https://www.timesofisrael.com/taylor-swift-calls-out-soros-familys-shameless-greed-in-beef-with-record-co/", "urlToImage": null, "publishedAt": "2020-04-24T20:55:57Z", "content": "JTA — Taylor Swift is drawing criticism and apparent applause among her neo-Nazi fan base for calling out the Soros family in an Instagram post. Its the latest salvo in the pop superstars ongoing battle with her former record label.\r\nThe family long has been … [+2957 chars]"}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Aramide Tinubu", "title": "Kate Middleton Thinks Prince Louis Is the Only One of Her Kids That Looks Like Her, Source Reveals - Showbiz Cheat Sheet", "description": "Kate Middleton has gotten candid about motherhood and quarantining with her children. She's also convinced that Prince Louis looks just like her.", "url": "https://www.cheatsheet.com/entertainment/kate-middleton-thinks-prince-louis-looks-just-like-her.html/", "urlToImage": null, "publishedAt": "2020-04-24T20:54:49Z", "content": "In recent years, Catherine, Duchess of Cambridge has taken on more and more duties as a senior working member of the British royal family. Most of the duchess’ patronages have focused on childhood development and early childhood education. Though her schedule… [+3884 chars]"}, {"source": {"id": null, "name": "Cosmopolitan.com"}, "author": "Shannon Barbour", "title": "LOL, Peter Weber Fully Knows He Is the ”Butt of the Joke” on TikTok - Cosmopolitan.com", "description": "He saw y’all’s shady comments!", "url": "https://www.cosmopolitan.com/entertainment/tv/a32271236/peter-weber-butt-of-the-joke-tik-tok-kelley-flanagan/", "urlToImage": null, "publishedAt": "2020-04-24T20:53:00Z", "content": "<ul><li>Peter Weber apparently knows everyone makes fun of his TikTok dancing skills. </li><li>Bachelor Nation alums like Tyler Cameron and Connor Saeli have both dragged his videos. </li><li>Reports say Peter once read all the negative comments aloud on Inst… [+1601 chars]"}, {"source": {"id": null, "name": "Soompi.com"}, "author": "notclaira", "title": "BTS Joins Star-Studded Lineup For Virtual Broadcast Of Nickelodeon Kids' Choice Awards - soompi", "description": "BTS will be appearing on the 2020 Nickelodeon Kids’ Choice Awards! On April 24, Nickelodeon announced that their annual Kids’ Choice Awards would be hosted virtually. This means that, due to the COVID-19 pandemic, awards and performances will be presented rem…", "url": "https://www.soompi.com/article/1396481wpp/bts-joins-star-studded-lineup-for-virtual-broadcast-of-nickelodeon-kids-choice-awards", "urlToImage": null, "publishedAt": "2020-04-24T20:49:50Z", "content": "BTS will be appearing on the 2020 Nickelodeon Kids Choice Awards!\r\nOn April 24, Nickelodeon announced that their annual Kids Choice Awards would be hosted virtually. This means that, due to the COVID-19 pandemic, awards and performances will be presented remo… [+1351 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Mark Kennedy", "title": "A 'Phantom of the Opera' contest seeks singer with style - The Associated Press", "description": "NEW YORK (AP) — Andrew Lloyd Webber has launched a virtual competition that could lead to one fan singing on Broadway or the West End when musicals resume playing. The composer has invited...", "url": "https://apnews.com/f29c267bc06ed3b9e3375a018b122447", "urlToImage": null, "publishedAt": "2020-04-24T20:48:22Z", "content": "NEW YORK (AP) Andrew Lloyd Webber has launched a virtual competition that could lead to one fan singing on Broadway or the West End when musicals resume playing.\r\nThe composer has invited singers to make up their own little vocal showcase at the end of the so… [+2018 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Brian Flood", "title": "Andy Cohen says blood is 'boiling' because he can't donate plasma as a gay man: 'My blood could save a life' - Fox News", "description": "Bravo’s Andy Cohen, who recently recovered from coronavirus, said his blood  “could save a life but instead it’s over here boiling” because rules prevent him from donating plasma as a gay man.", "url": "https://www.foxnews.com/entertainment/andy-cohen-blood-boiling-cant-donate-plasma", "urlToImage": null, "publishedAt": "2020-04-24T20:45:13Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox.  Sign up here.\r\nBravo’s Andy Cohen, who recently recovered from coronavirus, said his “blood could save a life but instead it’s over here boiling” because rules prevent him from do… [+1802 chars]"}, {"source": {"id": null, "name": "Bravotv.com"}, "author": "Jenny Berg", "title": "Kristen Doute's New Fixer Upper House: See Living Room Decor | Style & Living - Bravo", "description": "When Kristen Doute spoke to The Daily Dish Podcast about her Valley Village home, which she bought about a year ago, she described it as \"a1939 fixer-upper.\" (Watch the clip above to hear part of Kristen's interview.) But the Vanderpump Rules beauty has alrea…", "url": "https://www.bravotv.com/vanderpump-rules/style-living/kristen-doutes-new-fixer-upper-house-see-living-room-decor", "urlToImage": null, "publishedAt": "2020-04-24T20:43:51Z", "content": "When Kristen Doute spoke to The Daily Dish Podcast about her Valley Village home, which she bought about a year ago, she described it as \"a1939 fixer-upper.\" (Watch the clip above to hear part of Kristen's interview.) But the Vanderpump Rules beauty has alrea… [+1512 chars]"}, {"source": {"id": "entertainment-weekly", "name": "Entertainment Weekly"}, "author": "Samantha Highfill", "title": "'Friday Night Lights' cast reunites to watch the pilot for Together At Home - Entertainment Weekly", "description": "Adrianne Palicki, Scott Porter, and more cast members reunited via Zoom.", "url": "https://ew.com/tv/friday-night-lights-cast-reunion-watch-pilot/", "urlToImage": null, "publishedAt": "2020-04-24T20:36:34Z", "content": "Clear eyes, full hearts, can't Zoom?\r\nAs part of Global Citizen's \"Together At Home\" series, which raises money for the World Health Organization amid the coronavirus pandemic, a handful of cast members from Friday Night Lights staged a virtual reunion to re-… [+810 chars]"}, {"source": {"id": null, "name": "Hollywoodreporter.com"}, "author": "Borys Kit", "title": "'Star Wars': Cassian Andor Disney+ Series Adds Two Actors (Exclusive) - Hollywood Reporter", "description": "Diego Luna is reprising his 'Rogue One' role of the Rebel intelligence officer.", "url": "https://www.hollywoodreporter.com/heat-vision/star-wars-cassian-andor-disney-series-adds-two-actors-1291772", "urlToImage": null, "publishedAt": "2020-04-24T20:19:38Z", "content": "Stellan Skarsgard and Kyle Soller are also cast.\r\nO'Reilly will return to her role as Mon Mothma, the politician who worked to oppose Empire and helped found the Rebel Alliance.\r\nCharacter details for Gough were not revealed.\r\nWhile there is no start date for… [+695 chars]"}, {"source": {"id": null, "name": "Vulture.com"}, "author": "Justin Curto", "title": "Which Moment in This New Kids on the Block Video Will Break You? - Vulture", "description": "Put this in the quarantine museum.", "url": "https://www.vulture.com/2020/04/new-kids-on-the-block-house-party-video.html", "urlToImage": null, "publishedAt": "2020-04-24T20:16:45Z", "content": "As it was prophesied, the coronavirus has ushered in a new era of art, albeit marked by tone-deaf celebrity videos along with bathtubs, basements, and broken records. Add this video to the museum too. New Kids on the Block brought together their friends Boyz … [+1455 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Louis Casiano", "title": "Eminem sends 'Mom’s Spaghetti' pasta to Detroit health care workers on coronavirus frontline - Fox News", "description": "Health care workers in Detriot \"lost themselves\" in spaghetti courtesy of rapper Eminem, who sent the pasta to those battling the coronavirus on the front lines.", "url": "https://www.foxnews.com/entertainment/eminem-sends-pasta-detroit-health-care-workers-coronavirus-frontline", "urlToImage": null, "publishedAt": "2020-04-24T20:16:31Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox. Sign up here.\r\nHealth care workers in Detriot \"lost themselves\" in spaghetti courtesy of rapperEminem, who sent the pasta to those battling the coronavirus on the front lines.\r\nThe… [+1088 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Kylie Jenner Shades Kourtney Kardashian Over Christmas Plans - KUWTK Recap - HollywoodLife", "description": "Kylie Jenner & Kim Kardashian call out Kourtney Kardashian over her Christmas plans. Plus, Khloe Kardashian freezes her eggs. #KhloeKardashian #KylieJenner #...", "url": "https://www.youtube.com/watch?v=xIfTkepuVPU", "urlToImage": null, "publishedAt": "2020-04-24T20:12:15Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandra Gonzalez, CNN", "title": "Tributes to the entertainers and artists who died from coronavirus - CNN", "description": "To honor some the creative forces who have died due to Covid-19, CNN turned to those who knew them, loved them and were deeply affected by the work that defined their legacies.", "url": "https://www.cnn.com/2020/04/24/entertainment/entertainers-weve-lost-to-coronavirus/index.html", "urlToImage": null, "publishedAt": "2020-04-24T20:05:42Z", "content": "(CNN)To honor some the creative forces who have died due to Covid-19, CNN turned to those who knew them, loved them and were deeply affected by the work that defined their legacies. \r\nBelow are tributes to these artists.\r\n\"Mark Blum was an actor's actor. Ever… [+21319 chars]"}, {"source": {"id": null, "name": "Rollingstone.com"}, "author": "Jason Newman", "title": "NFL Legend Terry Bradshaw Now Has a Quarantine-Themed Country Song - Rolling Stone", "description": "The country and gospel singer and perpetually ebullient sportscaster tells us about his humorous new song, \"Quarantine Crazy\"", "url": "https://www.rollingstone.com/music/music-features/nfl-legend-terry-bradshaw-country-song-quarantine-989721/", "urlToImage": null, "publishedAt": "2020-04-24T19:54:32Z", "content": "These days, NFL legend, broadcaster extraordinaire and national treasure Terry Bradshaw can be found on his 800-acre quarterhorse ranch in Thackerville, Oklahoma, located right on the Texas-Oklahoma border. Bradshaw, his wife Tammy, his three grandchildren, a… [+6471 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Denise Petski", "title": "NBC Pushes ‘Blindspot’ Return, Shifts ‘Council Of Dads’ Thursday Debut To Make Way For ‘Parks And Recreation’ Special - Deadline", "description": "NBC has made some scheduling moves to accommodate the Parks and Recreation COVID-19 benefit special, which airs at 8:30 pm on April 30. Council of Dads, which was scheduled to air its second episode at 8 pm, will move to 10 pm ET/PT Thursday, April 30. It wil…", "url": "https://deadline.com/2020/04/nbc-shifts-council-of-dads-blindspot-parks-and-recreation-special-1202917331/", "urlToImage": null, "publishedAt": "2020-04-24T19:47:38Z", "content": "NBC has made some scheduling moves to accommodate the Parks and RecreationCOVID-19 benefit special, which airs at 8:30 pm on April 30.\r\nCouncil of Dads, which was scheduled to air its second episode at 8 pm, will move to 10 pm ET/PT Thursday, April 30. It wil… [+899 chars]"}, {"source": {"id": null, "name": "Variety.com"}, "author": "Rebecca Rubin", "title": "‘Mission: Impossible’ Sequels Get Pushed Back - Variety", "description": "Paramount has delayed the theatrical releases of “Mission: Impossible 7” and “Mission: Impossible 8,” the next two chapters in Tom Cruise’s action franchise. The seventh installment, originally due in theaters on July 23, 2021, will now debut four months late…", "url": "https://variety.com/2020/film/box-office/mission-impossible-sequels-get-pushed-back-1234589362/", "urlToImage": null, "publishedAt": "2020-04-24T19:42:25Z", "content": "Paramount has delayed the theatrical releases of “Mission: Impossible 7” and “Mission: Impossible 8,” the next two chapters in Tom Cruise’s action franchise.\r\nThe seventh installment, originally due in theaters on July 23, 2021, will now debut four months lat… [+1348 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Gary Dinges", "title": "Billy Porter speaks 'truth to power' in cover of Buffalo Springfield's 'For What It's Worth' - USA TODAY", "description": "A frequent critic of President Donald Trump, Porter says he was inspired by artists who recorded songs during times of conflict in U.S. history.", "url": "https://www.usatoday.com/story/entertainment/music/2020/04/24/billy-porter-covers-stephen-stills-classic-for-what-its-worth/5155035002/", "urlToImage": null, "publishedAt": "2020-04-24T19:32:25Z", "content": "Music producers battle with the Verzuz series as fans party along \r\nAP Entertainment\r\nBilly Porter is channeling the past by bringing you a message from the future.\r\nThe singer, actor and Broadway performer has covered Stephen Stills beloved Buffalo Springfie… [+2809 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Meghan Markle Case Against British Tabloid Set To Begin In London | TODAY - TODAY", "description": "Friday marks the first court hearing in a privacy case brought by Meghan Markle against the Daily Mail, a British tabloid, for publishing part of a letter sh...", "url": "https://www.youtube.com/watch?v=Cjuyow4ftc8", "urlToImage": null, "publishedAt": "2020-04-24T19:00:03Z", "content": "Friday marks the first court hearing in a privacy case brought by Meghan Markle against the Daily Mail, a British tabloid, for publishing part of a letter she wrote to her father. NBC's Kelly Cobiella reports for TODAY from London.» Subscribe to TODAY: http:/… [+845 chars]"}, {"source": {"id": null, "name": "Jambase.com"}, "author": "Nate Todd", "title": "Trey Anastasio Talks Quarantine, Phish's 'Sigma Oasis,' Touring & More In New Interview - JamBase", "description": "Organizers of the Shambhala Music Festival canceled the 2020 event due to the coronavirus pandemic.", "url": "https://www.jambase.com/article/shambhala-2020-canceled-coronavirus", "urlToImage": null, "publishedAt": "2020-04-24T18:37:29Z", "content": "Shambhala Music Festival canceled its 2020 event due to the coronavirus COVID-19 outbreak. The festival was set to take place July 24 – 27 in Salmo, British Columbia, Canada.\r\nScheduled to perform at Shambhala 2020 were DJ Premier, Ekali, Rezz, RL Grime, Seve… [+1403 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lisa Respers France, CNN", "title": "Prince William's reason for not watching 'Tiger King' will make you laugh - CNN", "description": "Like the rest of us, Prince William is shut in and has time to binge-watch TV, but don't expect him to be watching \"Tiger King.\"", "url": "https://www.cnn.com/2020/04/24/entertainment/prince-william-tiger-king/index.html", "urlToImage": null, "publishedAt": "2020-04-24T18:35:39Z", "content": null}, {"source": {"id": null, "name": "Decider.com"}, "author": "Claire Spellberg", "title": "Dolly Parton's Company Produced 'Buffy the Vampire Slayer' And Fans Are Stunned - Decider", "description": "Slayin’ 9 to 5…", "url": "https://decider.com/2020/04/24/dolly-parton-buffy-the-vampire-slayer/", "urlToImage": null, "publishedAt": "2020-04-24T18:33:09Z", "content": "Does it still count as working “9 to 5” if the world doesn’t know about it? This week, the Independent reported that Dolly Parton was partially responsible for hit drama Buffy the Vampire Slayer, as she owns the company that executive produced the show, Sando… [+3155 chars]"}, {"source": {"id": null, "name": "Insidethemagic.net"}, "author": "https://www.facebook.com/EmilleEnchanted/", "title": "Florida Shares Insight into Reopening Process for State Tourism, Such as Disney and Universal - Inside the Magic", "description": "We share the most up-to-date information regarding the reopening of the state of Florida based on recommendations from the task force.", "url": "https://insidethemagic.net/2020/04/florida-reopening-update-ec2-kc2-ba2/", "urlToImage": null, "publishedAt": "2020-04-24T17:54:58Z", "content": "This week, Florida Governor Ron DeSantis held several meetings regarding protocols of re-opening Florida — alongside county commissioners and members of the Florida Task Force, and with Disney and Universal officials involved in the conversations, much of the… [+6597 chars]"}, {"source": {"id": null, "name": "Thedailybeast.com"}, "author": "Rachel Olding", "title": "Trump Claims He Was Joking When He Very Seriously Asked About Injecting Disinfectants and UV Light - The Daily Beast", "description": "The president asked health experts in a press briefing whether sunlight could be put “inside the body” or disinfectants could be injected to treat the coronavirus.", "url": "https://www.thedailybeast.com/trump-says-he-was-joking-when-he-asked-about-injecting-disinfectants-and-uv-light-to-treat-virus", "urlToImage": null, "publishedAt": "2020-04-24T17:43:36Z", "content": "President Donald Trump claimed he was being sarcastic when he asked health experts in a White House coronavirus briefing whether UV light or disinfectants could be inserted inside humans as a possible coronavirus treatment. I was asking a very sarcastic quest… [+1450 chars]"}, {"source": {"id": null, "name": "Avclub.com"}, "author": "Erik Adams", "title": "Beastie Boys Story is no sure shot - The A.V. Club", "description": "Now here's a little story we've got to tell about three bad brothers you know so well.", "url": "https://film.avclub.com/beastie-boys-story-is-no-sure-shot-1843043901", "urlToImage": null, "publishedAt": "2020-04-24T17:00:00Z", "content": "What if they made a Beastie Boys movie and it wasnt any fun? If there were none of the rambunctious spirit that defined the New York trios music even after they abandoned the party-boy put-ons of License To Ill? If the surviving band members recollections of … [+5247 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Melissa Roberto", "title": "Ellen DeGeneres' alleged rude behavior to staff, guests is 'rat poison' to her brand, expert says - The-Latest News", "description": "A brand expert speaks to Fox News about the recent allegations against Ellen DeGeneres.", "url": "https://www.foxnews.com/entertainment/ellen-degeneres-behavior-staff-guests-coronavirus-rat-poison-brand-expert-says", "urlToImage": null, "publishedAt": "2020-04-24T16:47:23Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox. Sign up here. \r\nEllen DeGeneres was put on blast this week after crew members of her namesake talk show leaked details about the television host's lack of support amid the coronavi… [+4114 chars]"}, {"source": {"id": null, "name": "Nme.com"}, "author": null, "title": "Mick Jagger responds to Paul McCartney’s claims that The Beatles were “better” than The Rolling Stones - NME Live", "description": "Mick Jagger has responded to Paul McCartney's recent comments that The Beatles were a superior band to The Rolling Stones.", "url": "https://www.nme.com/news/music/mick-jagger-responds-paul-mccartney-claims-the-beatles-better-the-rolling-stones-2653305", "urlToImage": null, "publishedAt": "2020-04-24T16:33:55Z", "content": "Mick Jagger has responded to Paul McCartney‘s recent comments that The Beatles were a superior band to The Rolling Stones.\r\nMcCartney made the comments in an interview with Howard Stern earlier this month, when he agreed with the host’s assertion that The Bea… [+1806 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Louisa Ballhaus", "title": "Too Cute! Kim Kardashian West's New Family Photo Is, Of Course, a Gem - Yahoo Entertainment", "description": "Amid the tragedies that the COVID-19 pandemic has brought upon us, I've found a small glimmer of hope in seeing how eager we all are to still connect, and how creative we've become in finding new ways to reach each other. That's exactly what Vogue's new Postc…", "url": "https://www.yahoo.com/entertainment/too-cute-kim-kardashian-wests-163232956.html", "urlToImage": null, "publishedAt": "2020-04-24T16:32:00Z", "content": "Click here to read the full article. \r\nAmid the tragedies that the COVID-19 pandemic has brought upon us, Ive found a small glimmer of hope in seeing how eager we all are to still connect, and how creative weve become in finding new ways to reach each other. … [+1906 chars]"}, {"source": {"id": null, "name": "Thedailybeast.com"}, "author": "Jillian Lucas", "title": "Knitting Can Help Ease Your Mind. Here Are Some Beginners Kits to Get Started - The Daily Beast", "description": "Teaching yourself to knit is a skill that will carry through years of your life. Now’s a great time to learn.", "url": "https://www.thedailybeast.com/how-to-start-knitting", "urlToImage": null, "publishedAt": "2020-04-24T16:05:12Z", "content": "Nowadays, with my (and the entire worlds) anxiety levels through the roof, theres a need to slow down and be present. Knitting can ground you. It lets you focus on small, minute movements and tasks.  You dont need to be an expert, either. Plenty of companies … [+1651 chars]"}, {"source": {"id": null, "name": "Sltrib.com"}, "author": "https://www.facebook.com/SeanPMeansCricket", "title": "Redwood Drive-In to reopen Friday, the first Salt Lake County movie theater back after coronavirus shutdown - Salt Lake Tribune", "description": "The Redwood Drive-In’s plans to open this weekend are on hold, after the Salt Lake County Health Department reminded the management that opening a movie theater would violate a public health order.", "url": "https://www.sltrib.com/artsliving/2020/04/24/redwood-drive-in-reopen/", "urlToImage": null, "publishedAt": "2020-04-24T14:49:22Z", "content": "The Redwood Drive-Ins plans to open this weekend are on hold, after the Salt Lake County Health Department reminded the management that opening a movie theater would violate a public health order.\r\n The Salt Lake County Health Department posted a warning on t… [+3653 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Dino-Ray Ramos", "title": "Western Thriller ‘True History Of Kelly Gang’ And ’60s Coming-Of-Age Drama ‘To The Stars’ Make Debuts – Specialty Streaming Preview - Deadline", "description": "The story of the notorious outlaw Ned Kelly is dropping on digital and on-demand today with the Justin Kurzel-directed True History of the Kelly Gang starring George MacKay (1917, Captain Fantastic), Russell Crowe (Boy Erased, The Loudest Voice) and Nicholas …", "url": "https://deadline.com/2020/04/true-history-of-kelly-gang-russell-crowe-justin-kurzel-to-the-stars-martha-stephens-specialty-streaming-preview-1202916073/", "urlToImage": null, "publishedAt": "2020-04-24T14:28:13Z", "content": "The story of the notorious outlaw Ned Kelly is dropping on digital and on-demand today with the Justin Kurzel-directed True History of the Kelly Gang starring George MacKay (1917, Captain Fantastic), Russell Crowe (Boy Erased, The Loudest Voice) and Nicholas … [+5477 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Alexis Soloski", "title": "In ‘Penny Dreadful: City of Angels,’ California Dreaming, Darkly - The New York Times", "description": "In this new “Penny Dreadful” series, the creator John Logan imagines a lost Los Angeles of cops, pachucos, Nazi sympathizers and a slinky chaos demon.", "url": "https://www.nytimes.com/2020/04/24/arts/television/penny-dreadful-city-of-angels.html", "urlToImage": null, "publishedAt": "2020-04-24T14:16:14Z", "content": "NEWHALL, Calif. On a sun-drunk afternoon in late February, John Logan tramped down the middle of a deserted street, passing an empty nightclub, a shuttered cinema, a vacant rooming house relics of a past that never quite existed.\r\nWe sort of created this whol… [+9198 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Brian Lowry, CNN", "title": "'Avengers: Endgame' premiered a year ago. A whole lot has changed since then - CNN", "description": "The Marvel blockbuster premiered one year ago, on April 26, 2019, although just imagining people crowding into theaters, it surely feels a whole lot longer. The movie went on to amass $2.8 billion worldwide, surpassing the benchmark set by \"Avatar.\"", "url": "https://www.cnn.com/2020/04/24/entertainment/avengers-endgame-one-year-later/index.html", "urlToImage": null, "publishedAt": "2020-04-24T13:55:01Z", "content": "(CNN)With what felt like a snap, \"Avengers: Endgame\" shattered opening-weekend box-office records, earning $357 million in North America -- roughly $100 million more than its predecessor. The movie went on to amass $2.8 billion worldwide, surpassing the bench… [+3766 chars]"}, {"source": {"id": null, "name": "Pagesix.com"}, "author": "Eileen Reslen", "title": "Alex Rodriguez suggests 'drive-through wedding' with Jennifer Lopez - Page Six", "description": "Love don’t cost a thing.", "url": "https://pagesix.com/2020/04/24/alex-rodriguez-suggests-drive-through-wedding-with-jennifer-lopez/", "urlToImage": null, "publishedAt": "2020-04-24T13:47:40Z", "content": "Love don’t have to cost a thing.\r\nAlex Rodriguez has confirmed that his wedding to Jennifer Lopez which was supposed to take place this summer has been postponed due to the coronavirus pandemic, but says he is now open to “cheaper” and socially-distanced alte… [+972 chars]"}, {"source": {"id": null, "name": "Wthr.com"}, "author": "TEGNA", "title": "Everything coming and leaving Netflix in May 2020 - WTHR", "description": "May features the debut of Steve Carrell's newest workplace comedy, the return of 'The Unbreakable Kimmy Schmidt,' and several new binge-worthy Netflix shows.", "url": "https://www.wthr.com/article/everything-coming-and-leaving-netflix-may-2020", "urlToImage": null, "publishedAt": "2020-04-24T13:09:38Z", "content": "LOS GATOS, Calif. Netflix has released its list of new shows and movies coming to the streaming site in May, which is perfect timing for those stands who are extending coronavirus stay-at-home orders. The May list includes several brand new comedy specials, d… [+5243 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Tyler McCarthy", "title": "Ellen Pompeo defends herself after resurfaced video shows her seemingly sympathizing with Harvey Weinstein - Fox News", "description": "Ellen Pompeo responded to criticism she’s getting after a resurfaced video clip from 2018 shows her seemingly empathizing with now-convicted rapist Harvey Weinstein.", "url": "https://www.foxnews.com/entertainment/ellen-pompeo-defends-resurfaced-video-sympathizing-harvey-weinstein", "urlToImage": null, "publishedAt": "2020-04-24T13:02:41Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox. Sign up here. \r\nEllen Pompeo responded to criticism she’s getting after a resurfaced video clip from 2018 shows her seemingly empathizing with now-convicted rapist Harvey Weinstein… [+3066 chars]"}, {"source": {"id": null, "name": "Xxlmag.com"}, "author": "xxlstaff", "title": "New Juice Wrld and J. Cole Song on the Way? - XXLMAG.COM", "description": "Watch here.", "url": "https://www.xxlmag.com/news/2020/04/juice-wrld-j-cole-song/", "urlToImage": null, "publishedAt": "2020-04-24T12:59:00Z", "content": "Last night marked two important moments in Juice Wrld's posthumous career: the release of an official posthumous single and the possibility that a Juice and J. Cole collaboration exists.\r\nJuice's estate premiered the Nick Mira and Charlie Handsome-produced tr… [+1601 chars]"}, {"source": {"id": null, "name": "Digitaltrends.com"}, "author": "Caleb Denison", "title": "15 Years of YouTube: How a failed dating site became the king of online video - Digital Trends", "description": "In 15 years on the internet, YouTube has had a massive influence on culture, politics, music, and countless other facets of life. Where does it go from here?", "url": "https://www.digitaltrends.com/features/how-youtube-has-changed-the-world-in-15-years/", "urlToImage": null, "publishedAt": "2020-04-24T10:23:24Z", "content": "It started with a wardrobe malfunction. Fifteen years later, YouTube has changed the world, and it’s more relevant and influential today than ever before. \r\nIn honor of YouTubes 15th birthday, I thought we should take a look at how YouTube started, how it has… [+10870 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Guillermo & Russell Wilson Prep Joe Burrow for NFL Draft - Sponsored by Bose - Jimmy Kimmel Live", "description": "If you watched the NFL Draft on ABC, you know it was a big night for NFL hopeful Joe Burrow. Getting drafted from home is a tricky thing though, so to prep f...", "url": "https://www.youtube.com/watch?v=qr_TDbXsjPM", "urlToImage": null, "publishedAt": "2020-04-24T05:30:31Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Alicia Keys debuts powerful new song 'Good Job' on CNN - CNN", "description": "Alicia Keys, a 15-time Grammy winner, debuts \"Good Job\" during a CNN global town hall addressing the latest developments in the Covid-19 pandemic.", "url": "https://www.cnn.com/videos/entertainment/2020/04/24/alicia-keys-visual-premiere-good-job-coronavirus-town-hall-vpx.cnn", "urlToImage": null, "publishedAt": "2020-04-24T02:24:56Z", "content": "Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds."}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Eric Robinette", "title": "MCU Fans Want to See Nebula Reach Her 'Full Potential' in 'Guardians 3' - Showbiz Cheat Sheet", "description": "One of the specific hopes is to see a new and improved Nebula, as played by Karen Gillan. They see a lot of potential for that character now.", "url": "https://www.cheatsheet.com/entertainment/mcu-fans-want-to-see-nebula-reach-her-full-potential-in-guardians-3.html/", "urlToImage": null, "publishedAt": "2020-04-23T23:33:49Z", "content": "MCU fans have a lot of hopes for Guardians of the Galaxy Vol. 3, partly because the movie has a lot of characters, and partly because the movie is taking longer than expected, with the firing and eventual re-hiring of writer-director James Gunn. \r\nOne of the … [+3590 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Suzy Byrne", "title": "Richard Gere, 70, welcomes his third child - Yahoo Entertainment", "description": "The \"Chicago\" actor’s 37-year-old wife, Alejandra Gere (née Silva), gave birth to their second child, making him a father of three.", "url": "https://www.yahoo.com/entertainment/richard-gere-70-welcomes-third-child-220528751.html", "urlToImage": null, "publishedAt": "2020-04-23T22:23:05Z", "content": "Richard Gere is a father again at age 70.\r\nThe Chicago actors 37-year-old wife, Alejandra Gere (née Silva), gave birth to their second child, a source confirms to Yahoo Entertainment. Its a baby boy the name has not been revealed publicly and the family is ho… [+1262 chars]"}, {"source": {"id": null, "name": "Billboard.com"}, "author": "Heran Mamo", "title": "Keith Urban's Quarantine Hair Is Getting Way Too Long, But Fans Can't Get Enough - Billboard", "description": "", "url": "https://www.billboard.com/articles/columns/country/9364658/keith-urban-quarantine-hair-post", "urlToImage": null, "publishedAt": "2020-04-23T20:46:47Z", "content": "Keith Urban has had his fair share of haircuts over the years, but his signature shaggy locks haven't stop growing during quarantine.\r\nThe 52-year-old country artist shared a picture of his eye-shielding \"quarantine hair\" that spoke for itself. \"..... honestl… [+535 chars]"}, {"source": {"id": null, "name": "Vulture.com"}, "author": "Rebecca Alter", "title": "Mandalorian Doc Trailer Gives Us More Baby Yoda When We Need Him Most - Vulture", "description": "It’s only a glimpse, but we’ll take it.", "url": "https://www.vulture.com/2020/04/watch-trailer-for-disney-docuseries-with-baby-yoda-video.html", "urlToImage": null, "publishedAt": "2020-04-23T18:51:53Z", "content": "Are there any two words in filmic parlance sweeter than practicaleffects? Thats not rhetorical. The correct answer is yes, and the words are Baby Yoda. The trailer for the upcoming Disney+ docuseries Disney Gallery: The Mandaloriangives us both, like the worl… [+1221 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Jason Farago", "title": "Now Virtual and in Video, Museum Websites Shake Off the Dust - The New York Times", "description": "Homebound and feeling the wanderlust? Our critic’s guide to the best online presentations from the world’s leading art palaces and picture galleries.", "url": "https://www.nytimes.com/2020/04/23/arts/design/best-virtual-museum-guides.html", "urlToImage": null, "publishedAt": "2020-04-23T18:30:50Z", "content": "In times of adversity, we look to art to give form to chaos. But where do you go when the chaos keeps you from art entirely? It will have to be online. As the coronavirus pandemic stretches into yet another month, keeping arts institutions closed across the g… [+11520 chars]"}]}