{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Roxy Simons For Mailonline", "title": "Jeff Goldblum is BLASTED by RuPaul's Drag Race viewers for being 'anti-Muslim' - Daily Mail", "description": "The actor, 67, was a guest judge on Friday's edition of the show, and had asked drag queen Jackie Cox about her Stars And Stripes runway look which saw her wear a star-spangled hijab.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8256341/Jeff-Goldblum-BLASTED-RuPauls-Drag-Race-viewers-anti-Muslim.html", "urlToImage": null, "publishedAt": "2020-04-25T14:12:48Z", "content": "Jeff Goldblum has been hit by criticism from fans for being 'anti-Muslim' after his appearance on RuPaul's Drag Race.\r\nThe actor, 67, was a guest judge on Friday's edition of the show, and had asked drag queen Jackie Cox about her Stars And Stripes runway loo… [+4345 chars]"}, {"source": {"id": null, "name": "Latimes.com"}, "author": "Josh Rottenberg", "title": "'Extraction' ending explained: Is Netflix planning a sequel? - Los Angeles Times", "description": "The makers of Netflix's \"Extraction\" explain the ambiguous ending and sequel plans for the Chris Hemsworth action film.", "url": "https://www.latimes.com/entertainment-arts/movies/story/2020-04-24/extraction-ending-explained-netflix-sequel-hemsworth", "urlToImage": null, "publishedAt": "2020-04-25T13:35:50Z", "content": "Chris Hemsworth was initially a bit wary about signing on to the new Netflix action movie Extraction. On the face of it, the idea of playing a black market mercenary hired to rescue the kidnapped teenage son of a crime boss in the film, which is now available… [+6758 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jacob Kastrenakes", "title": "New trailers: Snowpiercer, Hollywood, I May Destroy You, and more - The Verge", "description": "Watch this week’s best new trailers from Netflix, Hulu, HBO, AMC, TNT, and more, including a first look at HBO Max, the upcoming streaming service from AT&T.", "url": "https://www.theverge.com/2020/4/25/21235067/new-trailers-snowpiercer-hollywood-hbo-max-and-more", "urlToImage": null, "publishedAt": "2020-04-25T13:11:02Z", "content": "Plus our first look at HBO Max\r\nPhoto: Justina Mintz / TNT\r\nWith Parasite still on my mind, I decided to go back and rewatch Snowpiercer the other week since both Bong Joon-ho movies deal with such similar themes around class. Snowpiercer, obviously, does it … [+3763 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Maureen Callahan", "title": "Quarantine has unmasked A-Rod and J.Lo as malignant narcissists - New York Post ", "description": "A-Rod and J.Lo potentially making a bid for the New York Mets is, on the surface, a glamorous and hopeful idea, a forward-looking act of positivity in these calamitous times. It would be even more …", "url": "https://nypost.com/2020/04/25/quarantine-has-unmasked-a-rod-j-lo-as-malignant-narcissists/", "urlToImage": null, "publishedAt": "2020-04-25T12:38:21Z", "content": "A-Rod and J.Lo potentially making a bid for the New York Mets is, on the surface, a glamorous and hopeful idea, a forward-looking act of positivity in these calamitous times.\r\nIt would be even more so if these two hadnt been using this quarantine to constantl… [+4490 chars]"}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Suse Forrest", "title": "Why Kanye West Thinks Sunday Service Is the 'Wu-Tang Clan of Choirs' - Showbiz Cheat Sheet", "description": "Rapper Kanye West recently made an interesting comparison of his Sunday Service to the iconic Wu-Tang Clan. Rapper Kanye West recently made an interesting comparison of his Sunday Service to the iconic Wu-Tang Clan.", "url": "https://www.cheatsheet.com/entertainment/why-kanye-west-thinks-sunday-service-is-the-wu-tang-clan-of-choirs.html/", "urlToImage": null, "publishedAt": "2020-04-25T12:02:34Z", "content": "Kanye West surprised the world a little over a year ago when he announced that he would be creating a gospel choir. The award-winning rapper, who is known for his many controversial antics, decided that start a religious church-like service that allows celebr… [+4368 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Matt London", "title": "'Tiger King': Lawyer for Carole Baskin's missing husband says he was strangled, thrown from plane - Fox News", "description": "An attorney for the former husband of 'Tiger King' star Carole Baskin believes that his client and friend was strangled to death and thrown out of an airplane over the Gulf of Mexico.", "url": "https://www.foxnews.com/media/tiger-king-carole-baskin-don-lewis-lawyer", "urlToImage": null, "publishedAt": "2020-04-25T11:59:04Z", "content": "An attorney for the missing husband of \"Tiger King\" star Carole Baskin believes that his former client and friend was strangled and thrown out of an airplane over the Gulf of Mexico.\r\nThe hit Netflix series \"Tiger King: Murder, Mayhem and Madness\" has breathe… [+3260 chars]"}, {"source": {"id": null, "name": "Yourtango.com"}, "author": "https://www.facebook.com/ariagmitterwriter/", "title": "Today's Love Horoscopes + Tarot Card Readings For All Zodiac Signs On Saturday, April 25, 2020 - YourTango", "description": "Today's free love horoscopes and tarot card readings for all zodiac signs in astrology offer predictions based on numerology Life Path Number 6, with the Sun in Taurus and Moon in Taurus entering Gemini on Saturday, April 25, 2020.", "url": "https://www.yourtango.com/2020333143/horoscopes-free-daily-love-tarot-card-readings-each-zodiac-sign-april-25-2020-according-astrology", "urlToImage": null, "publishedAt": "2020-04-25T11:52:21Z", "content": "Today's love horoscopes and tarot card readings are here for all zodiac signs in astrology on Saturday, April 25, 2020.\r\nThe Sun and the Moon are in Taurus. The waxing crescent Moon leaves Taurus to enter Gemini at 3:19 a.m., EST.\r\nWhat do today's love horosc… [+7416 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amy Woodyatt", "title": "Kanye West is finally a billionaire, Forbes says. He sent the magazine a text to say it undervalued him - CNN", "description": "Kanye West has long coveted the title of \"billionaire.\"", "url": "https://www.cnn.com/2020/04/25/celebrities/kanye-west-billionaire-intl-scli/index.html", "urlToImage": null, "publishedAt": "2020-04-25T10:24:56Z", "content": null}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Eduard Varnham", "title": "'KUWTK': Why Don't the Kardashians Post More Recent Photos of Rob? - Showbiz Cheat Sheet", "description": "Fans are confused why the Kardashian-Jenner sisters don't post more pictures of Rob Kardashian. Fans are confused why the Kardashian-Jenner sisters don't post more pictures of Rob Kardashian.", "url": "https://www.cheatsheet.com/entertainment/kuwtk-why-dont-the-kardashians-post-more-recent-photos-of-rob.html/", "urlToImage": null, "publishedAt": "2020-04-25T10:24:15Z", "content": "The Kardashians are famous for being famous, so seeing one of their own family members more or less drop off the public radar has been more than a little disturbing. At one point, Rob Kardashian was a major part of the family’s show and public appearances.\r\nB… [+3487 chars]"}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Stefan Preston", "title": "Prince Harry's LA Life Is a 'Breath of Fresh Air' From Royal Life, Says Source - Showbiz Cheat Sheet", "description": "Find out how Prince Harry's new life in LA is different from his royal life in the United Kingdom. Find out how Prince Harry's new life in LA is different from his royal life in the United Kingdom.", "url": "https://www.cheatsheet.com/entertainment/prince-harrys-l-a-life-is-a-breath-of-fresh-air-from-royal-life-says-source.html/", "urlToImage": null, "publishedAt": "2020-04-25T09:25:51Z", "content": "Prince Harry is now settled in Los Angeles along with his wife, Meghan, Duchess of Sussex, and their young son, Archie Harrison. The former senior royal couple is lying low in the wake of the COVID-19 pandemic, so any major projects that they have in the work… [+6220 chars]"}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Connie Liou", "title": "Who Plays Magda on 'Penny Dreadful: City of Angels'? Natalie Dormer Portrays Showtime's Latest Supernatural Antagonist - Showbiz Cheat Sheet", "description": "Who plays Magda, Elsa, Rio, and Alex on 'Penny Dreadful: City of Angels'? Here's Natalie Dormer's latest project after 'Game of Thrones'.", "url": "https://www.cheatsheet.com/entertainment/magda-penny-dreadful-city-of-angels-natalie-dormer-alex-rio-elsa.html/", "urlToImage": null, "publishedAt": "2020-04-25T04:33:27Z", "content": "ThePenny Dreadful spinoff, City of Angels, may not star Eva Green, but the shows cast still packs a powerful punch. The new Showtime original series includes fan-favorites such as Nathan Lane and Alex Rodriguez. But Natalie Dormer — who plays Magda, Elsa, Rio… [+4684 chars]"}, {"source": {"id": null, "name": "Thewrap.com"}, "author": null, "title": "Jerry Bishop, 'Judge Judy' Announcer for 24 Years, Dies at 84 - msnNOW", "description": "Jerry Bishop, the announcer for \"Judge Judy\" since the syndicated courtroom show's inception, has died at the age of 84 of heart disease, a rep for the show confirmed on Friday. \"Jerry Bishop has been the voice of our program for 24 years. Everybody loved him…", "url": "https://www.thewrap.com/jerry-bishop-judge-judy-announcer-for-24-years-dies-at-84/", "urlToImage": null, "publishedAt": "2020-04-25T04:30:00Z", "content": "© TheWrap\r\n Jerry Bishop Judge Judy\r\nJerry Bishop, the announcer for \"Judge Judy\" since the syndicated courtroom show's inception, has died at the age of 84 of heart disease, a rep for the show confirmed on Friday.\r\n\"Jerry Bishop has been the voice of our pro… [+14501 chars]"}, {"source": {"id": null, "name": "Comicbook.com"}, "author": "Nick Valdez", "title": "Why Netflix Going All-In on Anime is a Great Move - ComicBook.com", "description": "A few years ago, Netflix began its greater push into the anime world by expanding its library of licenses and original productions. It suddenly went from purely a focus on older series to having Netflix license currently airing series in Japan. Not only that,…", "url": "https://comicbook.com/anime/news/netflix-anime-future-predictions-breakdown/", "urlToImage": null, "publishedAt": "2020-04-25T04:25:33Z", "content": "A few years ago, Netflix began its greater push into the anime world by expanding its library of licenses and original productions. It suddenly went from purely a focus on older series to having Netflix license currently airing series in Japan. Not only that,… [+3697 chars]"}, {"source": {"id": null, "name": "Ktla.com"}, "author": "Tracy Bloom", "title": "Disney theme parks may remain closed until 2021, financial analyst predicts - WAVY.com", "description": "Disney theme parks in the U.S. have been shuttered since mid-March and could remain that way until the beginning of 2021 due to the ongoing coronavirus health emergency, according to one analyst at…", "url": "https://ktla.com/news/local-news/disneyland-may-not-reopen-this-year-because-of-coronavirus-financial-analyst-predicts/", "urlToImage": null, "publishedAt": "2020-04-25T03:31:00Z", "content": "Disney theme parks in the U.S. have been shuttered since mid-March and could remain that way until the beginning of 2021 due to the ongoing coronavirus health emergency, according to one analyst at global financial firm UBS. \r\nIn a report released to clients … [+1857 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Tom Tapp", "title": "The Rolling Stones Land Number One Song On iTunes With ‘Living In A Ghost Town’ - Deadline", "description": "More than 40 years since their last number one hit on the Billboard Hot 100 Singles Chart, The Rolling Stones have landed at number one on iTunes. Yesterday, the band dropped “Living in a Ghost Town,” a surprise new song and accompanying video. Mick Jagger sa…", "url": "https://deadline.com/2020/04/the-rolling-stones-itunes-living-in-a-ghost-town-1202917713/", "urlToImage": null, "publishedAt": "2020-04-25T03:08:22Z", "content": "More than 40 years since their last number one hit on the Billboard Hot 100 Singles Chart, The Rolling Stones have landed at number one on iTunes.\r\nYesterday, the band dropped “Living in a Ghost Town,” a surprise new song and accompanying video. Mick Jagger s… [+822 chars]"}, {"source": {"id": null, "name": "Nme.com"}, "author": null, "title": "Watch Jerry Seinfeld return to stand-up after 22 years for Netflix comedy special - NME Live", "description": "Jerry Seinfeld has returned to screen for a Netflix comedy special amid the coronavirus pandemic.", "url": "https://www.nme.com/news/tv/jerry-seinfield-netflix-comedy-special-2653324", "urlToImage": null, "publishedAt": "2020-04-25T02:45:55Z", "content": "Jerry Seinfeld is returning to our screens to lighten the mood amid the coronavirus pandemic across the globe.\r\nOn Thursday (April 24), Netflix released a trailer for the comedy legends forthcoming original stand-up special, 23 Hours to Kill, his first after … [+1704 chars]"}, {"source": {"id": null, "name": "Vulture.com"}, "author": "Halle Kiefer", "title": "Andrew Lloyd Webber’s Phantom of the Opera Sequel Love Never Dies Is Here, Inside Your Living Room - Vulture", "description": "It never made Broadway, but hopefully it will make your weekend.", "url": "https://www.vulture.com/2020/04/phantom-of-the-opera-sequel-love-never-dies-free-to-stream.html", "urlToImage": null, "publishedAt": "2020-04-25T02:40:33Z", "content": "In case you were unaware, Andrew Lloyd Webbers smash hit musical The Phantom of the Opera has a sequel. Love Never Dies, set ten years after the events of Phantom and located in 1907 Coney Island, made its West End debut in 2010, where it received, to put it … [+1123 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Jon Caramanica", "title": "Fred the Godson, Nimble New York Rapper, Dies at 41 - The New York Times", "description": "The Bronx musician was a forceful presence on mixtapes, filling his rhymes with clever punch lines.", "url": "https://www.nytimes.com/2020/04/24/arts/music/fred-the-godson-dead-coronavirus.html", "urlToImage": null, "publishedAt": "2020-04-25T02:39:03Z", "content": "This obituary is part of a series about people who have died in the coronavirus pandemic. Read about others here.\r\nFred the Godson, who for more than a decade was a respected figure in New York hip-hop, an understated master of wordplay with a signature flow,… [+2831 chars]"}, {"source": {"id": null, "name": "Wrestlingnews.co"}, "author": "Paul Davis", "title": "Vince McMahon made a surprise appearance for Triple H 25th anniversary celebration on WWE SmackDown - Wrestling News", "description": "Vince McMahon made a surprise appearance this week on WWE Friday Night SmackDown as part of the 25th anniversary celebration for Triple H. McMahon joked about some of the “rotten” segments from Triple H’s past and he ended by telling him that he loves him. Mc…", "url": "https://wrestlingnews.co/wwe-news/vince-mcmahon-made-a-surprise-appearance-for-triple-h-25th-anniversary-celebration-on-wwe-smackdown/", "urlToImage": null, "publishedAt": "2020-04-25T02:38:02Z", "content": "Vince McMahon made a surprise appearance this week on WWE Friday Night SmackDown as part of the 25th anniversary celebration for Triple H.\r\nMcMahon joked about some of the “rotten” segments from Triple H’s past and he ended by telling him that he loves him. M… [+934 chars]"}, {"source": {"id": null, "name": "Www.geo.tv"}, "author": "Web Desk", "title": "Nick Corderos wife gives major health update on his coronavirus battle - Geo News", "description": "Nick Cordero underwent a leg surgery which might have left him unable to walk again", "url": "https://www.geo.tv/latest/284816-nick-corderos-wife-gives-major-health-update-on-his-coronavirus-battle", "urlToImage": null, "publishedAt": "2020-04-25T02:35:48Z", "content": "Broadway actor Nick Corderos wife has given an update on his health, revealing that he has tested negative for coronavirus twice.\r\nAmanda Kloots took to Instagram to reveal, Good news, dada had two negative COVID tests! Yay!\" she said in a video with the coup… [+798 chars]"}, {"source": {"id": null, "name": "Etonline.com"}, "author": "John Boone‍", "title": "Every Movie Delayed Due to Coronavirus: Find Out the New Release Date - Entertainment Tonight", "description": "You'll have to wait a little longer to see 'Venom: Let There Be Carnage' and more.", "url": "https://www.etonline.com/spider-man-and-into-the-spider-verse-sequels-delayed-due-to-coronavirus-here-are-the-new-release", "urlToImage": null, "publishedAt": "2020-04-25T02:05:00Z", "content": "With movie theaters closed amid the ongoing pandemic, our homes have been turned into a cinema in the time of coronavirus, with many films available on VOD or to stream earlier than expected. But those are largely movies that had the unlucky timing of droppin… [+13529 chars]"}, {"source": {"id": null, "name": "Wlky.com"}, "author": "WLKY Digital Team", "title": "Bourbon & Beyond, Hometown Rising, Louder Than Life all canceled this year - WLKY Louisville", "description": "Three of Lousiville's major music festival are canceled for this year.", "url": "https://www.wlky.com/article/hometown-rising-louder-than-life-bourbon-and-beyond-all-canceled-this-year/32270764", "urlToImage": null, "publishedAt": "2020-04-25T01:49:00Z", "content": "LOUISVILLE, Ky. —Three of Lousiville's major music festivals are canceled for this year.\r\nDanny Wimmer Presents announced Friday that Hometown Rising, Louder Than Life and Bourbon &amp; Beyond, otherwise known as Louisville Trifesta, won't go on as scheduled … [+919 chars]"}, {"source": {"id": null, "name": "Latimes.com"}, "author": "Adam Tschorn", "title": "'Making the Cut' on Amazon: Meet winner Jonny Cota - Los Angeles Times", "description": "Season one's winner talks halo effects, career boosts and 'the most beautiful alien I have ever seen.'", "url": "https://www.latimes.com/entertainment-arts/tv/story/2020-04-24/amazon-making-the-cut-winner-interview", "urlToImage": null, "publishedAt": "2020-04-25T01:43:23Z", "content": "Even if it hadnt debuted just as the global coronavirus pandemic was profoundly reshaping the worlds of entertainment, fashion and retail, Amazons foray into reality television the 10-episode Making the Cut, which concluded its first season Friday was destine… [+9062 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Julius Young", "title": "Michelle Money’s daughter released from hospital 26 days after near-fatal skateboarding accident: ‘Grateful’ - Fox News", "description": "Michelle Money’s daughter Brielle is out of the hospital after spending three weeks in intensive care following a skateboarding accident that nearly ended her life.", "url": "https://www.foxnews.com/entertainment/michelle-money-daughter-released-hospital-near-fatal-skateboarding-accident", "urlToImage": null, "publishedAt": "2020-04-25T00:09:53Z", "content": "Michelle Money’s daughter Brielle is out of the hospital after spending three weeks in intensive care following a skateboarding accident that nearly ended her life.\r\nThe “Bachelor in Paradise” alum shared a series of photos of her daughter to her Instagram af… [+4032 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Charles Trepany", "title": "Coronavirus: Post Malone's virtual Nirvana tribute concert raises $2.6M for relief efforts - USA TODAY", "description": "Post Malone gave a virtual concert Friday in honor of Nirvana to raise money for charity. He performed songs from \"Drain You\" to \"Come as You Are.\"", "url": "https://www.usatoday.com/story/entertainment/music/2020/04/24/coronavirus-post-malone-nirvana-concert-charity/3023805001/", "urlToImage": null, "publishedAt": "2020-04-24T23:58:40Z", "content": "Teresa and Joe Giudice have separated after nearly twenty years of marriage; \"Rise of Skywalker\" reviews split 50-50 for and against; Post Malone to headline Dick Clark's New Year's Rockin' Eve. (Dec. 18)\r\nAP Entertainment\r\nPost Malone's concert may be virtua… [+3303 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Demi Lovato BREAKS SILENCE On Selena Gomez Drama! - Clevver News", "description": "More Celebrity News ►► http://bit.ly/SubClevverNews #demilovato #selenagomez #finsta Last week, Demi Lovato’s alleged ‘Finsta’ account that trashed Selena Go...", "url": "https://www.youtube.com/watch?v=OSpAjBo6njE", "urlToImage": null, "publishedAt": "2020-04-24T23:30:00Z", "content": null}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "David Moye", "title": "Tom Hanks Gives Typewriter To Boy Bullied Because His Name Is Corona - HuffPost", "description": "The actor told Corona DeVries, 8, “I thought this typewriter would suit you... Ask a grown-up how it works. And use it to write me back.”", "url": "https://www.huffpost.com/entry/tom-hanks-corona-typewriter-corona-devries_n_5ea35af6c5b669fd8924e00a", "urlToImage": null, "publishedAt": "2020-04-24T23:21:58Z", "content": "An 8-year-old boy named Corona has got a friend in Tom Hanks  as well as a gift stemming from the actors offbeat hobby of collecting typewriters.\r\nIt all started when Corona De Vries of Queensland, Australia, sent a get-well letter after the actor, who he kne… [+1551 chars]"}, {"source": {"id": null, "name": "Darkhorizons.com"}, "author": null, "title": "\"Doctor Strange 2\" Delayed Again To 2022 - Dark Horizons", "description": "Disney has pushed back “Doctor Strange in the Multiverse of Madness” again due to the coronavirus pandemic. Having previously shifted it from May 2021 to November 5th 2021, it has now been moved again to March 25th 2022. The Sam Raimi-directed film sees Bened…", "url": "https://www.darkhorizons.com/doctor-strange-2-delayed-again-to-2022/", "urlToImage": null, "publishedAt": "2020-04-24T23:17:00Z", "content": "Disney has pushed back “Doctor Strange in the Multiverse of Madness” again due to the coronavirus pandemic. Having previously shifted it from May 2021 to November 5th 2021, it has now been moved again to March 25th 2022.\r\nThe Sam Raimi-directed film sees Bene… [+935 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Curtis M. Wong", "title": "Matt Damon Adopts Irish Seaside Town As Lockdown Home Amid Coronavirus Crisis - HuffPost", "description": "Residents of Dalkey, Ireland, are proud of their new resident, who came to town for a movie but opted to stick around as stay-at-home restrictions took hold.", "url": "https://www.huffpost.com/entry/matt-damon-ireland-lockdown_n_5ea3145cc5b6f96398143c36", "urlToImage": null, "publishedAt": "2020-04-24T23:16:26Z", "content": "Matt Damon has established a new home away from home during the coronavirus pandemic.\r\nIn March, the “Good Will Hunting” star touched down in Dalkey, Ireland, where he was slated to shoot scenes for Ridley Scott’s “The Last Duel.” Filming was quickly halted, … [+1605 chars]"}, {"source": {"id": null, "name": "Salon.com"}, "author": "Annie Zaleski", "title": "\"Beastie Boys Story\" film pays bittersweet tribute to the trio's iconic career and friendship - Salon", "description": "The absence of Adam Yauch renders lively storytelling by Adam Horowitz and Mike Diamond all the more poignant", "url": "https://www.salon.com/2020/04/24/beastie-boys-story-review-apple-tv-plus/", "urlToImage": null, "publishedAt": "2020-04-24T23:10:46Z", "content": "During their decades-long career, The Beastie Boys never stayed in one musical lane for long. Although the trio became multiplatinum superstars thanks to hip-hop that drew on rock 'n' roll as much as Run-DMC, they very quickly moved on and embraced other thin… [+7288 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Marina Fang", "title": "The Largest US Movie Theater Chain Won't Reopen Even If States Say It Can - HuffPost", "description": "Some states are allowing theaters to resume operations, even though public health experts advise against it. But there aren't even any new movies to show.", "url": "https://www.huffpost.com/entry/amc-movie-theaters-reopening_n_5ea334d5c5b6d376358f3f7d", "urlToImage": null, "publishedAt": "2020-04-24T23:04:41Z", "content": "Although states are slowly starting to allow movie theaters to resume operations against the recommendations of public health experts, AMC Theatres, the largest movie theater chain in the U.S., won’t reopen its locations until at least this summer.\r\n“As we pl… [+2804 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Corinne Reichert", "title": "Disney reshuffles Marvel movie release dates out to 2022 - CNET", "description": "Doctor Strange and Thor have been moved, while Into the Spider-Verse has also been delayed by Sony.", "url": "https://www.cnet.com/news/disney-reshuffles-marvel-movie-release-dates-out-to-2022/", "urlToImage": null, "publishedAt": "2020-04-24T23:02:30Z", "content": "Disney\r\nWalt Disney Studios has moved around a few more release dates following the delay of movies amid COVID-19 lockdowns and quarantines, including two Marvel Cinematic Universe movies. The Doctor Strange sequel has been pushed from 2021 to 2022, Disney sa… [+849 chars]"}, {"source": {"id": null, "name": "Eonline.com"}, "author": "Mike Vulpo", "title": "Hannah Brown & Tyler Cameron's Chemistry Is Undeniable in Latest Video - E! NEWS", "description": "Hannah Brown and Tyler Cameron's latest Instagram Live reminds fans that their chemistry is undeniable. Watch the sweet moments unfold for yourself.", "url": "https://www.eonline.com/news/1144733/watching-hannah-brown-and-tyler-cameron-tease-each-other-proves-their-chemistry-is-undeniable", "urlToImage": null, "publishedAt": "2020-04-24T22:53:56Z", "content": "You just can't deny chemistry these days!\r\nWe know, we know. Both Hannah Brown and Tyler Cameron are the first to admit they are single and not dating anyone during the Coronavirus pandemic. But as they continue to stay in touch and document their friendship … [+603 chars]"}, {"source": {"id": "entertainment-weekly", "name": "Entertainment Weekly"}, "author": "Tyler Aquilina", "title": "'Seinfeld,' 'Star Trek' actor Gene Dynarski dies at 86 - The-Latest News", "description": "Character actor Gene Dynarski, who also appeared on 'Batman' and in Steven Spielberg's 'Duel' and 'Close Encounters of the Third Kind,' among other projects, had died at 86.", "url": "https://ew.com/tv/gene-dynarski-dead-seinfeld-star-trek-actor-obit/", "urlToImage": null, "publishedAt": "2020-04-24T22:49:15Z", "content": "Gene Dynarski, a character actor known for his roles on Seinfeld and in Steven Spielberg's Close Encounters of the Third Kind, has died. He was 86.\r\nDynarski died Feb. 27 in a rehabilitation center in Studio City, Calif., according to The Hollywood Reporter, … [+1431 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By George Stark For Dailymail.com", "title": "Will & Grace stars Debra Messing and Megan Mullally's rumored feud gets addressed - Daily Mail", "description": "Will & Grace creators David Kohan and Max Mutchnick have added fuel to the rumours the co-stars Debra Messing and Meghan Mullally have harbored a secret feud with each other.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8255239/Will-Grace-stars-Debra-Messing-Megan-Mullallys-rumored-feud-gets-addressed.html", "urlToImage": null, "publishedAt": "2020-04-24T22:32:15Z", "content": "Will &amp; Grace creators David Kohan and Max Mutchnick have added fuel to the rumours the co-stars Debra Messing, 51, and Megan Mullally, 61, have harbored a secret feud with each other.\r\nKohan and Mutchnick were asked about the alleged clash in a recent Q&a… [+2240 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "How the Latest Clone Wars Broke Fans' Hearts! (Nerdist News w/ Dan Casey) - Nerdist", "description": "Could this week's heartbreaking episode of The Clone Wars be one of the series best? Dan takes a closer look in today's episode of Nerdist News! What's your ...", "url": "https://www.youtube.com/watch?v=CmU8SWLI97k", "urlToImage": null, "publishedAt": "2020-04-24T22:31:09Z", "content": null}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Cydney Henderson", "title": "Is Prince William watching 'Tiger King'? The royal jokes homeschooling has been 'a nightmare' - USA TODAY", "description": "Netflix docuseries 'Tiger King' has taken the streaming world by storm, drawing in millions of viewers. But Prince William was not one. Here's why.", "url": "https://www.usatoday.com/story/entertainment/celebrities/2020/04/24/prince-william-says-he-wont-tuning-into-tiger-king-heres-why/3023538001/", "urlToImage": null, "publishedAt": "2020-04-24T22:15:27Z", "content": "Joe Exotic had hundreds of tigers in the Netflix 'Tiger King' documentary. The Wild Animal Sanctuary saved 39 of them.\r\nUSA TODAY\r\n\"Tiger King\" appears to be a royal pain to Prince Williams. \r\nThe popular Netflix docu-series about the misfortunes of Oklahoma … [+2438 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lisa Respers France, CNN", "title": "Alicia Keys debuts powerful anthem in partnership with CNN - CNN", "description": "If you find yourself in tears watching the visual for Alicia Keys' new song, know that the singer had the same reaction the first time she saw it.", "url": "https://www.cnn.com/2020/04/23/entertainment/alicia-keys-cnn-song/index.html", "urlToImage": null, "publishedAt": "2020-04-24T22:05:48Z", "content": null}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Carly Mallenbaum", "title": "Nickelodeon's Kids' Choice Awards goes remote; Disney World presents virtual fireworks - USA TODAY", "description": "The Kids' Choice Awards will now a \"virtually produced,\" star-studded show on May 2. Need kid-friendly programming while you wait: Disney's fireworks.", "url": "https://www.usatoday.com/story/entertainment/tv/2020/04/24/kids-choice-awards-ariana-grande-rock-bts-appear-virtually/3023296001/", "urlToImage": null, "publishedAt": "2020-04-24T21:58:23Z", "content": "Comedians, actors, and musicians use their extra free time during coronavirus isolation to give back to fans and support charities.\r\nUSA TODAY\r\nThe Kids' Choice Awards show will go on, and the slime will flow in a \"virtually produced\" show.\r\nOriginally schedu… [+1739 chars]"}, {"source": {"id": null, "name": "Salon.com"}, "author": "Melanie McFarland", "title": "In taut legal drama \"Defending Jacob,\" Chris Evans shows up as the daddy America needs - Salon", "description": "The latest Apple TV+ family drama is a crisply tailored crime and courtroom mystery. It's also an Evans showcase", "url": "https://www.salon.com/2020/04/24/in-taut-legal-drama-defending-jacob-chris-evans-shows-up-as-the-daddy-america-needs/", "urlToImage": null, "publishedAt": "2020-04-24T21:52:17Z", "content": "\"Any man can be a father, but it takes a hot, middle-aged guy with a big job to be a daddy.\" A wise man once said that. Wait — no, my bad, it was Matt Damon. That doesn't make it any less true. The difference between a father and a daddy is significant and mi… [+6609 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Luke Hawker", "title": "Kate and William honour Anzac Day and share resources to celebrate ‘in spirit’ - Express", "description": "KATE, the Duchess of Cambridge and Prince William have paid tribute all the fallen Australian and New Zealand military personnel who lost their life during conflicts around the world for Anzac Day", "url": "https://www.express.co.uk/news/royal/1273651/kate-middleton-news-latest-prince-william-anzac-day-celebrations-australia-new-zealand", "urlToImage": null, "publishedAt": "2020-04-24T21:48:07Z", "content": null}, {"source": {"id": null, "name": "Vulture.com"}, "author": "Chris Murphy", "title": "Billy Kimmel’s Third Birthday Party Won Late Night This Week - Vulture", "description": "With surprise guest Spider-Man.", "url": "http://www.vulture.com/2020/04/this-week-in-late-night-billy-kimmel-birthday-tom-holland.html", "urlToImage": null, "publishedAt": "2020-04-24T21:32:46Z", "content": "Whats new, pussycats? Well, the president of the United States of America has suggested that people start injecting disinfectants, and I just started a 1,500-piece puzzle, which seems equally as futile and somehow twice as dangerous. As for late-night televis… [+5681 chars]"}, {"source": {"id": null, "name": "Billboard.com"}, "author": "Dave Brooks", "title": "Live Nation Details Ticket Refund Plan for Canceled, Rescheduled Shows - Billboard", "description": "", "url": "https://www.billboard.com/articles/business/touring/9365657/live-nation-ticket-refund-plan-canceled-rescheduled-shows", "urlToImage": null, "publishedAt": "2020-04-24T21:16:00Z", "content": "Fans who purchased tickets to a canceled Live Nation show at one of the company's venues will have a chance to get a full refund or accept a 150% credit toward a new ticket for a future date and part of a newly-announced ticket relief program.\r\nThe details of… [+1277 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Tasha Robinson", "title": "Bad Education review: new HBO movie gives Hugh Jackman a chance to squirm - Polygon", "description": "Hugh Jackman and Allison Janney star in HBO’s true crime drama Bad Education, about a Long Island student who uncovers a massive embezzlement scandal in her school district. The best new movie to watch this week at home is on HBO GO and HBO NOW right now.", "url": "https://www.polygon.com/2020/4/24/21234625/bad-education-review-hbo-hugh-jackman-allison-janney-based-on-a-true-story", "urlToImage": null, "publishedAt": "2020-04-24T21:01:56Z", "content": "The inciting incident in Cory Finleys sharp, entertaining HBO drama Bad Education may strike some viewers as far too on-the-nose. When student journalist Rachel (Miracle Workers Geraldine Viswanathan) drops by the office of Long Island school superintendent F… [+6079 chars]"}, {"source": {"id": null, "name": "Timesofisrael.com"}, "author": null, "title": "Taylor Swift calls out Soros family's 'shameless greed' in beef with record co. - The Times of Israel", "description": "Pop superstar draws criticism as white supremacists seen associating her post with widespread anti-Semitic conspiracy theories about Soros", "url": "https://www.timesofisrael.com/taylor-swift-calls-out-soros-familys-shameless-greed-in-beef-with-record-co/", "urlToImage": null, "publishedAt": "2020-04-24T20:55:57Z", "content": "JTA — Taylor Swift is drawing criticism and apparent applause among her neo-Nazi fan base for calling out the Soros family in an Instagram post. Its the latest salvo in the pop superstars ongoing battle with her former record label.\r\nThe family long has been … [+2957 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Brian Flood", "title": "Andy Cohen says blood is 'boiling' because he can't donate plasma as a gay man: 'My blood could save a life' - Fox News", "description": "Bravo’s Andy Cohen, who recently recovered from coronavirus, said his blood  “could save a life but instead it’s over here boiling” because rules prevent him from donating plasma as a gay man.", "url": "https://www.foxnews.com/entertainment/andy-cohen-blood-boiling-cant-donate-plasma", "urlToImage": null, "publishedAt": "2020-04-24T20:45:13Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox.  Sign up here.\r\nBravo’s Andy Cohen, who recently recovered from coronavirus, said his “blood could save a life but instead it’s over here boiling” because rules prevent him from do… [+1802 chars]"}, {"source": {"id": "entertainment-weekly", "name": "Entertainment Weekly"}, "author": "Samantha Highfill", "title": "'Friday Night Lights' cast reunites to watch the pilot for Together At Home - Entertainment Weekly", "description": "Adrianne Palicki, Scott Porter, and more cast members reunited via Zoom.", "url": "https://ew.com/tv/friday-night-lights-cast-reunion-watch-pilot/", "urlToImage": null, "publishedAt": "2020-04-24T20:36:34Z", "content": "Clear eyes, full hearts, can't Zoom?\r\nAs part of Global Citizen's \"Together At Home\" series, which raises money for the World Health Organization amid the coronavirus pandemic, a handful of cast members from Friday Night Lights staged a virtual reunion to re-… [+810 chars]"}, {"source": {"id": null, "name": "Vulture.com"}, "author": "Justin Curto", "title": "Which Moment in This New Kids on the Block Video Will Break You? - Vulture", "description": "Put this in the quarantine museum.", "url": "https://www.vulture.com/2020/04/new-kids-on-the-block-house-party-video.html", "urlToImage": null, "publishedAt": "2020-04-24T20:16:45Z", "content": "As it was prophesied, the coronavirus has ushered in a new era of art, albeit marked by tone-deaf celebrity videos along with bathtubs, basements, and broken records. Add this video to the museum too. New Kids on the Block brought together their friends Boyz … [+1455 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Louis Casiano", "title": "Eminem sends 'Mom’s Spaghetti' pasta to Detroit health care workers on coronavirus frontline - Fox News", "description": "Health care workers in Detriot \"lost themselves\" in spaghetti courtesy of rapper Eminem, who sent the pasta to those battling the coronavirus on the front lines.", "url": "https://www.foxnews.com/entertainment/eminem-sends-pasta-detroit-health-care-workers-coronavirus-frontline", "urlToImage": null, "publishedAt": "2020-04-24T20:16:31Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox. Sign up here.\r\nHealth care workers in Detriot \"lost themselves\" in spaghetti courtesy of rapperEminem, who sent the pasta to those battling the coronavirus on the front lines.\r\nThe… [+1088 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Kylie Jenner Shades Kourtney Kardashian Over Christmas Plans - KUWTK Recap - HollywoodLife", "description": "Kylie Jenner & Kim Kardashian call out Kourtney Kardashian over her Christmas plans. Plus, Khloe Kardashian freezes her eggs. #KhloeKardashian #KylieJenner #...", "url": "https://www.youtube.com/watch?v=xIfTkepuVPU", "urlToImage": null, "publishedAt": "2020-04-24T20:12:15Z", "content": null}, {"source": {"id": null, "name": "Xxlmag.com"}, "author": "awoods", "title": "Lil Uzi Vert Says He's Dropping a New Song Today - XXLMAG.COM", "description": "Details here.", "url": "https://www.xxlmag.com/news/2020/04/lil-uzi-vert-new-song-2/", "urlToImage": null, "publishedAt": "2020-04-24T19:35:00Z", "content": "Lil Uzi Vert fans could be in for a treat, as the rapper has doubled down on his statement about releasing new music.\r\nUzi wrote on Twitter on Friday (April 24) that he is dropping a new song today. In a tweet to the Philadelphia rapper, a fan asked for advic… [+1347 chars]"}, {"source": {"id": null, "name": "Wesh.com"}, "author": null, "title": "Universal Orlando to auto-enroll workers in Florida’s unemployment system - WESH 2 Orlando", "description": "Universal Orlando said Friday that it will auto-enroll its furloughed workers into Florida’s unemployment system.", "url": "https://www.wesh.com/article/universal-orlando-auto-enroll-unemployment/32270929", "urlToImage": null, "publishedAt": "2020-04-24T19:34:07Z", "content": "ORLANDO, Fla. —Universal Orlando said Friday that it will auto-enroll its furloughed workers into Floridas unemployment system. \r\nThe company is furloughing part-time hourly workers beginning on May 3. \r\nBy working with the state to auto-enroll the furloughed… [+579 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Gary Dinges", "title": "Billy Porter speaks 'truth to power' in cover of Buffalo Springfield's 'For What It's Worth' - USA TODAY", "description": "A frequent critic of President Donald Trump, Porter says he was inspired by artists who recorded songs during times of conflict in U.S. history.", "url": "https://www.usatoday.com/story/entertainment/music/2020/04/24/billy-porter-covers-stephen-stills-classic-for-what-its-worth/5155035002/", "urlToImage": null, "publishedAt": "2020-04-24T19:32:25Z", "content": "Music producers battle with the Verzuz series as fans party along \r\nAP Entertainment\r\nBilly Porter is channeling the past by bringing you a message from the future.\r\nThe singer, actor and Broadway performer has covered Stephen Stills beloved Buffalo Springfie… [+2809 chars]"}, {"source": {"id": null, "name": "Eonline.com"}, "author": "Jess Cohen", "title": "Gigi Hadid Thanks Taylor Swift and Joe Alwyn for Birthday Flowers - E! NEWS", "description": "Gigi Hadid took to her Instagram Story to thank her pals Taylor Swift and Joe Alwyn for the birthday surprise. Click here to see the flowers!", "url": "https://www.eonline.com/news/1144590/gigi-hadid-thanks-taylor-swift-and-joe-alwyn-for-sending-beautiful-birthday-flowers", "urlToImage": null, "publishedAt": "2020-04-24T19:31:55Z", "content": "Gorgeous!\r\nGigi Hadid received a number of special deliveries for her 25th birthday on Thursday, including flowers from her loved ones. Taylor Swift, Joe Alwyn and Kendall Jenner were among the star-studded pals who sent the supermodel flowers on her special … [+763 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chloe Melas, CNN", "title": "Richard Gere and his wife welcome baby boy - CNN", "description": "Richard Gere and his wife, Alejandra Silva, have welcomed their second son, a rep for the actor confirms to CNN.", "url": "https://www.cnn.com/2020/04/24/entertainment/richard-gere-baby-boy-trnd/index.html", "urlToImage": null, "publishedAt": "2020-04-24T18:14:54Z", "content": "(CNN)Richard Gere and his wife, Alejandra Silva, have welcomed their second son, a rep for the actor confirms to CNN.\r\nGere, 70 and Silva, 37, already have 14-month-old Alexander. Gere also has a 20-year-old son from a previous marriage. Silva has a son with … [+419 chars]"}, {"source": {"id": null, "name": "Rollingstone.com"}, "author": "Charles Holmes", "title": "I’ve Never Played Fortnite, But Was Forced to Attend Travis Scott’s Fortnite Concert - Rolling Stone", "description": "One intrepid writer attempted to understand the wildly popular battle royale game and hear a new Travis Scott song. It didn't go well.", "url": "https://www.rollingstone.com/music/music-features/travis-scott-fortnite-concert-989209/", "urlToImage": null, "publishedAt": "2020-04-24T17:59:14Z", "content": "On Monday, Travis Scott ruined my life. That was the day the rapper announced he would be holding a concert in Fortnite, the wildly popular battle royale game, and my editor informed me that I would be covering it. My response was immediate.\r\n“Not going to li… [+5545 chars]"}, {"source": {"id": null, "name": "Tmz.com"}, "author": "TMZ Staff", "title": "Juice WRLD's Posthumous Track 'Righteous' Details Drug Use - TMZ", "description": "Juice WRLD's family has dropped a new track, \"Righteous,\" which foreshadowed his drug problem.", "url": "https://www.tmz.com/2020/04/24/juice-wrld-family-releases-new-track-righteous-drug-use/", "urlToImage": null, "publishedAt": "2020-04-24T17:23:44Z", "content": "Juice WRLD's family has dropped a posthumous track from him, and its lyrics sadly foreshadow his eventual demise.\r\nThe late rapper's family dropped \"Righteous\" Thursday night and the track goes into extreme detail about his heavy drug use and the state of his… [+1220 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Anthony D'Alessandro", "title": "‘Don’t Worry Darling’: Florence Pugh, Shia LaBeouf & Chris Pine Set For Olivia Wilde New Line Thriller - Deadline", "description": "Little Women Oscar nominee Florence Pugh, Shia LaBeouf and Chris Pine are set to star in Olivia Wilde’s genre feature Don’t Worry Darling at New Line. Deadline first broke the news about the auction for Wilde’s highly anticipated follow-up directorial after l…", "url": "https://deadline.com/2020/04/dont-worry-darling-florence-pugh-shia-labeouf-chris-pine-star-in-olivia-wilde-movie-1202917171/", "urlToImage": null, "publishedAt": "2020-04-24T17:08:41Z", "content": "Little Women Oscar nominee Florence Pugh, Shia LaBeouf and Chris Pine are set to star in Olivia Wilde’s genre feature Don’t Worry Darling at New Line.\r\nDeadline first broke the news about the auction for Wilde’s highly anticipated follow-up directorial after … [+2249 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Martina Bet", "title": "Royal outrage: How US President shocked the Queen Mother with kiss on the lips - Express", "description": "THE QUEEN MOTHER was left in shock when former US President Jimmy Carter greeted her with a kiss on the lips in 1977, unearthed reports reveal.", "url": "https://www.express.co.uk/news/royal/1273552/royal-news-queen-mother-us-president-jimmy-carter-kiss-spt", "urlToImage": null, "publishedAt": "2020-04-24T16:33:22Z", "content": null}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Ron Dicker", "title": "Kaley Cuoco Is Binge-Watching Sitcom Couple She Was Told To Avoid - HuffPost", "description": "\"The Big Bang Theory\" alum is catching up on her TV during the coronavirus pandemic.", "url": "https://www.huffpost.com/entry/kaley-cuoco-cheers-conan_n_5ea2f8e3c5b6f9639813bfba", "urlToImage": null, "publishedAt": "2020-04-24T16:31:23Z", "content": "Kaley Cuoco is now binge-watching the sitcom couple she and her costar, Johnny Galecki, were told not to emulate on “The Big Bang Theory.”\r\nThat would be Sam and Diane, the dumb jock and the snooty intellectual brilliantly played by Ted Danson and Shelley Lon… [+886 chars]"}, {"source": {"id": null, "name": "Cinemablend.com"}, "author": "Adrienne Jones", "title": "Parks And Recreation Is Coming Back With Amy Poehler, Chris Pratt And More, But There’s A Catch - CinemaBlend", "description": "The Parks and Recreation gang is coming back!", "url": "https://www.cinemablend.com/television/2495057/parks-and-recreation-is-coming-back-with-amy-poehler-chris-pratt-and-more-but-theres-a-catch", "urlToImage": null, "publishedAt": "2020-04-24T15:37:08Z", "content": "While NBC's workplace comedy Parks and Recreation was a bit of an underdog when it started (coming on the heels of the similarly styled hit The Office), after a bit of retooling for the second season it became a critical and audience favorite, lasting seven s… [+3697 chars]"}, {"source": {"id": null, "name": "Sltrib.com"}, "author": "https://www.facebook.com/SeanPMeansCricket", "title": "Redwood Drive-In's reopening will wait, after Salt Lake County Health Department steps in - Salt Lake Tribune", "description": "The Redwood Drive-In’s plans to open this weekend are on hold, after the Salt Lake County Health Department reminded the management that opening a movie theater would violate a public health order.", "url": "https://www.sltrib.com/artsliving/2020/04/24/redwood-drive-in-reopen/", "urlToImage": null, "publishedAt": "2020-04-24T14:35:39Z", "content": "The Redwood Drive-Ins plans to open this weekend are on hold, after the Salt Lake County Health Department reminded the management that opening a movie theater would violate a public health order.\r\n The Salt Lake County Health Department posted a warning on t… [+3653 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Dino-Ray Ramos", "title": "Western Thriller ‘True History Of Kelly Gang’ And ’60s Coming-Of-Age Drama ‘To The Stars’ Make Debuts – Specialty Streaming Preview - Deadline", "description": "The story of the notorious outlaw Ned Kelly is dropping on digital and on-demand today with the Justin Kurzel-directed True History of the Kelly Gang starring George MacKay (1917, Captain Fantastic), Russell Crowe (Boy Erased, The Loudest Voice) and Nicholas …", "url": "https://deadline.com/2020/04/true-history-of-kelly-gang-russell-crowe-justin-kurzel-to-the-stars-martha-stephens-specialty-streaming-preview-1202916073/", "urlToImage": null, "publishedAt": "2020-04-24T14:28:13Z", "content": "The story of the notorious outlaw Ned Kelly is dropping on digital and on-demand today with the Justin Kurzel-directed True History of the Kelly Gang starring George MacKay (1917, Captain Fantastic), Russell Crowe (Boy Erased, The Loudest Voice) and Nicholas … [+5477 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Brian Lowry, CNN", "title": "'Avengers: Endgame' premiered a year ago. A whole lot has changed since then - CNN", "description": "The Marvel blockbuster premiered one year ago, on April 26, 2019, although just imagining people crowding into theaters, it surely feels a whole lot longer. The movie went on to amass $2.8 billion worldwide, surpassing the benchmark set by \"Avatar.\"", "url": "https://www.cnn.com/2020/04/24/entertainment/avengers-endgame-one-year-later/index.html", "urlToImage": null, "publishedAt": "2020-04-24T13:55:01Z", "content": "(CNN)With what felt like a snap, \"Avengers: Endgame\" shattered opening-weekend box-office records, earning $357 million in North America -- roughly $100 million more than its predecessor. The movie went on to amass $2.8 billion worldwide, surpassing the bench… [+3766 chars]"}, {"source": {"id": null, "name": "Wthr.com"}, "author": "TEGNA", "title": "Everything coming and leaving Netflix in May 2020 - WTHR", "description": "May features the debut of Steve Carrell's newest workplace comedy, the return of 'The Unbreakable Kimmy Schmidt,' and several new binge-worthy Netflix shows.", "url": "https://www.wthr.com/article/everything-coming-and-leaving-netflix-may-2020", "urlToImage": null, "publishedAt": "2020-04-24T13:09:38Z", "content": "LOS GATOS, Calif. Netflix has released its list of new shows and movies coming to the streaming site in May, which is perfect timing for those stands who are extending coronavirus stay-at-home orders. The May list includes several brand new comedy specials, d… [+5243 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Guillermo & Russell Wilson Prep Joe Burrow for NFL Draft - Sponsored by Bose - Jimmy Kimmel Live", "description": "If you watched the NFL Draft on ABC, you know it was a big night for NFL hopeful Joe Burrow. Getting drafted from home is a tricky thing though, so to prep f...", "url": "https://www.youtube.com/watch?v=qr_TDbXsjPM", "urlToImage": null, "publishedAt": "2020-04-24T05:30:31Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Disney Gallery: Star Wars The Mandalorian - Official Trailer (Jon Favreau, Taika Waititi) - IGN", "description": "In Disney Gallery: The Mandalorian, Executive Producer Jon Favreau invites the cast and crew to share an unprecedented look at the making of the series which...", "url": "https://www.youtube.com/watch?v=f_miMhjdvvs", "urlToImage": null, "publishedAt": "2020-04-23T20:30:02Z", "content": "In Disney Gallery: The Mandalorian, Executive Producer Jon Favreau invites the cast and crew to share an unprecedented look at the making of the series which quickly became a pop culture phenomenon after premiering in November.\r\nDebuting on the day that a wor… [+406 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The Masked Singer Season 3 | Episode 12 Spoilers, Clues & Guesses - CinemaBlend", "description": "The Masked Singer has captivated America, and it isn’t hard to see why. The elaborate costumes, the performances, and the big mystery behind the identities o...", "url": "https://www.youtube.com/watch?v=Tp_OTEMzpMI", "urlToImage": null, "publishedAt": "2020-04-23T19:26:16Z", "content": null}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Gael Fashingbauer Cooper", "title": "YouTube turns 15 today. Watch the first video it posted - CNET", "description": "One of the founders visited the zoo. Let's just say the video site's content has improved a lot since 2005.", "url": "https://www.cnet.com/news/youtube-turns-15-today-watch-the-first-video-it-posted/", "urlToImage": null, "publishedAt": "2020-04-23T19:02:24Z", "content": "The clip is just 18 seconds long, but 15 years ago, it kicked off an online video revolution.  Thursday marks the 15th anniversary of the first-ever YouTube video, which shows company co-founder Jawed Karim standing in front of an elephant enclosure at the Sa… [+1519 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Joan E. Solsman", "title": "HBO Max: Launch date, prices, shows and movies to expect - CNET", "description": "HBO Max will launch May 27 with HBO's programs and movies, licensed hits and exclusive originals (at least, the ones that aren't delayed by coronavirus).", "url": "https://www.cnet.com/news/hbo-max-launch-date-may-27-prices-shows-movies-free-trials-promos-friends/", "urlToImage": null, "publishedAt": "2020-04-23T17:56:54Z", "content": "HBO Max promises a lot.\r\nScreenshot by CNET\r\nHBO Max, the HBO-anchored streaming service finally announced to be launching May 27, has much in common with its competitors in the streaming wars like Disney Plus and Peacock, not to mention Netflix. Like those, … [+18823 chars]"}]}