{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Cbslocal.com"}, "author": "CBS San Francisco", "title": "Coronavirus Update: Local Residents Join Tony Bennett's 'I Left My Heart In San Francisco' For Noon Singalong - CBS San Francisco", "description": "Someone has placed a protective mask on San Francisco's statue honoring famed crooner Tony Bennett -- a fitting tribute to the city's favorite adopted son who led a virtual singalong of his \"I Left My Heart In San Francisco\" classic Saturday to raise spirits …", "url": "https://sanfrancisco.cbslocal.com/2020/04/25/coronavirus-shelter-in-place-tony-bennetts-i-left-my-heart-in-san-francisco/", "urlToImage": null, "publishedAt": "2020-04-27T04:05:04Z", "content": "SAN FRANCISCO (CBS SF) — Someone has placed a protective mask on San Francisco’s statue honoring famed crooner Tony Bennett — a fitting tribute to the city’s favorite adopted son who led a virtual singalong of his “I Left My Heart In San Francisco” classic Sa… [+3517 chars]"}, {"source": {"id": null, "name": "Yourtango.com"}, "author": "https://www.facebook.com/ariagmitterwriter/", "title": "Today's Mercury In Taurus Love Horoscopes For All Zodiac Signs On Monday, April 27, 2020 - YourTango", "description": "Mercury enters Taurus on Monday!", "url": "https://www.yourtango.com/2020333232/mercury-taurus-horoscopes-free-daily-love-each-zodiac-sign-april-27-2020-according-astrology", "urlToImage": null, "publishedAt": "2020-04-27T03:11:42Z", "content": "Mercury enters Taurus on Monday!\r\nYour daily astrology forecast is here with love horoscopes for you and all zodiac signs for tomorrow on Monday, April 27, 2020.\r\nThe Sun is in the zodiac sign of Taurus until May 19, and the Moon is in Gemini entering Cancer … [+8135 chars]"}, {"source": {"id": null, "name": "Insider.com"}, "author": "Kim Renfro", "title": "15 details you might have missed in the latest episode of 'Westworld' - Insider - INSIDER", "description": "HBO's hit sci-fi drama continued Sunday night with season three, episode seven: \"Passed Pawn.\" As always, Insider is here to explain the best moments.", "url": "https://www.insider.com/westworld-season-3-episode-7-details-analysis-explained-2020-4", "urlToImage": null, "publishedAt": "2020-04-27T02:19:22Z", "content": null}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Dominic Patten", "title": "‘Homeland’ Series Finale: Co-Creator Alex Gansa On The Final Twist, Potential Revival, Claire Danes, Mandy Patinkin & The Story They Never Got To Tell - Deadline", "description": "SPOILER ALERT: This article contains details of tonight’s Homeland series finale.  Hurling a Molotov cocktail in its fiery closing minutes, Homeland came to the end of its eight season run tonight and Showtime’s multiple Emmy winning spy thriller certainly en…", "url": "https://deadline.com/2020/04/homeland-series-finale-spoilers-claire-danes-mandy-patinkin-alex-gansa-interview-terrorism-war-showtime-1202917770/", "urlToImage": null, "publishedAt": "2020-04-27T02:12:35Z", "content": "SPOILER ALERT: This article contains details of tonight’sHomeland series finale. \r\nHurling a Molotov cocktail in its fiery closing minutes, Homeland came to the end of its eight season run tonight and Showtime’s multiple Emmy winning spy thriller certainly en… [+22587 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Patrick Ryan", "title": "'American Idol': Contestant's Louis Armstrong cover moves judges during first taped-from-home show - USA TODAY", "description": "In response to the coronavirus pandemic, \"American Idol\" produced its first at-home episode Sunday, as hopefuls performed in living rooms and garages.", "url": "https://www.usatoday.com/story/entertainment/tv/2020/04/27/american-idol-how-did-top-20-fare-first-home-episode/3030810001/", "urlToImage": null, "publishedAt": "2020-04-27T02:02:32Z", "content": "Ryan Seacrest will host the next \"American Idol\" from home, using the same judges' desk that Randy Jackson, Simon Cowell and Paula Abdul sat behind.\r\nUSA TODAY\r\nDid you really think Katy Perry would tone down her antics just because of quarantine? \r\nThe quirk… [+3539 chars]"}, {"source": {"id": null, "name": "Pagesix.com"}, "author": "Sara Nathan", "title": "Stephen Sondheim's 90th birthday special comes down with technical issues - Page Six", "description": "The concert quickly became the top trending Twitter topic of the night as Lin Manuel tweeted: “Hope someone is rolling on the Noises Off production happening right now at #Sondheim90Concert.&…", "url": "https://pagesix.com/2020/04/26/stephen-sondheims-90th-birthday-special-had-technical-issues/", "urlToImage": null, "publishedAt": "2020-04-27T01:52:56Z", "content": "Stars flocked to pay tribute to Stephen Sondheim for his 90th birthday virtual concert Sunday night – but the curtain came down quickly amid a mess of technical hitches.\r\nThe show, which signed up a slew of big names from Meryl Streep to Patti LuPone and Hami… [+1685 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "When Calls the Heart Cast Reacts to SHOCKING Season 7 Finale (Exclusive) - Entertainment Tonight", "description": "ET's Deidre Behar spoke with 'When Calls the Heart' stars Erin Krakow, Chris McNally and Kevin McGarry about the shocking season 7 cliffhanger, where viewers...", "url": "https://www.youtube.com/watch?v=tbWxeUvV8Ro", "urlToImage": null, "publishedAt": "2020-04-27T01:09:27Z", "content": null}, {"source": {"id": "buzzfeed", "name": "Buzzfeed"}, "author": "Tatiana Tenreyro", "title": "A \"Riverdale\" Star Won The First Episode of \"RuPaul's Secret Celebrity Drag Race\" - BuzzFeed", "description": "\"We ain't at Riverdale anymore, baby!\"", "url": "https://www.buzzfeed.com/tatianatenreyrowhitlock/sweet-pea-from-riverdale-drag-race", "urlToImage": null, "publishedAt": "2020-04-27T01:04:27Z", "content": "instagram.comEach episode will feature three new celebrities taking on drag personas, with the winner taking home a cash prize for their chosen charity. But don't worry, everyone gets to win something for their charity! The other two queens still get a cash p… [+47 chars]"}, {"source": {"id": null, "name": "Tmz.com"}, "author": "TMZ Staff", "title": "Kodak Black Wants to Meet Trump for 'Brilliant' Idea, Offers His Life - TMZ", "description": "Mr. President, meet Kodak Black. He's got something important to tell you.", "url": "https://www.tmz.com/2020/04/26/kodak-black-wants-to-meet-trump-brilliant-idea-kill-me/", "urlToImage": null, "publishedAt": "2020-04-27T00:22:00Z", "content": "Kodak Black says he wants to meet President Trump to pass on some knowledge he feels can be useful -- and if DT ain't into it ... KB says the man can take him out, literally.\r\nThe incarcerated rapper posted a bizarre message on social media Sunday, tagging hi… [+1224 chars]"}, {"source": {"id": null, "name": "Dailysoapdish.com"}, "author": "Joanna Mazewski", "title": "CBS ‘The Bold and the Beautiful’ Spoilers: Sally Spectra Won’t Let Anyone Stand In The Way Of Her Dream Life - Daily Soap Dish", "description": "CBS 'The Bold and the Beautiful' (B&B) spoilers indicate that Sally Spectra (Courtney Hope) is willing to do just about anything to stay in the arms of her one true love Wyatt Spencer (Darin Brooks) even though he probably doesn’t feel the same a", "url": "https://dailysoapdish.com/2020/04/cbs-the-bold-and-the-beautiful-spoilers-sally-spectra-wont-let-anyone-stand-in-the-way-of-her-dream-life/", "urlToImage": null, "publishedAt": "2020-04-27T00:12:15Z", "content": "CBS ‘The Bold and the Beautiful’ (B&amp;B) spoilers indicate that Sally Spectra (Courtney Hope) is willing to do just about anything to stay in the arms of her one true love Wyatt Spencer (Darin Brooks) even though he probably doesnt feel the same about her. … [+1998 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Nate Day", "title": "Adam Sandler, Pete Davidson team for quarantine song during remote 'SNL' special - Fox News", "description": "Adam Sandler and Pete Davidson are expressing themselves through song.", "url": "https://www.foxnews.com/entertainment/adam-sandler-pete-davidson-quarantine-song-snl", "urlToImage": null, "publishedAt": "2020-04-26T23:51:15Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox.  Sign up here.\r\nAdam Sandler and Pete Davidson are expressing themselves through song, with the help of another '90s comic.\r\nThe two appeared in the latest at-home episode of \"Satu… [+2158 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Eddie Makuch", "title": "Avengers: Endgame Is The Most Profitable Movie In History - GameSpot", "description": "And Robert Downey Jr. is reportedly walking away with $55 million for his role as Iron Man.", "url": "https://www.gamespot.com/articles/avengers-endgame-is-the-most-profitable-movie-in-h/1100-6476509/", "urlToImage": null, "publishedAt": "2020-04-26T23:24:00Z", "content": "Avengers: Endgame is the most commercially successful movie of all time, with $2.79 billion at the global box office. The movie was extremely expensive to produce, as well, but the epic comic book film made enough money to become the most profitable film in h… [+1661 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alaa Elassar, CNN", "title": "Kristin Cavallari and Jay Cutler are divorcing after 10 years together - CNN", "description": "The reality TV star announced their decision to split on Instagram in an emotional post on Sunday.", "url": "https://www.cnn.com/2020/04/26/us/kristin-cavallari-jay-cutler-divorce-trnd/index.html", "urlToImage": null, "publishedAt": "2020-04-26T22:35:55Z", "content": null}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Eric Robinette", "title": "Thor's Epic Wakanda Arrival in 'Infinity War' Was a Bigger Deal Than Most Fans Realized - Showbiz Cheat Sheet", "description": "The Avengers in Wakanda during Avengers: Infinity War were shocked and awed by the reappearance of Thor during the battle of Wakanda.", "url": "https://www.cheatsheet.com/entertainment/thors-epic-wakanda-arrival-in-infinity-war-was-a-bigger-deal-than-most-fans-realized.html/", "urlToImage": null, "publishedAt": "2020-04-26T22:08:43Z", "content": "In every person’s life, there’s a point where you say to yourself, “Well, now I’ve seen everything.” Invariably, that turns out not to be true when they see the next amazing thing. No one sees everything. Not even an Avenger. \r\nThat’s why the Avengers in Waka… [+3538 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Penelope Green", "title": "Betsy Wyeth, Andrew Wyeth’s Widow and Collaborator, Dies at 98 - The New York Times", "description": "She was just 17 when she met her future husband. She went on to guide his career and became an avid preservationist of vernacular architecture.", "url": "https://www.nytimes.com/2020/04/26/arts/betsy-wyeth-dead.html", "urlToImage": null, "publishedAt": "2020-04-26T22:06:58Z", "content": "Betsy James Wyeth, the indomitable widow, collaborator and muse of the painter Andrew Wyeth, died on April 21 at her home in Chadds Ford, Pa. She was 98.\r\nShe had been in declining health for years, her son Jamie Wyeth said in confirming the death.\r\nThe coupl… [+7912 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Watch Brad Pitt Portray Dr. Anthony Fauci on 'SNL' | NowThis - NowThis News", "description": "Watch Brad Pitt transform into Dr. Anthony Fauci for the second remote segment of ‘SNL’ 👀 » Subscribe to NowThis: http://go.nowth.is/News_Subscribe » Sign up...", "url": "https://www.youtube.com/watch?v=oiWA4s-4i-A", "urlToImage": null, "publishedAt": "2020-04-26T22:00:16Z", "content": "Watch Brad Pitt transform into Dr. Anthony Fauci for the second remote segment of SNL » Subscribe to NowThis: http://go.nowth.is/News_Subscribe» Sign up for our newsletter KnowThis to get the biggest stories of the day delivered straight to your inbox: https:… [+1314 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Katherine Schwarzenegger Pratt Is PREGNANT! - Entertainment Tonight", "description": "Katherine Schwarzenegger and her hubby Chris Pratt are expecting their first child together.", "url": "https://www.youtube.com/watch?v=CUFR8ycaZA0", "urlToImage": null, "publishedAt": "2020-04-26T21:00:03Z", "content": null}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Nate Day", "title": "Kristen Bell records Dax Shepard performing surgery on himself during coronavirus pandemic - Fox News", "description": "Self-isolating has people turning to their own devices for everything -- even surgery.", "url": "https://www.foxnews.com/entertainment/kristen-bell-dax-shepard-performing-surgery-himself-coronavirus", "urlToImage": null, "publishedAt": "2020-04-26T20:51:34Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox.  Sign up here.\r\nSelf-isolating has people turning to their own devices for everything -- even surgery.\r\nAfter recently injuring his arm, Dax Shepard chose to remove pins from his h… [+1209 chars]"}, {"source": {"id": null, "name": "Hollywoodlife.com"}, "author": "Ryan Shea", "title": "Salma Hayek, 53, Looks Half Her Age While Posing Makeup-Free In Bed — Pic - HollywoodLife", "description": "Salma Hayek once again left her fans in a state of shock when she posted an absolutely gorgeous photo of herself in bed!", "url": "https://hollywoodlife.com/2020/04/26/salma-hayek-makeup-free-bed-pic/", "urlToImage": null, "publishedAt": "2020-04-26T20:43:03Z", "content": "Salma Hayek once again left her fans in a state of shock when she posted an absolutely gorgeous photo of herself in bed!\r\nSalma Hayek, 53, is proof that beauty has no age. The Oscar nominated actress continues to stun with every picture she takes and every mo… [+1804 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Libertina Brandt", "title": "Tom Hanks and Rita Wilson to donate blood after battling coronavirus - Business Insider - Business Insider", "description": "Tom Hanks and his wife, Rita Wilson, tested positive for COVID-19 back in early March. Hanks announced they will donate blood to help find a vaccine.", "url": "https://www.businessinsider.com/tom-hanks-and-rita-wilson-to-donate-blood-after-battling-coronavirus-2020-4", "urlToImage": null, "publishedAt": "2020-04-26T20:05:58Z", "content": "Tom Hanks and his wife, Rita Wilson, have offered to donate their blood to help develop a coronavirus vaccine.\r\nThe couple tested positive for the virus back in early March while in Australia. \r\nHello, folks. @ritawilson and I are down here in Australia. We f… [+1545 chars]"}, {"source": {"id": null, "name": "Thenewsstar.com"}, "author": "Greg Hilburn", "title": "Drive-by shooters spray Duck Dynasty star Willie Robertson's estate with bullets - The News Star", "description": "One bullet lodged in the bedroom wall of son John Luke Robertson's and his wife Mary Kate McEachern's home.", "url": "https://www.thenewsstar.com/story/news/2020/04/26/drive-by-shooters-spray-duck-dynasty-star-willie-robertsons-estate-eoyj-bullets/3030079001/", "urlToImage": null, "publishedAt": "2020-04-26T20:00:02Z", "content": "The \"Duck Dynasty\" stars lives and careers are featured in a new interactive museum at the Duck Commander headquarters in West Monroe called Duck Commander The Tour.\r\n\"Duck Dynasty\" star Willie Robertson said his family was the victim of a drive-by shooting F… [+2546 chars]"}, {"source": {"id": null, "name": "Salon.com"}, "author": "Melanie McFarland", "title": "\"Penny Dreadful: City of Angels\": Glam Nazis menace LA in this high style, no heart spin-off - Salon", "description": "John Logan's return to the \"Penny Dreadful\" universe shows many sides of Natalie Dormer, but veers off the map", "url": "https://www.salon.com/2020/04/26/penny-dreadful-city-of-angels-review/", "urlToImage": null, "publishedAt": "2020-04-26T19:47:55Z", "content": "\"Penny Dreadful: City of Angels\" creator John Logan has a masterful understanding of creating a look, that much is sure. The production's recreation of 1938 Los Angeles is a gorgeous vision, from the curvaceous autos to the Hollywood Regency-style arches and … [+6713 chars]"}, {"source": {"id": null, "name": "Avclub.com"}, "author": "Sam Barsanti", "title": "Congratulations to Kanye West, America's newest and pettiest billionaire - The A.V. Club", "description": "It's very important to Kanye West that everyone knows that he has a lot of money.", "url": "https://news.avclub.com/congratulations-to-kanye-west-americas-newest-and-pett-1843089313", "urlToImage": null, "publishedAt": "2020-04-26T19:35:00Z", "content": "Its Sunday, the day reserved for paying attention to Kanye West, and today theres a big reason why were paying attention to him or, to be more accurate, theres a billion reasons why were paying attention to him: According to a Forbes profile, Kanye West is of… [+2428 chars]"}, {"source": {"id": null, "name": "Variety.com"}, "author": "Jordan Moreau", "title": "Former ‘Hardball’ Host Chris Matthews Admits to ‘Inappropriate’ Behavior - Variety", "description": "In his first interview since abruptly retiring from “Hardball,” Chris Matthews owned up to the allegations of inappropriate behavior against him. In late February, journalist Laura Bassett revealed that Matthews made unprofessional comments to her while she w…", "url": "https://variety.com/2020/tv/news/chris-matthews-hardball-allegations-inappropriate-behavior-1234590218/", "urlToImage": null, "publishedAt": "2020-04-26T19:28:46Z", "content": "In his first interview since abruptly retiring from “Hardball,” Chris Matthews owned up to the allegations of inappropriate behavior against him.\r\nIn late February, journalist Laura Bassett revealed that Matthews made unprofessional comments to her while she … [+1815 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "John Wick Squares Off Against Hemsworth's Rake in Extraction Fan Art - Screen Rant", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiUGh0dHBzOi8vc2NyZWVucmFudC5jb20vam9obi13aWNrLWtlYW51LXJlZXZlcy1jaHJpcy1oZW1zd29ydGgtZXh0cmFjdGlvbi1mYW5hcnQv0gFUaHR0cHM6Ly9zY3JlZW5yYW50LmNvbS9qb2huLXdpY2sta2VhbnUtcmVldmVzLWNocmlzLWhlbXN3b3J0aC1leHRyYWN0aW9uLWZhbmFydC9hbXAv?oc=5", "urlToImage": null, "publishedAt": "2020-04-26T19:24:11Z", "content": null}, {"source": {"id": null, "name": "Elle.com"}, "author": "Hilary Weaver", "title": "Prince Harry and Meghan Markle Are Celebrating Archie's First Birthday With a New Photo - Yahoo Lifestyle", "description": "Archie will turn one on May 6.", "url": "https://www.elle.com/culture/celebrities/a32280747/prince-harry-meghan-markle-new-photo-archie-first-birthday/", "urlToImage": null, "publishedAt": "2020-04-26T19:08:00Z", "content": "From ELLE\r\nPrince Harry and Meghan Markle are about to have a one-year-old in their home. Archie, who was born on May 6 last year, is going to turn one in just a couple of weeks, and it sounds like Meghan and Harry already have at least one plan for how they'… [+1560 chars]"}, {"source": {"id": null, "name": "Sheknows.com"}, "author": "Julie Sprankles", "title": "We Can’t Unsee Ryan Reynolds’ Tiny Quarantine Ponytail (Well-Played, Blake Lively) - SheKnows", "description": "In case you were wondering, quarantine has not made Ryan Reynolds and Blake Lively call a moratorium on trolling each other. In fact, Lively dragged Reynolds over the weekend for sporting a tiny quarantine ponytail that, if we’re really being honest, we could…", "url": "https://www.sheknows.com/entertainment/articles/2224250/ryan-reynolds-quarantine-ponytail-blake-lively-instagram/", "urlToImage": null, "publishedAt": "2020-04-26T18:58:33Z", "content": "In case you were wondering, quarantine has not made Ryan Reynolds and Blake Lively call a moratorium on trolling each other. In fact, Lively dragged Reynolds over the weekend for sporting a tiny quarantine ponytail that, if were really being honest, we couldn… [+2172 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amanda Jackson, CNN", "title": "Angelina Jolie shares parenting advice, saying you don't have to be perfect - CNN", "description": "Award-winning actress Angelina Jolie has penned a letter to parents, offering advice during the coronavirus pandemic.", "url": "https://www.cnn.com/2020/04/26/entertainment/angelina-jolie-parenting-advice-time-trnd/index.html", "urlToImage": null, "publishedAt": "2020-04-26T18:55:01Z", "content": "(CNN)Award-winning actress Angelina Jolie has penned a letter to parents, offering advice during the coronavirus pandemic.\r\n\"I am thinking of you. I am imagining how hard each of you is trying to get through your days,\" reads the letter published in Time maga… [+1155 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Natasha Mascarenhas", "title": "Tech for good during COVID-19: Therapy for nurses, baby food, and an online diary - TechCrunch", "description": "If you’re one of the 12.3 million people who watched Travis Scott perform on Fortnite this past week, you’ll agree: The sky’s the limit right now when it comes to cheering people up. One kid, per our commenters, said Scott’s performance was better than Star W…", "url": "http://techcrunch.com/2020/04/26/tech-for-good-during-covid-19-therapy-for-nurses-baby-food-and-an-online-diary/", "urlToImage": null, "publishedAt": "2020-04-26T18:47:50Z", "content": "If youre one of the 12.3 million people who watched Travis Scott perform on Fortnite this past week, youll agree: The sky’s the limit right now when it comes to cheering people up. One kid, per our commenters, said Scotts performance was better than Star Wars… [+5187 chars]"}, {"source": {"id": null, "name": "Today.com"}, "author": "Francesca Gariano", "title": "Michael Bublé's son Noah, 6, appears on Instagram after cancer diagnosis - TODAY", "description": "Michael Bublé's 6-year-old son, Noah, surprised his parents and their fans when he appeared on Instagram Live. In 2016, Noah was diagnosed with liver cancer.", "url": "https://www.today.com/parents/michael-bubl-s-son-noah-6-appears-instagram-after-cancer-t179944", "urlToImage": null, "publishedAt": "2020-04-26T18:44:42Z", "content": "Michael Bublé and wife Luisana Lopilato had a surprising, special guest during their latest Instagram Live stream: their 6-year-old son, Noah. In 2016, Noah was diagnosed with liver cancer at 3 years old. Fortunately, he's since gone into remission.\r\nOn Frida… [+2309 chars]"}, {"source": {"id": null, "name": "Vulture.com"}, "author": "Devon Ivie", "title": "SNL Promotes Kate McKinnon’s Cat to Featured Player - Vulture", "description": "He has the range.", "url": "https://www.vulture.com/2020/04/snl-kate-mckinnon-and-her-cat-star-in-whiskers-r-we-watch.html", "urlToImage": null, "publishedAt": "2020-04-26T18:39:12Z", "content": "The longing for cute and cuddly pet adoptions has never been higher thanks to our perpetual self-quarantine era, and what perfect timing is this: Whiskers R We owner Barbara DeDrew (Kate McKinnon), denied her small-business loan, has to make a commercial from… [+467 chars]"}, {"source": {"id": null, "name": "Jambase.com"}, "author": "Nate Todd", "title": "Post Malone Performs Nirvana Tribute - JamBase", "description": "Post Malone conducted a Nirvana livestream tribute on Friday benefitting The United Nations Foundation’s COVID-19 Solidarity Response Fund for The World Health Organization.", "url": "https://www.jambase.com/article/post-malone-nirvana-tribute", "urlToImage": null, "publishedAt": "2020-04-26T18:21:09Z", "content": "Post Malone delivered a Nirvana tribute livestream set on Friday. Post performed from home with virtual contributions from drummer Travis Barker of Blink-182, bassist Brian Lee and guitarist Nick Mac.\r\nPost Malone opened up the tribute set benefitting The Uni… [+1717 chars]"}, {"source": {"id": null, "name": "Elle.com"}, "author": "Hilary Weaver", "title": "Channing Tatum Is Ready for Love—and He Doesn't Mind Looking Online - Yahoo Lifestyle", "description": "Now that he and Jessie J are over, he's reportedly swiping again.", "url": "https://www.elle.com/culture/celebrities/a32280615/channing-tatum-online-dating/", "urlToImage": null, "publishedAt": "2020-04-26T18:12:00Z", "content": "After breaking up late last year, Channing Tatum and Jessie J called things back on again at the beginning of the year. They split again earlier this month, and Tatum is now single. Per E! News, Tatum is ready to date again, and he's not saying no to dating a… [+1132 chars]"}, {"source": {"id": null, "name": "Thewrap.com"}, "author": null, "title": "'The Price Is Right' Announcer George Gray 'in Good Spirits' After 3 Heart Attacks - msnNOW", "description": "George Gray, the announcer for \"The Price Is Right,\" is currently recovering in the hospital after suffering three massive heart attacks, but according to his publicist, he is \"in good spirits.\" Gray was first hospitalized in Arizona last week after suffering…", "url": "https://www.thewrap.com/the-price-is-right-announcer-george-gray-in-good-spirits-after-3-heart-attacks/", "urlToImage": null, "publishedAt": "2020-04-26T18:02:00Z", "content": "George Gray, the announcer for \"The Price Is Right,\" is currently recovering in the hospital after suffering three massive heart attacks, but according to his publicist, he is \"in good spirits.\"\r\n© TheWrap\r\n George Gray The Price Is Right\r\nGray was first hosp… [+1079 chars]"}, {"source": {"id": "entertainment-weekly", "name": "Entertainment Weekly"}, "author": "Rosy Cordero", "title": "Dave Chappelle helps raise over $100k for struggling comics during coronavirus pandemic - Entertainment Weekly", "description": "Dave Chappelle was a surprise guest at The Comedy Store live fundraiser event that raised over $100k for struggling comic during the coronavirus pandemic.", "url": "https://ew.com/tv/dave-chappelle-comedy-store-fundrasier-coronavirus/", "urlToImage": null, "publishedAt": "2020-04-26T17:50:08Z", "content": "The Comedy Store may be closed during the coronavirus pandemic, but they haven't forgotten the talent who've graced their stage who are now struggling to make ends meet.\r\nThe famous Los Angeles stand-up comedy venue hosted a live three-part podcast benefit on… [+1216 chars]"}, {"source": {"id": null, "name": "Cinemablend.com"}, "author": "Mack Rawden", "title": "When Will Disney World Reopen? One Analyst Is Really Pessimistic - CinemaBlend", "description": "No one is exactly sure at this point when Disney World might reopen its doors to the general public, but one prediction from a major financial analyst is pretty bleak.", "url": "https://www.cinemablend.com/news/2495138/when-will-disney-world-reopen-one-analyst-is-really-pessimistic", "urlToImage": null, "publishedAt": "2020-04-26T17:48:33Z", "content": "No one is exactly sure at this point when Disney World might reopen its doors to the general public, but one prediction from a major financial analyst is pretty bleak. John Hodulik, a managing director at UBS, a leading financial firm, published a paper this … [+3975 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Nate Day", "title": "Demi Lovato opens up about her 'biggest inspiration' during rehab: 'I'm so much happier now' - Fox News", "description": "Demi Lovato is opening up about her time in rehab.", "url": "https://www.foxnews.com/entertainment/demi-lovato-rehab", "urlToImage": null, "publishedAt": "2020-04-26T17:24:05Z", "content": "Demi Lovato is opening up about her time in rehab.\r\nThe singer recently participated in a virtual reunion with her \"Sonny with a Chance\" co-stars from her days on Disney Channel.\r\nEarly on in the chat Allisyn Ashley Arm asked her co-stars what they've been up… [+2696 chars]"}, {"source": {"id": null, "name": "Thenews.com.pk"}, "author": "Web  Desk", "title": "Chernobyl Diaries actor Dimitri Diatchenko dies at 52 - The News International", "description": "'Chernobyl Diaries' actor Dimitri Diatchenko dies at 52", "url": "https://www.thenews.com.pk/latest/650194-chernobyl-diaries-actor-dimitri-diatchenko-dies-at-52", "urlToImage": null, "publishedAt": "2020-04-26T17:16:25Z", "content": "Police in Florida found actor   Dimitri Diatchenko dead in his house, according to reports.\r\nThe \"Sons of Anarchy\" actor was 52.\r\nCNN reported that police found him unresponsive and keeling with his face down in a reclining chair in his living room on Wednesd… [+490 chars]"}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Amanda Spence", "title": "'Outlander' Season 5, Episode 10: What Happens When Brianna Faces Her Past? - Showbiz Cheat Sheet", "description": "Episode 10 of season 5 of 'Outlander' was everything fans could hope for in an episode. Some of the main characters search for Stephen Bonnet.", "url": "https://www.cheatsheet.com/entertainment/outlander-season-5-episode-10-what-happens-when-brianna-faces-her-past.html/", "urlToImage": null, "publishedAt": "2020-04-26T17:04:22Z", "content": "Episode 10 of season 5 of Outlander was everything fans could hope for in an episode. Some of the main characters search for Stephen Bonnet (Ed Speleers) and the unthinkable happens. Brianna (Sophie Skelton) gets caught up in it all in the worst way. Read on … [+2518 chars]"}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Julia Dzurillay", "title": "It's a (Zoom) Party Get Down — The Cast of 'Sonny With a Chance' and 'So Random' Have a Reunion Over Video Chat - Showbiz Cheat Sheet", "description": "For a laugh and a bit of nostalgia, Disney Channel fans caught up with the cast of 'Sonny With a Chance' and 'So Random.' Here's what you might've missed from the cast's reunion.", "url": "https://www.cheatsheet.com/entertainment/so-random-demi-lovato-reunion.html/", "urlToImage": null, "publishedAt": "2020-04-26T16:41:22Z", "content": "It’s always a party with this Disney Channel cast. Years after the final episode of Sonny With a Chance and its spinoff So Random, the actors behind this series reunited for a laugh-filled video chat. Here’s our look into this iconic reunion, featuring Demi L… [+2777 chars]"}, {"source": {"id": null, "name": "Billboard.com"}, "author": "Anna Chan", "title": "Demi Lovato Jokes About Going to Rehab During 'Sonny With a Chance' Reunion - Billboard", "description": "", "url": "https://www.billboard.com/articles/news/television/9366069/demi-lovato-sonny-with-a-chance-reunion-rehab-joke", "urlToImage": null, "publishedAt": "2020-04-26T16:40:08Z", "content": "She went there! During the Sonny With a Chance/So Random! reunion on Zoom Saturday (April 25), Demi Lovato made light of her trips to get treatment while virtually hanging with the cast of the Disney Channel shows.\r\nAs the chat kicked off, Allisyn Snyder aske… [+3045 chars]"}, {"source": {"id": null, "name": "Harpersbazaar.com"}, "author": "Amy Mackelden", "title": "Duchess Meghan and Prince Harry Might Share a New Photo of Archie on His First Birthday - HarpersBAZAAR.com", "description": "Fans are hoping for a glimpse of the little royal as he turns one.", "url": "https://www.harpersbazaar.com/celebrity/latest/a32280078/meghan-markle-prince-harry-archie-birthday-new-photo/", "urlToImage": null, "publishedAt": "2020-04-26T15:49:00Z", "content": "<ul><li>Archie Mountbatten-Windsor turns one on May 6, 2020, and fans are hoping to see a new photo of the little royal in honor of the big day.</li><li>A new report suggested that Duchess Meghan and Prince Harry plan to release a new picture in celebration o… [+1322 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Reservoir Dogs' Mr. Blonde Cuts Off Family's Ears While In Quarantine - Screen Rant", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiUGh0dHBzOi8vc2NyZWVucmFudC5jb20vcmVzZXJ2b2lyLWRvZ3MtbXItYmxvbmRlLW1pY2hhZWwtbWFkc2VuLXF1YXJhbnRpbmUtdmlkZW8v0gFUaHR0cHM6Ly9zY3JlZW5yYW50LmNvbS9yZXNlcnZvaXItZG9ncy1tci1ibG9uZGUtbWljaGFlbC1tYWRzZW4tcXVhcmFudGluZS12aWRlby9hbXAv?oc=5", "urlToImage": null, "publishedAt": "2020-04-26T15:30:54Z", "content": null}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Cory Stieg", "title": "Disney has free animation classes online—and drawing can help you relax and focus during the pandemic - CNBC", "description": "Disney has free drawing classes on YouTube that teach you how to doodle your favorite characters, right from the pros. Studies suggest it could help with stress, sadness and concentration amid Covid-19.", "url": "https://www.cnbc.com/2020/04/26/free-disney-animation-courses-on-youtube-can-relieve-covid-19-stress.html", "urlToImage": null, "publishedAt": "2020-04-26T15:11:19Z", "content": "From baking to puzzles, the Covid-19 quarantine might have you turning to hobbies that you never had time for before.\r\nIf you're looking for a calming weekend art project, Disney has free drawing classes on YouTube.\r\nYou can learn how to draw some of the most… [+1891 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Charlie Puth Plays Selena Gomez's 'Boyfriend' | Capital - Capital FM", "description": "What better way to learn the piano than being taught by the musical genius that is Charlie Puth? Host of Capital Breakfast Roman Kemp got the chance of a 1-2...", "url": "https://www.youtube.com/watch?v=5FqC_7RJebY", "urlToImage": null, "publishedAt": "2020-04-26T14:38:06Z", "content": null}, {"source": {"id": null, "name": "Pitchfork.com"}, "author": "Evan Minsker", "title": "Watch Bad Bunny Try to Sell You Sweatpants on SNL - Pitchfork", "description": "The episode also featured a collaborative Adam Sandler and Pete Davidson music video", "url": "https://pitchfork.com/news/watch-bad-bunny-try-to-sell-you-sweatpants-on-snl/", "urlToImage": null, "publishedAt": "2020-04-26T14:11:32Z", "content": "This weeks Saturday Night Live featured a sketch called Big Papi Cooking Show, wherein Kenan Thompson offers a cooking tutorial (sort of) as former Boston Red Sox player David Ortiz. During the sketch, Thompson introduced Big Bunny, which of course was Bad Bu… [+594 chars]"}, {"source": {"id": null, "name": "Nme.com"}, "author": null, "title": "‘Spider-Man’ star Tom Holland is hosting a Marvel-themed charity pub quiz - NME Live", "description": "It comes in aid of The Brothers Trust, set up by Holland's family", "url": "https://www.nme.com/news/film/spider-man-star-tom-holland-is-hosting-a-marvel-themed-charity-pub-quiz-2654025", "urlToImage": null, "publishedAt": "2020-04-26T13:55:20Z", "content": "Spider-Man star Tom Holland is set to host a Marvel-themed charity pub quiz next week.\r\nOn Wednesday night (April 29) at 8pm BST, Holland will quiz fans on all things MCU in aid of his family’s Brothers Trust.\r\nHolland announced details of the quiz when appea… [+1019 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Matt London", "title": "'Tiger King' employee speaks out: 'Monster is a relative term. And Joe fits the bill' - Fox News", "description": "\"A 'monster' is a relative term. And Joe fits the bill,\" Kelci \"Saff\" Saffery, a former worker at the Greater Wynnewood Exotic Animal Park, told former prosecutor and Fox Nation host Nancy Grace.", "url": "https://www.foxnews.com/media/tiger-king-employee-saff-saffrey-shot-tigers", "urlToImage": null, "publishedAt": "2020-04-26T13:33:23Z", "content": "A one-time employee of the infamous Joe Exotic's Oklahoma zoo said that law enforcement is likely to file new charges against more people -- if investigators examine the web of those involved in animal cruelty crimes exposed by the Netflix series \"Tiger King:… [+3695 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Too Hot to Handle: Matthew Explains Why Leaving The Show Early Helped Some of The Guys (Exclusi… - Entertainment Tonight", "description": "ET chatted with 'Too Hot to Handle' cast member Matthew Smith about why he decided to leave the show early. Exclusives from #ETonline : https://www.youtube.c...", "url": "https://www.youtube.com/watch?v=p5R3NbncxoQ", "urlToImage": null, "publishedAt": "2020-04-26T13:00:25Z", "content": "ET chatted with 'Too Hot to Handle' cast member Matthew Smith about why he decided to leave the show early.\r\nExclusives from #ETonline :https://www.youtube.com/playlist?list..."}, {"source": {"id": null, "name": "Avclub.com"}, "author": "Danette Chavez", "title": "Cory Finley on Bad Education, capitalism, and Hugh Jackman’s walk of shame - The A.V. Club", "description": "\"Directing a story where you want to place an emphasis on the words puts the onus on the director to find intentional ways to frame each scene so that it’s not just sort of a long series of conversations that are shot in exactly the same way.\"", "url": "https://tv.avclub.com/cory-finley-on-bad-education-capitalism-and-hugh-jack-1843031267", "urlToImage": null, "publishedAt": "2020-04-26T13:00:00Z", "content": "With dark humor and one of Hugh Jackmans finest onscreen performances, HBOs Bad Education puts the lie to Horace Manns declaration that education is the great equalizer. The film, which premiered at the Toronto International Film Festival last year, is based … [+13318 chars]"}, {"source": {"id": null, "name": "Wrestlingnews.co"}, "author": "Andrew Ravens", "title": "Early betting odds released for top WWE Money in the Bank matches - Wrestling News", "description": "Early betting odds for some matches at WWE’s next pay-per-view event, Money in the Bank, have been released. The WWE Money in the Bank pay-per-view event is slated to be held on Sunday, May 10, 2020. It should be noted that WWE has booked Otis vs. Dolph Ziggl…", "url": "https://wrestlingnews.co/wwe-news/early-betting-odds-released-for-top-wwe-money-in-the-bank-matches/", "urlToImage": null, "publishedAt": "2020-04-26T12:59:32Z", "content": "Early betting odds for some matches at WWEs next pay-per-view event, Money in the Bank, have been released.\r\nThe WWE Money in the Bank pay-per-view event is slated to be held on Sunday, May 10, 2020.\r\nIt should be noted that WWE has booked Otis vs. Dolph Zigg… [+1044 chars]"}, {"source": {"id": null, "name": "Ultimateclassicrock.com"}, "author": "martinkielty", "title": "Watch Miley Cyrus Cover Pink Floyd's 'Wish You Were Here' - Ultimate Classic Rock", "description": "Miley Cyrus covered Pink Floyd's WIsh You Were Here while the Killers covered Tom Petty in April 2020.", "url": "https://ultimateclassicrock.com/miley-cyrus-pink-floyd-wish-you-were-here/", "urlToImage": null, "publishedAt": "2020-04-26T12:53:00Z", "content": "Miley Cyrus appeared on Saturday Night Live to perform a cover of Pink Floyd classic Wish You Were Here.\r\nThe pop singer, whos crossed over into rock music several times in recent years, delivered the 1975 song from a campfire setting at home, as coronavirus … [+1427 chars]"}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Suse Forrest", "title": "Why Amy Poehler Is Making Her Kids Binge 'Parks and Recreation' - Showbiz Cheat Sheet", "description": "Find out why actress Amy Poehler is making her children binge-watch her NBC hit sitcom 'Parks and Rec.' Find out why actress Amy Poehler is making her children binge-watch her NBC hit sitcom 'Parks and Rec.'", "url": "https://www.cheatsheet.com/entertainment/why-amy-poehler-is-making-her-kids-binge-parks-and-recreation.html/", "urlToImage": null, "publishedAt": "2020-04-26T11:41:08Z", "content": "Many parents are finding the COVID-19 lockdown very difficult. Not only are they having to try and keep their kids entertained all day while making sure that they stay indoors, but they are also having to perform a new role as their children’s teacher as scho… [+4343 chars]"}, {"source": {"id": null, "name": "Pagesix.com"}, "author": "Jack Hobbs", "title": "Jeff Goldblum faces backlash over comments on 'RuPaul's Drag Race' - Page Six", "description": "Goldblum, who appeared as a Season 12 guest judge on the show with “Crazy Ex-Girlfriend’s” Rachel Bloom, came under fire when he asked if the Islamic religion was “anti-homo…", "url": "https://pagesix.com/2020/04/26/jeff-goldblum-faces-backlash-over-comments-on-rupauls-drag-race/", "urlToImage": null, "publishedAt": "2020-04-26T07:41:35Z", "content": "Jeff Goldblum, known for his iconic role in the “Jurrasic Park” franchise, is facing social media backlash over comments he made to a contestant on “RuPaul’s Drag Race.”\r\nGoldblum, who appeared as a Season 12 guest judge on the wildly popular show with “Crazy… [+1442 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Jack Hobbs", "title": "Jerry Bishop, announcer on 'Judge Judy' for 24 years dead at 84 - New York Post ", "description": "Jerry Bishop, who announced the iconic Judge Judy daytime courtroom show for 24 years, passed away on Tuesday after heart complications and kidney failure, his granddaughter told the Hollywood Repo…", "url": "https://nypost.com/2020/04/26/jerry-bishop-announcer-on-judge-judy-for-24-years-dead-at-84/", "urlToImage": null, "publishedAt": "2020-04-26T06:51:51Z", "content": "Jerry Bishop, who announced the iconic Judge Judy daytime courtroom show for 24 years, passed away on Tuesday after heart complications and kidney failure, his granddaughter told the Hollywood Reporter.\r\nHe was 84.\r\nThe Hartford, Conn. born Bishop got a degre… [+520 chars]"}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Eryn Murphy", "title": "How to Watch SuperM's 'Beyond LIVE' Online Concert - Showbiz Cheat Sheet", "description": "On April 26, SuperM will kick off the new 'Beyond Live' virtual concert series. Here's how to watch their performance.", "url": "https://www.cheatsheet.com/entertainment/how-to-watch-superm-beyond-live-online-concert-kpop-sm-entertainment.html/", "urlToImage": null, "publishedAt": "2020-04-26T05:12:00Z", "content": "For fans who want the chance to see SuperM, WayV, NCT Dream, and NCT 127 in concert, the wait is almost over. SM Entertainment has partnered with Naver and will be broadcasting the groups’ live concert performances to start the live concert streaming service … [+2679 chars]"}, {"source": {"id": null, "name": "Hiphopdx.com"}, "author": "Kyle Eustice", "title": "Lil Uzi Vert Claims He Fought Playboi Carti To Squash 'Beef' - HipHopDX", "description": "Lil Uzi Vert once again set his sights on former collaborator Playboi Carti earlier this month, calling Carti's new \"Meh\" single \"just meh\"", "url": "https://hiphopdx.com/news/id.55602/title.lil-uzi-vert-claims-he-fought-playboi-carti-to-squash-beef", "urlToImage": null, "publishedAt": "2020-04-26T02:30:00Z", "content": "Lil Uzi Vert once again set his sights on former collaborator Playboi Carti last week, calling Carti’s new “Meh” single “just meh” and promising to drop new music on the same day Carti did. Their fans couldn’t quite figure out what was going on between the tw… [+1020 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Jayme Deerwester", "title": "Live Nation updates COVID-19 policy, automatically issuing refunds for canceled shows - USA TODAY", "description": "Effective May 1, Live Nation customers will automatically receive a refund if the event they bought tickets for is canceled due to coronavirus.", "url": "https://www.usatoday.com/story/entertainment/music/2020/04/25/live-nation-customers-get-automatic-refunds-canceled-shows/3028772001/", "urlToImage": null, "publishedAt": "2020-04-26T02:17:50Z", "content": "Country star Eric Church says he doesnt know when concerts might resume, but he wants people to feel safe when they do. (April 24)\r\nAP Entertainment\r\nIt's official: Live Nation customers will now automatically receive a refund if the concert or show they boug… [+3402 chars]"}, {"source": {"id": null, "name": "Nbcconnecticut.com"}, "author": "Angela Fortuna", "title": "Conn. Father Leaves Sentimental Note in His Phone for Wife, Kids Before Dying of COVID-19 - NBC Connecticut", "description": "Before a Connecticut father died from coronavirus, he wrote a letter expressing how grateful he was for his family and how much he loved them. Little did his...", "url": "https://www.nbcconnecticut.com/news/coronavirus/conn-father-leaves-sentimental-note-in-his-phone-for-wife-kids-before-dying-of-covid-19/2261027/", "urlToImage": null, "publishedAt": "2020-04-26T00:45:00Z", "content": "Before a Connecticut father died from coronavirus, he wrote a letter expressing how grateful he was for his family and how much he loved them. Little did his wife Katie know this letter was written in her husband's phone, waiting to be found after his death.\r… [+2549 chars]"}, {"source": {"id": null, "name": "Indiewire.com"}, "author": "Ryan Lattanzio", "title": "‘Saturday Night Live’: How to Watch Tonight’s New Virtual Episode of SNL - IndieWire", "description": "The Studio 8H gang is going remote for the second time on April 25.", "url": "https://www.indiewire.com/2020/04/snl-how-to-watch-new-episode-april-25-1202227384/", "urlToImage": null, "publishedAt": "2020-04-25T23:20:05Z", "content": "“Saturday Night Live” is once again going virtual this weekend after a successful April 11 airing that marked the first episode since the show’s last live taping on March 7. The April 25 episode will air at its usual cable time on NBC beginning at 11:30 p.m. … [+2117 chars]"}, {"source": {"id": null, "name": "Newsleader.com"}, "author": "Leanna Smith", "title": "Statler Brothers fans honor 'hometown hero' Harold Reid with memories, flowers - The News Leader", "description": "By Saturday afternoon, Harold Reid's stool at the Statler Brothers monument in Staunton was decorated with flowers and notes.", "url": "https://www.newsleader.com/story/news/2020/04/25/statler-brothers-fans-honor-harold-reid-memories-flowers/3025982001/", "urlToImage": null, "publishedAt": "2020-04-25T23:16:36Z", "content": "Statler Brothers founding member Harold Reid dies. A remembrance.\r\nWochit\r\nSTAUNTON Statler Brothers fans far and wide are celebrating the life of Harold Reid, who was a founding member of the award-winning country music group. \r\nA post on the Statler Brother… [+4147 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Dean Balsamini", "title": "Rolling Stones top charts with 'Living in a Ghost Town' - New York Post ", "description": "On Thursday, the band released  “Living in a Ghost Town,” with an accompanying video, and the track jumped to the top of the iTunes’ song chart. It was the band’s first No. 1 hit in 40 y…", "url": "https://nypost.com/2020/04/25/rolling-stones-top-charts-with-living-in-a-ghost-town/", "urlToImage": null, "publishedAt": "2020-04-25T23:07:51Z", "content": "The legendary Rolling Stones got some satisfaction with a new chart-topping song, their first No. 1 hit on iTunes.\r\nOn Thursday, the band released  Living in a Ghost Town, with an accompanying video, and the track jumped to the top of the iTunes song chart, b… [+656 chars]"}, {"source": {"id": null, "name": "Pagesix.com"}, "author": "Jessica Bennett", "title": "Elisabeth Hasselbeck tells 'aggressive' Meghan McCain to 'turn off the meanness' - Page Six", "description": "Elisabeth Hasselbeck has called out “The View” panelist Meghan McCain for recent comments the conservative made during her Wednesday appearance on “Watch What Happens Live.”", "url": "https://pagesix.com/2020/04/25/elisabeth-hasselbeck-hits-back-at-aggressive-meghan-mccain/", "urlToImage": null, "publishedAt": "2020-04-25T18:35:23Z", "content": "Elisabeth Hasselbeck has called out “The View” panelist Meghan McCain for recent comments the conservative made during her Wednesday appearance on “Watch What Happens Live.”\r\nWhile virtually sitting down with host Andy Cohen, McCain, 35, took Hasselbeck to ta… [+1870 chars]"}, {"source": {"id": null, "name": "Harpersbazaar.com"}, "author": "Amy Mackelden", "title": "Kylie Jenner Just Dropped $36.5 Million on a New Home, and It's Seriously Chic - HarpersBAZAAR.com", "description": "The jaw-dropping property has its own bar and 20 parking spaces.", "url": "https://www.harpersbazaar.com/celebrity/latest/a32276471/kylie-jenner-holmby-hills-california-property-photos/", "urlToImage": null, "publishedAt": "2020-04-25T18:27:00Z", "content": "<ul><li>Kylie Jenner has purchased a brand new home in the Holmby Hills neighborhood of California.</li><li>The property set her back a whopping $36.5 million, but she apparently got a great discount.</li><li>Kylie's new home reportedly has 20 parking spaces … [+1219 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Anna MacSwan", "title": "Queen's life in lockdown with just a dozen staff and her budgies, but no horse rides - Mirror Online", "description": "The 94-year-old Queen is reportedly keeping in touch with family through video messenger and avidly watching the news as she and Prince Phillip spend lockdown at Windsor Castle", "url": "https://www.mirror.co.uk/news/uk-news/queens-life-lockdown-just-dozen-21924664", "urlToImage": null, "publishedAt": "2020-04-25T16:34:30Z", "content": "The Queen is reportedly being looked after by just a dozen staff and has been keeping in touch with family through video calls during lockdown.\r\n The 94-year-old monarch has been isolating with husband Prince Phillip, 98, at Windsor Castle amid the coronaviru… [+2811 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Austin Mabeus", "title": "Watch the entire CNN/Sesame Street coronavirus town hall - CNN", "description": "CNN's Erica Hill and Dr. Sanjay Gupta partner with Sesame Street to explain the ABC's of coronavirus in a town hall for parents and kids.", "url": "https://www.cnn.com/2020/04/25/app-news-section/cnn-sesame-street-coronavirus-town-hall-april-25-2020-app/index.html", "urlToImage": null, "publishedAt": "2020-04-25T15:54:58Z", "content": null}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Paul Tassi", "title": "‘Fortnite’ Players Think This Travis Scott Clue May Lead To The Return Of The Old Map - Forbes", "description": "Is the old Fortnite Chapter 1 map coming back?", "url": "https://www.forbes.com/sites/paultassi/2020/04/25/fortnite-players-think-this-travis-scott-clue-may-lead-to-the-return-of-the-old-map/", "urlToImage": null, "publishedAt": "2020-04-25T15:19:15Z", "content": "Fortnite\r\nEpic/Lucas7Yoshi\r\nThe final two Travis Scott shows are today in Fortnite, and while theyre must-see events because of how damn cool they are, some Fortnite fans are starting to get excited about what they view as an easter egg that they believe coul… [+2544 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Brie Bella Defends Nikki's Close Bond With Birdie | Total Bellas Bonus Scene | E! - E! Entertainment", "description": "The \"Total Bellas\" star discusses her sister's bond with her daughter Birdie, after hearing her brother JJ wants Nikki and Vivienne to have the same bond. Wa...", "url": "https://www.youtube.com/watch?v=jKzw9Cfuakg", "urlToImage": null, "publishedAt": "2020-04-25T14:59:56Z", "content": "The \"Total Bellas\" star discusses her sister's bond with her daughter Birdie, after hearing her brother JJ wants Nikki and Vivienne to have the same bond. Watch!\r\n#TotalBellas#EEntertainment#BellaTwins#BrieBella#NikkiBella#BirdieJoeDanielson\r\nSUBSCRIBE: http:… [+1371 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "6 Ways Doctor Strange 2 Could Be A Game-Changer For The MCU - CBR", "description": "Multiverse of Madness Could Change the MCU Forever SUBSCRIBE NOW to CBR! Click here: http://bit.ly/Subscribe-to-CBR We all know that the Infinity Saga was a ...", "url": "https://www.youtube.com/watch?v=_f0Jc21vK5Q", "urlToImage": null, "publishedAt": "2020-04-25T13:45:00Z", "content": "Multiverse of Madness Could Change the MCU ForeverSUBSCRIBE NOW to CBR! Click here: http://bit.ly/Subscribe-to-CBR\r\nWe all know that the Infinity Saga was a major game changer for the Marvel Cinematic Universe, but lets not forget about Phase Fours Doctor Str… [+1433 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "James Crowley", "title": "Broadway Star Nick Cordero Receives Temporary Pacemaker, Says His Wife - Newsweek", "description": "Cordero's wife, Amanda Kloots, shared an updated with fans on Friday and also said that the Broadway actor had tested negative in two COVID-19 tests.", "url": "https://www.newsweek.com/nick-cordero-temporary-pacemaker-broadway-star-1500209", "urlToImage": null, "publishedAt": "2020-04-25T13:40:44Z", "content": "Actor Nick Cordero, whose leg was recently amputated due to coronavirus complications, has received a temporary pacemaker after doctors noticed an irregular heartbeat.\r\nCordero's wife, former Broadway dancer and celebrity trainer Amanda Kloots, spoke about th… [+2337 chars]"}]}