{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Connie Liou", "title": "'The Bachelorette': Clare Crawley Gets Real About Her Contestants Who Are There for the Wrong Reasons - Showbiz Cheat Sheet", "description": "'The Bachelorette's Clare Crawley calls out her cast on Twitter and Bachelor Nation fans predict she was addressing Matt James.", "url": "https://www.cheatsheet.com/entertainment/bachelorette-clare-crawley-twitter-matt-james.html/", "urlToImage": null, "publishedAt": "2020-04-26T02:05:25Z", "content": "When Clare Crawley was cast as the next bachelorette, Bachelor Nation fans rejoiced. Over the past few years, many fans have called out the ABC reality franchise for rewarding Instagram influencers over genuine romance. And ever since she first appeared on Ju… [+4074 chars]"}, {"source": {"id": null, "name": "Wrestlingnews.co"}, "author": "Paul Davis", "title": "REPORT: Vince McMahon’s new attitude at WWE SmackDown following the closing of XFL and WrestleMania Tampa cancellation - Wrestling News", "description": "There has been a lot said on social media in the last 24 hours about Vince McMahon’s appearance on WWE Friday Night SmackDown. For those of you that missed it, McMahon was on the show to celebrate Triple H’s 25 years with the company. McMahon had nice things …", "url": "https://wrestlingnews.co/wwe-news/report-vince-mcmahons-new-attitude-at-wwe-smackdown-following-the-closing-of-xfl-and-wrestlemania-tampa-cancellation/", "urlToImage": null, "publishedAt": "2020-04-26T01:55:03Z", "content": "There has been a lot said on social media in the last 24 hours about Vince McMahon’s appearance on WWE Friday Night SmackDown.\r\nFor those of you that missed it, McMahon was on the show to celebrate Triple H’s 25 years with the company. McMahon had nice things… [+1524 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Caroline Linton", "title": "Actor Dimitri Diatchenko, featured on \"Sons of Anarchy,\" has died at age 52 - CBS News", "description": "It appeared to be either a heart attack or related to being shocked by 220 volts of electricity while on the job the week prior, but autopsy results are pending.", "url": "https://www.cbsnews.com/news/dimitri-diatchenko-died-character-actor-dead-age-52-cause-of-death-unclear-2020-04-25/", "urlToImage": null, "publishedAt": "2020-04-26T01:36:40Z", "content": "Actor Dimitri Diatchenko, best known for his roles as Head Russian on \"Sons of Anarchy\" and Uri on \"Chernobyl Diaries,\" has died, according to his representatives. He was 52.\r\nAccording to a statement from Barry Bookin Management, Diatchenko died in his Dayto… [+978 chars]"}, {"source": {"id": null, "name": "Eonline.com"}, "author": "Pamela Avila", "title": "Katherine Schwarzenegger Debuts Her Baby Bump Alongside Chris Pratt - E! NEWS", "description": "Katherine Schwarzenegger is debuting her baby bump shortly after it was announced that she was expecting her first child.", "url": "https://www.eonline.com/news/1144919/katherine-schwarzenegger-debuts-her-baby-bump-alongside-chris-pratt-during-bike-ride", "urlToImage": null, "publishedAt": "2020-04-26T01:29:31Z", "content": "Katherine Schwarzenegger is debuting her baby bump shortly after it was announced that she was expecting her first child. \r\nThe 30-year-old and Chris Pratt were spotted out on a bike ride in Santa Monica, Calif. on Saturday afternoon and the mother-to-be's ba… [+835 chars]"}, {"source": {"id": null, "name": "Cinemablend.com"}, "author": "Sarah El-Mahmoud", "title": "Back To The Future And 9 More ‘80s Roles Tom Holland Would Have Been Perfect For If Time Travel Worked - CinemaBlend", "description": "Great Scott! Who gave Tom Holland the keys to the DeLorean?", "url": "https://www.cinemablend.com/news/2494942/back-to-the-future-and-more-80s-roles-tom-holland-would-have-been-perfect-for-if-time-travel-worked", "urlToImage": null, "publishedAt": "2020-04-26T01:10:03Z", "content": "Did you know Tom Holland used to be a trained dancer and gymnast? The actor got his start in Billy Elliot the Musical when he was a kid. Now Holland has admitted to having dropped the craft in his later life, but he really wants to get back into it. What bett… [+353 chars]"}, {"source": {"id": null, "name": "Slate.com"}, "author": "Cornelia Channing", "title": "Bad Education accuracy: Fact vs. fiction in HBO's new movie about the Roslyn schools scandal. - Slate", "description": "We break down HBO’s new movie about the Roslyn school scandal, starring Hugh Jackman and Allison Janney.", "url": "https://slate.com/culture/2020/04/bad-education-accuracy-fact-fiction-hbo-movie-roslyn.html", "urlToImage": null, "publishedAt": "2020-04-26T01:00:49Z", "content": "Frank Tassone and Hugh Jackman.\r\n<ol><li>\r\nNFL Executives Weird Houses Saved the 2020 Draft\r\n </li><li>Normal People Is a Swoony Adaption of Sally Rooneys Hit Novel\r\n </li><li>The Plot Against AmericasShowrunners on Why They Changed the Ending\r\n </li><li>\r\nSi… [+11675 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Elise Solé", "title": "Tom Hanks and Rita Wilson are donating blood for coronavirus research - Yahoo Entertainment", "description": "Tom Hanks and Rita Wilson, who have recovered from the coronavirus, are paying it forward.", "url": "https://www.yahoo.com/entertainment/tom-hanks-and-rita-wilson-donate-blood-to-help-coronavirus-vaccine-234312222.html", "urlToImage": null, "publishedAt": "2020-04-26T00:40:18Z", "content": "Tom Hanks says the blood that him and wife Rita Wilson donated after recovering from the coronavirus, should go toward a Hank-ccine.\r\nDuring a recent episode of NPRs Wait Wait...Dont Tell Me! Hanks, 63, explained that him and Wilson are feeling dandy, althoug… [+2903 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Jayme Deerwester", "title": "'There were no signs': 'Price Is Right' announcer George Gray recovering after three heart attacks - USA TODAY", "description": "George Gray, the announcer on CBS' \"The Price Is Right\" suffered a massive heart attack just before undergoing quadruple bypass surgery on Friday.", "url": "https://www.usatoday.com/story/entertainment/tv/2020/04/25/the-price-right-announcer-recovering-after-three-heart-attacks/3028164001/", "urlToImage": null, "publishedAt": "2020-04-26T00:25:59Z", "content": "USA TODAY's Jefferson Graham met with Price is Right host Drew Carey to ask: what tech prize would get Drew Carey to jump and down?\r\nGeorge Gray, the announcer on CBS' \"The Price Is Right\" actually told a cardiac surgeon to come on down Friday to perform a qu… [+4172 chars]"}, {"source": {"id": null, "name": "Tmz.com"}, "author": "TMZ Staff", "title": "Jeff Ross Roasts Random Fans on Instagram Live - TMZ", "description": "Jeff Ross's Instagram Roast was about the funniest thing we've seen all week.", "url": "https://www.tmz.com/2020/04/25/jeff-ross-roasts-random-fans-instagram-live/", "urlToImage": null, "publishedAt": "2020-04-26T00:04:00Z", "content": "Jeff Ross couldn't stay away from what he does best -- roasting people on a big platform -- so he got right back to it with some newbie volunteers ... quarantine-style, of course.\r\nThe comedian held an Insta-Roast Saturday on IG Live, which didn't feature any… [+1099 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Mary Papenfuss", "title": "'A Spoonful Of Clorox': Randy Rainbow Channels Mary Poppins In Anti-Trump Parody - HuffPost", "description": "The president's dangerous suggestion was parody gold for the YouTube comedian.", "url": "https://www.huffpost.com/entry/randy-rainbow-spoonful-clorox-trump-covid-19_n_5ea4b0e3c5b6805f9ece2978", "urlToImage": null, "publishedAt": "2020-04-26T00:03:10Z", "content": "Comedian Randy Rainbow on Saturday posted a caustic attack on President Donald Trump and his suggestion that injecting disinfectant into human bodies might work to cure COVID-19.\r\n“When viral symptoms underlie, there are home remedies to apply,” the YouTube s… [+1314 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Lyndsey Parker", "title": "Post Malone's all-Nirvana charity concert earns nearly $3 million, Krist Novoselic and Courtney Love's approval - Yahoo Entertainment", "description": "\"@PostMalone and crew are killing it!!!!!!!!!!!!!!!!! So proud of @PostMalone and crew. Everyone so good, so talented. I am moved!!!!! I don't think these fellows can play any better. They are on fire!!!!\" the Nirvana bassist raved.", "url": "https://www.yahoo.com/entertainment/krist-novoselic-courtney-love-approve-post-malones-all-nirvana-livestream-concert-233017340.html", "urlToImage": null, "publishedAt": "2020-04-25T23:39:30Z", "content": "When Post Malone announced that hed be doing a live-streamed concert of all Nirvana songs this weekend, many skeptics understandably cried blasphemy, or at least doubted that the rap-rocker would be able to pull it off. Even Post, as he stood in front of his … [+3772 chars]"}, {"source": {"id": null, "name": "Toofab.com"}, "author": "TooFab Staff", "title": "Angelina Jolie Says She 'Never Thought' She Would Become a Mother - TooFab", "description": "\"I remember the decision to become a parent. It wasn't hard to love,\" the actress writes in a Time essay. \"It wasn't hard to dedicate myself to someone and something greater than my life.\"", "url": "https://toofab.com/2020/04/25/angelina-jolie-says-she-never-thought-she-would-become-a-mother/", "urlToImage": null, "publishedAt": "2020-04-25T23:12:00Z", "content": "Though Angelina Jolie is a mother of six, she has now revealed that she \"never thought\" she would have children. \r\nWhile guest-editing a special edition of Time's Parents newsletter, the 44-year-old actress reflected on her decision to become a parent and exp… [+2964 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Dean Balsamini", "title": "Rolling Stones top charts with 'Living in a Ghost Town' - New York Post ", "description": "On Thursday, the band released  “Living in a Ghost Town,” with an accompanying video, and the track jumped to the top of the iTunes’ song chart. It was the band’s first No. 1 hit in 40 y…", "url": "https://nypost.com/2020/04/25/rolling-stones-top-charts-with-living-in-a-ghost-town/", "urlToImage": null, "publishedAt": "2020-04-25T23:07:51Z", "content": "The legendary Rolling Stones got some satisfaction with a new chart-topping song, their first No. 1 hit on iTunes.\r\nOn Thursday, the band released  Living in a Ghost Town, with an accompanying video, and the track jumped to the top of the iTunes song chart, b… [+656 chars]"}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Julia Dzurillay", "title": "Fans React to the First Episode of Bob the Drag Queen, Eureka O'Hara, and Shangela's HBO Series, 'We're Here' - Showbiz Cheat Sheet", "description": "These queens are strutting their stuff in some of the most conservative parts of the United States. Learn more about the HBO original, 'We're Here' here.", "url": "https://www.cheatsheet.com/entertainment/bob-the-drag-queen-eureka-shangela-hbo-were-here.html/", "urlToImage": null, "publishedAt": "2020-04-25T23:03:44Z", "content": "There may be new episodes of RuPauls Drag Race season 12 and Secret Celebrity Drag Race premiering on Fridays. However, HBO has its own series featuring some of the former contestants of this reality series. Heres what fans are saying about the latest LGBTQ-c… [+3014 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ed Lavandera, CNN", "title": "New Orleans in the age of coronavirus is quiet and strange. But like after Katrina, musicians and artists are planning a revival - CNN", "description": "Creativity is the underlying pulse that gives New Orleans life, not death, and it's in quarantine. Walking the streets and funky neighborhoods of New Orleans makes you crave the city's rhythmic heartbeat. This city is quiet, and without music dancing in the a…", "url": "https://www.cnn.com/2020/04/25/us/new-orleans-life-coronavirus/index.html", "urlToImage": null, "publishedAt": "2020-04-25T22:54:56Z", "content": "New Orleans (CNN)Creativity is the underlying pulse that gives New Orleans life, not death, and it's in quarantine. Walking the streets and funky neighborhoods of New Orleans makes you crave the city's rhythmic heartbeat. This city is quiet, and without music… [+7948 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Elise Solé", "title": "Salma Hayek celebrates 14th anniversary of meeting her 'soul mate' husband: 'I feel very blessed that I’ve found you' - Yahoo Entertainment", "description": "Salma Hayek raved about husband François-Henri Pinault in the sweet note.", "url": "https://www.yahoo.com/entertainment/salma-hayek-celebrates-14th-anniversary-of-meeting-her-soul-mate-husband-i-feel-very-blessed-that-ive-found-you-214948118.html", "urlToImage": null, "publishedAt": "2020-04-25T22:02:18Z", "content": "Salma Hayek is celebrating the 14th anniversary of meeting her soul mate and husband François-Henri Pinault.\r\nOn Saturday, the 53-year-old actress posted the affectionate Instagram note to her French hubby writing, Today 14 years ago I met my soul mate. After… [+1876 chars]"}, {"source": {"id": null, "name": "Tmz.com"}, "author": "TMZ Staff", "title": "NYC's Domino Park Packed to the Gills, Not Much Social Distancing - TMZ", "description": "Domino Park was the place to be in Brooklyn this weekend, which ain't a great thing.", "url": "https://www.tmz.com/2020/04/25/brooklyn-new-york-domino-park-packed-people-social-distancing/", "urlToImage": null, "publishedAt": "2020-04-25T21:54:00Z", "content": "The sun is starting to creep out in the Big Apple, and New Yorkers are clearly getting restless and eager to take in the rays as a giant flock of them went out en masse to a park.\r\nCheck out this photo of a bunch of Brooklynites hitting up Domino Park Saturda… [+1291 chars]"}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Matthew Trzcinski", "title": "Pink Floyd: Was 'The Phantom of the Opera' Stolen From Them? - Showbiz Cheat Sheet", "description": "Pink Floyd are an iconic progressive rock band. Their influence is incredible. Did they inspire Andrew Lloyd Webber's The Phantom of the Opera?", "url": "https://www.cheatsheet.com/entertainment/pink-floyd-was-the-phantom-of-the-opera-stolen-from-them.html/", "urlToImage": null, "publishedAt": "2020-04-25T21:45:38Z", "content": "The Phantom of the Operais still one of the most popular musicals ever. Its title song is one of the most popular songs in the history of musical theater. But did it originate with The Phantom of the Opera or Pink Floyd?\r\nThe song The Phantom of the Opera has… [+2854 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Rachel Sharp For Dailymail.com", "title": "Mister Rogers told co-star Officer Clemmons not to come out as gay and to marry a woman - Daily Mail", "description": "Francois Clemmons, 75, recalled an incident where 'Mister' Fred Rogers told him he could not be a 'member of the Neighborhood' if he was openly gay.", "url": "https://www.dailymail.co.uk/news/article-8256973/Mister-Rogers-told-star-Officer-Clemmons-not-come-gay-marry-woman.html", "urlToImage": null, "publishedAt": "2020-04-25T21:40:02Z", "content": "Francois Clemmons, best known as Officer Clemmons on children's TV series 'Mister Rogers' Neighborhood', has said that TV star Fred Rogers told him to not come out as gay and to marry a woman because if he didn't, it would 'threaten his dream'.\r\nClemmons, 75,… [+2995 chars]"}, {"source": {"id": null, "name": "Latimes.com"}, "author": "Stephen Battaglio", "title": "'Judge Judy' announcer Jerry Bishop dies at 84 - Los Angeles Times", "description": "Jerry Bishop, the voice of hit daytime courtroom show 'Judge Judy' was also a Los Angeles radio host.", "url": "https://www.latimes.com/entertainment-arts/tv/story/2020-04-25/judge-judy-announcer-jerry-bishop-dead", "urlToImage": null, "publishedAt": "2020-04-25T21:30:00Z", "content": "Jerry Bishop, the veteran radio personality who was the off-camera announcer for the courtroom television show Judge Judy, died Tuesday after a brief illness. He was 84.\r\nBishops death was confirmed by his granddaughter Allison Rosenbloom, who said he suffere… [+1928 chars]"}, {"source": {"id": null, "name": "Latimes.com"}, "author": "Adam Tschorn", "title": "'Making the Cut' on Amazon: Meet winner Jonny Cota - Los Angeles Times", "description": "Season one's winner talks halo effects, career boosts and 'the most beautiful alien I have ever seen.'", "url": "https://www.latimes.com/entertainment-arts/tv/story/2020-04-24/amazon-making-the-cut-winner-interview", "urlToImage": null, "publishedAt": "2020-04-25T21:29:39Z", "content": "Even if it hadnt debuted just as the global coronavirus pandemic was profoundly reshaping the worlds of entertainment, fashion and retail, Amazons foray into reality television the 10-episode Making the Cut, which concluded its first season Friday was destine… [+9062 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alaa Elassar, CNN", "title": "The Beatles streamed 'Yellow Submarine' and hosted a sing-a-long watch party, and people loved it - CNN", "description": "Even during a global pandemic, the Beatles found a way for people to come together.", "url": "https://www.cnn.com/2020/04/25/us/the-beatles-yellow-submarine-trnd/index.html", "urlToImage": null, "publishedAt": "2020-04-25T21:24:55Z", "content": null}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Kimberley Richards", "title": "Nick Cordero's Wife Amanda Kloots Gives Health Update On The Broadway Star - HuffPost", "description": "The \"Rock of Ages\" actor was \"recovering well\" after a pacemaker procedure. He previously had his right leg amputated due to complications from COVID-19.", "url": "https://www.huffpost.com/entry/nick-cordero-amanda-kloots-coronavirus-health-update-broadway_n_5ea466ffc5b6d37635907b81", "urlToImage": null, "publishedAt": "2020-04-25T20:55:00Z", "content": "Former Radio City Rockette Amanda Kloots gave a health update on her husband, Broadway actor Nick Cordero, who had his right leg amputated last week due to complications from the coronavirus.\r\nKloots noted in a series of Instagram story videos on Friday that … [+1977 chars]"}, {"source": {"id": null, "name": "Billboard.com"}, "author": "Jim Asker", "title": "Following the Passing of Harold Reid, A Look at the Statler Brothers’ Biggest Billboard Hits - Billboard", "description": "The baritone served as the group’s foundation for more than four decades.", "url": "https://www.billboard.com/articles/business/chart-beat/9365978/statler-brothers-biggest-hits", "urlToImage": null, "publishedAt": "2020-04-25T20:25:22Z", "content": "Following a long battle with kidney failure, Harold Reid, a founding member of The Statler Brothers, died on Friday (April 24) in his hometown Staunton, Va. He was 80.\r\nStaunton was the home base for the group, which initially worked as a gospel group, since … [+2644 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Jennifer Ouellette", "title": "Review: Chris Hemsworth shows his dramatic acting chops in Extraction - Ars Technica", "description": "Streaming services like Netflix provide a much-needed platform for mid-level films", "url": "https://arstechnica.com/gaming/2020/04/review-extraction-is-a-solid-action-thriller-with-killer-fight-sequences/", "urlToImage": null, "publishedAt": "2020-04-25T20:20:00Z", "content": "Enlarge/ Chris Hemsworth plays a ruthless mercenary whose latest mission calls for recusing a drug lord's kidnapped son from Bangladesh. \r\n3 with 3 posters participating\r\nChris Hemsworth gets a chance to stretch his acting chops as a hardened mercenary hired … [+6160 chars]"}, {"source": {"id": null, "name": "Pagesix.com"}, "author": "Paula Froelich", "title": "Mike Tyson 'might have' bought his tigers from 'Tiger King' Joe Exotic - Page Six", "description": "He owned three tigers in the 1990s.", "url": "https://pagesix.com/2020/04/25/mike-tyson-might-have-bought-his-tigers-from-joe-exotic/", "urlToImage": null, "publishedAt": "2020-04-25T19:54:20Z", "content": "Mike Tyson says the three tigers he owned in the 1990s might have come from “Tiger King” Joe Exotic.\r\nTyson was one of the 64 million viewers around the world who watched the bizarre Netflix docuseries about ex-zookeeper and tiger collector Joe Exotic now in … [+1638 chars]"}, {"source": {"id": null, "name": "Rollingstone.com"}, "author": "Daniel Kreps", "title": "Live Nation Amends Ticket Refund Policy Following Criticism - Rolling Stone", "description": "\"Fans, we hear you. We don’t want you to be waiting in limbo while shows are being rescheduled,\" CEO Michael Rapino tweets", "url": "https://www.rollingstone.com/music/music-news/live-nation-tickermaster-refund-policy-990053/", "urlToImage": null, "publishedAt": "2020-04-25T19:31:14Z", "content": "Following continued criticism over their refund policies, Live Nation has amended its previously announced plan for concerts canceled or postponed by the coronavirus pandemic, the New York Times reported Saturday.\r\n“Fans, we hear you. We don’t want you to be … [+2553 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chloe Melas, CNN", "title": "Davido releases 'Dolce & Gabanna' music video and donates proceeds to coronavirus research after fiancée tests positive - CNN", "description": "Nigerian singer, Davido, is doing his part in the fight against COVID-19.", "url": "https://www.cnn.com/2020/04/25/entertainment/davido-dolce-gabbana-music-video-coronavirus/index.html", "urlToImage": null, "publishedAt": "2020-04-25T19:25:03Z", "content": "(CNN)Nigerian singer, Davido, is doing his part in the fight against COVID-19.\r\nThe internationally-known singer not only released his new music video, \"Dolce &amp; Gabbana,\" on Friday but also announced that all the proceeds from the video will go to support… [+1207 chars]"}, {"source": {"id": null, "name": "Sfchronicle.com"}, "author": "Steve Rubenstein", "title": "SF sings its heart out in unison with Tony Bennett to combat coronavirus blues - San Francisco Chronicle", "description": "At high noon, there was no getting away from the sound of “I Left My Heart in San Francisco” in the city’s first live-from-everyplace pandemic feel-good sing-along.", "url": "https://datebook.sfchronicle.com/music/sf-sings-its-heart-out-with-tony-bennett-to-combat-coronavirus-blues", "urlToImage": null, "publishedAt": "2020-04-25T19:16:22Z", "content": null}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Frederica Miller", "title": "Royal rule: The REAL reason Prince Charles 'more reserved' than relatable Kate and William - Express", "description": "KATE, DUCHESS OF CAMBRIDGE and Prince William have charmed the British public with their relatable approach amid the coronavirus crisis. This is the real reason Prince Charles has been more reserved, according to a royal expert.", "url": "https://www.express.co.uk/news/royal/1273873/royal-news-prince-charles-rule-king-prince-william-kate-middleton", "urlToImage": null, "publishedAt": "2020-04-25T19:06:40Z", "content": null}, {"source": {"id": null, "name": "Nydailynews.com"}, "author": "Tim Balk", "title": "Kristen Bell films husband Dax Shepard pulling pin from hand - New York Daily News", "description": "You gotta hand it to him, actor Dax Shepard is getting crafty amid his quarantine.", "url": "https://www.nydailynews.com/snyde/ny-kristen-bell-dax-shepard-hand-surgery-20200425-tndjy7t7lnah5f6wx6o6boj6c4-story.html", "urlToImage": null, "publishedAt": "2020-04-25T18:54:53Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alaa Elassar, CNN", "title": "Best moments from CNN and Sesame Street's coronavirus town hall for kids and parents - CNN", "description": "CNN partnered with Sesame Street for a special town hall about coronavirus to give kids the opportunity to learn more about the pandemic and ask questions.", "url": "https://www.cnn.com/2020/04/25/us/cnn-sesame-street-town-hall-coronavirus-trnd/index.html", "urlToImage": null, "publishedAt": "2020-04-25T18:44:46Z", "content": "By Alaa Elassar, CNN\r\nUpdated 2:35 PM ET, Sat April 25, 2020\r\nChat with us in Facebook Messenger. Find out what's happening in the world as it unfolds.\r\n(CNN)CNN partnered with Sesame Street for a special town hall about coronavirus to give kids the opportuni… [+5839 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Rasha Ali", "title": "Anderson Cooper chokes up during emotional interview with woman who lost husband to COVID-19 - USA TODAY", "description": "Anderson Cooper conducted an emotional interview with Katie Coelho who lost her 32-year-old husband to coronavirus on Wednesday.", "url": "https://www.usatoday.com/story/entertainment/celebrities/2020/04/25/anderson-cooper-tears-up-emotional-interview-coronavirus-widow/3026515001/", "urlToImage": null, "publishedAt": "2020-04-25T18:37:01Z", "content": "Anderson Cooper got emotional during Friday's \"Anderson Cooper 360\" while interviewing a woman who lost her husband to COVID-19.\r\nDoctors told Katie Coelho her husband Jonathan Coelho was expected to beat the coronavirus. Thenshe got a call from the hospital … [+2502 chars]"}, {"source": {"id": null, "name": "Pagesix.com"}, "author": "Jessica Bennett", "title": "Elisabeth Hasselbeck tells 'aggressive' Meghan McCain to 'turn off the meanness' - Page Six", "description": "Elisabeth Hasselbeck has called out “The View” panelist Meghan McCain for recent comments the conservative made during her Wednesday appearance on “Watch What Happens Live.”", "url": "https://pagesix.com/2020/04/25/elisabeth-hasselbeck-hits-back-at-aggressive-meghan-mccain/", "urlToImage": null, "publishedAt": "2020-04-25T18:35:23Z", "content": "Elisabeth Hasselbeck has called out “The View” panelist Meghan McCain for recent comments the conservative made during her Wednesday appearance on “Watch What Happens Live.”\r\nWhile virtually sitting down with host Andy Cohen, McCain, 35, took Hasselbeck to ta… [+1870 chars]"}, {"source": {"id": null, "name": "Pagesix.com"}, "author": "Paula Froelich", "title": "Meghan and Harry moved to paparazzi 'hotspot' - Page Six", "description": "Meghan Markle and Prince Harry have jumped from the proverbial frying pan into the paparazzi fire.", "url": "https://pagesix.com/2020/04/25/meghan-and-harry-moved-to-paparazzi-hotspot/", "urlToImage": null, "publishedAt": "2020-04-25T18:29:29Z", "content": "Meghan Markle and Prince Harry have jumped from the proverbial frying pan into the paparazzi fire.\r\nThe couple, who claimed harsh treatment from the British press and prying paparazzi drove them to leave the royal family earlier this year and flee their seclu… [+2878 chars]"}, {"source": {"id": null, "name": "Wnyc.org"}, "author": null, "title": "Statement From CEO Goli Sheikholeslami To The NYPR Staff On The Death Of WNYC's Richard Hake | WNYC News - WNYC", "description": "Richard worked at WNYC for nearly 30 years as a host, reporter, and producer. He was an extraordinary broadcaster and journalist who took great pride in serving our audience.", "url": "https://www.wnyc.org/story/richard-hake-statement-goli-sheikholeslami/", "urlToImage": null, "publishedAt": "2020-04-25T18:00:06Z", "content": null}, {"source": {"id": null, "name": "Vulture.com"}, "author": "Devon Ivie", "title": "Dead to Me Season 2 Trailer: Murder, They Wrote - Vulture", "description": "The female buddy dramedy returns, just when we need it.", "url": "https://www.vulture.com/2020/04/netflix-dead-to-me-season-2-trailer-2020-watch.html", "urlToImage": null, "publishedAt": "2020-04-25T17:59:21Z", "content": "If youre going to murder one of the most handsome men in the world, perhaps dont do it in your pool. So inelegant. So expected. And now, Jen (Christina Applegate) and Judy (Linda Cardellini) have to worry about draining all of that chlorine. The blood takes a… [+552 chars]"}, {"source": {"id": null, "name": "Tomsguide.com"}, "author": "Henry T. Casey", "title": "Beastie Boys Story is so good you’ll want to pay for Apple TV Plus - Tom's Guide", "description": "Spike Jonze's latest film should show Apple how to make Apple TV Plus a hit", "url": "https://www.tomsguide.com/news/beastie-boys-story-review-apple-tv-plus", "urlToImage": null, "publishedAt": "2020-04-25T17:17:43Z", "content": "Out now, exclusively on Apple TV Plus\r\n, Beastie Boys Story might be my favorite thing I've watched during the 6 weeks I've been stuck inside under quarantine. It also got me thinking about the Apple TV Plus service, which probably hasn't been the home-run hi… [+7073 chars]"}, {"source": {"id": null, "name": "Billboard.com"}, "author": "Mitchell Peters", "title": "Kanye West Is Now a Billionaire, Thanks Mostly to His Yeezy Sneaker Brand - Hollywood Reporter", "description": "", "url": "https://www.billboard.com/articles/columns/hip-hop/9365910/kanye-west-is-now-a-billionaire-thanks-mostly-to-his-yeezy-sneaker-brand-forbes", "urlToImage": null, "publishedAt": "2020-04-25T16:40:09Z", "content": "It's official: Kanye West is now a billionaire.\r\nOver the years, West's finances have remained mostly a mystery. But now, Forbes reports that the rapper-turned-footwear mogul has an estimated net worth of $1.3 billion.\r\nWest can attribute his entry into the b… [+1643 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Melissa Roberto", "title": "Dolly Parton secretly produced 'Buffy the Vampire Slayer' and fans are stunned: 'We do not deserve her' - Fox News", "description": "Dolly Parton secretly produced \"Buffy the Vampire Slayer\" and fans are freaking out over the revelation.", "url": "https://www.foxnews.com/entertainment/dolly-parton-secretly-produced-buffy-the-vampire-slayer", "urlToImage": null, "publishedAt": "2020-04-25T16:30:36Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox.  Sign up here. \r\nDolly Parton secretly produced \"Buffy the Vampire Slayer\" and fans are freaking out over the resurfaced revelation.\r\nThe country icon's name never appeared in the … [+2401 chars]"}, {"source": {"id": null, "name": "Eonline.com"}, "author": "Alyssa Morin", "title": "The Jonas Brothers Play ''Quarantine Confessions'' With Jimmy Fallon - E! NEWS", "description": "The Jonas Brothers are laying it all on the table during their virtual appearance on <i>The Tonight Show Starring Jimmy Fallon</i>", "url": "https://www.eonline.com/news/1144853/the-jonas-brothers-share-their-quarantine-confessions-and-it-will-make-you-love-them-more", "urlToImage": null, "publishedAt": "2020-04-25T16:22:40Z", "content": "There's more to the Jonas Brothers than fans knew!\r\nOn Friday night, the talented trio—Nick Jonas, Joe Jonas and Kevin Jonas—made a virtual appearance on The Tonight Show Starring Jimmy Fallon.\r\nAs of late, host Jimmy Fallon, has been giving his fans and view… [+714 chars]"}, {"source": {"id": null, "name": "Nme.com"}, "author": null, "title": "Watch The Killers debut new song ‘Blowback’ and cover Tom Petty’s ‘The Waiting’ - NME Live", "description": "The Killers have debuted another new song from their forthcoming album ‘Imploding The Mirage’ - click here to listen to 'Blowback'.", "url": "https://www.nme.com/news/music/watch-the-killers-debut-new-song-blowback-and-cover-tom-pettys-the-waiting-2653845", "urlToImage": null, "publishedAt": "2020-04-25T16:13:05Z", "content": "The Killers have debuted another new song from their forthcoming album Imploding The Mirage.\r\nThe band’s frontman Brandon Flowers and Ronnie Vannucci Jr. appeared on CBS This Morning today (April 25) for the shows recurring Saturday Sessions segment. While on… [+1292 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Scott Mendelson", "title": "Did ‘Spider-Man 3’ Spoil Marvel’s Post-‘Avengers: Endgame’ Plans? - Forbes", "description": "Thanks to 'Spider-Man 3,' 'Doctor Strange 2' may open out of order. 'Thor 4,' 'Doctor Strange 2,' 'Black Panther 2' and 'Captain Marvel 2' will open almost concurrently in 2022.", "url": "https://www.forbes.com/sites/scottmendelson/2020/04/25/spider-man-3-delay-puts-a-wrinkle-in-marvels-post-avengers-endgame-plans-for-thor-and-doctor-strange/", "urlToImage": null, "publishedAt": "2020-04-25T16:05:17Z", "content": "posters from 'Doctor Strange,' 'Spider-Man Far from Home' and 'Thor Ragnarok'\r\nWalt Disney and Marvel\r\nA date change for Sonys untitled third Spider-Man movie leaves Doctor Strange in the Multiverse of Madness opening out of order and results in Thor 4, Docto… [+7355 chars]"}, {"source": {"id": "buzzfeed", "name": "Buzzfeed"}, "author": "[{\"@type\":\"Person\",\"name\":\"Terry Carter\",\"url\":\"https://www.buzzfeed.com/terrycarter\",\"jobTitle\":\"BuzzFeed Staff\"}]", "title": "Pauly D From \"Jersey Shore\" Debuted His New Quarantine Beard And People Had Lots Of Jokes About It - BuzzFeed", "description": "Will the real Pauly D please stand up?", "url": "https://www.buzzfeed.com/terrycarter/pauly-d-quarantine-beard", "urlToImage": null, "publishedAt": "2020-04-25T15:33:47Z", "content": null}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Paul Tassi", "title": "‘Fortnite’ Players Think This Travis Scott Clue May Lead To The Return Of The Old Map - Forbes", "description": "Is the old Fortnite Chapter 1 map coming back?", "url": "https://www.forbes.com/sites/paultassi/2020/04/25/fortnite-players-think-this-travis-scott-clue-may-lead-to-the-return-of-the-old-map/", "urlToImage": null, "publishedAt": "2020-04-25T15:19:15Z", "content": "Fortnite\r\nEpic/Lucas7Yoshi\r\nThe final two Travis Scott shows are today in Fortnite, and while theyre must-see events because of how damn cool they are, some Fortnite fans are starting to get excited about what they view as an easter egg that they believe coul… [+2544 chars]"}, {"source": {"id": null, "name": "Cosmopolitan.com"}, "author": "Alanna Lauren Greco", "title": "Tyler Cameron Says He and Hannah Brown Are \"Just Starting Off as Friends\" and \"Not in a Place\" to Date RN - Cosmopolitan.com", "description": "That doesn't rule out the future, though! 👀", "url": "https://www.cosmopolitan.com/entertainment/tv/a32275994/tyler-cameron-hannah-brown-starting-off-friends-not-in-place-date/", "urlToImage": null, "publishedAt": "2020-04-25T15:19:00Z", "content": "<ul><li>Tyler Cameron just hinted that even though he's not dating his Bachelorette ex Hannah Brown at the moment, he wants to date her again in the future. </li><li>In a new vid he says, \"we're just starting off as friends and that's what it is right now.\"</… [+1280 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Too Hot to Handle: Inside Sharron & Rhonda's Complicated Post-Show Relationship (Exclusive) - Entertainment Tonight", "description": "ET chatted with 'Too Hot to Handle' cast member Sharron Townsend about the status of his relationship with Rhonda Paul after filming. Exclusives from #ETonli...", "url": "https://www.youtube.com/watch?v=IVDAP8oB9xw", "urlToImage": null, "publishedAt": "2020-04-25T15:00:11Z", "content": "ET chatted with 'Too Hot to Handle' cast member Sharron Townsend about the status of his relationship with Rhonda Paul after filming.\r\nExclusives from #ETonline :https://www.youtube.com/playlist?list..."}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Brie Bella Defends Nikki's Close Bond With Birdie | Total Bellas Bonus Scene | E! - E! Entertainment", "description": "The \"Total Bellas\" star discusses her sister's bond with her daughter Birdie, after hearing her brother JJ wants Nikki and Vivienne to have the same bond. Wa...", "url": "https://www.youtube.com/watch?v=jKzw9Cfuakg", "urlToImage": null, "publishedAt": "2020-04-25T14:59:56Z", "content": null}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Arturo Conde", "title": "\"Penny Dreadful: City of Angels\" explores violence against Mexican Americans in L.A. - NBC News", "description": "\"Penny Dreadful: City of Angels\" premiering Sunday on Showtime, sets a story against the backdrop of 1930s Los Angeles, with racial violence against Mexican-Americans and the Zoot Suit Riots.", "url": "https://www.nbcnews.com/news/latino/penny-dreadful-city-angels-explores-violence-against-mexican-americans-l-n1191661", "urlToImage": null, "publishedAt": "2020-04-25T14:30:58Z", "content": "Television has become a window into the outside world for millions of quarantined Americans. And this Sunday, when the much-anticipated series Penny Dreadful: City of Angels premieres on Showtime, Latina actress Stephanie Arcila says that the horror drama wil… [+3436 chars]"}, {"source": {"id": null, "name": "Xxlmag.com"}, "author": "cvernoncoleman", "title": "Lil Uzi Vert Denies Dissing Playboi Carti on New Song “Sasuke” - XXLMAG.COM", "description": "Read details here.", "url": "https://www.xxlmag.com/news/2020/04/lil-uzi-vert-denies-dissing-playboi-carti-sasuke/", "urlToImage": null, "publishedAt": "2020-04-25T14:21:00Z", "content": "Lil Uzi Vert is shooting down speculation that he is taking shots at Playboi Carti on his new single, \"Sasuke.\"\r\nAfter both rappers hinted at dropping new songs on Monday (April 20), neither rapper came through as promised, causing upset fans. However, Uzi de… [+1312 chars]"}, {"source": {"id": null, "name": "Times-herald.com"}, "author": null, "title": "Music legend Bohannon passes - Newnan Times-Herald", "description": "Newnan music legend Hamilton Bohannon passed away Friday at the age of 78.", "url": "https://times-herald.com/news/2020/04/music-legend-bohannon-passes", "urlToImage": null, "publishedAt": "2020-04-25T14:14:13Z", "content": "Newnan music legend Hamilton Bohannon passed away Friday at the age of 78. Bohannon was a percussionist, band leader, songwriter and record producer, who was one of the leading figures in 1970s disco music.\r\nNewnan music legend Hamilton Bohannon passed away F… [+14098 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Watch Kylie Jenner's Daughter Stormi CRASH Dad Travis Scott's Instagram Live - Entertainment Tonight", "description": "The rapper’s 2-year-old daughter totally interrupted her famous dad’s Instagram Live in the cutest way possible! Exclusives from #ETonline : https://www.yout...", "url": "https://www.youtube.com/watch?v=KUb-hFD4M7E", "urlToImage": null, "publishedAt": "2020-04-25T14:00:06Z", "content": "The rappers 2-year-old daughter totally interrupted her famous dads Instagram Live in the cutest way possible!\r\nExclusives from #ETonline :https://www.youtube.com/playlist?list..."}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Kelly Lawler", "title": "Staying Apart, Together: Why 'Paddington,' dancing and meditation bring joy amid COVID-19 - USA TODAY", "description": "The best British bear movie to watch, how to meditate at home and more to get you through another weekend in quarantine.", "url": "https://www.usatoday.com/story/life/2020/04/25/staying-apart-together-paddington-dance-bring-joy-amid-covid-19/3020554001/", "urlToImage": null, "publishedAt": "2020-04-25T13:45:23Z", "content": "Editor's Note: This is a preview of USA TODAY's newsletter Staying Apart, Together, a guide to help us all cope with a world changed by coronavirus. If you would like it in your inbox on Tuesdays and Saturdays, subscribe here. \r\n\"If you're kind and polite, th… [+6208 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Maureen Callahan", "title": "Quarantine has unmasked A-Rod and J.Lo as malignant narcissists - New York Post ", "description": "A-Rod and J.Lo potentially making a bid for the New York Mets is, on the surface, a glamorous and hopeful idea, a forward-looking act of positivity in these calamitous times. It would be even more …", "url": "https://nypost.com/2020/04/25/quarantine-has-unmasked-a-rod-j-lo-as-malignant-narcissists/", "urlToImage": null, "publishedAt": "2020-04-25T12:38:21Z", "content": "A-Rod and J.Lo potentially making a bid for the New York Mets is, on the surface, a glamorous and hopeful idea, a forward-looking act of positivity in these calamitous times.\r\nIt would be even more so if these two hadnt been using this quarantine to constantl… [+4490 chars]"}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Robert Yaniz Jr.", "title": "'Avengers: Endgame': One Year Later, the Marvel Epic Is More Relevant than Ever - Showbiz Cheat Sheet", "description": "A full year has passed since 'Avengers: Endgame' hit theaters. Yet, the film feels more relevant to today's world than ever before.", "url": "https://www.cheatsheet.com/entertainment/avengers-endgame-one-year-later-the-marvel-epic-is-more-relevant-than-ever.html/", "urlToImage": null, "publishedAt": "2020-04-25T11:01:51Z", "content": "It feels like only yesterday, but believe it or not, a full year has passed since Captain America (Chris Evans) led the entire Marvel Cinematic Universe against Thanos (Josh Brolin) and his army. Accordingly, Avengers: Endgame proved to be a superhero blockbu… [+3864 chars]"}, {"source": {"id": null, "name": "Ktla.com"}, "author": "Tracy Bloom", "title": "Disney theme parks may remain closed until 2021, financial analyst predicts - WAVY.com", "description": "Disney theme parks in the U.S. have been shuttered since mid-March and could remain that way until the beginning of 2021 due to the ongoing coronavirus health emergency, according to one analyst at…", "url": "https://ktla.com/news/local-news/disneyland-may-not-reopen-this-year-because-of-coronavirus-financial-analyst-predicts/", "urlToImage": null, "publishedAt": "2020-04-25T03:31:00Z", "content": "Disney theme parks in the U.S. have been shuttered since mid-March and could remain that way until the beginning of 2021 due to the ongoing coronavirus health emergency, according to one analyst at global financial firm UBS. \r\nIn a report released to clients … [+1857 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Demi Lovato BREAKS SILENCE On Selena Gomez Drama! - Clevver News", "description": "More Celebrity News ►► http://bit.ly/SubClevverNews #demilovato #selenagomez #finsta Last week, Demi Lovato’s alleged ‘Finsta’ account that trashed Selena Go...", "url": "https://www.youtube.com/watch?v=OSpAjBo6njE", "urlToImage": null, "publishedAt": "2020-04-24T23:30:00Z", "content": "More Celebrity News http://bit.ly/SubClevverNews#demilovato#selenagomez#finsta\r\nLast week, Demi Lovatos alleged Finsta account that trashed Selena Gomez was leaked for the world to see, and now Demi is speaking out on the #Demilovatoisover party, cancel cultu… [+864 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Rasha Ali", "title": "New York rapper Fred the Godson dead at 35 from coronavirus complications - USA TODAY", "description": "Bronx rapper, Fred the Godson, died Thursday after revealing he had contracted COVID-19 earlier this month.", "url": "https://www.usatoday.com/story/entertainment/celebrities/2020/04/24/coronavirus-fred-godson-dead-stars-react-today-sad-one/3013999001/", "urlToImage": null, "publishedAt": "2020-04-24T22:03:13Z", "content": "New York rapper Fred the Godson died after being hospitalized for the coronavirus. He was 35 years old.\r\nUSA TODAY\r\nNew York rapper Fred the Godson died Thursday after being diagnosed with COVID-19, his manager confirmed to USA TODAY. He was 35.\r\n\"New York Ci… [+2534 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Carly Mallenbaum", "title": "Nickelodeon's Kids' Choice Awards goes remote; Disney World presents virtual fireworks - USA TODAY", "description": "The Kids' Choice Awards will now a \"virtually produced,\" star-studded show on May 2. Need kid-friendly programming while you wait: Disney's fireworks.", "url": "https://www.usatoday.com/story/entertainment/tv/2020/04/24/kids-choice-awards-ariana-grande-rock-bts-appear-virtually/3023296001/", "urlToImage": null, "publishedAt": "2020-04-24T21:58:23Z", "content": "Comedians, actors, and musicians use their extra free time during coronavirus isolation to give back to fans and support charities.\r\nUSA TODAY\r\nThe Kids' Choice Awards show will go on, and the slime will flow in a \"virtually produced\" show.\r\nOriginally schedu… [+1739 chars]"}, {"source": {"id": null, "name": "Salon.com"}, "author": "Melanie McFarland", "title": "In taut legal drama \"Defending Jacob,\" Chris Evans shows up as the daddy America needs - Salon", "description": "The latest Apple TV+ family drama is a crisply tailored crime and courtroom mystery. It's also an Evans showcase", "url": "https://www.salon.com/2020/04/24/in-taut-legal-drama-defending-jacob-chris-evans-shows-up-as-the-daddy-america-needs/", "urlToImage": null, "publishedAt": "2020-04-24T21:52:17Z", "content": "\"Any man can be a father, but it takes a hot, middle-aged guy with a big job to be a daddy.\" A wise man once said that. Wait — no, my bad, it was Matt Damon. That doesn't make it any less true. The difference between a father and a daddy is significant and mi… [+6609 chars]"}, {"source": {"id": null, "name": "Timesofisrael.com"}, "author": null, "title": "Taylor Swift calls out Soros family's 'shameless greed' in beef with record co. - The Times of Israel", "description": "Pop superstar draws criticism as white supremacists seen associating her post with widespread anti-Semitic conspiracy theories about Soros", "url": "https://www.timesofisrael.com/taylor-swift-calls-out-soros-familys-shameless-greed-in-beef-with-record-co/", "urlToImage": null, "publishedAt": "2020-04-24T20:55:00Z", "content": "JTA — Taylor Swift is drawing criticism and apparent applause among her neo-Nazi fan base for calling out the Soros family in an Instagram post. Its the latest salvo in the pop superstars ongoing battle with her former record label.\r\nThe family long has been … [+2957 chars]"}, {"source": {"id": null, "name": "Vogue.com"}, "author": "Emma Specter", "title": "The 17 Best '80s Movies and How to Watch Them - Vogue", "description": "We may be trapped indoors for the foreseeable future, but why not make the time pass quicker with a 1980s movie marathon? Here's how to stream everything from 'Die Hard' to 'Do the Right Thing.'", "url": "https://www.vogue.com/article/best-80s-movies", "urlToImage": null, "publishedAt": "2020-04-24T20:28:03Z", "content": "Let's be honest: The 2020s are nobody's favorite decade. In just four months, we've had our world rocked by a global pandemic, so why not retreat to the past with a nostalgic '80s-movie retrospective?\r\nSure, many of the films from that decade are dated, but t… [+4497 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Louis Casiano", "title": "Eminem sends 'Mom’s Spaghetti' pasta to Detroit health care workers on coronavirus frontline - Fox News", "description": "Health care workers in Detriot \"lost themselves\" in spaghetti courtesy of rapper Eminem, who sent the pasta to those battling the coronavirus on the front lines.", "url": "https://www.foxnews.com/entertainment/eminem-sends-pasta-detroit-health-care-workers-coronavirus-frontline", "urlToImage": null, "publishedAt": "2020-04-24T20:16:31Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox. Sign up here.\r\nHealth care workers in Detriot \"lost themselves\" in spaghetti courtesy of rapperEminem, who sent the pasta to those battling the coronavirus on the front lines.\r\nThe… [+1088 chars]"}, {"source": {"id": null, "name": "Tvline.com"}, "author": "Matt Webb Mitovich", "title": "'Blindspot' Final Season 5 Premiere Pushed to Thursday, May 7 - TVLine", "description": "RELATED STORIES Will & Grace Creators Reveal That Grace's Baby Daddy Is [Spoiler] SVU Finale Recap: Blast From the Recent Past -- Plus, Peter Scanavino Interprets That 'Rollisi' Moment Dammit, Jerry! The rightly celebrated Parks and Recreation reunion nonethe…", "url": "https://tvline.com/2020/04/24/blindspot-final-season-5-premiere-date-change-may-7/", "urlToImage": null, "publishedAt": "2020-04-24T19:17:00Z", "content": "Dammit, Jerry!\r\nThe rightly celebrated Parks and Recreation reunion nonetheless has had a ripple effect on NBC’s springtime scheduling.\r\nWith Leslie Knope and friends returning for A Parks and Recreation Special on Thursday, April 30 at 8:30/7:30c, the premie… [+1419 chars]"}, {"source": {"id": null, "name": "Today.com"}, "author": "Alexander Kacala", "title": "Andy Cohen says he couldn't donate plasma because he is gay - TODAY", "description": "Andy Cohen is speaking out about what he says is a discriminatory practice when it comes to LGBTQ people being able to donate blood and convalescent plasma.", "url": "https://www.today.com/health/andy-cohen-says-he-couldn-t-donate-plasma-because-he-t179881", "urlToImage": null, "publishedAt": "2020-04-24T18:16:37Z", "content": "Andy Cohen is speaking out about what he says is a discriminatory practice happening at the federal level when it comes to LGBTQ people being able to donate blood and convalescent plasma.\r\nThe 51-year-old talk show host tested positive for the coronavirus in … [+3733 chars]"}, {"source": {"id": null, "name": "Tmz.com"}, "author": "TMZ Staff", "title": "Juice WRLD's Posthumous Track 'Righteous' Details Drug Use - TMZ", "description": "Juice WRLD's family has dropped a new track, \"Righteous,\" which foreshadowed his drug problem.", "url": "https://www.tmz.com/2020/04/24/juice-wrld-family-releases-new-track-righteous-drug-use/", "urlToImage": null, "publishedAt": "2020-04-24T17:23:44Z", "content": "Juice WRLD's family has dropped a posthumous track from him, and its lyrics sadly foreshadow his eventual demise.\r\nThe late rapper's family dropped \"Righteous\" Thursday night and the track goes into extreme detail about his heavy drug use and the state of his… [+1220 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Dino-Ray Ramos", "title": "Western Thriller ‘True History Of Kelly Gang’ And ’60s Coming-Of-Age Drama ‘To The Stars’ Make Debuts – Specialty Streaming Preview - Deadline", "description": "The story of the notorious outlaw Ned Kelly is dropping on digital and on-demand today with the Justin Kurzel-directed True History of the Kelly Gang starring George MacKay (1917, Captain Fantastic), Russell Crowe (Boy Erased, The Loudest Voice) and Nicholas …", "url": "https://deadline.com/2020/04/true-history-of-kelly-gang-russell-crowe-justin-kurzel-to-the-stars-martha-stephens-specialty-streaming-preview-1202916073/", "urlToImage": null, "publishedAt": "2020-04-24T14:28:13Z", "content": "The story of the notorious outlaw Ned Kelly is dropping on digital and on-demand today with the Justin Kurzel-directed True History of the Kelly Gang starring George MacKay (1917, Captain Fantastic), Russell Crowe (Boy Erased, The Loudest Voice) and Nicholas … [+5477 chars]"}, {"source": {"id": null, "name": "Tvguide.com"}, "author": "Tim Surette", "title": "7 Shows Like Homeland That Aren't Homeland That You Should Watch If You Like Homeland - TV Guide", "description": "Including the show that was Homeland before Homeland was Homeland", "url": "https://www.tvguide.com/news/shows-like-homeland-season-8-what-to-watch-next/", "urlToImage": null, "publishedAt": "2020-04-24T13:45:30Z", "content": "The sweet blippity-screech-boop of Homeland's jazzy theme song will grate your ears for the last time this Sunday when the series finale of Homeland sends Showtime's celebrated thriller off for good. But for fans of the show, eight seasons of Homeland wasn't … [+7205 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Sean Keane", "title": "Star Wars: The Clone Wars episode 10 recap -- Ahsoka takes on Maul in The Phantom Apprentice - CNET", "description": "The former Sith Lord's plan is revealed as Siege of Mandalore gets personal.", "url": "https://www.cnet.com/news/star-wars-the-clone-wars-episode-10-recap-ahsoka-takes-on-maul-in-the-phantom-apprentice/", "urlToImage": null, "publishedAt": "2020-04-24T10:40:24Z", "content": "Aw yeah -- Maul mirrors his iconic post from The Phantom Menace as he wields signature style of lightsaber in this episode.\r\nLucasfilm\r\nOh wow. The third-to-last episode of Star Wars: The Clone Wars' final season arrived on Disney Plus on Friday, following on… [+6392 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Faith Karimi, CNN", "title": "At these movie theaters, the shows have gone on despite the coronavirus pandemic - CNN", "description": "In some places, drive-in theaters have remained open even with restrictions on nonessential services.", "url": "https://www.cnn.com/2020/04/24/us/coronavirus-drive-in-movie-theater-trnd/index.html", "urlToImage": null, "publishedAt": "2020-04-24T09:44:48Z", "content": "(CNN)As movie theater screens fade to black nationwide during the coronavirus pandemic, people sheltering in place are turning to drive-ins for much-needed entertainment. \r\nPeople once drawn to the glare of regular movie theaters are finding themselves at dri… [+2555 chars]"}]}