{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Stefan Preston", "title": "Prince Harry's LA Life Is a 'Breath of Fresh Air' From Royal Life, Says Source - Showbiz Cheat Sheet", "description": "Find out how Prince Harry's new life in LA is different from his royal life in the United Kingdom. Find out how Prince Harry's new life in LA is different from his royal life in the United Kingdom.", "url": "https://www.cheatsheet.com/entertainment/prince-harrys-l-a-life-is-a-breath-of-fresh-air-from-royal-life-says-source.html/", "urlToImage": null, "publishedAt": "2020-04-25T09:25:51Z", "content": "Prince Harry is now settled in Los Angeles along with his wife, Meghan, Duchess of Sussex, and their young son, Archie Harrison. The former senior royal couple is lying low in the wake of the COVID-19 pandemic, so any major projects that they have in the work… [+6220 chars]"}, {"source": {"id": null, "name": "Digitalspy.com"}, "author": "Chris Edwards", "title": "Jonas Brothers' movie Happiness Continues available to stream now - Digital Spy", "description": "With a Game of Thrones cameo (kind of).", "url": "https://www.digitalspy.com/movies/a32268846/jonas-brothers-new-movie-happiness-continues-stream/", "urlToImage": null, "publishedAt": "2020-04-25T09:07:53Z", "content": "The Jonas Brothers' new movie Happiness Continues: A Jonas Brothers Concert Film has arrived on Amazon Prime.\r\nThe documentary, which became available to stream today (April 24), follow's on from last year's Chasing Happiness and charts the group's rise to fa… [+1550 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Roisin O'Connor", "title": "RuPaul's Drag Race: Jeff Goldblum receives backlash for Islam comments to Jackie Cox - The Independent", "description": "‘As if America hasn’t been anti-gay and anti-woman from the outset, or killed and displaced millions of Muslims, including women and queers,’ one critic retorted", "url": "https://www.independent.co.uk/arts-entertainment/tv/news/jeff-goldblum-islam-rupaul-drag-race-jackie-cox-women-homosexuality-a9483536.html", "urlToImage": null, "publishedAt": "2020-04-25T08:14:31Z", "content": "Jeff Goldblum has found himself the subject of a backlash after asking a contestant on RuPauls Drag Race if Islam is anti-homosexuality and anti-woman.\r\nThe actor and musician appeared as a guest judge on an episode of the shows 12th season, in which the seve… [+29238 chars]"}, {"source": {"id": null, "name": "Tmz.com"}, "author": "TMZ Staff", "title": "Tyler Perry Working On Safe Way to Reopen Atlanta Studios - TMZ", "description": "Tyler Perry isn't jumping to reopen his 330-acre Atlanta studio complex, but we've learned he's working on a really unique, interesting and safe way to shoot TV shows there during the coronavirus pandemic.", "url": "https://www.tmz.com/2020/04/25/tyler-perry-working-on-safe-way-to-reopen-atlanta-studio/", "urlToImage": null, "publishedAt": "2020-04-25T08:00:00Z", "content": "Tyler Perry isn't jumping to reopen his 330-acre Atlanta studio complex, but we've learned he's working on a really unique, interesting and safe way to shoot TV shows there during the coronavirus pandemic.\r\nStudio sources tell TMZ, Tyler has a plan he's curre… [+1604 chars]"}, {"source": {"id": null, "name": "Nme.com"}, "author": null, "title": "Kanye West is now hip-hop’s second billionaire, according to Forbes - NME Live", "description": "After reviewing his finances upon request, Forbes Magazine says Kanye West is now officially a billionaire. West is now hip-hop's second billionaire.", "url": "https://www.nme.com/news/music/kanye-west-is-now-hip-hops-second-billionaire-according-to-forbes-2653542", "urlToImage": null, "publishedAt": "2020-04-25T07:52:18Z", "content": "After reviewing his finances upon request, Forbes says Kanye West is now officially a billionaire.\r\nA new report from the American business magazine valued the rapper and fashion mogul at $1.3billion. The bulk of that wealth comes from West’s stake in his Yee… [+1281 chars]"}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Connie Liou", "title": "Who Plays Magda on 'Penny Dreadful: City of Angels'? Natalie Dormer Portrays Showtime's Latest Supernatural Antagonist - Showbiz Cheat Sheet", "description": "Who plays Magda, Elsa, Rio, and Alex on 'Penny Dreadful: City of Angels'? Here's Natalie Dormer's latest project after 'Game of Thrones'.", "url": "https://www.cheatsheet.com/entertainment/magda-penny-dreadful-city-of-angels-natalie-dormer-alex-rio-elsa.html/", "urlToImage": null, "publishedAt": "2020-04-25T04:33:27Z", "content": "ThePenny Dreadful spinoff, City of Angels, may not star Eva Green, but the shows cast still packs a powerful punch. The new Showtime original series includes fan-favorites such as Nathan Lane and Alex Rodriguez. But Natalie Dormer — who plays Magda, Elsa, Rio… [+4684 chars]"}, {"source": {"id": null, "name": "Yourtango.com"}, "author": "https://www.facebook.com/jayceelevinofficial/", "title": "Weekend Love Horoscopes + Pluto Retrograde Tarot Card Readings, By Zodiac Sign, Friday, April 24 - Sunday, April 26, 2020 - YourTango", "description": "Pluto turns retrograde in Capricorn this weekend!", "url": "https://www.yourtango.com/2020332968/pluto-retrograde-horoscopes-weekend-april-24-26-2020-all-zodiac-signs-astrology", "urlToImage": null, "publishedAt": "2020-04-25T04:31:36Z", "content": "Pluto turns retrograde in Capricorn this weekend!\r\nYourTango's free weekend astrology forecast is here with love horoscopes and a Pluto retrograde in Capricorn love tarot card reading to guide all zodiac signs over the weekend of Friday, April 24, Saturday, A… [+9821 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The Raiders select Lynn Bowden Jr. & Bryan Edwards with the 80th and 81st pick | 2020 NFL Draft - CBS Sports", "description": "With the 80th pick in the 2020 NFL Draft, the Las Vegas Raiders select Lynn Bowden Jr., WR from Kentucky. And with the 81st pick select Bryan Edwards, WR fro...", "url": "https://www.youtube.com/watch?v=l6Zn5j5V3zg", "urlToImage": null, "publishedAt": "2020-04-25T03:33:21Z", "content": "With the 80th pick in the 2020 NFL Draft, the Las Vegas Raiders select Lynn Bowden Jr., WR from Kentucky. And with the 81st pick select Bryan Edwards, WR from South Carolina\r\nOur CBS Sports HQ crew breaks down the selection, providing a grade for the team and… [+334 chars]"}, {"source": {"id": null, "name": "Nme.com"}, "author": null, "title": "Watch Jerry Seinfeld return to stand-up after 22 years for Netflix comedy special - NME Live", "description": "Jerry Seinfeld has returned to screen for a Netflix comedy special amid the coronavirus pandemic.", "url": "https://www.nme.com/news/tv/jerry-seinfield-netflix-comedy-special-2653324", "urlToImage": null, "publishedAt": "2020-04-25T02:45:55Z", "content": "Jerry Seinfeld is returning to our screens to lighten the mood amid the coronavirus pandemic across the globe.\r\nOn Thursday (April 24), Netflix released a trailer for the comedy legends forthcoming original stand-up special, 23 Hours to Kill, his first after … [+1704 chars]"}, {"source": {"id": null, "name": "Vulture.com"}, "author": "Halle Kiefer", "title": "Andrew Lloyd Webber’s Phantom of the Opera Sequel Love Never Dies Is Here, Inside Your Living Room - Vulture", "description": "It never made Broadway, but hopefully it will make your weekend.", "url": "https://www.vulture.com/2020/04/phantom-of-the-opera-sequel-love-never-dies-free-to-stream.html", "urlToImage": null, "publishedAt": "2020-04-25T02:40:33Z", "content": "In case you were unaware, Andrew Lloyd Webbers smash hit musical The Phantom of the Opera has a sequel. Love Never Dies, set ten years after the events of Phantom and located in 1907 Coney Island, made its West End debut in 2010, where it received, to put it … [+1123 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Zach Kruse", "title": "Highlights of new Packers RB AJ Dillon - Packers Wire", "description": "College highlights of new Packers running back A.J. Dillon, the 62nd overall pick in the 2020 draft.", "url": "https://packerswire.usatoday.com/2020/04/24/highlights-of-new-packers-rb-a-j-dillon/", "urlToImage": null, "publishedAt": "2020-04-25T02:23:47Z", "content": "The Green Bay Packers made three picks during the first two days of the 2020 NFL draft, moving up to take quarterback Jordan Love in the first round before staying put and taking running back A.J. Dillon in the second round and tight end Josiah Deguara in the… [+321 chars]"}, {"source": {"id": null, "name": "Cbssports.com"}, "author": "Brent Brookhouse", "title": "WWE SmackDown results, recap, grades: Awkward Triple H celebration brings down an otherwise solid show - CBSSports.com", "description": "A fairly solid edition of SmackDown ended on a bad note after an awkward celebration of Triple H's 25 years in WWE", "url": "https://www.cbssports.com/wwe/news/wwe-smackdown-results-recap-grades-awkward-triple-h-celebration-brings-down-an-otherwise-solid-show/live/", "urlToImage": null, "publishedAt": "2020-04-25T02:18:00Z", "content": "With WWE continuing to build toward the May 10 Money in the Bank pay-per-view, SmackDown was a fairly solid show with good in-ring action. Unfortunately, the show ended on a bad note with a \"celebration\" of Triple H's 25 years in WWE. Joined by Shawn Michaels… [+6668 chars]"}, {"source": {"id": null, "name": "Wesh.com"}, "author": "National Desk Staff", "title": "Disneyland, Disney World may not reopen until 2021, independent financial report says - WESH Orlando", "description": "Disney theme parks may stay closed for the rest of this year, according to an analyst.", "url": "https://www.wesh.com/article/disneyland-disney-world-may-not-reopen-until-2021-independent-financial-report-says/32273537", "urlToImage": null, "publishedAt": "2020-04-25T02:14:00Z", "content": "Disney theme parks may stay closed for the rest of this year.\r\nThats the newest advice from financial firm UBS for Disneyland in California and Walt Disney World in Florida.\r\nUBS said it now expects the parks to open Jan. 1 at 50% capacity for the first six m… [+1157 chars]"}, {"source": {"id": null, "name": "Latimes.com"}, "author": "Adam Tschorn", "title": "'Making the Cut' on Amazon: Meet winner Jonny Cota - Los Angeles Times", "description": "Season one's winner talks halo effects, career boosts and 'the most beautiful alien I have ever seen.'", "url": "https://www.latimes.com/entertainment-arts/tv/story/2020-04-24/amazon-making-the-cut-winner-interview", "urlToImage": null, "publishedAt": "2020-04-25T01:43:23Z", "content": "Even if it hadnt debuted just as the global coronavirus pandemic was profoundly reshaping the worlds of entertainment, fashion and retail, Amazons foray into reality television the 10-episode Making the Cut, which concluded its first season Friday was destine… [+9062 chars]"}, {"source": {"id": null, "name": "Vogue.com"}, "author": "Rachel Hahn", "title": "Post Malone Recreated an Iconic Kurt Cobain Look for His Nirvana Tribute Show - Vogue", "description": "Post Malone did a live Nirvana tribute in support of the WHO’s COVID-10 Solidarity Response Fund.", "url": "https://www.vogue.com/article/post-malone-nirvana-tribute-dress-kurt-cobain-style-youtube-covid-fundraiser-who", "urlToImage": null, "publishedAt": "2020-04-25T01:31:57Z", "content": "Post Malone has a certain charm that one might politely call unkempt, but his style doesnt necessarily skew towards grunge in the traditional sense. Posty, as hes affectionately called by his fans, can usually be seen in a variation of the classic Nudie suit,… [+1632 chars]"}, {"source": {"id": null, "name": "Tmz.com"}, "author": "TMZ Staff", "title": "'Judge Judy' Announcer Jerry Bishop Dead at 84 - TMZ", "description": "\"Judge Judy\" announcer Jerry Bishop is dead at 84.", "url": "https://www.tmz.com/2020/04/24/judge-judy-announcer-jerry-bishop-dead-dies-radio-voice-los-angeles/", "urlToImage": null, "publishedAt": "2020-04-25T01:07:00Z", "content": "Jerry Bishop -- famous for being the announcer on \"Judge Judy\" -- is dead.\r\nJerry died Tuesday of heart disease, according to the show, and Judge Judy says she's gonna miss him.\r\nJudy remembered her longtime announcer in a statement, saying ... \"Jerry Bishop … [+688 chars]"}, {"source": {"id": null, "name": "Cinemablend.com"}, "author": "Laura Hurley", "title": "Blue Bloods Actor Nick Cordero's Wife Says He Should Have Woken From Coma By Now - CinemaBlend", "description": "Amanda Kloots provides an update on her husband's condition.", "url": "https://www.cinemablend.com/television/2495108/blue-bloods-actor-nick-corderos-wife-says-he-should-have-woken-from-coma-by-now", "urlToImage": null, "publishedAt": "2020-04-25T00:23:14Z", "content": "Blue Bloods actor and popular TV guest star Nick Cordero has been fighting for his life after a diagnosis with COVID-19, and his wife Amanda Kloots has been providing regular updates on his condition. Her updates have provided a window into the illness as wel… [+2833 chars]"}, {"source": {"id": null, "name": "Vulture.com"}, "author": "Rebecca Alter", "title": "Florence Pugh and Chris Pine to Star in Olivia Wilde’s New Thriller - Vulture", "description": "Flossie Rose will play a 1950s housewife.", "url": "http://www.vulture.com/2020/04/florence-pugh-olivia-wildes-new-movies.html", "urlToImage": null, "publishedAt": "2020-04-24T23:52:21Z", "content": "Olivia Wilde seems to have a filmmaking M.O., and were all benefiting from it. Step one: She identifies a beloved, trendy breakout star in an acclaimed A24 movie. Step two: She casts them in a complex leading role worthy of their considerable talents. Step th… [+1019 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Demi Lovato BREAKS SILENCE On Selena Gomez Drama! - Clevver News", "description": "More Celebrity News ►► http://bit.ly/SubClevverNews #demilovato #selenagomez #finsta Last week, Demi Lovato’s alleged ‘Finsta’ account that trashed Selena Go...", "url": "https://www.youtube.com/watch?v=OSpAjBo6njE", "urlToImage": null, "publishedAt": "2020-04-24T23:30:00Z", "content": null}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Joshua Barone", "title": "How the Met Opera Is Throwing a Gala Concert With Smartphones - The New York Times", "description": "Closed by the coronavirus, the company is streaming its biggest stars, performing live across nine time zones.", "url": "https://www.nytimes.com/2020/04/24/arts/music/met-opera-at-home-gala.html", "urlToImage": null, "publishedAt": "2020-04-24T23:29:06Z", "content": "Is this enough light? asked the baritone Peter Mattei.\r\nHe was in the living room of his home outside Stockholm, speaking over Skype with a small group of Metropolitan Opera staff members who were giving him directions to prepare for the companys At-Home Gala… [+7069 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "David Moye", "title": "Tom Hanks Gives Typewriter To Boy Bullied Because His Name Is Corona - HuffPost", "description": "The actor told Corona DeVries, 8, “I thought this typewriter would suit you... Ask a grown-up how it works. And use it to write me back.”", "url": "https://www.huffpost.com/entry/tom-hanks-corona-typewriter-corona-devries_n_5ea35af6c5b669fd8924e00a", "urlToImage": null, "publishedAt": "2020-04-24T23:21:58Z", "content": "An 8-year-old boy named Corona has got a friend in Tom Hanks  as well as a gift stemming from the actors offbeat hobby of collecting typewriters.\r\nIt all started when Corona De Vries of Queensland, Australia, sent a get-well letter after the actor, who he kne… [+1551 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Curtis M. Wong", "title": "Matt Damon Adopts Irish Seaside Town As Lockdown Home Amid Coronavirus Crisis - HuffPost", "description": "Residents of Dalkey, Ireland, are proud of their new resident, who came to town for a movie but opted to stick around as stay-at-home restrictions took hold.", "url": "https://www.huffpost.com/entry/matt-damon-ireland-lockdown_n_5ea3145cc5b6f96398143c36", "urlToImage": null, "publishedAt": "2020-04-24T23:16:26Z", "content": "Matt Damon has established a new home away from home during the coronavirus pandemic.\r\nIn March, the “Good Will Hunting” star touched down in Dalkey, Ireland, where he was slated to shoot scenes for Ridley Scott’s “The Last Duel.” Filming was quickly halted, … [+1605 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Karen Han", "title": "Extraction review: Netflix thriller overloads Hemsworth’s charm with action - Polygon", "description": "Former Captain America stunt double Sam Hargrave directs this thriller starring Chris Hemsworth as mercenary Tyler Rake. His mission to rescue a kidnapped boy goes sideways, and also becomes extremely bloody. Streaming on Netflix now.", "url": "https://www.polygon.com/2020/4/24/21235001/extraction-review-chris-hemsworth-netflix-streaming", "urlToImage": null, "publishedAt": "2020-04-24T23:05:43Z", "content": "Chris Hemsworths best roles to date have tapped into his charm. His turn as a handsome but clueless assistant in the Ghostbusters reboot was a revelation, and Thor: Ragnarok wisely replaced the somber aspects of the god of thunder with a puppylike eagerness. … [+4452 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Marina Fang", "title": "The Largest US Movie Theater Chain Won't Reopen Even If States Say It Can - HuffPost", "description": "Some states are allowing theaters to resume operations, even though public health experts advise against it. But there aren't even any new movies to show.", "url": "https://www.huffpost.com/entry/amc-movie-theaters-reopening_n_5ea334d5c5b6d376358f3f7d", "urlToImage": null, "publishedAt": "2020-04-24T23:04:41Z", "content": "Although states are slowly starting to allow movie theaters to resume operations against the recommendations of public health experts, AMC Theatres, the largest movie theater chain in the U.S., won’t reopen its locations until at least this summer.\r\n“As we pl… [+2804 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Corinne Reichert", "title": "Disney reshuffles Marvel movie release dates out to 2022 - CNET", "description": "Doctor Strange and Thor have been moved, while Into the Spider-Verse has also been delayed by Sony.", "url": "https://www.cnet.com/news/disney-reshuffles-marvel-movie-release-dates-out-to-2022/", "urlToImage": null, "publishedAt": "2020-04-24T23:02:30Z", "content": "Disney\r\nWalt Disney Studios has moved around a few more release dates following the delay of movies amid COVID-19 lockdowns and quarantines, including two Marvel Cinematic Universe movies. The Doctor Strange sequel has been pushed from 2021 to 2022, Disney sa… [+849 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Julia Alexander", "title": "Sony delays Spider-Man films, forcing Marvel to move Doctor Strange and Thor sequels again - The Verge", "description": "Spider-Man: Into the Spider-Verse and the third movie in the Spider-Man: Homecoming trilogy are getting delayed as Sony messes with its release schedule. As a result, Doctor Strange into the Multiverse and Thor: Love and Thunder have been delayed for a second…", "url": "https://www.theverge.com/2020/4/24/21235283/spider-man-spiderverse-homecoming-delay-release-date-trilogy-marvel-venom-doctor-strange-thor", "urlToImage": null, "publishedAt": "2020-04-24T22:45:42Z", "content": "But Uncharted gets an early release date\r\nPhoto: Sony Pictures Entertainment\r\nLike almost every other studio, Sony is moving around its film schedule because of the novel coronavirus. That means its two biggest Spider-Man movies will be delayed. \r\nThe sequel … [+1662 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By George Stark For Dailymail.com", "title": "Will & Grace stars Debra Messing and Megan Mullally's rumored feud gets addressed - Daily Mail", "description": "Will & Grace creators David Kohan and Max Mutchnick have added fuel to the rumours the co-stars Debra Messing and Meghan Mullally have harbored a secret feud with each other.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8255239/Will-Grace-stars-Debra-Messing-Megan-Mullallys-rumored-feud-gets-addressed.html", "urlToImage": null, "publishedAt": "2020-04-24T22:32:15Z", "content": "Will &amp; Grace creators David Kohan and Max Mutchnick have added fuel to the rumours the co-stars Debra Messing, 51, and Megan Mullally, 61, have harbored a secret feud with each other.\r\nKohan and Mutchnick were asked about the alleged clash in a recent Q&a… [+2240 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "How the Latest Clone Wars Broke Fans' Hearts! (Nerdist News w/ Dan Casey) - Nerdist", "description": "Could this week's heartbreaking episode of The Clone Wars be one of the series best? Dan takes a closer look in today's episode of Nerdist News! What's your ...", "url": "https://www.youtube.com/watch?v=CmU8SWLI97k", "urlToImage": null, "publishedAt": "2020-04-24T22:31:09Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lisa Respers France, CNN", "title": "Alicia Keys debuts powerful anthem in partnership with CNN - CNN", "description": "If you find yourself in tears watching the visual for Alicia Keys' new song, know that the singer had the same reaction the first time she saw it.", "url": "https://www.cnn.com/2020/04/23/entertainment/alicia-keys-cnn-song/index.html", "urlToImage": null, "publishedAt": "2020-04-24T22:05:48Z", "content": null}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Rasha Ali", "title": "New York rapper Fred the Godson dead at 35 from coronavirus complications - USA TODAY", "description": "Bronx rapper, Fred the Godson, died Thursday after revealing he had contracted COVID-19 earlier this month.", "url": "https://www.usatoday.com/story/entertainment/celebrities/2020/04/24/coronavirus-fred-godson-dead-stars-react-today-sad-one/3013999001/", "urlToImage": null, "publishedAt": "2020-04-24T22:03:13Z", "content": "New York rapper Fred the Godson died after being hospitalized for the coronavirus. He was 35 years old.\r\nUSA TODAY\r\nNew York rapper Fred the Godson died Thursday after being diagnosed with COVID-19, his manager confirmed to USA TODAY. He was 35.\r\n\"New York Ci… [+2534 chars]"}, {"source": {"id": null, "name": "Salon.com"}, "author": "Melanie McFarland", "title": "In taut legal drama \"Defending Jacob,\" Chris Evans shows up as the daddy America needs - Salon", "description": "The latest Apple TV+ family drama is a crisply tailored crime and courtroom mystery. It's also an Evans showcase", "url": "https://www.salon.com/2020/04/24/in-taut-legal-drama-defending-jacob-chris-evans-shows-up-as-the-daddy-america-needs/", "urlToImage": null, "publishedAt": "2020-04-24T21:52:17Z", "content": "\"Any man can be a father, but it takes a hot, middle-aged guy with a big job to be a daddy.\" A wise man once said that. Wait — no, my bad, it was Matt Damon. That doesn't make it any less true. The difference between a father and a daddy is significant and mi… [+6609 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Luke Hawker", "title": "Kate and William honour Anzac Day and share resources to celebrate ‘in spirit’ - Express", "description": "KATE, the Duchess of Cambridge and Prince William have paid tribute all the fallen Australian and New Zealand military personnel who lost their life during conflicts around the world for Anzac Day", "url": "https://www.express.co.uk/news/royal/1273651/kate-middleton-news-latest-prince-william-anzac-day-celebrations-australia-new-zealand", "urlToImage": null, "publishedAt": "2020-04-24T21:48:07Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Raechal Shewfelt", "title": "'Tiger King' quiz: Test your knowledge of Joe Exotic and the Netflix series - Yahoo Entertainment", "description": "The bonkers tale of Joe Exotic, the former keeper of a private zoo in Oklahoma, and his vendetta against Carole Baskin covers a lot of ground.", "url": "https://www.yahoo.com/entertainment/tiger-king-quiz-joe-exotic-carole-baskin-netflix-204830022.html", "urlToImage": null, "publishedAt": "2020-04-24T21:34:09Z", "content": "Tiger King: Murder, Mayhem and Madness is the talk of the internet, just when we really needed a distraction.\r\nThe bonkers tale of Joe Exotic, the former keeper of a private zoo in Oklahoma, and his vendetta against big cat conservationist Carole Baskin has n… [+1179 chars]"}, {"source": {"id": null, "name": "Vulture.com"}, "author": "Chris Murphy", "title": "Billy Kimmel’s Third Birthday Party Won Late Night This Week - Vulture", "description": "With surprise guest Spider-Man.", "url": "http://www.vulture.com/2020/04/this-week-in-late-night-billy-kimmel-birthday-tom-holland.html", "urlToImage": null, "publishedAt": "2020-04-24T21:32:46Z", "content": "Whats new, pussycats? Well, the president of the United States of America has suggested that people start injecting disinfectants, and I just started a 1,500-piece puzzle, which seems equally as futile and somehow twice as dangerous. As for late-night televis… [+5681 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Austen Goslin", "title": "Fortnite’s Travis Scott event drew over 12.3 million players at its premiere - Polygon", "description": "Travis Scott’s Astronomical Fortnite event garnered a new record number of concurrent players as 12.3 million people dropped into the game for the premiere.", "url": "https://www.polygon.com/fortnite/2020/4/24/21235017/fortnite-travis-scott-event-concert-astronomical-12-3-million-concurrent-players-record", "urlToImage": null, "publishedAt": "2020-04-24T21:31:04Z", "content": "Travis Scotts in-game Fortnite tour brought a record number of players online. Epic Games announced Friday that over 12.3 million concurrent players joined Scotts in-game concert. \r\nThe event started with a giant version of Scott performing some of his most r… [+969 chars]"}, {"source": {"id": "entertainment-weekly", "name": "Entertainment Weekly"}, "author": null, "title": "Seinfeld, Star Trek actor Gene Dynarski dies at 86 - msnNOW", "description": "Character actor Gene Dynarski, who also appeared on 'Batman' and in Steven Spielberg's 'Duel' and 'Close Encounters of the Third Kind,' among other projects, had died at 86.", "url": "https://ew.com/tv/gene-dynarski-dead-seinfeld-star-trek-actor-obit/", "urlToImage": null, "publishedAt": "2020-04-24T21:21:00Z", "content": "© Joey Delvalle/NBCU Photo Bank/NBCUniversal via Getty Images\r\n Character actor Gene Dynarski, who also appeared on 'Batman' and in Steven Spielberg's 'Duel' and 'Close Encounters of the Third Kind,' among other projects, had died at 86.\r\nGene Dynarski, a cha… [+15129 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Tasha Robinson", "title": "Bad Education review: new HBO movie gives Hugh Jackman a chance to squirm - Polygon", "description": "Hugh Jackman and Allison Janney star in HBO’s true crime drama Bad Education, about a Long Island student who uncovers a massive embezzlement scandal in her school district. The best new movie to watch this week at home is on HBO GO and HBO NOW right now.", "url": "https://www.polygon.com/2020/4/24/21234625/bad-education-review-hbo-hugh-jackman-allison-janney-based-on-a-true-story", "urlToImage": null, "publishedAt": "2020-04-24T21:01:56Z", "content": "The inciting incident in Cory Finleys sharp, entertaining HBO drama Bad Education may strike some viewers as far too on-the-nose. When student journalist Rachel (Miracle Workers Geraldine Viswanathan) drops by the office of Long Island school superintendent F… [+6079 chars]"}, {"source": {"id": null, "name": "Slashfilm.com"}, "author": "Chris Evangelista", "title": "The Best TV Shows & Movies Coming to Netflix in May 2020 - /FILM", "description": "Check out the best TV shows and movies coming to Netflix in May 2020, including Uncut Gems, Sinister, Back to the Future, and more.", "url": "https://www.slashfilm.com/movies-coming-to-netflix-in-may-2020/", "urlToImage": null, "publishedAt": "2020-04-24T21:00:41Z", "content": "best TV shows and movies coming to Netflix in May 2020.\r\nUncut Gems\r\nThis is how you win: by watching Uncut Gems on Netflix. Adam Sandler turns in one of his best performances as a Diamond District salesman with an obsessive gambling problem. Sandler’s addict… [+18355 chars]"}, {"source": {"id": null, "name": "Blabbermouth.net"}, "author": "Blabbermouth", "title": "This Year's Louder Than Life Festival Is Officially Canceled - BLABBERMOUTH.NET", "description": "This year's Louder Than Life festival, which was scheduled to take place in September in Louisville, Kentucky, has been officially canceled due to the COVID-19 pandemic.\n\n\"Even though the festivals...", "url": "https://www.blabbermouth.net/news/this-years-louder-than-life-festival-is-officially-canceled/", "urlToImage": null, "publishedAt": "2020-04-24T20:56:39Z", "content": "This year's Louder Than Life festival, which was scheduled to take place in September in Louisville, Kentucky, has been officially canceled due to the COVID-19 pandemic.\r\n\"Even though the festivals are not until September, the advanced planning realities of p… [+2702 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Prince William Won't Watch 'Tiger King' - ET Canada", "description": "After Prince William said why he won't watch \"Tiger King\", Sangita Patel and Graeme O'Neil react to his family paying tribute to frontline workers during \"ET...", "url": "https://www.youtube.com/watch?v=9lsadkoCXYA", "urlToImage": null, "publishedAt": "2020-04-24T20:52:38Z", "content": "After Prince William said why he won't watch \"Tiger King\", Sangita Patel and Graeme O'Neil react to his family paying tribute to frontline workers during \"ET Canada Live\".\r\nSUBSCRIBE to our channel:\r\nhttps://www.youtube.com/user/ETCanada...\r\nFOLLOW us here:\r\n… [+181 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Louis Casiano", "title": "Eminem sends 'Mom’s Spaghetti' pasta to Detroit health care workers on coronavirus frontline - Fox News", "description": "Health care workers in Detriot \"lost themselves\" in spaghetti courtesy of rapper Eminem, who sent the pasta to those battling the coronavirus on the front lines.", "url": "https://www.foxnews.com/entertainment/eminem-sends-pasta-detroit-health-care-workers-coronavirus-frontline", "urlToImage": null, "publishedAt": "2020-04-24T20:16:31Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox. Sign up here.\r\nHealth care workers in Detriot \"lost themselves\" in spaghetti courtesy of rapperEminem, who sent the pasta to those battling the coronavirus on the front lines.\r\nThe… [+1088 chars]"}, {"source": {"id": null, "name": "Cosmopolitan.com"}, "author": "Starr Bowenbank", "title": "Uh, Scott Disick Liked a Picture of Him and Kourtney Kardashian Kissing on Instagram - Cosmopolitan.com", "description": "I need answers.", "url": "https://www.cosmopolitan.com/entertainment/celebs/a32270822/scott-disick-likes-kourtney-kardashian-kissing-instagram-picture/", "urlToImage": null, "publishedAt": "2020-04-24T20:05:00Z", "content": "<ul><li>Scott Disick Liked a picture on Instagram of him and Kourtney Kardashian taken back when they were dating. </li><li>In the photos, Scott is kissing Kourtney and grabbing her butt.</li></ul><ol></ol>\r\nAs if things weren’t already suuuper weird in Karda… [+1351 chars]"}, {"source": {"id": null, "name": "Xxlmag.com"}, "author": "awoods", "title": "Lil Uzi Vert Says He's Dropping a New Song Today - XXLMAG.COM", "description": "Details here.", "url": "https://www.xxlmag.com/news/2020/04/lil-uzi-vert-new-song-2/", "urlToImage": null, "publishedAt": "2020-04-24T19:35:00Z", "content": "Lil Uzi Vert fans could be in for a treat, as the rapper has doubled down on his statement about releasing new music.\r\nUzi wrote on Twitter on Friday (April 24) that he is dropping a new song today. In a tweet to the Philadelphia rapper, a fan asked for advic… [+1347 chars]"}, {"source": {"id": null, "name": "Wesh.com"}, "author": null, "title": "Universal Orlando to auto-enroll workers in Florida’s unemployment system - WESH 2 Orlando", "description": "Universal Orlando said Friday that it will auto-enroll its furloughed workers into Florida’s unemployment system.", "url": "https://www.wesh.com/article/universal-orlando-auto-enroll-unemployment/32270929", "urlToImage": null, "publishedAt": "2020-04-24T19:34:07Z", "content": "ORLANDO, Fla. —Universal Orlando said Friday that it will auto-enroll its furloughed workers into Floridas unemployment system. \r\nThe company is furloughing part-time hourly workers beginning on May 3. \r\nBy working with the state to auto-enroll the furloughed… [+579 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Gary Dinges", "title": "Billy Porter speaks 'truth to power' in cover of Buffalo Springfield's 'For What It's Worth' - USA TODAY", "description": "A frequent critic of President Donald Trump, Porter says he was inspired by artists who recorded songs during times of conflict in U.S. history.", "url": "https://www.usatoday.com/story/entertainment/music/2020/04/24/billy-porter-covers-stephen-stills-classic-for-what-its-worth/5155035002/", "urlToImage": null, "publishedAt": "2020-04-24T19:32:25Z", "content": "Music producers battle with the Verzuz series as fans party along \r\nAP Entertainment\r\nBilly Porter is channeling the past by bringing you a message from the future.\r\nThe singer, actor and Broadway performer has covered Stephen Stills beloved Buffalo Springfie… [+2809 chars]"}, {"source": {"id": null, "name": "Eonline.com"}, "author": "Jess Cohen", "title": "Gigi Hadid Thanks Taylor Swift and Joe Alwyn for Birthday Flowers - E! NEWS", "description": "Gigi Hadid took to her Instagram Story to thank her pals Taylor Swift and Joe Alwyn for the birthday surprise. Click here to see the flowers!", "url": "https://www.eonline.com/news/1144590/gigi-hadid-thanks-taylor-swift-and-joe-alwyn-for-sending-beautiful-birthday-flowers", "urlToImage": null, "publishedAt": "2020-04-24T19:31:55Z", "content": "Gorgeous!\r\nGigi Hadid received a number of special deliveries for her 25th birthday on Thursday, including flowers from her loved ones. Taylor Swift, Joe Alwyn and Kendall Jenner were among the star-studded pals who sent the supermodel flowers on her special … [+763 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Denise Petski", "title": "Victoria Justice To Host Nickelodeon’s Rescheduled Kids’ Choice Awards, With Dwayne Johnson, Ariana Grande & More - Deadline", "description": "Nickelodeon is moving forward with its Kids’ Choice Awards with a new date, and with Victoria Justice as host. Initially scheduled for March 22, the awards ceremony was postponed indefinitely due to the coronavirus pandemic. The newly titled virtually-produce…", "url": "https://deadline.com/2020/04/victoria-justice-to-host-nickelodeons-rescheduled-kids-choice-awards-with-dwayne-johnson-ariana-grande-more-1202917237/", "urlToImage": null, "publishedAt": "2020-04-24T19:12:09Z", "content": "Nickelodeon is moving forward with its Kids’ Choice Awards with a new date, and with Victoria Justice as host. Initially scheduled for March 22, the awards ceremony was postponed indefinitely due to the coronavirus pandemic. The newly titled virtually-produce… [+1462 chars]"}, {"source": {"id": null, "name": "Billboard.com"}, "author": "Gil Kaufman", "title": "Here's What Mick Jagger Has to Say to Paul McCartney's Beatles-vs.-Stones Thoughts - Billboard", "description": "", "url": "https://www.billboard.com/articles/columns/rock/9365433/mick-jagger-interview-living-in-a-ghost-town-origin-beatles-vs-rolling-stones", "urlToImage": null, "publishedAt": "2020-04-24T18:44:05Z", "content": "Sometimes you accidentally write a song that perfectly fits the moment. That's basically what Mick Jagger told Apple Music's Zane Lowe on Friday morning (April 24), in a chat that included the origin story of the eerily prescient new Rolling Stones single \"Li… [+3640 chars]"}, {"source": {"id": null, "name": "Today.com"}, "author": "Alexander Kacala", "title": "Andy Cohen says he couldn't donate plasma because he is gay - TODAY", "description": "Andy Cohen is speaking out about what he says is a discriminatory practice when it comes to LGBTQ people being able to donate blood and convalescent plasma.", "url": "https://www.today.com/health/andy-cohen-says-he-couldn-t-donate-plasma-because-he-t179881", "urlToImage": null, "publishedAt": "2020-04-24T18:16:37Z", "content": "Andy Cohen is speaking out about what he says is a discriminatory practice happening at the federal level when it comes to LGBTQ people being able to donate blood and convalescent plasma.\r\nThe 51-year-old talk show host tested positive for the coronavirus in … [+3733 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chloe Melas, CNN", "title": "Richard Gere and his wife welcome baby boy - CNN", "description": "Richard Gere and his wife, Alejandra Silva, have welcomed their second son, a rep for the actor confirms to CNN.", "url": "https://www.cnn.com/2020/04/24/entertainment/richard-gere-baby-boy-trnd/index.html", "urlToImage": null, "publishedAt": "2020-04-24T18:14:54Z", "content": "(CNN)Richard Gere and his wife, Alejandra Silva, have welcomed their second son, a rep for the actor confirms to CNN.\r\nGere, 70 and Silva, 37, already have 14-month-old Alexander. Gere also has a 20-year-old son from a previous marriage. Silva has a son with … [+419 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Jenna Amatulli", "title": "New Kids On The Block Gather Friends In Star-Studded 'House Party' Video For Charity - HuffPost", "description": "The band released a song with a celebrity-packed video and merchandise for fans to enjoy, with all proceeds going to No Kid Hungry.", "url": "https://www.huffpost.com/entry/new-kids-on-the-block-coronavirus_n_5ea306d4c5b669fd89240092", "urlToImage": null, "publishedAt": "2020-04-24T17:52:33Z", "content": "New Kids on the Block are clearly hangin’ tough during the current global health crisis, as they managed to still drop new music and donate to charity in the process.\r\nThe band released a song titled “House Party” with a star-studded music video on Thursday, … [+1396 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Carly Mallenbaum", "title": "Ellen Pompeo explains her old Harvey Weinstein comments that have come under fire - USA TODAY", "description": "Ellen Pompeo took to Twitter to clarify controversial comments she made in a 2018 panel about Harvey Weinstein and victims of sexual harassment.", "url": "https://www.usatoday.com/story/entertainment/celebrities/2020/04/23/ellen-pompeo-clarifies-controversial-harvey-weinstein-comments/3015938001/", "urlToImage": null, "publishedAt": "2020-04-24T17:27:59Z", "content": "Formerly powerful movie mogul Harvey Weinstein was indicted in May 2018 and charged with five sex crimes. He was found guilty on two charges.\r\nUSA TODAY\r\nEllen Pompeo is taking to Twitter to clarify Harvey Weinstein comments she made a couple of years ago.\r\nT… [+4853 chars]"}, {"source": {"id": null, "name": "Townandcountrymag.com"}, "author": "Chloe Foussianes", "title": "See How Queen Elizabeth's Style Has Evolved Since She Was Just a Princess - Yahoo Lifestyle", "description": "The British monarch's best dresses (and hats!) through the decades.", "url": "https://www.townandcountrymag.com/style/fashion-trends/g24676517/queen-elizabeths-style-evolution/", "urlToImage": null, "publishedAt": "2020-04-24T17:14:00Z", "content": "It's not easy to make fashion decisions when you're in the spotlight. Luckily, Queen Elizabeth II has had several decades of practice. From her first formal dresses as a child, to her 70's and 80's gowns, to today's coats and hats, we've rounded up the best o… [+53 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "90 Day Fiance: Big Ed NEEDS Answers From Rose Before He Commits - Entertainment Tonight", "description": "Big Ed and Rose discuss their future over a romantic dinner in this exclusive clip from '90 Day Fiance: Before the 90 Days,' airing Sunday on TLC. Exclusives...", "url": "https://www.youtube.com/watch?v=NmB6RGE8jpk", "urlToImage": null, "publishedAt": "2020-04-24T17:00:13Z", "content": "Big Ed and Rose discuss their future over a romantic dinner in this exclusive clip from '90 Day Fiance: Before the 90 Days,' airing Sunday on TLC.\r\nExclusives from #ETonline :https://www.youtube.com/playlist?list..."}, {"source": {"id": null, "name": "Avclub.com"}, "author": "Erik Adams", "title": "Beastie Boys Story is no sure shot - The A.V. Club", "description": "Now here's a little story we've got to tell about three bad brothers you know so well.", "url": "https://film.avclub.com/beastie-boys-story-is-no-sure-shot-1843043901", "urlToImage": null, "publishedAt": "2020-04-24T17:00:00Z", "content": "What if they made a Beastie Boys movie and it wasnt any fun? If there were none of the rambunctious spirit that defined the New York trios music even after they abandoned the party-boy put-ons of License To Ill? If the surviving band members recollections of … [+5247 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Ron Dicker", "title": "Kaley Cuoco Is Binge-Watching Sitcom Couple She Was Told To Avoid - HuffPost", "description": "\"The Big Bang Theory\" alum is catching up on her TV during the coronavirus pandemic.", "url": "https://www.huffpost.com/entry/kaley-cuoco-cheers-conan_n_5ea2f8e3c5b6f9639813bfba", "urlToImage": null, "publishedAt": "2020-04-24T16:31:23Z", "content": "Kaley Cuoco is now binge-watching the sitcom couple she and her costar, Johnny Galecki, were told not to emulate on “The Big Bang Theory.”\r\nThat would be Sam and Diane, the dumb jock and the snooty intellectual brilliantly played by Ted Danson and Shelley Lon… [+886 chars]"}, {"source": {"id": null, "name": "Cinemablend.com"}, "author": "Adrienne Jones", "title": "Parks And Recreation Is Coming Back With Amy Poehler, Chris Pratt And More, But There’s A Catch - CinemaBlend", "description": "The Parks and Recreation gang is coming back!", "url": "https://www.cinemablend.com/television/2495057/parks-and-recreation-is-coming-back-with-amy-poehler-chris-pratt-and-more-but-theres-a-catch", "urlToImage": null, "publishedAt": "2020-04-24T15:37:08Z", "content": "While NBC's workplace comedy Parks and Recreation was a bit of an underdog when it started (coming on the heels of the similarly styled hit The Office), after a bit of retooling for the second season it became a critical and audience favorite, lasting seven s… [+3697 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Dino-Ray Ramos", "title": "Western Thriller ‘True History Of Kelly Gang’ And ’60s Coming-Of-Age Drama ‘To The Stars’ Make Debuts – Specialty Streaming Preview - Deadline", "description": "The story of the notorious outlaw Ned Kelly is dropping on digital and on-demand today with the Justin Kurzel-directed True History of the Kelly Gang starring George MacKay (1917, Captain Fantastic), Russell Crowe (Boy Erased, The Loudest Voice) and Nicholas …", "url": "https://deadline.com/2020/04/true-history-of-kelly-gang-russell-crowe-justin-kurzel-to-the-stars-martha-stephens-specialty-streaming-preview-1202916073/", "urlToImage": null, "publishedAt": "2020-04-24T14:28:13Z", "content": "The story of the notorious outlaw Ned Kelly is dropping on digital and on-demand today with the Justin Kurzel-directed True History of the Kelly Gang starring George MacKay (1917, Captain Fantastic), Russell Crowe (Boy Erased, The Loudest Voice) and Nicholas … [+5477 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Brian Lowry, CNN", "title": "'Avengers: Endgame' premiered a year ago. A whole lot has changed since then - CNN", "description": "The Marvel blockbuster premiered one year ago, on April 26, 2019, although just imagining people crowding into theaters, it surely feels a whole lot longer. The movie went on to amass $2.8 billion worldwide, surpassing the benchmark set by \"Avatar.\"", "url": "https://www.cnn.com/2020/04/24/entertainment/avengers-endgame-one-year-later/index.html", "urlToImage": null, "publishedAt": "2020-04-24T13:55:01Z", "content": "(CNN)With what felt like a snap, \"Avengers: Endgame\" shattered opening-weekend box-office records, earning $357 million in North America -- roughly $100 million more than its predecessor. The movie went on to amass $2.8 billion worldwide, surpassing the bench… [+3766 chars]"}, {"source": {"id": null, "name": "Pagesix.com"}, "author": "Eileen Reslen", "title": "Alex Rodriguez suggests 'drive-through wedding' with Jennifer Lopez - Page Six", "description": "Love don’t cost a thing.", "url": "https://pagesix.com/2020/04/24/alex-rodriguez-suggests-drive-through-wedding-with-jennifer-lopez/", "urlToImage": null, "publishedAt": "2020-04-24T13:47:40Z", "content": "Love don’t have to cost a thing.\r\nAlex Rodriguez has confirmed that his wedding to Jennifer Lopez which was supposed to take place this summer has been postponed due to the coronavirus pandemic, but says he is now open to “cheaper” and socially-distanced alte… [+972 chars]"}, {"source": {"id": null, "name": "Newser.com"}, "author": "Arden Dier", "title": "Former Right-Hand Man: Wintour Gave Me 'Scars' - Newser", "description": "Andre Leon Talley tells of 'huge emotional and psychological scars' in new book", "url": "https://www.newser.com/story/290013/former-right-hand-man-wintour-gave-me-scars.html", "urlToImage": null, "publishedAt": "2020-04-24T13:25:00Z", "content": "(Newser)\r\nIt was the 2003 novel The Devil Wears Prada, written by a former assistant of Anna Wintour, that cast the Vogue editor-in-chief as a nightmare. Almost two decades later, a new book from her former right-hand man reportedly confirms some of the narra… [+1228 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Nikki Bella Is Accused of Playing Favorites: \"Total Bellas\" Recap (S5, Ep4) | E! - E! Entertainment", "description": "JJ feels Nikki is showing her true colors when it comes to his daughters, Brie's car gets burglarized and mama Bella doesn't want Artem in the family photo. ...", "url": "https://www.youtube.com/watch?v=y66FNpb4L_Q", "urlToImage": null, "publishedAt": "2020-04-24T12:59:58Z", "content": "JJ feels Nikki is showing her true colors when it comes to his daughters, Brie's car gets burglarized and mama Bella doesn't want Artem in the family photo. Watch on \"Total Bellas!\"\r\n#TotalBellas#EEntertainment#BellaTwins#JJGarcia#NikkiBella#BrieBella#ArtemCh… [+1398 chars]"}, {"source": {"id": null, "name": "Xxlmag.com"}, "author": "xxlstaff", "title": "New Juice Wrld and J. Cole Song on the Way? - XXLMAG.COM", "description": "Watch here.", "url": "https://www.xxlmag.com/news/2020/04/juice-wrld-j-cole-song/", "urlToImage": null, "publishedAt": "2020-04-24T12:59:00Z", "content": "Last night marked two important moments in Juice Wrld's posthumous career: the release of an official posthumous single and the possibility that a Juice and J. Cole collaboration exists.\r\nJuice's estate premiered the Nick Mira and Charlie Handsome-produced tr… [+1601 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Faith Karimi, CNN", "title": "At these movie theaters, the shows have gone on despite the coronavirus pandemic - CNN", "description": "In some places, drive-in theaters have remained open even with restrictions on nonessential services.", "url": "https://www.cnn.com/2020/04/24/us/coronavirus-drive-in-movie-theater-trnd/index.html", "urlToImage": null, "publishedAt": "2020-04-24T09:44:48Z", "content": "(CNN)As movie theater screens fade to black nationwide during the coronavirus pandemic, people sheltering in place are turning to drive-ins for much-needed entertainment. \r\nPeople once drawn to the glare of regular movie theaters are finding themselves at dri… [+2555 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Guillermo & Russell Wilson Prep Joe Burrow for NFL Draft - Sponsored by Bose - Jimmy Kimmel Live", "description": "If you watched the NFL Draft on ABC, you know it was a big night for NFL hopeful Joe Burrow. Getting drafted from home is a tricky thing though, so to prep f...", "url": "https://www.youtube.com/watch?v=qr_TDbXsjPM", "urlToImage": null, "publishedAt": "2020-04-24T05:30:31Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Disney Gallery: Star Wars The Mandalorian - Official Trailer (Jon Favreau, Taika Waititi) - IGN", "description": "In Disney Gallery: The Mandalorian, Executive Producer Jon Favreau invites the cast and crew to share an unprecedented look at the making of the series which...", "url": "https://www.youtube.com/watch?v=f_miMhjdvvs", "urlToImage": null, "publishedAt": "2020-04-23T20:30:02Z", "content": "In Disney Gallery: The Mandalorian, Executive Producer Jon Favreau invites the cast and crew to share an unprecedented look at the making of the series which quickly became a pop culture phenomenon after premiering in November.\r\nDebuting on the day that a wor… [+406 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The Masked Singer Season 3 | Episode 12 Spoilers, Clues & Guesses - CinemaBlend", "description": "The Masked Singer has captivated America, and it isn’t hard to see why. The elaborate costumes, the performances, and the big mystery behind the identities o...", "url": "https://www.youtube.com/watch?v=Tp_OTEMzpMI", "urlToImage": null, "publishedAt": "2020-04-23T19:26:16Z", "content": null}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Gael Fashingbauer Cooper", "title": "YouTube turns 15 today. Watch the first video it posted - CNET", "description": "One of the founders visited the zoo. Let's just say the video site's content has improved a lot since 2005.", "url": "https://www.cnet.com/news/youtube-turns-15-today-watch-the-first-video-it-posted/", "urlToImage": null, "publishedAt": "2020-04-23T19:02:24Z", "content": "The clip is just 18 seconds long, but 15 years ago, it kicked off an online video revolution.  Thursday marks the 15th anniversary of the first-ever YouTube video, which shows company co-founder Jawed Karim standing in front of an elephant enclosure at the Sa… [+1519 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Joan E. Solsman", "title": "HBO Max: Launch date, prices, shows and movies to expect - CNET", "description": "HBO Max will launch May 27 with HBO's programs and movies, licensed hits and exclusive originals (at least, the ones that aren't delayed by coronavirus).", "url": "https://www.cnet.com/news/hbo-max-launch-date-may-27-prices-shows-movies-free-trials-promos-friends/", "urlToImage": null, "publishedAt": "2020-04-23T17:56:54Z", "content": "HBO Max promises a lot.\r\nScreenshot by CNET\r\nHBO Max, the HBO-anchored streaming service finally announced to be launching May 27, has much in common with its competitors in the streaming wars like Disney Plus and Peacock, not to mention Netflix. Like those, … [+18823 chars]"}, {"source": {"id": null, "name": "Qz.com"}, "author": "Justin Rohrlich, Max de Haldevang", "title": "Inside the hunt for the stolen Van Gogh - Quartz", "description": "The art world's most notorious cops and robbers discuss the recent theft, and what happens next.", "url": "https://qz.com/1841045/inside-the-hunt-for-the-stolen-van-gogh/", "urlToImage": null, "publishedAt": "2020-04-23T11:07:58Z", "content": "When a thief stole a multimillion-dollar painting by Vincent van Gogh from a small museum in the Netherlands last month, Octave Durham almost immediately found himself a person of interest.\r\nIts not a coincidence, because most of the time I did it, Durham, wh… [+15988 chars]"}]}