{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Sky.com"}, "author": "Tom Gillespie", "title": "Kanye West: Hip hop star and fashion designer becomes a billionaire - Sky News", "description": "The rapper, who has long coveted the status, has claimed he is worth more after his net worth was valued at $1.3bn (£1.05bn).", "url": "https://news.sky.com/story/kanye-west-hip-hop-star-and-fashion-designer-becomes-a-billionaire-11978510", "urlToImage": null, "publishedAt": "2020-04-25T03:39:04Z", "content": null}, {"source": {"id": null, "name": "Vulture.com"}, "author": "Halle Kiefer", "title": "Andrew Lloyd Webber’s Phantom of the Opera Sequel Love Never Dies Is Here, Inside Your Living Room - Vulture", "description": "It never made Broadway, but hopefully it will make your weekend.", "url": "https://www.vulture.com/2020/04/phantom-of-the-opera-sequel-love-never-dies-free-to-stream.html", "urlToImage": null, "publishedAt": "2020-04-25T02:40:33Z", "content": "In case you were unaware, Andrew Lloyd Webbers smash hit musical The Phantom of the Opera has a sequel. Love Never Dies, set ten years after the events of Phantom and located in 1907 Coney Island, made its West End debut in 2010, where it received, to put it … [+1123 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Jon Caramanica", "title": "Fred the Godson, Nimble New York Rapper, Dies at 41 - The New York Times", "description": "The Bronx musician was a forceful presence on mixtapes, filling his rhymes with clever punch lines.", "url": "https://www.nytimes.com/2020/04/24/arts/music/fred-the-godson-dead-coronavirus.html", "urlToImage": null, "publishedAt": "2020-04-25T02:39:03Z", "content": "This obituary is part of a series about people who have died in the coronavirus pandemic. Read about others here.\r\nFred the Godson, who for more than a decade was a respected figure in New York hip-hop, an understated master of wordplay with a signature flow,… [+2831 chars]"}, {"source": {"id": null, "name": "Cbssports.com"}, "author": "Brent Brookhouse", "title": "WWE SmackDown results, recap, grades: Awkward Triple H celebration brings down an otherwise solid show - CBSSports.com", "description": "A fairly solid edition of SmackDown ended on a bad note after an awkward celebration of Triple H's 25 years in WWE", "url": "https://www.cbssports.com/wwe/news/wwe-smackdown-results-recap-grades-awkward-triple-h-celebration-brings-down-an-otherwise-solid-show/live/", "urlToImage": null, "publishedAt": "2020-04-25T02:18:00Z", "content": "With WWE continuing to build toward the May 10 Money in the Bank pay-per-view, SmackDown was a fairly solid show with good in-ring action. Unfortunately, the show ended on a bad note with a \"celebration\" of Triple H's 25 years in WWE. Joined by Shawn Michaels… [+6668 chars]"}, {"source": {"id": null, "name": "Wesh.com"}, "author": "National Desk Staff", "title": "Disneyland, Disney World may not reopen until 2021, independent financial report says - WESH Orlando", "description": "Disney theme parks may stay closed for the rest of this year, according to an analyst.", "url": "https://www.wesh.com/article/disneyland-disney-world-may-not-reopen-until-2021-independent-financial-report-says/32273537", "urlToImage": null, "publishedAt": "2020-04-25T02:14:00Z", "content": "Disney theme parks may stay closed for the rest of this year.\r\nThats the newest advice from financial firm UBS for Disneyland in California and Walt Disney World in Florida.\r\nUBS said it now expects the parks to open Jan. 1 at 50% capacity for the first six m… [+1157 chars]"}, {"source": {"id": null, "name": "Tvline.com"}, "author": "Teresa Timmer", "title": "'Drag Race' Recap: Season 12 Episode 9 — Political Debate, Elimination - Bulletin Mail", "description": "Advertisement RELATED STORIES Who would have expected that a false presidential debate between seven queens would be a little less bizarre and more bourgeois than the real talk we’ve been watching on TV in recent years? The remaining contestants became politi…", "url": "https://tvline.com/2020/04/24/drag-race-recap-season-12-episode-9-widow-vondu-eliminated/", "urlToImage": null, "publishedAt": "2020-04-25T02:03:40Z", "content": "Who would have expected that a false presidential debate between seven queens would be a little less bizarre and more bourgeois than the real talk we’ve been watching on TV in recent years?\r\nThe remaining contestants became politicians at Friday’s Drag Race, … [+3893 chars]"}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Lizzie Wells", "title": "'KUWTK': Some Fans Urged Scott Disick to 'Go to Therapy' to Deal With His Insecurities - Showbiz Cheat Sheet", "description": "Scott Disick has seemed to go on a true redemption arc as of late, so much so some fans are speculating he might benefit from some help.", "url": "https://www.cheatsheet.com/entertainment/kuwtk-some-fans-urged-scott-disick-to-go-to-therapy-to-deal-with-his-insecurities.html/", "urlToImage": null, "publishedAt": "2020-04-25T01:54:41Z", "content": "Several years ago, Scott Disick appeared to have it all. He was in a relationship with one of the world’s most beautiful, and rich, women, Kourtney Kardashian. They had a lovely family, and a huge home. However, like many of us, Disick seems prone to self- sa… [+3754 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Carly Johnson For Dailymail.com", "title": "Vanderpump Rules star Kristen Doute reveals she is dating 'Mystery Man' Alex Menache - Daily Mail", "description": "Kristen Doute, 36, has officially moved on from Carter and is currently in the throws of romance with a man by the name of Alex Menache, as confirmed by UsWeekly on Friday.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8255457/Vanderpump-Rules-star-Kristen-Doute-reveals-dating-Mystery-Man-Alex-Menache.html", "urlToImage": null, "publishedAt": "2020-04-25T01:03:23Z", "content": "Her on-and-off relationship with Brian Carter has been the focal point of the current season of Vanderpump Rules.\r\nBut series regular Kristen Doute, 36, has officially moved on from Carter and is currently in the throws of romance with a man by the name of Al… [+3495 chars]"}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Connie Liou", "title": "What Happened to Izzy After the 'Little Fires Everywhere' Finale? The Character's Ending Could Pave the Way for a Spinoff - Showbiz Cheat Sheet", "description": "What happened to Izzy Richardson after the 'Little Fires Everywhere' finale? The showrunner discussed the character's ending.", "url": "https://www.cheatsheet.com/entertainment/izzy-little-fires-everywhere-finale-what-happened-spinoff.html/", "urlToImage": null, "publishedAt": "2020-04-25T00:56:35Z", "content": "On April 22, Little Fires Everywhereended its eight-episode run on Hulu. As expected, the finale — titled Find a Way — wrapped where the series premiere began. Viewers finally received answers, including who started the fire at the Richardson household. But o… [+6302 chars]"}, {"source": {"id": null, "name": "Cinemablend.com"}, "author": "Laura Hurley", "title": "Blue Bloods Actor Nick Cordero's Wife Says He Should Have Woken From Coma By Now - CinemaBlend", "description": "Amanda Kloots provides an update on her husband's condition.", "url": "https://www.cinemablend.com/television/2495108/blue-bloods-actor-nick-corderos-wife-says-he-should-have-woken-from-coma-by-now", "urlToImage": null, "publishedAt": "2020-04-25T00:23:14Z", "content": "Blue Bloods actor and popular TV guest star Nick Cordero has been fighting for his life after a diagnosis with COVID-19, and his wife Amanda Kloots has been providing regular updates on his condition. Her updates have provided a window into the illness as wel… [+2833 chars]"}, {"source": {"id": "buzzfeed", "name": "Buzzfeed"}, "author": "Brian Galindo", "title": "New Kids On The Block Dropped A New Music Video And It Has Cameos From Carrie Underwood, Nicole Scherzinger, And Mark Wahlberg - BuzzFeed", "description": "And it's all for a good cause!", "url": "https://www.buzzfeed.com/briangalindo/new-kids-on-the-blocks-dropped-a-new-music-video-and-it-has", "urlToImage": null, "publishedAt": "2020-04-25T00:22:40Z", "content": "Sony Music\r\nWhich you should do, 'cause it's great self-care!!!"}, {"source": {"id": null, "name": "Npr.org"}, "author": "Andrew Limbong", "title": "Fans Struggle With Ticketmaster, Live Nation And AEG Coronavirus Refund Policies - NPR", "description": "Entertainment companies Live Nation and AEG have modified their refund policies for postponed events. Getting money back would depend on whether a concert or a game has a firm rescheduled date.", "url": "https://www.npr.org/2020/04/24/844301434/why-ticket-holders-are-struggling-to-get-refunds-for-concerts-and-live-events", "urlToImage": null, "publishedAt": "2020-04-25T00:07:34Z", "content": "The U.S. leg of Weezer's Hella Mega tour with Green Day and Fall Out Boy has yet to be canceled due to the coronavirus, leaving fans who purchased tickets in limbo when it comes to refunds.\r\nAngela Weiss/AFP via Getty Images\r\nUpdatedat 4:21 p.m. ET.\r\nThe coro… [+4600 chars]"}, {"source": {"id": null, "name": "Vulture.com"}, "author": "Rebecca Alter", "title": "Florence Pugh and Chris Pine to Star in Olivia Wilde’s New Thriller - Vulture", "description": "Flossie Rose will play a 1950s housewife.", "url": "http://www.vulture.com/2020/04/florence-pugh-olivia-wildes-new-movies.html", "urlToImage": null, "publishedAt": "2020-04-24T23:52:21Z", "content": "Olivia Wilde seems to have a filmmaking M.O., and were all benefiting from it. Step one: She identifies a beloved, trendy breakout star in an acclaimed A24 movie. Step two: She casts them in a complex leading role worthy of their considerable talents. Step th… [+1019 chars]"}, {"source": {"id": null, "name": "Consequenceofsound.net"}, "author": "Alex Young", "title": "Watch Post Malone Perform Nirvana Covers with Travis Barker - Consequence of Sound", "description": "Post Malone delivered a rousing set of Nirvana covers as part of a YouTube livestream benefiting COVID-19 relief. Watch the replay here.", "url": "https://consequenceofsound.net/2020/04/post-malone-nirvana-covers-video/", "urlToImage": null, "publishedAt": "2020-04-24T23:42:06Z", "content": "Here we are now, entertain us: Post Malone delivered a rousing set of Nirvana covers as part of a YouTube livestream benefiting COVID-19 relief. Watch the full replay below\r\nPlaying live from his home in Salt Lake City on Friday, Posty ripped through a varied… [+1257 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "David Moye", "title": "Tom Hanks Gives Typewriter To Boy Bullied Because His Name Is Corona - HuffPost", "description": "The actor told Corona DeVries, 8, “I thought this typewriter would suit you... Ask a grown-up how it works. And use it to write me back.”", "url": "https://www.huffpost.com/entry/tom-hanks-corona-typewriter-corona-devries_n_5ea35af6c5b669fd8924e00a", "urlToImage": null, "publishedAt": "2020-04-24T23:21:58Z", "content": "An 8-year-old boy named Corona has got a friend in Tom Hanks  as well as a gift stemming from the actors offbeat hobby of collecting typewriters.\r\nIt all started when Corona De Vries of Queensland, Australia, sent a get-well letter after the actor, who he kne… [+1551 chars]"}, {"source": {"id": null, "name": "Salon.com"}, "author": "Annie Zaleski", "title": "\"Beastie Boys Story\" film pays bittersweet tribute to the trio's iconic career and friendship - Salon", "description": "The absence of Adam Yauch renders lively storytelling by Adam Horowitz and Mike Diamond all the more poignant", "url": "https://www.salon.com/2020/04/24/beastie-boys-story-review-apple-tv-plus/", "urlToImage": null, "publishedAt": "2020-04-24T23:10:46Z", "content": "During their decades-long career, The Beastie Boys never stayed in one musical lane for long. Although the trio became multiplatinum superstars thanks to hip-hop that drew on rock 'n' roll as much as Run-DMC, they very quickly moved on and embraced other thin… [+7288 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Marina Fang", "title": "The Largest US Movie Theater Chain Won't Reopen Even If States Say It Can - HuffPost", "description": "Some states are allowing theaters to resume operations, even though public health experts advise against it. But there aren't even any new movies to show.", "url": "https://www.huffpost.com/entry/amc-movie-theaters-reopening_n_5ea334d5c5b6d376358f3f7d", "urlToImage": null, "publishedAt": "2020-04-24T23:04:41Z", "content": "Although states are slowly starting to allow movie theaters to resume operations against the recommendations of public health experts, AMC Theatres, the largest movie theater chain in the U.S., won’t reopen its locations until at least this summer.\r\n“As we pl… [+2804 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Corinne Reichert", "title": "Disney reshuffles Marvel movie release dates out to 2022 - CNET", "description": "Doctor Strange and Thor have been moved, while Into the Spider-Verse has also been delayed by Sony.", "url": "https://www.cnet.com/news/disney-reshuffles-marvel-movie-release-dates-out-to-2022/", "urlToImage": null, "publishedAt": "2020-04-24T23:02:30Z", "content": "Disney\r\nWalt Disney Studios has moved around a few more release dates following the delay of movies amid COVID-19 lockdowns and quarantines, including two Marvel Cinematic Universe movies. The Doctor Strange sequel has been pushed from 2021 to 2022, Disney sa… [+849 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Fox News", "title": "Sheriff denies police cover-up of 'Tiger King' star's missing husband - New York Post ", "description": "The Florida county sheriff investigating a suspicious, decades-old disappearance, revived by the Netflix series “Tiger King: Murder, Mayhem and Madness,” said that h…", "url": "https://nypost.com/2020/04/24/sheriff-denies-police-cover-up-of-tiger-king-stars-missing-husband/", "urlToImage": null, "publishedAt": "2020-04-24T22:59:10Z", "content": "The Florida county sheriff investigating a suspicious, decades-old disappearance, revived by the Netflix series “Tiger King: Murder, Mayhem and Madness,” said that his police department is not involved in a cover-up related to the case.\r\nAmong the cast of biz… [+3117 chars]"}, {"source": {"id": null, "name": "Eonline.com"}, "author": "Mike Vulpo", "title": "Hannah Brown & Tyler Cameron's Chemistry Is Undeniable in Latest Video - E! NEWS", "description": "Hannah Brown and Tyler Cameron's latest Instagram Live reminds fans that their chemistry is undeniable. Watch the sweet moments unfold for yourself.", "url": "https://www.eonline.com/news/1144733/watching-hannah-brown-and-tyler-cameron-tease-each-other-proves-their-chemistry-is-undeniable", "urlToImage": null, "publishedAt": "2020-04-24T22:53:56Z", "content": "You just can't deny chemistry these days!\r\nWe know, we know. Both Hannah Brown and Tyler Cameron are the first to admit they are single and not dating anyone during the Coronavirus pandemic. But as they continue to stay in touch and document their friendship … [+603 chars]"}, {"source": {"id": "entertainment-weekly", "name": "Entertainment Weekly"}, "author": "Anonymous", "title": "'Seinfeld,' 'Star Trek' actor Gene Dynarski dies at 86 - The-Latest News", "description": "Gene Dynarski, a character actor known for his roles on Seinfeld and in Steven Spielberg's Close Encounters of the Third Kind, has died. He was 86. Dynarski died Feb. 27 in a rehabilitation center in Studio City, Calif., according to The Hollywood Reporter, w…", "url": "https://ew.com/tv/gene-dynarski-dead-seinfeld-star-trek-actor-obit/", "urlToImage": null, "publishedAt": "2020-04-24T22:49:15Z", "content": "Gene Dynarski, a character actor known for his roles Seinfeld and in Steven Spielberg‘s Close Encounters of the Third Kind, has expired. He had been 86. \r\nDynarski expired Feb. 27 in a rehab center in Studio City, Calif., based on The Hollywood Reporter, whic… [+1454 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Julia Alexander", "title": "Sony delays Spider-Man films, forcing Marvel to move Doctor Strange and Thor sequels again - The Verge", "description": "Spider-Man: Into the Spider-Verse and the third movie in the Spider-Man: Homecoming trilogy are getting delayed as Sony messes with its release schedule. As a result, Doctor Strange into the Multiverse and Thor: Love and Thunder have been delayed for a second…", "url": "https://www.theverge.com/2020/4/24/21235283/spider-man-spiderverse-homecoming-delay-release-date-trilogy-marvel-venom-doctor-strange-thor", "urlToImage": null, "publishedAt": "2020-04-24T22:45:42Z", "content": "But Uncharted gets an early release date\r\nPhoto: Sony Pictures Entertainment\r\nLike almost every other studio, Sony is moving around its film schedule because of the novel coronavirus. That means its two biggest Spider-Man movies will be delayed. \r\nThe sequel … [+1662 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Dan Bates For Dailymail.com", "title": "Karl Lagerfeld's mother 'strapped him to his bed to stop him from eating', André Leon Talley reveals - Daily Mail", "description": "André Leon Talley explains it was one of the reasons he and Karl Lagerfeld became friends for decades - they had both suffered 'abuse' in their childhoods, he writes in his new memoir.", "url": "https://www.dailymail.co.uk/news/article-8253589/Karl-Lagerfelds-mother-strapped-bed-stop-eating-Andr-Leon-Talley-reveals.html", "urlToImage": null, "publishedAt": "2020-04-24T22:42:41Z", "content": "When Karl Lagerfeld was young his mother strapped him in bed with leather restraints to stop him from eating at night, Vogue's former editor-at-large has revealed in his new memoir obtained exclusively by DailyMail.com.\r\nAndré Leon Talley said the late design… [+9778 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By George Stark For Dailymail.com", "title": "Will & Grace stars Debra Messing and Megan Mullally's rumored feud gets addressed - Daily Mail", "description": "Will & Grace creators David Kohan and Max Mutchnick have added fuel to the rumours the co-stars Debra Messing and Meghan Mullally have harbored a secret feud with each other.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8255239/Will-Grace-stars-Debra-Messing-Megan-Mullallys-rumored-feud-gets-addressed.html", "urlToImage": null, "publishedAt": "2020-04-24T22:32:15Z", "content": "Will &amp; Grace creators David Kohan and Max Mutchnick have added fuel to the rumours the co-stars Debra Messing, 51, and Megan Mullally, 61, have harbored a secret feud with each other.\r\nKohan and Mutchnick were asked about the alleged clash in a recent Q&a… [+2240 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "How the Latest Clone Wars Broke Fans' Hearts! (Nerdist News w/ Dan Casey) - Nerdist", "description": "Could this week's heartbreaking episode of The Clone Wars be one of the series best? Dan takes a closer look in today's episode of Nerdist News! What's your ...", "url": "https://www.youtube.com/watch?v=CmU8SWLI97k", "urlToImage": null, "publishedAt": "2020-04-24T22:31:09Z", "content": null}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Mike Fleming Jr", "title": "Year After Record ‘Avengers: Endgame’ B.O. Launch, AGBO’s Joe & Anthony Russo Open ‘Extraction’ On Netflix - Deadline", "description": "A year ago today Avengers: Endgame bowed in China, kicking off an unprecedented theatrical run that ended when it surpassed James Cameron’s Avatar as the all-time top-grossing film. With movie theaters shut for the foreseeable future, Endgame directors and AG…", "url": "https://deadline.com/2020/04/avengers-endgame-anniversary-joe-russo-anthony-russo-extraction-netflix-chris-hemsworth-1202917408/", "urlToImage": null, "publishedAt": "2020-04-24T21:52:51Z", "content": "A year ago today Avengers: Endgame bowed in China, kicking off an unprecedented theatrical run that ended when it surpassed James Cameron’s Avatar as the all-time top-grossing film. With movie theaters shut for the foreseeable future, Endgame directors and AG… [+11369 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Luke Hawker", "title": "Kate and William honour Anzac Day and share resources to celebrate ‘in spirit’ - Express", "description": "KATE, the Duchess of Cambridge and Prince William have paid tribute all the fallen Australian and New Zealand military personnel who lost their life during conflicts around the world for Anzac Day", "url": "https://www.express.co.uk/news/royal/1273651/kate-middleton-news-latest-prince-william-anzac-day-celebrations-australia-new-zealand", "urlToImage": null, "publishedAt": "2020-04-24T21:48:07Z", "content": null}, {"source": {"id": null, "name": "Tmz.com"}, "author": "TMZ Staff", "title": "2 Chainz's Atlanta Restaurants Will Now Not Reopen For Dine-In Service - TMZ", "description": "2 Chainz is reopening his Atlanta restaurants for dine-in service, and putting safety as a top priority.", "url": "https://www.tmz.com/2020/04/24/2-chainz-reopening-atlanta-restaurant-dine-in-service-sit-down-safety-precations-coronavirus-escobar-tapas/", "urlToImage": null, "publishedAt": "2020-04-24T21:45:00Z", "content": "2:40 PM PT -- That didn't take long. Less than 24 hours after 2 Chainz's business partner and co-owner Snoop Dillard told us they were going to reopen their ATL joints, they're now saying it's a no-go. Dillard tells TMZ, \"After careful consideration, we are n… [+2445 chars]"}, {"source": {"id": null, "name": "Vulture.com"}, "author": "Chris Murphy", "title": "Billy Kimmel’s Third Birthday Party Won Late Night This Week - Vulture", "description": "With surprise guest Spider-Man.", "url": "http://www.vulture.com/2020/04/this-week-in-late-night-billy-kimmel-birthday-tom-holland.html", "urlToImage": null, "publishedAt": "2020-04-24T21:32:46Z", "content": "Whats new, pussycats? Well, the president of the United States of America has suggested that people start injecting disinfectants, and I just started a 1,500-piece puzzle, which seems equally as futile and somehow twice as dangerous. As for late-night televis… [+5681 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Austen Goslin", "title": "Fortnite’s Travis Scott event drew over 12.3 million players at its premiere - Polygon", "description": "Travis Scott’s Astronomical Fortnite event garnered a new record number of concurrent players as 12.3 million people dropped into the game for the premiere.", "url": "https://www.polygon.com/fortnite/2020/4/24/21235017/fortnite-travis-scott-event-concert-astronomical-12-3-million-concurrent-players-record", "urlToImage": null, "publishedAt": "2020-04-24T21:31:04Z", "content": "Travis Scotts in-game Fortnite tour brought a record number of players online. Epic Games announced Friday that over 12.3 million concurrent players joined Scotts in-game concert. \r\nThe event started with a giant version of Scott performing some of his most r… [+969 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Jessica Napoli", "title": "'Defending Jacob' showrunner and director talk working with Chris Evans, challenging aspect of adapting a book - Fox News", "description": "It was all fun and games on the \"Defending Jacob\" set outside Boston, according to writer-showrunner Mark Bomback and director Morten Tyldum.", "url": "https://www.foxnews.com/entertainment/defending-jacob-chris-evans-tv-family-crime", "urlToImage": null, "publishedAt": "2020-04-24T21:17:54Z", "content": "It was all fun and games on the \"Defending Jacob\" set outside Boston, according to writer-showrunner Mark Bomback and director Morten Tyldum.\r\nPing pong tournaments and listening to podcasts created a lighthearted dynamic despite the grim plot of the Apple TV… [+4577 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Tasha Robinson", "title": "Bad Education review: new HBO movie gives Hugh Jackman a chance to squirm - Polygon", "description": "Hugh Jackman and Allison Janney star in HBO’s true crime drama Bad Education, about a Long Island student who uncovers a massive embezzlement scandal in her school district. The best new movie to watch this week at home is on HBO GO and HBO NOW right now.", "url": "https://www.polygon.com/2020/4/24/21234625/bad-education-review-hbo-hugh-jackman-allison-janney-based-on-a-true-story", "urlToImage": null, "publishedAt": "2020-04-24T21:01:56Z", "content": "The inciting incident in Cory Finleys sharp, entertaining HBO drama Bad Education may strike some viewers as far too on-the-nose. When student journalist Rachel (Miracle Workers Geraldine Viswanathan) drops by the office of Long Island school superintendent F… [+6079 chars]"}, {"source": {"id": null, "name": "Slashfilm.com"}, "author": "Chris Evangelista", "title": "The Best TV Shows & Movies Coming to Netflix in May 2020 - /FILM", "description": "Check out the best TV shows and movies coming to Netflix in May 2020, including Uncut Gems, Sinister, Back to the Future, and more.", "url": "https://www.slashfilm.com/movies-coming-to-netflix-in-may-2020/", "urlToImage": null, "publishedAt": "2020-04-24T21:00:41Z", "content": "best TV shows and movies coming to Netflix in May 2020.\r\nUncut Gems\r\nThis is how you win: by watching Uncut Gems on Netflix. Adam Sandler turns in one of his best performances as a Diamond District salesman with an obsessive gambling problem. Sandler’s addict… [+18355 chars]"}, {"source": {"id": null, "name": "Blabbermouth.net"}, "author": "Blabbermouth", "title": "This Year's Louder Than Life Festival Is Officially Canceled - BLABBERMOUTH.NET", "description": "This year's Louder Than Life festival, which was scheduled to take place in September in Louisville, Kentucky, has been officially canceled due to the COVID-19 pandemic.\n\n\"Even though the festivals...", "url": "https://www.blabbermouth.net/news/this-years-louder-than-life-festival-is-officially-canceled/", "urlToImage": null, "publishedAt": "2020-04-24T20:56:39Z", "content": "This year's Louder Than Life festival, which was scheduled to take place in September in Louisville, Kentucky, has been officially canceled due to the COVID-19 pandemic.\r\n\"Even though the festivals are not until September, the advanced planning realities of p… [+2702 chars]"}, {"source": {"id": null, "name": "Timesofisrael.com"}, "author": null, "title": "Taylor Swift calls out Soros family's 'shameless greed' in beef with record co. - The Times of Israel", "description": "Pop superstar draws criticism as white supremacists seen associating her post with widespread anti-Semitic conspiracy theories about Soros", "url": "https://www.timesofisrael.com/taylor-swift-calls-out-soros-familys-shameless-greed-in-beef-with-record-co/", "urlToImage": null, "publishedAt": "2020-04-24T20:55:57Z", "content": "JTA — Taylor Swift is drawing criticism and apparent applause among her neo-Nazi fan base for calling out the Soros family in an Instagram post. Its the latest salvo in the pop superstars ongoing battle with her former record label.\r\nThe family long has been … [+2957 chars]"}, {"source": {"id": null, "name": "Cosmopolitan.com"}, "author": "Shannon Barbour", "title": "LOL, Peter Weber Fully Knows He Is the ”Butt of the Joke” on TikTok - Cosmopolitan.com", "description": "He saw y’all’s shady comments!", "url": "https://www.cosmopolitan.com/entertainment/tv/a32271236/peter-weber-butt-of-the-joke-tik-tok-kelley-flanagan/", "urlToImage": null, "publishedAt": "2020-04-24T20:53:00Z", "content": "<ul><li>Peter Weber apparently knows everyone makes fun of his TikTok dancing skills. </li><li>Bachelor Nation alums like Tyler Cameron and Connor Saeli have both dragged his videos. </li><li>Reports say Peter once read all the negative comments aloud on Inst… [+1601 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Brian Flood", "title": "Andy Cohen says blood is 'boiling' because he can't donate plasma as a gay man: 'My blood could save a life' - Fox News", "description": "Bravo’s Andy Cohen, who recently recovered from coronavirus, said his blood  “could save a life but instead it’s over here boiling” because rules prevent him from donating plasma as a gay man.", "url": "https://www.foxnews.com/entertainment/andy-cohen-blood-boiling-cant-donate-plasma", "urlToImage": null, "publishedAt": "2020-04-24T20:45:13Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox.  Sign up here.\r\nBravo’s Andy Cohen, who recently recovered from coronavirus, said his “blood could save a life but instead it’s over here boiling” because rules prevent him from do… [+1802 chars]"}, {"source": {"id": "entertainment-weekly", "name": "Entertainment Weekly"}, "author": "Samantha Highfill", "title": "'Friday Night Lights' cast reunites to watch the pilot for Together At Home - Entertainment Weekly", "description": "Adrianne Palicki, Scott Porter, and more cast members reunited via Zoom.", "url": "https://ew.com/tv/friday-night-lights-cast-reunion-watch-pilot/", "urlToImage": null, "publishedAt": "2020-04-24T20:36:34Z", "content": "Clear eyes, full hearts, can't Zoom?\r\nAs part of Global Citizen's \"Together At Home\" series, which raises money for the World Health Organization amid the coronavirus pandemic, a handful of cast members from Friday Night Lights staged a virtual reunion to re-… [+810 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Louis Casiano", "title": "Eminem sends 'Mom’s Spaghetti' pasta to Detroit health care workers on coronavirus frontline - Fox News", "description": "Health care workers in Detriot \"lost themselves\" in spaghetti courtesy of rapper Eminem, who sent the pasta to those battling the coronavirus on the front lines.", "url": "https://www.foxnews.com/entertainment/eminem-sends-pasta-detroit-health-care-workers-coronavirus-frontline", "urlToImage": null, "publishedAt": "2020-04-24T20:16:31Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox. Sign up here.\r\nHealth care workers in Detriot \"lost themselves\" in spaghetti courtesy of rapperEminem, who sent the pasta to those battling the coronavirus on the front lines.\r\nThe… [+1088 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Julius Young", "title": "Scarlett Johansson reflects on not getting roles: ‘I’ve basically made a career out of being second choice’ - Fox News", "description": "Scarlett Johannson has always had a knack for performing ever since she fell in love with the art of acting as a child when she used to watch films featuring old Hollywood stars in their heydays as well as classic musicals and vintage Disney productions.", "url": "https://www.foxnews.com/entertainment/scarlett-johansson-reflects-not-getting-roles", "urlToImage": null, "publishedAt": "2020-04-24T20:10:26Z", "content": "Scarlett Johannson has been drawn to performing ever since she fell in love with the art of acting as a child when she used to watch films featuring Old Hollywood stars in their heydays as well as classic musicals and vintage Disney productions.\r\nThe “Black W… [+3635 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandra Gonzalez, CNN", "title": "Tributes to the entertainers and artists who died from coronavirus - CNN", "description": "To honor some the creative forces who have died due to Covid-19, CNN turned to those who knew them, loved them and were deeply affected by the work that defined their legacies.", "url": "https://www.cnn.com/2020/04/24/entertainment/entertainers-weve-lost-to-coronavirus/index.html", "urlToImage": null, "publishedAt": "2020-04-24T20:05:42Z", "content": "(CNN)To honor some the creative forces who have died due to Covid-19, CNN turned to those who knew them, loved them and were deeply affected by the work that defined their legacies. \r\nBelow are tributes to these artists.\r\n\"Mark Blum was an actor's actor. Ever… [+21319 chars]"}, {"source": {"id": null, "name": "Rollingstone.com"}, "author": "Jason Newman", "title": "NFL Legend Terry Bradshaw Now Has a Quarantine-Themed Country Song - Rolling Stone", "description": "The country and gospel singer and perpetually ebullient sportscaster tells us about his humorous new song, \"Quarantine Crazy\"", "url": "https://www.rollingstone.com/music/music-features/nfl-legend-terry-bradshaw-country-song-quarantine-989721/", "urlToImage": null, "publishedAt": "2020-04-24T19:54:32Z", "content": "These days, NFL legend, broadcaster extraordinaire and national treasure Terry Bradshaw can be found on his 800-acre quarterhorse ranch in Thackerville, Oklahoma, located right on the Texas-Oklahoma border. Bradshaw, his wife Tammy, his three grandchildren, a… [+6471 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Denise Petski", "title": "NBC Pushes ‘Blindspot’ Return, Shifts ‘Council Of Dads’ Thursday Debut To Make Way For ‘Parks And Recreation’ Special - Deadline", "description": "NBC has made some scheduling moves to accommodate the Parks and Recreation COVID-19 benefit special, which airs at 8:30 pm on April 30. Council of Dads, which was scheduled to air its second episode at 8 pm, will move to 10 pm ET/PT Thursday, April 30. It wil…", "url": "https://deadline.com/2020/04/nbc-shifts-council-of-dads-blindspot-parks-and-recreation-special-1202917331/", "urlToImage": null, "publishedAt": "2020-04-24T19:47:38Z", "content": "NBC has made some scheduling moves to accommodate the Parks and RecreationCOVID-19 benefit special, which airs at 8:30 pm on April 30.\r\nCouncil of Dads, which was scheduled to air its second episode at 8 pm, will move to 10 pm ET/PT Thursday, April 30. It wil… [+899 chars]"}, {"source": {"id": null, "name": "Consequenceofsound.net"}, "author": "Lake Schatz", "title": "Mick Jagger Responds to Paul McCartney’s The Beatles vs. The Rolling Stones Comments - Consequence of Sound", "description": "Mick Jagger has responded to Paul McCartney's comments claiming The Beatles \"were better\" than The Rolling Stones. Read the details here.", "url": "https://consequenceofsound.net/2020/04/mick-jagger-responds-paul-mccartney-the-beatles-better-the-rolling-stones/", "urlToImage": null, "publishedAt": "2020-04-24T19:44:32Z", "content": "In an chat with Howard Stern earlier this month, Paul McCartney talked about the legacies of both The Beatles and The Rolling Stones or more specifically, why The Fab Four were better. Now, Mick Jagger has joined the debate and responded to Macca, proudly boa… [+2680 chars]"}, {"source": {"id": null, "name": "Variety.com"}, "author": "Rebecca Rubin", "title": "‘Mission: Impossible’ Sequels Get Pushed Back - Variety", "description": "Paramount has delayed the theatrical releases of “Mission: Impossible 7” and “Mission: Impossible 8,” the next two chapters in Tom Cruise’s action franchise. The seventh installment, originally due in theaters on July 23, 2021, will now debut four months late…", "url": "https://variety.com/2020/film/box-office/mission-impossible-sequels-get-pushed-back-1234589362/", "urlToImage": null, "publishedAt": "2020-04-24T19:42:25Z", "content": "Paramount has delayed the theatrical releases of “Mission: Impossible 7” and “Mission: Impossible 8,” the next two chapters in Tom Cruise’s action franchise.\r\nThe seventh installment, originally due in theaters on July 23, 2021, will now debut four months lat… [+1348 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Gary Dinges", "title": "Billy Porter speaks 'truth to power' in cover of Buffalo Springfield's 'For What It's Worth' - USA TODAY", "description": "A frequent critic of President Donald Trump, Porter says he was inspired by artists who recorded songs during times of conflict in U.S. history.", "url": "https://www.usatoday.com/story/entertainment/music/2020/04/24/billy-porter-covers-stephen-stills-classic-for-what-its-worth/5155035002/", "urlToImage": null, "publishedAt": "2020-04-24T19:32:25Z", "content": "Music producers battle with the Verzuz series as fans party along \r\nAP Entertainment\r\nBilly Porter is channeling the past by bringing you a message from the future.\r\nThe singer, actor and Broadway performer has covered Stephen Stills beloved Buffalo Springfie… [+2809 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Denise Petski", "title": "Victoria Justice To Host Nickelodeon’s Rescheduled Kids’ Choice Awards, With Dwayne Johnson, Ariana Grande & More - Deadline", "description": "Nickelodeon is moving forward with its Kids’ Choice Awards with a new date, and with Victoria Justice as host. Initially scheduled for March 22, the awards ceremony was postponed indefinitely due to the coronavirus pandemic. The newly titled virtually-produce…", "url": "https://deadline.com/2020/04/victoria-justice-to-host-nickelodeons-rescheduled-kids-choice-awards-with-dwayne-johnson-ariana-grande-more-1202917237/", "urlToImage": null, "publishedAt": "2020-04-24T19:12:09Z", "content": "Nickelodeon is moving forward with its Kids’ Choice Awards with a new date, and with Victoria Justice as host. Initially scheduled for March 22, the awards ceremony was postponed indefinitely due to the coronavirus pandemic. The newly titled virtually-produce… [+1462 chars]"}, {"source": {"id": "entertainment-weekly", "name": "Entertainment Weekly"}, "author": "Nick Romano", "title": "'Penny Dreadful' star Natalie Dormer on how Magda feeds 'the darker side of men's souls' - Entertainment Weekly", "description": "The <em>Game of Thrones</em> vet delights in playing Magda, a demon who takes three human forms.", "url": "https://ew.com/tv/penny-dreadful-natalie-dormer-city-of-angels-interview/", "urlToImage": null, "publishedAt": "2020-04-24T19:09:16Z", "content": "Just call Natalie Dormer a triple threat... or, rather, a quadruple threat.\r\nIn her first cable-TV role since Game of Thrones, the 38-year-old U.K. star takes on a devilish new challenge on Showtime’s Penny Dreadful: City of Angels, creator John Logan's “spir… [+8860 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Meghan Markle Case Against British Tabloid Set To Begin In London | TODAY - TODAY", "description": "Friday marks the first court hearing in a privacy case brought by Meghan Markle against the Daily Mail, a British tabloid, for publishing part of a letter sh...", "url": "https://www.youtube.com/watch?v=Cjuyow4ftc8", "urlToImage": null, "publishedAt": "2020-04-24T19:00:03Z", "content": "Friday marks the first court hearing in a privacy case brought by Meghan Markle against the Daily Mail, a British tabloid, for publishing part of a letter she wrote to her father. NBC's Kelly Cobiella reports for TODAY from London.» Subscribe to TODAY: http:/… [+845 chars]"}, {"source": {"id": null, "name": "Jambase.com"}, "author": "Nate Todd", "title": "Trey Anastasio Talks Quarantine, Phish's 'Sigma Oasis,' Touring & More In New Interview - JamBase", "description": "Organizers of the Shambhala Music Festival canceled the 2020 event due to the coronavirus pandemic.", "url": "https://www.jambase.com/article/shambhala-2020-canceled-coronavirus", "urlToImage": null, "publishedAt": "2020-04-24T18:37:29Z", "content": "Shambhala Music Festival canceled its 2020 event due to the coronavirus COVID-19 outbreak. The festival was set to take place July 24 – 27 in Salmo, British Columbia, Canada.\r\nScheduled to perform at Shambhala 2020 were DJ Premier, Ekali, Rezz, RL Grime, Seve… [+1403 chars]"}, {"source": {"id": null, "name": "Decider.com"}, "author": "Claire Spellberg", "title": "Dolly Parton's Company Produced 'Buffy the Vampire Slayer' And Fans Are Stunned - Decider", "description": "Slayin’ 9 to 5…", "url": "https://decider.com/2020/04/24/dolly-parton-buffy-the-vampire-slayer/", "urlToImage": null, "publishedAt": "2020-04-24T18:33:09Z", "content": "Does it still count as working “9 to 5” if the world doesn’t know about it? This week, the Independent reported that Dolly Parton was partially responsible for hit drama Buffy the Vampire Slayer, as she owns the company that executive produced the show, Sando… [+3155 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chloe Melas, CNN", "title": "Richard Gere and his wife welcome baby boy - CNN", "description": "Richard Gere and his wife, Alejandra Silva, have welcomed their second son, a rep for the actor confirms to CNN.", "url": "https://www.cnn.com/2020/04/24/entertainment/richard-gere-baby-boy-trnd/index.html", "urlToImage": null, "publishedAt": "2020-04-24T18:14:54Z", "content": "(CNN)Richard Gere and his wife, Alejandra Silva, have welcomed their second son, a rep for the actor confirms to CNN.\r\nGere, 70 and Silva, 37, already have 14-month-old Alexander. Gere also has a 20-year-old son from a previous marriage. Silva has a son with … [+419 chars]"}, {"source": {"id": null, "name": "Tmz.com"}, "author": "TMZ Staff", "title": "'Chernobyl Diaries' Star Dimitri Diatchenko Dead at 52 - TMZ", "description": "\"Chernobyl Diaries\" star Dimitri Diatchenko is dead at 52 after his body was found at his Florida home.", "url": "https://www.tmz.com/2020/04/24/chernobyl-diaries-star-dimitri-diatchenko-dead-dies-52/", "urlToImage": null, "publishedAt": "2020-04-24T18:11:00Z", "content": "Dimitri Diatchenko -- famous for his role in \"Chernobyl Diaries\" is dead ... TMZ has learned.\r\nDimitri was found dead Wednesday at his home in Daytona Beach, FL ... the actor's brother tells TMZ. We're told Dimitri's death was not related to the novel coronav… [+728 chars]"}, {"source": {"id": null, "name": "Insidethemagic.net"}, "author": "https://www.facebook.com/EmilleEnchanted/", "title": "Florida Shares Insight into Reopening Process for State Tourism, Such as Disney and Universal - Inside the Magic", "description": "We share the most up-to-date information regarding the reopening of the state of Florida based on recommendations from the task force.", "url": "https://insidethemagic.net/2020/04/florida-reopening-update-ec2-kc2-ba2/", "urlToImage": null, "publishedAt": "2020-04-24T17:54:58Z", "content": "This week, Florida Governor Ron DeSantis held several meetings regarding protocols of re-opening Florida — alongside county commissioners and members of the Florida Task Force, and with Disney and Universal officials involved in the conversations, much of the… [+6597 chars]"}, {"source": {"id": null, "name": "Pagesix.com"}, "author": "Nicki Gostin", "title": "Cameron Diaz says Benji Madden is the 'best thing' that's ever happened to her - Page Six", "description": "Cameron Diaz is happy at home with hubby Benji Madden.", "url": "https://pagesix.com/2020/04/24/cameron-diaz-gushes-about-husband-benji-madden/", "urlToImage": null, "publishedAt": "2020-04-24T17:45:57Z", "content": "Cameron Diaz says hubby Benji Madden is the best thing thats ever happened to me.\r\nI love being married,” the Charlies Angels actress, 47, said in an interview, which was posted on Thursday, with her longtime makeup artist and pal Gucci Westman for the beauty… [+1111 chars]"}, {"source": {"id": null, "name": "Tmz.com"}, "author": "TMZ Staff", "title": "Juice WRLD's Posthumous Track 'Righteous' Details Drug Use - TMZ", "description": "Juice WRLD's family has dropped a new track, \"Righteous,\" which foreshadowed his drug problem.", "url": "https://www.tmz.com/2020/04/24/juice-wrld-family-releases-new-track-righteous-drug-use/", "urlToImage": null, "publishedAt": "2020-04-24T17:23:44Z", "content": "Juice WRLD's family has dropped a posthumous track from him, and its lyrics sadly foreshadow his eventual demise.\r\nThe late rapper's family dropped \"Righteous\" Thursday night and the track goes into extreme detail about his heavy drug use and the state of his… [+1220 chars]"}, {"source": {"id": null, "name": "Sltrib.com"}, "author": "https://www.facebook.com/SeanPMeansCricket", "title": "Redwood Drive-In to reopen Friday, the first Salt Lake County movie theater back after coronavirus shutdown - Salt Lake Tribune", "description": "The Redwood Drive-In’s plans to open this weekend are on hold, after the Salt Lake County Health Department reminded the management that opening a movie theater would violate a public health order.", "url": "https://www.sltrib.com/artsliving/2020/04/24/redwood-drive-in-reopen/", "urlToImage": null, "publishedAt": "2020-04-24T14:49:22Z", "content": "The Redwood Drive-Ins plans to open this weekend are on hold, after the Salt Lake County Health Department reminded the management that opening a movie theater would violate a public health order.\r\n The Salt Lake County Health Department posted a warning on t… [+3653 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Dino-Ray Ramos", "title": "Western Thriller ‘True History Of Kelly Gang’ And ’60s Coming-Of-Age Drama ‘To The Stars’ Make Debuts – Specialty Streaming Preview - Deadline", "description": "The story of the notorious outlaw Ned Kelly is dropping on digital and on-demand today with the Justin Kurzel-directed True History of the Kelly Gang starring George MacKay (1917, Captain Fantastic), Russell Crowe (Boy Erased, The Loudest Voice) and Nicholas …", "url": "https://deadline.com/2020/04/true-history-of-kelly-gang-russell-crowe-justin-kurzel-to-the-stars-martha-stephens-specialty-streaming-preview-1202916073/", "urlToImage": null, "publishedAt": "2020-04-24T14:28:13Z", "content": "The story of the notorious outlaw Ned Kelly is dropping on digital and on-demand today with the Justin Kurzel-directed True History of the Kelly Gang starring George MacKay (1917, Captain Fantastic), Russell Crowe (Boy Erased, The Loudest Voice) and Nicholas … [+5477 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Brian Lowry, CNN", "title": "'Avengers: Endgame' premiered a year ago. A whole lot has changed since then - CNN", "description": "The Marvel blockbuster premiered one year ago, on April 26, 2019, although just imagining people crowding into theaters, it surely feels a whole lot longer. The movie went on to amass $2.8 billion worldwide, surpassing the benchmark set by \"Avatar.\"", "url": "https://www.cnn.com/2020/04/24/entertainment/avengers-endgame-one-year-later/index.html", "urlToImage": null, "publishedAt": "2020-04-24T13:55:01Z", "content": "(CNN)With what felt like a snap, \"Avengers: Endgame\" shattered opening-weekend box-office records, earning $357 million in North America -- roughly $100 million more than its predecessor. The movie went on to amass $2.8 billion worldwide, surpassing the bench… [+3766 chars]"}, {"source": {"id": null, "name": "Vulture.com"}, "author": "Claire Lampen", "title": "Specter of Matt Damon Haunts Quaint Irish Town - Vulture", "description": "He’s stranded in the tiny seaside village of Dalkey during their coronavirus lockdown.", "url": "http://www.vulture.com/2020/04/matt-damon-stranded-in-ireland-during-coronavirus-pandemic.html", "urlToImage": null, "publishedAt": "2020-04-24T13:54:08Z", "content": "A plague of Matt Damon has descended upon one Irish seaside town. The New York Times reports that Damon haunts the beaches of Irelands Amalfi Coast, rattling his shopping bags from regional supermarket chains. He has become something of a local legend, materi… [+1331 chars]"}, {"source": {"id": null, "name": "Pagesix.com"}, "author": "Eileen Reslen", "title": "Alex Rodriguez suggests 'drive-through wedding' with Jennifer Lopez - Page Six", "description": "Love don’t cost a thing.", "url": "https://pagesix.com/2020/04/24/alex-rodriguez-suggests-drive-through-wedding-with-jennifer-lopez/", "urlToImage": null, "publishedAt": "2020-04-24T13:47:40Z", "content": "Love don’t have to cost a thing.\r\nAlex Rodriguez has confirmed that his wedding to Jennifer Lopez which was supposed to take place this summer has been postponed due to the coronavirus pandemic, but says he is now open to “cheaper” and socially-distanced alte… [+972 chars]"}, {"source": {"id": null, "name": "Newser.com"}, "author": "Arden Dier", "title": "Former Right-Hand Man: Wintour Gave Me 'Scars' - Newser", "description": "Andre Leon Talley tells of 'huge emotional and psychological scars' in new book", "url": "https://www.newser.com/story/290013/former-right-hand-man-wintour-gave-me-scars.html", "urlToImage": null, "publishedAt": "2020-04-24T13:25:00Z", "content": "(Newser)\r\nIt was the 2003 novel The Devil Wears Prada, written by a former assistant of Anna Wintour, that cast the Vogue editor-in-chief as a nightmare. Almost two decades later, a new book from her former right-hand man reportedly confirms some of the narra… [+1228 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Nikki Bella Is Accused of Playing Favorites: \"Total Bellas\" Recap (S5, Ep4) | E! - E! Entertainment", "description": "JJ feels Nikki is showing her true colors when it comes to his daughters, Brie's car gets burglarized and mama Bella doesn't want Artem in the family photo. ...", "url": "https://www.youtube.com/watch?v=y66FNpb4L_Q", "urlToImage": null, "publishedAt": "2020-04-24T12:59:58Z", "content": null}, {"source": {"id": null, "name": "Capitalfm.com"}, "author": "Capital", "title": "Zayn & Gigi Hadid Are Isolating Together On A Farm In Pennsylvania - Capital", "description": "Zayn and Gigi are reportedly isolating together on her family's farm in the US, as they keep their relationship which has been the subject of much speculation, on the low.", "url": "https://www.capitalfm.com/artists/zayn/gigi-hadid-isolating-farm-relationship-together/", "urlToImage": null, "publishedAt": "2020-04-24T12:34:10Z", "content": "24 April 2020, 12:12\r\nZayn and Gigi are isolating together on a farm in Pennsylvania.\r\nPicture: \r\nInstagram @zayn @gigihadid\r\nZayn and Gigi are reportedly isolating together on her family's farm in the US, as they keep their relationship which has been the su… [+1930 chars]"}, {"source": {"id": null, "name": "Cultaholic.com"}, "author": "Aidan Gibbons", "title": "Vince McMahon Says A Deal To Sell WWE's Pay-Per-View Rights Was Close Before The Coronavirus Pandemic - Cultaholic", "description": "Back in January, Vince McMahon announced WWE was looking to sell their pay-per-view rights before the end of March. It is widely known that the company has been in negotiations with ESPN,&nbsp; but no deal has been completed as of yet, in part, because of the…", "url": "https://cultaholic.com/posts/vince-mcmahon-says-a-deal-to-sell-wwe-pay-per-view-rights-was-close-before-coronavirus-pandemic", "urlToImage": null, "publishedAt": "2020-04-24T09:48:00Z", "content": "Back in January, Vince McMahon announced WWE was looking to sell their pay-per-view rights before the end of March. It is widely known that the company has been in negotiations with ESPN,  but no deal has been completed as of yet, in part, because of the coro… [+1094 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Guillermo & Russell Wilson Prep Joe Burrow for NFL Draft - Sponsored by Bose - Jimmy Kimmel Live", "description": "If you watched the NFL Draft on ABC, you know it was a big night for NFL hopeful Joe Burrow. Getting drafted from home is a tricky thing though, so to prep f...", "url": "https://www.youtube.com/watch?v=qr_TDbXsjPM", "urlToImage": null, "publishedAt": "2020-04-24T05:30:31Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Alicia Keys debuts powerful new song 'Good Job' on CNN - CNN", "description": "Alicia Keys, a 15-time Grammy winner, debuts \"Good Job\" during a CNN global town hall addressing the latest developments in the Covid-19 pandemic.", "url": "https://www.cnn.com/videos/entertainment/2020/04/24/alicia-keys-visual-premiere-good-job-coronavirus-town-hall-vpx.cnn", "urlToImage": null, "publishedAt": "2020-04-24T02:24:56Z", "content": "Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds."}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Disney Gallery: Star Wars The Mandalorian - Official Trailer (Jon Favreau, Taika Waititi) - IGN", "description": "In Disney Gallery: The Mandalorian, Executive Producer Jon Favreau invites the cast and crew to share an unprecedented look at the making of the series which...", "url": "https://www.youtube.com/watch?v=f_miMhjdvvs", "urlToImage": null, "publishedAt": "2020-04-23T20:30:02Z", "content": "In Disney Gallery: The Mandalorian, Executive Producer Jon Favreau invites the cast and crew to share an unprecedented look at the making of the series which quickly became a pop culture phenomenon after premiering in November.\r\nDebuting on the day that a wor… [+406 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Gael Fashingbauer Cooper", "title": "YouTube turns 15 today. Watch the first video it posted - CNET", "description": "One of the founders visited the zoo. Let's just say the video site's content has improved a lot since 2005.", "url": "https://www.cnet.com/news/youtube-turns-15-today-watch-the-first-video-it-posted/", "urlToImage": null, "publishedAt": "2020-04-23T19:02:24Z", "content": "The clip is just 18 seconds long, but 15 years ago, it kicked off an online video revolution.  Thursday marks the 15th anniversary of the first-ever YouTube video, which shows company co-founder Jawed Karim standing in front of an elephant enclosure at the Sa… [+1519 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Ron Dicker", "title": "Chris Hemsworth Discovers A Python In His Helmet During Quarantine - HuffPost", "description": "The \"Extraction\" actor reached his hand in and quickly pulled it away.", "url": "https://www.huffpost.com/entry/chris-hemsworth-python_n_5ea18a77c5b6194c7be92658", "urlToImage": null, "publishedAt": "2020-04-23T15:12:59Z", "content": "What Chris Hemsworth found in his motorcycle helmet while self-isolating might be enough to scare even Thor. (Fast forward to 3:00 above.)\r\nThe Australian actor, who of course plays the hammer-wielding Marvel superhero, said Wednesday on “Jimmy Kimmel Live!” … [+948 chars]"}]}