{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Tvline.com"}, "author": "Michael Ausiello", "title": "'Homeland' Finale: Carrie's Daughter Franny — Scene Cut From Season 8 - TVLine", "description": "RELATED STORIES Homeland Series Finale Recap: The Cost of Doing Business -- Grade It! Homeland Finale: Inside the 'Intense' Debate Over Series Finale's Killer Twist Sunday’s Homeland series finale was initially supposed to kick off with the return of a pivota…", "url": "https://tvline.com/2020/04/26/homeland-finale-franny-carrie-daughter-scene-season-8/", "urlToImage": null, "publishedAt": "2020-04-27T02:13:00Z", "content": "Sunday’s Homeland series finale was initially supposed to kick off with the return of a pivotal character, but the combination of budget overruns and an 11th hour appeal from Claire Danes led to the scene’s demise.\r\nShowrunner Alex Gansa tells TVLine that an … [+970 chars]"}, {"source": {"id": null, "name": "Avclub.com"}, "author": "Zack Handlen", "title": "Secrets are revealed in an unrevealing way on Westworld - The A.V. Club", "description": "In \"Passed Pawn,\" it becomes clear that even though Dolores has left the park, she’s still fighting the same battle she was from the start.", "url": "https://tv.avclub.com/secrets-are-revealed-in-an-unrevealing-way-on-westworld-1843091586", "urlToImage": null, "publishedAt": "2020-04-27T02:00:00Z", "content": "Doc Savage: The Man of Bronze, the 1975 Warner Brothers movie adapting the pulp hero to the big screen, is not very good; Ive seen it half a dozen times or more, because its easy to make fun of with friends, and it has a certain corny charm that works on me e… [+7535 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "When Calls the Heart Cast Reacts to SHOCKING Season 7 Finale (Exclusive) - Entertainment Tonight", "description": "ET's Deidre Behar spoke with 'When Calls the Heart' stars Erin Krakow, Chris McNally and Kevin McGarry about the shocking season 7 cliffhanger, where viewers...", "url": "https://www.youtube.com/watch?v=tbWxeUvV8Ro", "urlToImage": null, "publishedAt": "2020-04-27T01:09:27Z", "content": null}, {"source": {"id": null, "name": "Tmz.com"}, "author": "TMZ Staff", "title": "Kodak Black Wants to Meet Trump for 'Brilliant' Idea, Offers His Life - TMZ", "description": "Mr. President, meet Kodak Black. He's got something important to tell you.", "url": "https://www.tmz.com/2020/04/26/kodak-black-wants-to-meet-trump-brilliant-idea-kill-me/", "urlToImage": null, "publishedAt": "2020-04-27T00:22:00Z", "content": "Kodak Black says he wants to meet President Trump to pass on some knowledge he feels can be useful -- and if DT ain't into it ... KB says the man can take him out, literally.\r\nThe incarcerated rapper posted a bizarre message on social media Sunday, tagging hi… [+1224 chars]"}, {"source": {"id": null, "name": "Variety.com"}, "author": "Klaritza Rico", "title": "Gene Dynarski, ‘Seinfeld’ and ‘Star Trek’ Actor, Dies at 86 - Variety", "description": "Gene Dynarski, who appeared as Izzy Mandelbaum Jr. on “Seinfeld” and on the original “Star Trek” television series, has died. He was 86. Dynarski died on Feb. 27 at a rehabilitation center in Studio City, his friend, playwright Ernest Kearney announced. The a…", "url": "https://variety.com/2020/tv/obituaries-people-news/gene-dynarski-seinfeld-star-trek-actor-dies-dead-1234589717/", "urlToImage": null, "publishedAt": "2020-04-27T00:21:11Z", "content": "Gene Dynarski, who appeared as Izzy Mandelbaum Jr. on “Seinfeld” and on the original “Star Trek” television series, has died. He was 86.\r\nDynarski died on Feb. 27 at a rehabilitation center in Studio City, his friend, playwright Ernest Kearney announced.\r\nThe… [+2039 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Nate Day", "title": "Adam Sandler, Pete Davidson team for quarantine song during remote 'SNL' special - Fox News", "description": "Adam Sandler and Pete Davidson are expressing themselves through song.", "url": "https://www.foxnews.com/entertainment/adam-sandler-pete-davidson-quarantine-song-snl", "urlToImage": null, "publishedAt": "2020-04-26T23:51:15Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox.  Sign up here.\r\nAdam Sandler and Pete Davidson are expressing themselves through song, with the help of another '90s comic.\r\nThe two appeared in the latest at-home episode of \"Satu… [+2158 chars]"}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Aramide Tinubu", "title": "There's Only a 'Small' Chance Prince Harry Will Be Happy in LA, Royal Expert Claims - Showbiz Cheat Sheet", "description": "Prince Harry and Meghan Markle have been spending family time since they arrived in LA. But there's only a small chance the duke will be happy.", "url": "https://www.cheatsheet.com/entertainment/royal-expert-small-chance-prince-harry-happy-los-angeles.html/", "urlToImage": null, "publishedAt": "2020-04-26T23:30:29Z", "content": "When Prince Harry and Meghan, Duchess of Sussex announced Megxit in January 2020, they had a very clear and well-thought-out idea of what they wanted from their lives. At the time, the duke spoke very clearly about why he ultimately made the choice to step aw… [+5896 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Eddie Makuch", "title": "Avengers: Endgame Is The Most Profitable Movie In History - GameSpot", "description": "And Robert Downey Jr. is reportedly walking away with $55 million for his role as Iron Man.", "url": "https://www.gamespot.com/articles/avengers-endgame-is-the-most-profitable-movie-in-h/1100-6476509/", "urlToImage": null, "publishedAt": "2020-04-26T23:24:00Z", "content": "Avengers: Endgame is the most commercially successful movie of all time, with $2.79 billion at the global box office. The movie was extremely expensive to produce, as well, but the epic comic book film made enough money to become the most profitable film in h… [+1661 chars]"}, {"source": {"id": null, "name": "Goldderby.com"}, "author": "Paul Sheehan", "title": "‘American Idol’: How to vote for your favorite Top 20 artist of Season 18 - Gold Derby", "description": "Show support for your favorite artist in the Top 20 of “American Idol” by casting a vote for them during the first live show of season 18 on Sunday, April 26. We have dug some digging and discovered the various methods by which you can make your voice heard. …", "url": "https://www.goldderby.com/article/2020/american-idol-how-to-vote-top-20-season-18/", "urlToImage": null, "publishedAt": "2020-04-26T23:21:53Z", "content": "Show support for your favorite artist in the Top 20 of “American Idol” by casting a vote for them during the first live show of season 18 on Sunday, April 26. We have dug some digging and discovered the various methods by which you can make your voice heard. … [+2305 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alaa Elassar, CNN", "title": "Kristin Cavallari and Jay Cutler are divorcing after 10 years together - CNN", "description": "The reality TV star announced their decision to split on Instagram in an emotional post on Sunday.", "url": "https://www.cnn.com/2020/04/26/us/kristin-cavallari-jay-cutler-divorce-trnd/index.html", "urlToImage": null, "publishedAt": "2020-04-26T22:35:55Z", "content": null}, {"source": {"id": null, "name": "Avclub.com"}, "author": "Sam Barsanti", "title": "Nearly 2 months after retiring mid-broadcast, Chris Matthews admits to \"inappropriate\" behavior - The A.V. Club", "description": "Matthews retired from his MSNBC show Hardball on the night before Super Tuesday in March.", "url": "https://news.avclub.com/nearly-2-months-after-retiring-mid-broadcast-chris-mat-1843092199", "urlToImage": null, "publishedAt": "2020-04-26T22:21:00Z", "content": "Right at the beginning of March, when the Democratic primary was still the biggest news in the nation, MSNBC anchor and Hardball host Chris Matthews announcedright the middle of a broadcast on the night before Super Tuesdaythat he was retiring, effective imme… [+1432 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Penelope Green", "title": "Betsy Wyeth, Andrew Wyeth’s Widow and Collaborator, Dies at 98 - The New York Times", "description": "She was just 17 when she met her future husband. She went on to guide his career and became an avid preservationist of vernacular architecture.", "url": "https://www.nytimes.com/2020/04/26/arts/betsy-wyeth-dead.html", "urlToImage": null, "publishedAt": "2020-04-26T22:06:58Z", "content": "Betsy James Wyeth, the indomitable widow, collaborator and muse of the painter Andrew Wyeth, died on April 21 at her home in Chadds Ford, Pa. She was 98.\r\nShe had been in declining health for years, her son Jamie Wyeth said in confirming the death.\r\nThe coupl… [+7912 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Watch Brad Pitt Portray Dr. Anthony Fauci on 'SNL' | NowThis - NowThis News", "description": "Watch Brad Pitt transform into Dr. Anthony Fauci for the second remote segment of ‘SNL’ 👀 » Subscribe to NowThis: http://go.nowth.is/News_Subscribe » Sign up...", "url": "https://www.youtube.com/watch?v=oiWA4s-4i-A", "urlToImage": null, "publishedAt": "2020-04-26T22:00:16Z", "content": "Watch Brad Pitt transform into Dr. Anthony Fauci for the second remote segment of SNL » Subscribe to NowThis: http://go.nowth.is/News_Subscribe» Sign up for our newsletter KnowThis to get the biggest stories of the day delivered straight to your inbox: https:… [+1314 chars]"}, {"source": {"id": null, "name": "Hollywoodreporter.com"}, "author": "Evan Real", "title": "'Take Me to the World: A Sondheim 90th Birthday Celebration': Watch Live - Hollywood Reporter", "description": "A host of notable names are gathering to perform in a special virtual concert 'Take Me to the World: A Sondheim 90th Birthday Celebration' that will benefit youth in underserved communities.", "url": "https://www.hollywoodreporter.com/news/take-me-world-a-sondheim-90th-birthday-celebration-watch-live-1291510", "urlToImage": null, "publishedAt": "2020-04-26T22:00:00Z", "content": "Hollywood stars and Broadway veterans are teaming Sunday to celebrate the 90th birthday of the legendary composer Stephen Sondheim. In a special virtual concert, titled Take Me to the World: A Sondheim 90th Birthday Celebration, more than 20 powerhouse perfor… [+1894 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Eric Todisco", "title": "Jessie J Sends Ex Channing Tatum a Sweet Birthday Message: 'So Grateful You Were Born' - Yahoo Entertainment", "description": "Jessie J and Channing Tatum split for a second time earlier this month", "url": "https://www.yahoo.com/entertainment/jessie-j-sends-ex-channing-213019718.html", "urlToImage": null, "publishedAt": "2020-04-26T21:30:00Z", "content": "Jessie J has nothing but love for her ex Channing Tatum.\r\nThe \"Domino\" singer, 32, sent the Magic Mike star several birthday messages on her Instagram Story Sunday, just a few weeks after the pair ended their romantic relationship for a second time.\r\n\"Happy 4… [+2307 chars]"}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Trey Mangum", "title": "'RuPaul's Secret Celebrity Drag Race': What Is Jordan Connor Most Known For? - Showbiz Cheat Sheet", "description": "A winner was crowned Friday night on the first installment of RuPaul's Celebrity Drag Race. Among the contestants was actor Jordan Connor, recognizable from one of the biggest teen drama series out right now.", "url": "https://www.cheatsheet.com/entertainment/rupauls-secret-celebrity-drag-race-what-is-jordan-connor-most-known-for.html/", "urlToImage": null, "publishedAt": "2020-04-26T21:08:34Z", "content": "A winner was crowned Friday night on the first installment of RuPaul’s Secret Celebrity Drag Race. Among the contestants was actor Jordan Connor, recognizable from one of the biggest teen drama series out right now. \r\nJordan Connor | Andrew Chin/Getty Images\r… [+2221 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Katherine Schwarzenegger Pratt Is PREGNANT! - Entertainment Tonight", "description": "Katherine Schwarzenegger and her hubby Chris Pratt are expecting their first child together.", "url": "https://www.youtube.com/watch?v=CUFR8ycaZA0", "urlToImage": null, "publishedAt": "2020-04-26T21:00:03Z", "content": null}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Nate Day", "title": "Kristen Bell records Dax Shepard performing surgery on himself during coronavirus pandemic - Fox News", "description": "Self-isolating has people turning to their own devices for everything -- even surgery.", "url": "https://www.foxnews.com/entertainment/kristen-bell-dax-shepard-performing-surgery-himself-coronavirus", "urlToImage": null, "publishedAt": "2020-04-26T20:51:34Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox.  Sign up here.\r\nSelf-isolating has people turning to their own devices for everything -- even surgery.\r\nAfter recently injuring his arm, Dax Shepard chose to remove pins from his h… [+1209 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Kim Severson", "title": "Safe Dining? Hard to Imagine, but Many Restaurants Are Trying - The New York Times", "description": "Though widespread reopenings may be a long way off, chefs and health officials have begun studying how a post-pandemic restaurant might look.", "url": "https://www.nytimes.com/2020/04/26/dining/restaurants-open-coronavirus.html", "urlToImage": null, "publishedAt": "2020-04-26T20:39:21Z", "content": "ATLANTA This week, a restaurant here intends to sell what will likely be Americas first dry-aged porterhouse steak served by a waiter at a white-tablecloth restaurant in the midst of a global pandemic.\r\nGov. Brian Kemp, citing state health data showing that t… [+9328 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Libertina Brandt", "title": "Tom Hanks and Rita Wilson to donate blood after battling coronavirus - Business Insider - Business Insider", "description": "Tom Hanks and his wife, Rita Wilson, tested positive for COVID-19 back in early March. Hanks announced they will donate blood to help find a vaccine.", "url": "https://www.businessinsider.com/tom-hanks-and-rita-wilson-to-donate-blood-after-battling-coronavirus-2020-4", "urlToImage": null, "publishedAt": "2020-04-26T20:05:58Z", "content": "Tom Hanks and his wife, Rita Wilson, have offered to donate their blood to help develop a coronavirus vaccine.\r\nThe couple tested positive for the virus back in early March while in Australia. \r\nHello, folks. @ritawilson and I are down here in Australia. We f… [+1545 chars]"}, {"source": {"id": null, "name": "Salon.com"}, "author": "Melanie McFarland", "title": "\"Penny Dreadful: City of Angels\": Glam Nazis menace LA in this high style, no heart spin-off - Salon", "description": "John Logan's return to the \"Penny Dreadful\" universe shows many sides of Natalie Dormer, but veers off the map", "url": "https://www.salon.com/2020/04/26/penny-dreadful-city-of-angels-review/", "urlToImage": null, "publishedAt": "2020-04-26T19:47:55Z", "content": "\"Penny Dreadful: City of Angels\" creator John Logan has a masterful understanding of creating a look, that much is sure. The production's recreation of 1938 Los Angeles is a gorgeous vision, from the curvaceous autos to the Hollywood Regency-style arches and … [+6713 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Greg Hilburn", "title": "Drive-by shooters spray Duck Dynasty star Willie Robertson's estate with bullets - USA TODAY", "description": "One bullet lodged in the bedroom wall of son John Luke Robertson's and his wife Mary Kate McEachern's home.", "url": "https://www.usatoday.com/story/news/nation/2020/04/26/drive-by-shooters-spray-duck-dynasty-star-willie-robertsons-estate-eoyj-bullets/3030341001/", "urlToImage": null, "publishedAt": "2020-04-26T19:40:10Z", "content": "The \"Duck Dynasty\" stars lives and careers are featured in a new interactive museum at the Duck Commander headquarters in West Monroe called Duck Commander The Tour.\r\nMONROE, La. \"Duck Dynasty\" star Willie Robertson said his family was the victim of a drive-b… [+2537 chars]"}, {"source": {"id": null, "name": "Avclub.com"}, "author": "Sam Barsanti", "title": "Congratulations to Kanye West, America's newest and pettiest billionaire - The A.V. Club", "description": "It's very important to Kanye West that everyone knows that he has a lot of money.", "url": "https://news.avclub.com/congratulations-to-kanye-west-americas-newest-and-pett-1843089313", "urlToImage": null, "publishedAt": "2020-04-26T19:35:00Z", "content": "Its Sunday, the day reserved for paying attention to Kanye West, and today theres a big reason why were paying attention to him or, to be more accurate, theres a billion reasons why were paying attention to him: According to a Forbes profile, Kanye West is of… [+2428 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "John Wick Squares Off Against Hemsworth's Rake in Extraction Fan Art - Screen Rant", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiUGh0dHBzOi8vc2NyZWVucmFudC5jb20vam9obi13aWNrLWtlYW51LXJlZXZlcy1jaHJpcy1oZW1zd29ydGgtZXh0cmFjdGlvbi1mYW5hcnQv0gFUaHR0cHM6Ly9zY3JlZW5yYW50LmNvbS9qb2huLXdpY2sta2VhbnUtcmVldmVzLWNocmlzLWhlbXN3b3J0aC1leHRyYWN0aW9uLWZhbmFydC9hbXAv?oc=5", "urlToImage": null, "publishedAt": "2020-04-26T19:24:11Z", "content": null}, {"source": {"id": null, "name": "Hollywoodlife.com"}, "author": "Ryan Shea", "title": "Sofia Vergara, 47, Stuns In A Blue Bikini During ‘Patio Picnic’ With Husband Joe Manganiello - HollywoodLife", "description": "Sofia Vergara left little to the imagination during a fun outing with her hunky husband Joe Manganiello!", "url": "https://hollywoodlife.com/2020/04/26/sofia-vergara-blue-bikini-picnic-joe-manganiello-pic/", "urlToImage": null, "publishedAt": "2020-04-26T19:00:37Z", "content": "Sofia Vergara left little to the imagination during a fun outing with her hunky husband Joe Manganiello!\r\nLooking good and feeling gorgeous! Sofia Vergara, 47, and her hubby Joe Manganiello, 43, enjoyed some fun in the sun during a “patio picnic” on Saturday,… [+1919 chars]"}, {"source": {"id": null, "name": "Sheknows.com"}, "author": "Julie Sprankles", "title": "We Can’t Unsee Ryan Reynolds’ Tiny Quarantine Ponytail (Well-Played, Blake Lively) - SheKnows", "description": "In case you were wondering, quarantine has not made Ryan Reynolds and Blake Lively call a moratorium on trolling each other. In fact, Lively dragged Reynolds over the weekend for sporting a tiny quarantine ponytail that, if we’re really being honest, we could…", "url": "https://www.sheknows.com/entertainment/articles/2224250/ryan-reynolds-quarantine-ponytail-blake-lively-instagram/", "urlToImage": null, "publishedAt": "2020-04-26T18:58:33Z", "content": "In case you were wondering, quarantine has not made Ryan Reynolds and Blake Lively call a moratorium on trolling each other. In fact, Lively dragged Reynolds over the weekend for sporting a tiny quarantine ponytail that, if were really being honest, we couldn… [+2172 chars]"}, {"source": {"id": null, "name": "Vulture.com"}, "author": "Devon Ivie", "title": "SNL Promotes Kate McKinnon’s Cat to Featured Player - Vulture", "description": "He has the range.", "url": "https://www.vulture.com/2020/04/snl-kate-mckinnon-and-her-cat-star-in-whiskers-r-we-watch.html", "urlToImage": null, "publishedAt": "2020-04-26T18:39:12Z", "content": "The longing for cute and cuddly pet adoptions has never been higher thanks to our perpetual self-quarantine era, and what perfect timing is this: Whiskers R We owner Barbara DeDrew (Kate McKinnon), denied her small-business loan, has to make a commercial from… [+467 chars]"}, {"source": {"id": null, "name": "Jambase.com"}, "author": "Nate Todd", "title": "Post Malone Performs Nirvana Tribute - JamBase", "description": "Post Malone conducted a Nirvana livestream tribute on Friday benefitting The United Nations Foundation’s COVID-19 Solidarity Response Fund for The World Health Organization.", "url": "https://www.jambase.com/article/post-malone-nirvana-tribute", "urlToImage": null, "publishedAt": "2020-04-26T18:21:09Z", "content": "Post Malone delivered a Nirvana tribute livestream set on Friday. Post performed from home with virtual contributions from drummer Travis Barker of Blink-182, bassist Brian Lee and guitarist Nick Mac.\r\nPost Malone opened up the tribute set benefitting The Uni… [+1717 chars]"}, {"source": {"id": null, "name": "Thewrap.com"}, "author": null, "title": "'The Price Is Right' Announcer George Gray 'in Good Spirits' After 3 Heart Attacks - msnNOW", "description": "George Gray, the announcer for \"The Price Is Right,\" is currently recovering in the hospital after suffering three massive heart attacks, but according to his publicist, he is \"in good spirits.\" Gray was first hospitalized in Arizona last week after suffering…", "url": "https://www.thewrap.com/the-price-is-right-announcer-george-gray-in-good-spirits-after-3-heart-attacks/", "urlToImage": null, "publishedAt": "2020-04-26T18:02:00Z", "content": "George Gray, the announcer for \"The Price Is Right,\" is currently recovering in the hospital after suffering three massive heart attacks, but according to his publicist, he is \"in good spirits.\"\r\n© TheWrap\r\n George Gray The Price Is Right\r\nGray was first hosp… [+1079 chars]"}, {"source": {"id": "entertainment-weekly", "name": "Entertainment Weekly"}, "author": "Rosy Cordero", "title": "Dave Chappelle helps raise over $100k for struggling comics during coronavirus pandemic - Entertainment Weekly", "description": "Dave Chappelle was a surprise guest at The Comedy Store live fundraiser event that raised over $100k for struggling comic during the coronavirus pandemic.", "url": "https://ew.com/tv/dave-chappelle-comedy-store-fundrasier-coronavirus/", "urlToImage": null, "publishedAt": "2020-04-26T17:50:08Z", "content": "The Comedy Store may be closed during the coronavirus pandemic, but they haven't forgotten the talent who've graced their stage who are now struggling to make ends meet.\r\nThe famous Los Angeles stand-up comedy venue hosted a live three-part podcast benefit on… [+1216 chars]"}, {"source": {"id": null, "name": "Cinemablend.com"}, "author": "Mack Rawden", "title": "When Will Disney World Reopen? One Analyst Is Really Pessimistic - CinemaBlend", "description": "No one is exactly sure at this point when Disney World might reopen its doors to the general public, but one prediction from a major financial analyst is pretty bleak.", "url": "https://www.cinemablend.com/news/2495138/when-will-disney-world-reopen-one-analyst-is-really-pessimistic", "urlToImage": null, "publishedAt": "2020-04-26T17:48:33Z", "content": "No one is exactly sure at this point when Disney World might reopen its doors to the general public, but one prediction from a major financial analyst is pretty bleak. John Hodulik, a managing director at UBS, a leading financial firm, published a paper this … [+3975 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Nate Day", "title": "Demi Lovato opens up about her 'biggest inspiration' during rehab: 'I'm so much happier now' - Fox News", "description": "Demi Lovato is opening up about her time in rehab.", "url": "https://www.foxnews.com/entertainment/demi-lovato-rehab", "urlToImage": null, "publishedAt": "2020-04-26T17:24:05Z", "content": "Demi Lovato is opening up about her time in rehab.\r\nThe singer recently participated in a virtual reunion with her \"Sonny with a Chance\" co-stars from her days on Disney Channel.\r\nEarly on in the chat Allisyn Ashley Arm asked her co-stars what they've been up… [+2696 chars]"}, {"source": {"id": null, "name": "Thenews.com.pk"}, "author": "Web  Desk", "title": "Chernobyl Diaries actor Dimitri Diatchenko dies at 52 - The News International", "description": "'Chernobyl Diaries' actor Dimitri Diatchenko dies at 52", "url": "https://www.thenews.com.pk/latest/650194-chernobyl-diaries-actor-dimitri-diatchenko-dies-at-52", "urlToImage": null, "publishedAt": "2020-04-26T17:16:25Z", "content": "Police in Florida found actor   Dimitri Diatchenko dead in his house, according to reports.\r\nThe \"Sons of Anarchy\" actor was 52.\r\nCNN reported that police found him unresponsive and keeling with his face down in a reclining chair in his living room on Wednesd… [+490 chars]"}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Matthew Trzcinski", "title": "Mick Jagger Weighs in on Paul McCartney's Claim the Beatles Outdid the Rolling Stones - Showbiz Cheat Sheet", "description": "Paul McCartney said the Beatles were better than the Rolling Stones and now Mick Jagger is responding to his widely-publicized comments.", "url": "https://www.cheatsheet.com/entertainment/mick-jagger-weighs-in-on-paul-mccartneys-claim-the-beatles-outdid-the-rolling-stones.html/", "urlToImage": null, "publishedAt": "2020-04-26T17:04:14Z", "content": "In the minds of many music fans in the 1960s, the Beatles and the Rolling Stones were rivals. That rivalry was fake and fans dont compare the bands as much as they used to do. Until now.\r\nPaul McCartney was interviewed on The Howard Stern Show. Paul said he b… [+3033 chars]"}, {"source": {"id": null, "name": "Hollywoodreporter.com"}, "author": "Lexy Perez", "title": "Demi Lovato Reflects on Eating Disorder, Being \"Overworked\" During Disney Years - Hollywood Reporter", "description": "Lovato reunited with castmembers from her former Disney Channel original series 'Sonny With a Chance' where she recalled struggling with an eating disorder: \"I was underweight and freezing.\"", "url": "https://www.hollywoodreporter.com/news/demi-lovato-reflects-eating-disorder-being-overworked-disney-years-1291909", "urlToImage": null, "publishedAt": "2020-04-26T16:51:43Z", "content": "Demi Lovato took a trip down Disney memory lane as she reunited with castmembers from her former Disney Channel original series Sonny With a Chance. \r\nJoining the show's former stars Tiffany Thornton, Allisyn Ashley Arm, Doug Brochu, Sterling Knight, Audrey W… [+4266 chars]"}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Julia Dzurillay", "title": "It's a (Zoom) Party Get Down — The Cast of 'Sonny With a Chance' and 'So Random' Have a Reunion Over Video Chat - Showbiz Cheat Sheet", "description": "For a laugh and a bit of nostalgia, Disney Channel fans caught up with the cast of 'Sonny With a Chance' and 'So Random.' Here's what you might've missed from the cast's reunion.", "url": "https://www.cheatsheet.com/entertainment/so-random-demi-lovato-reunion.html/", "urlToImage": null, "publishedAt": "2020-04-26T16:41:22Z", "content": "It’s always a party with this Disney Channel cast. Years after the final episode of Sonny With a Chance and its spinoff So Random, the actors behind this series reunited for a laugh-filled video chat. Here’s our look into this iconic reunion, featuring Demi L… [+2777 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Stephen Smith", "title": "Coronavirus victim Jonathan Coelho leaves heartbreaking goodbye note for wife, kids: \"I'm so lucky\" - CBS News", "description": "A Connecticut woman who lost her 32-year-old husband to coronavirus said she later a heart-wrenching goodbye note that he had left for his family.", "url": "https://www.cbsnews.com/news/coronavirus-death-jonathan-coelho-leaves-goodbye-note-family-connecticut/", "urlToImage": null, "publishedAt": "2020-04-26T16:17:11Z", "content": "A Connecticut woman who lost her 32-year-old husband to coronavirus complications said she later found a heart-wrenching goodbye note that he had left for his family. Jonathan Coelho died on Wednesday, after a 28-day battle in the hospital and 20 days on a ve… [+2532 chars]"}, {"source": {"id": null, "name": "Jambase.com"}, "author": "Nate Todd", "title": "Miley Cyrus Covers Pink Floyd's 'Wish You Were Here' For 'Saturday Night Live' - JamBase", "description": "Miley Cyrus offered up a Pink Floyd classic on ‘Saturday Night Live at Home.’", "url": "https://www.jambase.com/article/miley-cyrus-pink-floyd-wish-you-were-here-saturday-night-live", "urlToImage": null, "publishedAt": "2020-04-26T15:48:56Z", "content": "Miley Cyrus was the musical guest on Saturday Night Live at Home last night. Miley delivered a cover of Pink Floyds Wish You Were Here.\r\nThe song originally appears on the legendary rock bands 1975 album of the same name. While Wish You Were Here is a tribute… [+274 chars]"}, {"source": {"id": null, "name": "Vulture.com"}, "author": "Matthew Love", "title": "Saturday Night Live Recap: At-Home Improvement - Vulture", "description": "SNL is proving that the At-Home experiment can work, with a little extra polish and strong cameos from Brad Pitt, Paul Rudd, and Adam Sandler.", "url": "http://www.vulture.com/2020/04/snl-at-home-recap-season-45-episode-17.html", "urlToImage": null, "publishedAt": "2020-04-26T15:42:10Z", "content": "The first Saturday Night Live at Home which aired a couple of weeks ago, or maybe a few years ago, or possibly yesterday illustrated the good and bad of shows created in quarantine. The Zoom sketches made clear the limitations of the app, and pre-recorded vid… [+11054 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Reservoir Dogs' Mr. Blonde Cuts Off Family's Ears While In Quarantine - Screen Rant", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiUGh0dHBzOi8vc2NyZWVucmFudC5jb20vcmVzZXJ2b2lyLWRvZ3MtbXItYmxvbmRlLW1pY2hhZWwtbWFkc2VuLXF1YXJhbnRpbmUtdmlkZW8v0gFUaHR0cHM6Ly9zY3JlZW5yYW50LmNvbS9yZXNlcnZvaXItZG9ncy1tci1ibG9uZGUtbWljaGFlbC1tYWRzZW4tcXVhcmFudGluZS12aWRlby9hbXAv?oc=5", "urlToImage": null, "publishedAt": "2020-04-26T15:30:54Z", "content": null}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Cory Stieg", "title": "Disney has free animation classes online—and drawing can help you relax and focus during the pandemic - CNBC", "description": "Disney has free drawing classes on YouTube that teach you how to doodle your favorite characters, right from the pros. Studies suggest it could help with stress, sadness and concentration amid Covid-19.", "url": "https://www.cnbc.com/2020/04/26/free-disney-animation-courses-on-youtube-can-relieve-covid-19-stress.html", "urlToImage": null, "publishedAt": "2020-04-26T15:11:19Z", "content": "From baking to puzzles, the Covid-19 quarantine might have you turning to hobbies that you never had time for before.\r\nIf you're looking for a calming weekend art project, Disney has free drawing classes on YouTube.\r\nYou can learn how to draw some of the most… [+1891 chars]"}, {"source": {"id": null, "name": "Dailysoapdish.com"}, "author": "CP Bialois", "title": "‘The Bold and the Beautiful’ Spoilers Next Week: Thomas Returns, Penny and Sally Bumble, Ridge Misses Shauna - Daily Soap Dish", "description": "CBS 'The Bold and the Beautiful' (B&B) spoilers for next week find that you have here the Possible Weekly Preview for April 17 to May 1. We say possible, because there are a few sites and fans out there sharing spoilers that make it appear that B", "url": "https://dailysoapdish.com/2020/04/the-bold-and-the-beautiful-spoilers-next-week-thomas-returns-penny-and-sally-bumble-ridge-misses-shauna/", "urlToImage": null, "publishedAt": "2020-04-26T14:52:39Z", "content": "CBS ‘The Bold and the Beautiful’ (B&amp;B) spoilers for next week find that you have here the Possible Weekly Preview for April 17 to May 1. We say possible, because there are a few sites and fans out there sharing spoilers that make it appear that B&amp;B is… [+4283 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Kellie Chudzinski For Dailymail.com", "title": "Bachelorette star Clare Crawley shades contestant Matt James for using show for attention - Daily Mail", "description": "The upcoming season of the Bachelorette has been postponed as the coronavirus shut down productions across Hollywood. But there is already some drama.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8257825/Bachelorette-star-Clare-Crawley-shades-contestant-Matt-James-using-attention.html", "urlToImage": null, "publishedAt": "2020-04-26T14:38:45Z", "content": "The upcoming season of the Bachelorette has been postponed as the coronavirus shut down productions across Hollywood. \r\nBut there is already some drama among the upcoming star Clare Crawley and a contestant. \r\nThe 39-year-old hairstylist took to Twitter to se… [+4600 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Charlie Puth Plays Selena Gomez's 'Boyfriend' | Capital - Capital FM", "description": "What better way to learn the piano than being taught by the musical genius that is Charlie Puth? Host of Capital Breakfast Roman Kemp got the chance of a 1-2...", "url": "https://www.youtube.com/watch?v=5FqC_7RJebY", "urlToImage": null, "publishedAt": "2020-04-26T14:38:06Z", "content": null}, {"source": {"id": null, "name": "Yourtango.com"}, "author": "https://www.facebook.com/ariagmitterwriter/", "title": "Today's Horoscopes For All Zodiac Signs On Sunday, April 26, 2020 - YourTango", "description": "Start to plan for the future.", "url": "https://www.yourtango.com/2020333109/horoscopes-free-daily-each-zodiac-sign-april-26-2020-according-astrology", "urlToImage": null, "publishedAt": "2020-04-26T14:23:42Z", "content": "Start to plan for the future. \r\nToday's horoscopes are here with daily astrology forecasts for each of the zodiac signs on Sunday, April 26, 2020.\r\nThe Sun is in the zodiac sign of Taurus. The Moon is in the sign of Gemini.\r\nWhat do today's horoscopes have in… [+8198 chars]"}, {"source": {"id": null, "name": "Pitchfork.com"}, "author": "Evan Minsker", "title": "Watch Bad Bunny Try to Sell You Sweatpants on SNL - Pitchfork", "description": "The episode also featured a collaborative Adam Sandler and Pete Davidson music video", "url": "https://pitchfork.com/news/watch-bad-bunny-try-to-sell-you-sweatpants-on-snl/", "urlToImage": null, "publishedAt": "2020-04-26T14:11:32Z", "content": "This weeks Saturday Night Live featured a sketch called Big Papi Cooking Show, wherein Kenan Thompson offers a cooking tutorial (sort of) as former Boston Red Sox player David Ortiz. During the sketch, Thompson introduced Big Bunny, which of course was Bad Bu… [+594 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Amalie Henden", "title": "Kate Middleton title: Is Kate Middleton a Princess? What is Kate’s full title? - Express", "description": "KATE MIDDLETON married Prince William, the second in line to the British throne, in a fairytale ceremony in 2011. But is she a Princess? What is Kate's full royal title?", "url": "https://www.express.co.uk/news/royal/1274059/Kate-Middleton-title-is-Kate-Middleton-a-Princess-Duchess-Queen-royal-family-title", "urlToImage": null, "publishedAt": "2020-04-26T13:56:02Z", "content": null}, {"source": {"id": null, "name": "Nme.com"}, "author": null, "title": "‘Spider-Man’ star Tom Holland is hosting a Marvel-themed charity pub quiz - NME Live", "description": "It comes in aid of The Brothers Trust, set up by Holland's family", "url": "https://www.nme.com/news/film/spider-man-star-tom-holland-is-hosting-a-marvel-themed-charity-pub-quiz-2654025", "urlToImage": null, "publishedAt": "2020-04-26T13:55:20Z", "content": "Spider-Man star Tom Holland is set to host a Marvel-themed charity pub quiz next week.\r\nOn Wednesday night (April 29) at 8pm BST, Holland will quiz fans on all things MCU in aid of his family’s Brothers Trust.\r\nHolland announced details of the quiz when appea… [+1019 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Too Hot to Handle: Matthew Explains Why Leaving The Show Early Helped Some of The Guys (Exclusi… - Entertainment Tonight", "description": "ET chatted with 'Too Hot to Handle' cast member Matthew Smith about why he decided to leave the show early. Exclusives from #ETonline : https://www.youtube.c...", "url": "https://www.youtube.com/watch?v=p5R3NbncxoQ", "urlToImage": null, "publishedAt": "2020-04-26T13:00:25Z", "content": "ET chatted with 'Too Hot to Handle' cast member Matthew Smith about why he decided to leave the show early.\r\nExclusives from #ETonline :https://www.youtube.com/playlist?list..."}, {"source": {"id": null, "name": "Avclub.com"}, "author": "Danette Chavez", "title": "Cory Finley on Bad Education, capitalism, and Hugh Jackman’s walk of shame - The A.V. Club", "description": "\"Directing a story where you want to place an emphasis on the words puts the onus on the director to find intentional ways to frame each scene so that it’s not just sort of a long series of conversations that are shot in exactly the same way.\"", "url": "https://tv.avclub.com/cory-finley-on-bad-education-capitalism-and-hugh-jack-1843031267", "urlToImage": null, "publishedAt": "2020-04-26T13:00:00Z", "content": "With dark humor and one of Hugh Jackmans finest onscreen performances, HBOs Bad Education puts the lie to Horace Manns declaration that education is the great equalizer. The film, which premiered at the Toronto International Film Festival last year, is based … [+13318 chars]"}, {"source": {"id": null, "name": "Wrestlingnews.co"}, "author": "Andrew Ravens", "title": "Early betting odds released for top WWE Money in the Bank matches - Wrestling News", "description": "Early betting odds for some matches at WWE’s next pay-per-view event, Money in the Bank, have been released. The WWE Money in the Bank pay-per-view event is slated to be held on Sunday, May 10, 2020. It should be noted that WWE has booked Otis vs. Dolph Ziggl…", "url": "https://wrestlingnews.co/wwe-news/early-betting-odds-released-for-top-wwe-money-in-the-bank-matches/", "urlToImage": null, "publishedAt": "2020-04-26T12:59:32Z", "content": "Early betting odds for some matches at WWEs next pay-per-view event, Money in the Bank, have been released.\r\nThe WWE Money in the Bank pay-per-view event is slated to be held on Sunday, May 10, 2020.\r\nIt should be noted that WWE has booked Otis vs. Dolph Zigg… [+1044 chars]"}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Suse Forrest", "title": "Why Amy Poehler Is Making Her Kids Binge 'Parks and Recreation' - Showbiz Cheat Sheet", "description": "Find out why actress Amy Poehler is making her children binge-watch her NBC hit sitcom 'Parks and Rec.' Find out why actress Amy Poehler is making her children binge-watch her NBC hit sitcom 'Parks and Rec.'", "url": "https://www.cheatsheet.com/entertainment/why-amy-poehler-is-making-her-kids-binge-parks-and-recreation.html/", "urlToImage": null, "publishedAt": "2020-04-26T11:41:08Z", "content": "Many parents are finding the COVID-19 lockdown very difficult. Not only are they having to try and keep their kids entertained all day while making sure that they stay indoors, but they are also having to perform a new role as their children’s teacher as scho… [+4343 chars]"}, {"source": {"id": null, "name": "As.com"}, "author": "Epik", "title": "Tiger King, Unorthodox and other Netflix essential lockdown viewing - AS English", "description": "With many parts of the world under lockdown, platforms such as Netflix have seen a major boost in interest as we look for avenues of escape.", "url": "https://en.as.com/en/2020/04/26/other_sports/1587901060_093242.html", "urlToImage": null, "publishedAt": "2020-04-26T11:37:40Z", "content": "With many parts of the world now having spent more than a month under lockdown, online platforms such as Netflix, Amazon Video and HBO have seen a surge in subscription levels as households across the planet look for moments of escapism from the ongoing coron… [+3654 chars]"}, {"source": {"id": null, "name": "Nme.com"}, "author": null, "title": "Live Nation change their refund plan to include postponed shows awaiting new dates - NME Live", "description": "Promoter giant Live Nation has altered its refund policy amid the coronavirus crisis to include postponed shows that are yet to be given a new date.", "url": "https://www.nme.com/news/music/live-nation-change-their-refund-plan-to-include-postponed-shows-awaiting-new-dates-2653992", "urlToImage": null, "publishedAt": "2020-04-26T10:56:39Z", "content": "Live Nation have revised their refund plan for gigs affected by the coronavirus.\r\nThe promoter giant came under fire for not offering fans refunds for gigs that were postponed indefinitely and awaiting a new date.\r\nOriginally, fans could only obtain a refund … [+1434 chars]"}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Alice Stone", "title": "Kylie Jenner's Instagram Stories Prove She Isn't Having Kids Anytime Soon, Say Fans - Showbiz Cheat Sheet", "description": "Fans are sure that Kylie Jenner is not having another kid any time soon. Fans are sure that Kylie Jenner is not having another kid any time soon.", "url": "https://www.cheatsheet.com/entertainment/kylie-jenners-instagram-stories-prove-she-isnt-having-kids-anytime-soon-say-fans.html/", "urlToImage": null, "publishedAt": "2020-04-26T10:20:21Z", "content": "There’s been a lot of speculation floating around about a post-pandemic baby boom. With everyone holed up inside with their significant others, some people think that there are bound to be more babies born in nine months. \r\nSome fans of Keeping Up with the Ka… [+3428 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Jack Hobbs", "title": "Jerry Bishop, announcer on 'Judge Judy' for 24 years dead at 84 - New York Post ", "description": "Jerry Bishop, who announced the iconic Judge Judy daytime courtroom show for 24 years, passed away on Tuesday after heart complications and kidney failure, his granddaughter told the Hollywood Repo…", "url": "https://nypost.com/2020/04/26/jerry-bishop-announcer-on-judge-judy-for-24-years-dead-at-84/", "urlToImage": null, "publishedAt": "2020-04-26T06:51:51Z", "content": "Jerry Bishop, who announced the iconic Judge Judy daytime courtroom show for 24 years, passed away on Tuesday after heart complications and kidney failure, his granddaughter told the Hollywood Reporter.\r\nHe was 84.\r\nThe Hartford, Conn. born Bishop got a degre… [+520 chars]"}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Eryn Murphy", "title": "How to Watch SuperM's 'Beyond LIVE' Online Concert - Showbiz Cheat Sheet", "description": "On April 26, SuperM will kick off the new 'Beyond Live' virtual concert series. Here's how to watch their performance.", "url": "https://www.cheatsheet.com/entertainment/how-to-watch-superm-beyond-live-online-concert-kpop-sm-entertainment.html/", "urlToImage": null, "publishedAt": "2020-04-26T05:12:00Z", "content": "For fans who want the chance to see SuperM, WayV, NCT Dream, and NCT 127 in concert, the wait is almost over. SM Entertainment has partnered with Naver and will be broadcasting the groups’ live concert performances to start the live concert streaming service … [+2679 chars]"}, {"source": {"id": null, "name": "Sfchronicle.com"}, "author": "Steve Rubenstein", "title": "Tony Bennett helps combat coronavirus blues as SF sing its heart out in unison - San Francisco Chronicle", "description": "At high noon, there was no getting away from the sound of “I Left My Heart in San Francisco” in the city’s first live-from-everyplace pandemic feel-good sing-along.", "url": "https://datebook.sfchronicle.com/music/sf-sings-its-heart-out-with-tony-bennett-to-combat-coronavirus-blues", "urlToImage": null, "publishedAt": "2020-04-26T03:11:15Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Alinity Has Been Suspended From Twitch | TheGamer - TheGamer", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiRWh0dHBzOi8vd3d3LnRoZWdhbWVyLmNvbS9hbGluaXR5LXR3aXRjaC1iYW4tc3VzcGVuc2lvbi1uaXAtc2xpcC1uc2Z3L9IBSWh0dHBzOi8vd3d3LnRoZWdhbWVyLmNvbS9hbGluaXR5LXR3aXRjaC1iYW4tc3VzcGVuc2lvbi1uaXAtc2xpcC1uc2Z3L2FtcC8?oc=5", "urlToImage": null, "publishedAt": "2020-04-26T02:47:13Z", "content": null}, {"source": {"id": null, "name": "Hiphopdx.com"}, "author": "Kyle Eustice", "title": "Lil Uzi Vert Claims He Fought Playboi Carti To Squash 'Beef' - HipHopDX", "description": "Lil Uzi Vert once again set his sights on former collaborator Playboi Carti earlier this month, calling Carti's new \"Meh\" single \"just meh\"", "url": "https://hiphopdx.com/news/id.55602/title.lil-uzi-vert-claims-he-fought-playboi-carti-to-squash-beef", "urlToImage": null, "publishedAt": "2020-04-26T02:30:00Z", "content": "Lil Uzi Vert once again set his sights on former collaborator Playboi Carti last week, calling Carti’s new “Meh” single “just meh” and promising to drop new music on the same day Carti did. Their fans couldn’t quite figure out what was going on between the tw… [+1020 chars]"}, {"source": {"id": null, "name": "Newsleader.com"}, "author": "Leanna Smith", "title": "Statler Brothers fans honor 'hometown hero' Harold Reid with memories, flowers - The News Leader", "description": "By Saturday afternoon, Harold Reid's stool at the Statler Brothers monument in Staunton was decorated with flowers and notes.", "url": "https://www.newsleader.com/story/news/2020/04/25/statler-brothers-fans-honor-harold-reid-memories-flowers/3025982001/", "urlToImage": null, "publishedAt": "2020-04-25T23:16:36Z", "content": "Statler Brothers founding member Harold Reid dies. A remembrance.\r\nWochit\r\nSTAUNTON Statler Brothers fans far and wide are celebrating the life of Harold Reid, who was a founding member of the award-winning country music group. \r\nA post on the Statler Brother… [+4147 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Dean Balsamini", "title": "Rolling Stones top charts with 'Living in a Ghost Town' - New York Post ", "description": "On Thursday, the band released  “Living in a Ghost Town,” with an accompanying video, and the track jumped to the top of the iTunes’ song chart. It was the band’s first No. 1 hit in 40 y…", "url": "https://nypost.com/2020/04/25/rolling-stones-top-charts-with-living-in-a-ghost-town/", "urlToImage": null, "publishedAt": "2020-04-25T23:07:51Z", "content": "The legendary Rolling Stones got some satisfaction with a new chart-topping song, their first No. 1 hit on iTunes.\r\nOn Thursday, the band released  Living in a Ghost Town, with an accompanying video, and the track jumped to the top of the iTunes song chart, b… [+656 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Simon's GOLDEN BUZZER: Fayth Ifil is ROLLIN' all the way to the Semi-Finals! | BGT 2020 - Britain's Got Talent", "description": "See more from Britain's Got Talent at http://itv.com/talent Watch Britain's Got Talent: Unseen on the ITV HUB: https://bit.ly/2RreDOp Simon thinks a star is ...", "url": "https://www.youtube.com/watch?v=aii62acsp_E", "urlToImage": null, "publishedAt": "2020-04-25T19:42:20Z", "content": null}, {"source": {"id": null, "name": "Pagesix.com"}, "author": "Jessica Bennett", "title": "Elisabeth Hasselbeck tells 'aggressive' Meghan McCain to 'turn off the meanness' - Page Six", "description": "Elisabeth Hasselbeck has called out “The View” panelist Meghan McCain for recent comments the conservative made during her Wednesday appearance on “Watch What Happens Live.”", "url": "https://pagesix.com/2020/04/25/elisabeth-hasselbeck-hits-back-at-aggressive-meghan-mccain/", "urlToImage": null, "publishedAt": "2020-04-25T18:35:23Z", "content": "Elisabeth Hasselbeck has called out “The View” panelist Meghan McCain for recent comments the conservative made during her Wednesday appearance on “Watch What Happens Live.”\r\nWhile virtually sitting down with host Andy Cohen, McCain, 35, took Hasselbeck to ta… [+1870 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Rasha Ali", "title": "Jeff Goldblum criticized for 'dangerous and hurtful' comments on Islam during 'RuPaul's Drag Race' - USA TODAY", "description": "Jeff Goldblum came under fire on social media for his questions about Islam during an episode of \"RuPaul's Drag Race.\"", "url": "https://www.usatoday.com/story/entertainment/celebrities/2020/04/25/jeff-goldblum-criticized-twitter-dangerous-comments-islam/3025998001/", "urlToImage": null, "publishedAt": "2020-04-25T18:19:50Z", "content": "Jeff Goldblum shares the inside scoop on his new show from National Geographic 'The World According to Jeff Goldblum' set to premiere on Disney+.\r\nUSA TODAY\r\nJeff Goldblum became a  topic of discussion on social media for his questions about Islam's treatment… [+4911 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Anna MacSwan", "title": "Queen's life in lockdown with just a dozen staff and her budgies, but no horse rides - Mirror Online", "description": "The 94-year-old Queen is reportedly keeping in touch with family through video messenger and avidly watching the news as she and Prince Phillip spend lockdown at Windsor Castle", "url": "https://www.mirror.co.uk/news/uk-news/queens-life-lockdown-just-dozen-21924664", "urlToImage": null, "publishedAt": "2020-04-25T16:34:30Z", "content": "The Queen is reportedly being looked after by just a dozen staff and has been keeping in touch with family through video calls during lockdown.\r\n The 94-year-old monarch has been isolating with husband Prince Phillip, 98, at Windsor Castle amid the coronaviru… [+2811 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Paul Tassi", "title": "‘Fortnite’ Players Think This Travis Scott Clue May Lead To The Return Of The Old Map - Forbes", "description": "Is the old Fortnite Chapter 1 map coming back?", "url": "https://www.forbes.com/sites/paultassi/2020/04/25/fortnite-players-think-this-travis-scott-clue-may-lead-to-the-return-of-the-old-map/", "urlToImage": null, "publishedAt": "2020-04-25T15:19:15Z", "content": "Fortnite\r\nEpic/Lucas7Yoshi\r\nThe final two Travis Scott shows are today in Fortnite, and while theyre must-see events because of how damn cool they are, some Fortnite fans are starting to get excited about what they view as an easter egg that they believe coul… [+2544 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "6 Ways Doctor Strange 2 Could Be A Game-Changer For The MCU - CBR", "description": "Multiverse of Madness Could Change the MCU Forever SUBSCRIBE NOW to CBR! Click here: http://bit.ly/Subscribe-to-CBR We all know that the Infinity Saga was a ...", "url": "https://www.youtube.com/watch?v=_f0Jc21vK5Q", "urlToImage": null, "publishedAt": "2020-04-25T13:45:00Z", "content": "Multiverse of Madness Could Change the MCU ForeverSUBSCRIBE NOW to CBR! Click here: http://bit.ly/Subscribe-to-CBR\r\nWe all know that the Infinity Saga was a major game changer for the Marvel Cinematic Universe, but lets not forget about Phase Fours Doctor Str… [+1433 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "James Crowley", "title": "Broadway Star Nick Cordero Receives Temporary Pacemaker, Says His Wife - Newsweek", "description": "Cordero's wife, Amanda Kloots, shared an updated with fans on Friday and also said that the Broadway actor had tested negative in two COVID-19 tests.", "url": "https://www.newsweek.com/nick-cordero-temporary-pacemaker-broadway-star-1500209", "urlToImage": null, "publishedAt": "2020-04-25T13:40:44Z", "content": "Actor Nick Cordero, whose leg was recently amputated due to coronavirus complications, has received a temporary pacemaker after doctors noticed an irregular heartbeat.\r\nCordero's wife, former Broadway dancer and celebrity trainer Amanda Kloots, spoke about th… [+2337 chars]"}, {"source": {"id": null, "name": "Insidethemagic.net"}, "author": null, "title": "Stunning Pictures Of The Empty Disney Parks Radiates Magic - Inside the Magic", "description": "Stunning professional pictures show how Walt Disney World parks look when no one is around, and the sight is still magical.", "url": "https://insidethemagic.net/2020/04/stunning-empty-disney-parks-photos-cb1/", "urlToImage": null, "publishedAt": "2020-04-25T12:37:03Z", "content": "Have you wondered what Disney World parks look like when no one is watching? Not even casts members around. Lights on, but completely empty.\r\nWell, the professional photographer Mark Walter knows very well how the happiest place on earth looks like when no on… [+1787 chars]"}]}