{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Yourtango.com"}, "author": "https://www.facebook.com/ariagmitterwriter/", "title": "Today's Horoscopes For All Zodiac Signs On Sunday, April 26, 2020 - YourTango", "description": "Start to plan for the future.", "url": "https://www.yourtango.com/2020333109/horoscopes-free-daily-each-zodiac-sign-april-26-2020-according-astrology", "urlToImage": null, "publishedAt": "2020-04-26T14:23:42Z", "content": "Start to plan for the future. \r\nToday's horoscopes are here with daily astrology forecasts for each of the zodiac signs on Sunday, April 26, 2020.\r\nThe Sun is in the zodiac sign of Taurus. The Moon is in the sign of Gemini.\r\nWhat do today's horoscopes have in… [+8198 chars]"}, {"source": {"id": null, "name": "Tmz.com"}, "author": "TMZ Staff", "title": "Ron White Wants Spousal Support Terminated Because of Coronavirus Impact - TMZ", "description": "Ron White is an incredibly successful comedian, and even he is feeling the disastrous fallout from the coronavirus pandemic ... so much so, he's telling a judge he can't afford to pay his ex-wife spousal support.", "url": "https://www.tmz.com/2020/04/26/ron-white-spousal-support-coronavirus-margo-rey/", "urlToImage": null, "publishedAt": "2020-04-26T14:23:00Z", "content": "Ron White is an incredibly successful comedian, and even he is feeling the disastrous fallout from the coronavirus pandemic ... so much so, he's telling a judge he can't afford to pay his ex-wife spousal support.\r\nRon filed legal docs asking the family law ju… [+1182 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Stephen Smith", "title": "Coronavirus victim Jonathan Coelho leaves heartbreaking goodbye note for wife, kids: \"I'm so lucky\" - CBS News", "description": "A Connecticut woman who lost her 32-year-old husband to coronavirus said she later a heart-wrenching goodbye note that he had left for his family.", "url": "https://www.cbsnews.com/news/coronavirus-death-jonathan-coelho-leaves-goodbye-note-family-connecticut/", "urlToImage": null, "publishedAt": "2020-04-26T14:22:27Z", "content": "A Connecticut woman who lost her 32-year-old husband to coronavirus complications said she later found a heart-wrenching goodbye note that he had left for his family. Jonathan Coelho died on Wednesday, after a 28-day battle in the hospital and 20 days on a ve… [+2428 chars]"}, {"source": {"id": null, "name": "Tmz.com"}, "author": "TMZ Staff", "title": "Demi Lovato's 'Sonny With A Chance' Cast Reunion, Talks Rehab, Eating Disorder - TMZ", "description": "Demi Lovato opened up in a big way with her former castmates from the Disney show, \"Sonny With a Chance\" ... describing how a fellow castmate was her inspiration for going to rehab and how her eating disorder made it impossibly cold on the set.", "url": "https://www.tmz.com/2020/04/26/demi-lovato-joins-sonny-with-a-chance-cast-for-reunion-talks-rehab-recovery/", "urlToImage": null, "publishedAt": "2020-04-26T13:46:00Z", "content": "Demi Lovato opened up in a big way with her former castmates from the Disney show, \"Sonny With a Chance\" ... describing how a fellow castmate was her inspiration for going to rehab and how her eating disorder made it impossibly cold on the set.\r\nDemi was part… [+1946 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Zach Vasquez", "title": "Saturday Night Live: Brad Pitt plays Dr Anthony Fauci in standout virtual episode - The Guardian", "description": "In cold open, Fauci (Pitt) clears up Trump’s false claims about the coronavirus and Miley Cyrus performs a killer cover of Pink Floyd’s Wish You Were Here", "url": "https://www.theguardian.com/tv-and-radio/2020/apr/26/saturday-night-live-brad-pitt-dr-anthony-fauci-virtual-episode", "urlToImage": null, "publishedAt": "2020-04-26T13:45:51Z", "content": "For the second time this month, Saturday Night Live made a surprise return to deliver a new episode filmed remotely. This time, virtual hosting duties fell to Brad Pitt, playing lead member of the White House coronavirus task force, Dr Anthony Fauci. The rasp… [+6959 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Why Infinity War And Endgame Did Not Feature The Eternals - CBR", "description": "Why Weren’t the Eternals in the Infinity Saga, SUBSCRIBE NOW to CBR! Click here: http://bit.ly/Subscribe-to-CBR As much as we love major Marvel Cinematic Uni...", "url": "https://www.youtube.com/watch?v=FCnEZ4vhPmc", "urlToImage": null, "publishedAt": "2020-04-26T13:45:00Z", "content": null}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Matt London", "title": "'Tiger King' employee speaks out: 'Monster is a relative term. And Joe fits the bill' - Fox News", "description": "\"A 'monster' is a relative term. And Joe fits the bill,\" Kelci \"Saff\" Saffery, a former worker at the Greater Wynnewood Exotic Animal Park, told former prosecutor and Fox Nation host Nancy Grace.", "url": "https://www.foxnews.com/media/tiger-king-employee-saff-saffrey-shot-tigers", "urlToImage": null, "publishedAt": "2020-04-26T13:33:23Z", "content": "A one-time employee of the infamous Joe Exotic's Oklahoma zoo said that law enforcement is likely to file new charges against more people -- if investigators examine the web of those involved in animal cruelty crimes exposed by the Netflix series \"Tiger King:… [+3695 chars]"}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Mishal Ali Zafar", "title": "That 'Extraction' Ending Has Fans Wondering If a Sequel Is in the Works - Showbiz Cheat Sheet", "description": "Netflix's action film, 'Extraction,' left viewers with an ambiguous ending. Many are now wondering if the movie will get a sequel.", "url": "https://www.cheatsheet.com/entertainment/that-extraction-ending-has-fans-wondering-if-a-sequel-is-in-the-works.html/", "urlToImage": null, "publishedAt": "2020-04-26T13:07:22Z", "content": "Netflixs action film, Extraction, tells the story of Tyler Rake (Chris Hemsworth), a black market mercenary who is hired to rescue the son of an Indian drug lord in Dhaka. The films ending left Tylers fate up in the air, which is why many are wondering if the… [+2810 chars]"}, {"source": {"id": null, "name": "Rollingstone.com"}, "author": "Daniel Kreps", "title": "See Miley Cyrus Cover Pink Floyd’s ‘Wish You Were Here’ on ‘SNL at Home’ - Rolling Stone", "description": "Singer delivers acoustic take on 1975 classic", "url": "https://www.rollingstone.com/music/music-news/miley-cyrus-pink-floyd-wish-you-were-here-snl-990103/", "urlToImage": null, "publishedAt": "2020-04-26T13:04:55Z", "content": "Miley Cyrus performed an acoustic cover of the Pink Floyd classic “Wish You Were Here” as musical guest on the latest episode of Saturday Night Live at Home.\r\nSitting next to a fire pit that lent the performance a red glow, Cyrus and her socially distanced gu… [+650 chars]"}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Perry Carpenter", "title": "Will Archie Harrison Be Allowed to Work For the Royal Family Now That Harry and Meghan Have Left Royal Life Behind? - Showbiz Cheat Sheet", "description": "Now that Prince Harry and Meghan Markle have left the royal family behind, many wonder if Archie Harrison will be allowed to work for the royal family if he so chooses.", "url": "https://www.cheatsheet.com/entertainment/will-archie-harrison-be-allowed-to-work-for-the-royal-family-now-that-harry-and-meghan-have-left-royal-life-behind.html/", "urlToImage": null, "publishedAt": "2020-04-26T12:03:56Z", "content": "When Meghan Markle and Prince Harry welcomed their first baby, Archie Harrison Mountbatten-Windsor, in 2019, they opted against giving him a royal title. Instead, they gave Archie his fathers last name in a bid to take him out of the royal spotlight. Although… [+5883 chars]"}, {"source": {"id": null, "name": "Mercurynews.com"}, "author": "Jeanne Phillips", "title": "Dear Abby: This rude man knows he’s off our wedding list, and now he wants to talk - The Mercury News", "description": "Plus: My husband’s father disinherited him because I wouldn’t divorce him.", "url": "https://www.mercurynews.com/dear-abby-he-knows-hes-off-our-wedding-list", "urlToImage": null, "publishedAt": "2020-04-26T11:36:32Z", "content": "DEAR ABBY: My fiance has a friend who is, for lack of a better word, a train wreck. When I started dating my fiance, I heard about this guy, “Al,” from my fiance’s other friends even before I met him.\r\nJeanne Phillips \r\nThe group of friends has an on-again, o… [+3064 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Dan Heching For Dailymail.com", "title": "Katherine Schwarzenegger goes on a bike ride with husband Chris Pratt as it's learned she's pregnant - Daily Mail", "description": "It's already been an eventful weekend for Katherine Schwarzenegger and Chris Pratt, as news broke on Saturday that the couple are expecting their first baby together.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8257317/Katherine-Schwarzenegger-goes-bike-ride-husband-Chris-Pratt-learned-shes-pregnant.html", "urlToImage": null, "publishedAt": "2020-04-26T11:16:43Z", "content": "It's been an eventful weekend for Katherine Schwarzenegger and Chris Pratt, as news broke on Saturday that the couple are expecting their first baby together.\r\nAnd earlier that day, the 30-year-old daughter of Arnold Schwarzenegger and Maria Shriver took a ge… [+3815 chars]"}, {"source": {"id": null, "name": "Avclub.com"}, "author": "Dennis Perkins", "title": "Saturday Night Live pulls everyone back together for a star-packed, uniformly funny home episode - The A.V. Club", "description": "“I’m not gonna lie, this is weird.”", "url": "https://tv.avclub.com/saturday-night-live-pulls-everyone-back-together-for-a-1843078758", "urlToImage": null, "publishedAt": "2020-04-26T10:49:00Z", "content": "Im not gonna lie, this is weird.\r\nYou said it, Charles Barkley. As we ponder the second outing of a Saturday Night Live transformed through necessity and civic caution into a patchwork playlist of YouTube clips, the temptation remains to grade this temporary … [+20711 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Roisin O'Connor", "title": "RuPaul's Drag Race: Jeff Goldblum receives backlash for Islam comments to Jackie Cox - The Independent", "description": "‘As if America hasn’t been anti-gay and anti-woman from the outset, or killed and displaced millions of Muslims, including women and queers,’ one critic retorted", "url": "https://www.independent.co.uk/arts-entertainment/tv/news/jeff-goldblum-islam-rupaul-drag-race-jackie-cox-women-homosexuality-a9483536.html", "urlToImage": null, "publishedAt": "2020-04-26T10:25:20Z", "content": "Jeff Goldblum has found himself the subject of a backlash after asking a contestant on RuPauls Drag Race if Islam is anti-homosexuality and anti-woman.\r\nThe actor and musician appeared as a guest judge on an episode of the shows 12th season, in which the seve… [+29238 chars]"}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Alice Stone", "title": "Kylie Jenner's Instagram Stories Prove She Isn't Having Kids Anytime Soon, Say Fans - Showbiz Cheat Sheet", "description": "Fans are sure that Kylie Jenner is not having another kid any time soon. Fans are sure that Kylie Jenner is not having another kid any time soon.", "url": "https://www.cheatsheet.com/entertainment/kylie-jenners-instagram-stories-prove-she-isnt-having-kids-anytime-soon-say-fans.html/", "urlToImage": null, "publishedAt": "2020-04-26T10:20:21Z", "content": "There’s been a lot of speculation floating around about a post-pandemic baby boom. With everyone holed up inside with their significant others, some people think that there are bound to be more babies born in nine months. \r\nSome fans of Keeping Up with the Ka… [+3428 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Mary Papenfuss", "title": "Adam Sandler Pops Up In Pete Davidson's 'SNL' Rap About Going Quarantine Crazy - HuffPost", "description": "Bad Bunny, Paul Rudd, Jason Sudeikis, JD Khalid and Charles Barkley also made cameos on the second at-home \"Saturday Night Live.\"", "url": "https://www.huffpost.com/entry/pete-davidson-snl-adam-sandler-snl_n_5ea52fb4c5b6805f9ece6425", "urlToImage": null, "publishedAt": "2020-04-26T08:32:37Z", "content": "Pete Davidson starred in another one of his signature raps on the second at-home “Saturday Night Live,” this time about going crazy stuck at home.\r\nThe unshaven Davidson grouses about running out of TV shows to watch, avoiding his mom, and losing his mind dur… [+1061 chars]"}, {"source": {"id": null, "name": "Digitalspy.com"}, "author": "Chris Edwards", "title": "Jonas Brothers' movie Happiness Continues available to stream now - Digital Spy", "description": "With a Game of Thrones cameo (kind of).", "url": "https://www.digitalspy.com/movies/a32268846/jonas-brothers-new-movie-happiness-continues-stream/", "urlToImage": null, "publishedAt": "2020-04-26T08:08:01Z", "content": "The Jonas Brothers' new movie Happiness Continues: A Jonas Brothers Concert Film has arrived on Amazon Prime.\r\nThe documentary, which became available to stream today (April 24), follow's on from last year's Chasing Happiness and charts the group's rise to fa… [+1550 chars]"}, {"source": {"id": null, "name": "Pagesix.com"}, "author": "Jack Hobbs", "title": "Jeff Goldblum faces backlash over comments on 'RuPaul's Drag Race' - Page Six", "description": "Goldblum, who appeared as a Season 12 guest judge on the wildly popular show with Crazy Ex-girl friend’s Rachel Bloom, came under fire when he asked if the Islamic religion was “anti-ho…", "url": "https://pagesix.com/2020/04/26/jeff-goldblum-faces-backlash-over-comments-on-rupauls-drag-race/", "urlToImage": null, "publishedAt": "2020-04-26T07:41:35Z", "content": "Jeff Goldblum, known for his iconic role in the Jurrasic Park franchise, is facing social media backlash over comments he made to a contestant on ‘RuPaul’s drag race.’\r\nGoldblum, who appeared as a Season 12 guest judge on the wildly popular show with Crazy Ex… [+1441 chars]"}, {"source": {"id": null, "name": "Oregonlive.com"}, "author": "Amy Dickinson", "title": "Ask Amy: Couple’s children are grown, now wife wants nothing to do with them - OregonLive", "description": "She finds them annoying, he just wants the family to stay together", "url": "https://www.oregonlive.com/advice/2020/04/ask-amy-couples-children-are-grown-now-wife-wants-nothing-to-do-with-them.html", "urlToImage": null, "publishedAt": "2020-04-26T07:16:13Z", "content": "Dear Amy: My wife and I have been married for 31 years. We have four adult children -- the oldest is 30, the youngest is 22.\r\nOver the course of the last year, my wife has changed drastically and dramatically. I do not know if the cause is menopause, or the c… [+4153 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Sarra Gray", "title": "Kate Middleton's ring from Prince William shows she is already preparing to be Queen - Express", "description": "KATE MIDDLETON, 38, and Prince William, 37, have been married since 2011. Before this, they dated for many years and a gift from Prince William could have shown Kate was already preparing to be Queen early on in the relationship.", "url": "https://www.express.co.uk/life-style/style/1272975/kate-middleton-news-prince-william-ring-jewellery-royal-role-pictures", "urlToImage": null, "publishedAt": "2020-04-26T07:06:00Z", "content": null}, {"source": {"id": null, "name": "Tmz.com"}, "author": "TMZ Staff", "title": "Channing Tatum -- Good Genes Or Good Docs?! - TMZ", "description": "Here is a 23-year-old version of the talented actor rockin' this buzz cut and 17 years later ... This famous face is spending the weekend celebrating his 40th birthday. The question is ... Good Genes or Good Docs?!", "url": "https://www.tmz.com/2020/04/26/channing-tatum-good-genes-or-good-docs/", "urlToImage": null, "publishedAt": "2020-04-26T07:01:00Z", "content": "Channing Tatum's good looks are a magic trick!\r\nHere is a 23-year-old version of the talented actor rockin' this buzz cut backstage at a commercial shoot as he was just starting out in the industry back in 2003 (left).\r\nAnd, 17 years later ... Tatum -- who is… [+352 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Jack Hobbs", "title": "Jerry Bishop, announcer on 'Judge Judy' for 24 years dead at 84 - New York Post ", "description": "Jerry Bishop, who announced the iconic Judge Judy daytime courtroom show for 24 years, passed away on Tuesday after heart complications and kidney failure, his granddaughter told the Hollywood Repo…", "url": "https://nypost.com/2020/04/26/jerry-bishop-announcer-on-judge-judy-for-24-years-dead-at-84/", "urlToImage": null, "publishedAt": "2020-04-26T06:51:51Z", "content": "Jerry Bishop, who announced the iconic Judge Judy daytime courtroom show for 24 years, passed away on Tuesday after heart complications and kidney failure, his granddaughter told the Hollywood Reporter.\r\nHe was 84.\r\nThe Hartford, Conn. born Bishop got a degre… [+520 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Sara Aridi", "title": "What’s on TV Sunday: ‘Penny Dreadful: City of Angels’ and ‘Vida’ - The New York Times", "description": "A new supernatural horror series and a returning drama highlight very different experiences of Mexican-Americans in Los Angeles.", "url": "https://www.nytimes.com/2020/04/26/arts/television/whats-on-tv-sunday-penny-dreadful-city-of-angels-and-vida.html", "urlToImage": null, "publishedAt": "2020-04-26T06:00:54Z", "content": "PENNY DREADFUL: CITY OF ANGELS 10:10 p.m. on Showtime. John Logan, the creator behind the fantasy horror series Penny Dreadful, which ended in 2016, follows it up with this spinoff. Set in 1938 Los Angeles, City of Angels delivers a packed narrative: A Mexica… [+852 chars]"}, {"source": {"id": null, "name": "Vulture.com"}, "author": "Charu Sinha", "title": "Meet Pretty Mandy, Paul Rudd’s Awful Cousin, on SNL - Vulture", "description": "You’ve changed, Little Paulie.", "url": "https://www.vulture.com/2020/04/paul-rudd-heidi-gardner-star-in-saturday-night-live-sketch.html", "urlToImage": null, "publishedAt": "2020-04-26T05:55:00Z", "content": "Saturday Night Live continued in their coverage of awkward video calls in the age of coronavirus with a sketch featuring guest star Paul Rudd and Heidi Gardner as his horrible cousin Mandy. The sketch starts off innocuously enough, with Mandy checking in on l… [+566 chars]"}, {"source": {"id": null, "name": "Thedailybeast.com"}, "author": "Matt Wilstein", "title": "SNL's Colin Jost and Michael Che Roast Trump's 'Sarcastic' Disinfectant Cure Nonsense - The Daily Beast", "description": "The “Weekend Update” anchors hammered the president for trying to claim his dangerous comments were “sarcastic.”", "url": "https://www.thedailybeast.com/snls-colin-jost-and-michael-che-roast-trumps-sarcastic-disinfectant-cure-nonsense", "urlToImage": null, "publishedAt": "2020-04-26T04:52:56Z", "content": "Instead of inviting Alec Baldwins Donald Trump to call into Weekend Update this week, SNLs Colin Jost and Michael Che took the actual president to task for suggesting that injecting disinfectant could cure the coronavirus. \r\nWell, you know when things are goi… [+2036 chars]"}, {"source": {"id": null, "name": "Nydailynews.com"}, "author": "Storm Gifford", "title": "Mean girl mayhem: Sniping war between Hasselbeck and McCain - New York Daily News", "description": "Elisabeth Hasselbeck and Meghan McCain squabble over coronavirus.", "url": "https://www.nydailynews.com/snyde/ny-hasselbeck-and-mccain-20200426-qna6byssvfdwzll2nyeaqbkvyq-story.html", "urlToImage": null, "publishedAt": "2020-04-26T03:39:02Z", "content": null}, {"source": {"id": null, "name": "Sfchronicle.com"}, "author": "Steve Rubenstein", "title": "Tony Bennett helps combat coronavirus blues as SF sing its heart out in unison - San Francisco Chronicle", "description": "At high noon, there was no getting away from the sound of “I Left My Heart in San Francisco” in the city’s first live-from-everyplace pandemic feel-good sing-along.", "url": "https://datebook.sfchronicle.com/music/sf-sings-its-heart-out-with-tony-bennett-to-combat-coronavirus-blues", "urlToImage": null, "publishedAt": "2020-04-26T03:11:15Z", "content": null}, {"source": {"id": null, "name": "Eonline.com"}, "author": "Pamela Avila", "title": "Post Malone Pays Tribute to One of Kurt Cobain's Most Iconic Outfits - E! NEWS", "description": "See how Post Malone paid tribute to the late Kurt Cobain by recreating one of his most iconic fashion looks.", "url": "https://www.eonline.com/news/1144907/post-malone-pays-tribute-to-one-of-kurt-cobain-s-most-iconic-outfits", "urlToImage": null, "publishedAt": "2020-04-26T02:24:12Z", "content": "Post Malone knows how to pay tribute to one of the most influential rock artist's of our time. \r\nLast week, the \"Rockstar\" singer announced that he would host a livestream concert where he would be performing Nirvana songs from home to raise money for coronav… [+857 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Jayme Deerwester", "title": "Live Nation updates COVID-19 policy, automatically issuing refunds for canceled shows - USA TODAY", "description": "Effective May 1, Live Nation customers will automatically receive a refund if the event they bought tickets for is canceled due to coronavirus.", "url": "https://www.usatoday.com/story/entertainment/music/2020/04/25/live-nation-customers-get-automatic-refunds-canceled-shows/3028772001/", "urlToImage": null, "publishedAt": "2020-04-26T02:17:50Z", "content": "Country star Eric Church says he doesnt know when concerts might resume, but he wants people to feel safe when they do. (April 24)\r\nAP Entertainment\r\nIt's official: Live Nation customers will now automatically receive a refund if the concert or show they boug… [+3402 chars]"}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Connie Liou", "title": "'The Bachelorette': Clare Crawley Gets Real About Her Contestants Who Are There for the Wrong Reasons - Showbiz Cheat Sheet", "description": "'The Bachelorette's Clare Crawley calls out her cast on Twitter and Bachelor Nation fans predict she was addressing Matt James.", "url": "https://www.cheatsheet.com/entertainment/bachelorette-clare-crawley-twitter-matt-james.html/", "urlToImage": null, "publishedAt": "2020-04-26T02:05:25Z", "content": "When Clare Crawley was cast as the next bachelorette, Bachelor Nation fans rejoiced. Over the past few years, many fans have called out the ABC reality franchise for rewarding Instagram influencers over genuine romance. And ever since she first appeared on Ju… [+4076 chars]"}, {"source": {"id": null, "name": "Wrestlingnews.co"}, "author": "Paul Davis", "title": "REPORT: Vince McMahon’s new attitude at WWE SmackDown following the closing of XFL and WrestleMania Tampa cancellation - Wrestling News", "description": "There has been a lot said on social media in the last 24 hours about Vince McMahon’s appearance on WWE Friday Night SmackDown. For those of you that missed it, McMahon was on the show to celebrate Triple H’s 25 years with the company. McMahon had nice things …", "url": "https://wrestlingnews.co/wwe-news/report-vince-mcmahons-new-attitude-at-wwe-smackdown-following-the-closing-of-xfl-and-wrestlemania-tampa-cancellation/", "urlToImage": null, "publishedAt": "2020-04-26T01:55:03Z", "content": "There has been a lot said on social media in the last 24 hours about Vince McMahon’s appearance on WWE Friday Night SmackDown.\r\nFor those of you that missed it, McMahon was on the show to celebrate Triple H’s 25 years with the company. McMahon had nice things… [+1524 chars]"}, {"source": {"id": null, "name": "Hollywoodlife.com"}, "author": "Cassie Gill", "title": "Vanessa Hudgens Sings Along To Iconic ‘HSM’ Duet With Zac Efron After He Skips Performing At Reunion - HollywoodLife", "description": "Vanessa Hudgens showed off her vocals as she belted out 'Breaking Free' in her car! The former Disney star was all-smiles as she danced and sang along to the track featuring ex-BF Zac Efron.", "url": "https://hollywoodlife.com/2020/04/25/vanessa-hudgens-sings-zac-efron-duet-high-school-musical-video/", "urlToImage": null, "publishedAt": "2020-04-26T01:51:22Z", "content": "Vanessa Hudgens showed off her vocals as she belted out ‘Breaking Free’ in her car! The former Disney star was all-smiles as she danced and sang along to the track featuring ex-BF Zac Efron.\r\nVanessa Hudgens, 31, still knows every word to the iconic High Scho… [+2631 chars]"}, {"source": {"id": null, "name": "Tvline.com"}, "author": "Matt Webb Mitovich", "title": "Price Is Right Announcer George Gray 'Recovering Well' After 3 Heart Attacks - TVLine", "description": "The Price Is Right announcer George Gray is “recovering well” after suffering not one but three massive heart attacks earlier this week. “He is recovering well, considering his brush with death,” Gray’s rep, Phil Viardo, told our sister site Variety. “I was a…", "url": "https://tvline.com/2020/04/25/price-is-right-announcer-george-gray-heart-attacks/", "urlToImage": null, "publishedAt": "2020-04-26T01:02:00Z", "content": "The Price Is Right announcer George Gray is “recovering well” after suffering not one but three massive heart attacks earlier this week.\r\n“He is recovering well, considering his brush with death,” Gray’s rep, Phil Viardo, told our sister site Variety. “I was … [+1416 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "James Laird", "title": "How to watch Bad Education: stream new Hugh Jackman movie online from anywhere - TechRadar", "description": "The fact-based TV movie is a critical hit", "url": "https://www.techradar.com/news/how-to-watch-bad-education-stream-new-hugh-jackman-movie-online-from-anywhere", "urlToImage": null, "publishedAt": "2020-04-26T00:30:48Z", "content": "It's being hailed as Hugh Jackman's best performance since The Greatest Showman and reportedly cost HBO $20 million to secure the distribution rights to - quite the figure for a film about a suburban district school board scandal. Yet it's won the critics ove… [+3871 chars]"}, {"source": {"id": null, "name": "Whsv.com"}, "author": "Cayley Urenko", "title": "Harold Reid, founding member of the Statler Brothers and valley native, dies at 80 - WHSV", "description": "Reid was fighting kidney failure and passed away in Staunton on Friday night.", "url": "https://www.whsv.com/content/news/Country-music-legend--569953651.html", "urlToImage": null, "publishedAt": "2020-04-25T23:41:36Z", "content": "STAUNTON, Va.(WHSV) -- Country music and Staunton legend Harold Reid, who sang bass for the Grammy-winning country group the Statler Brothers died last night at his home in Staunton. Reid had a long battle with kidney failure. He was 80 years old. \r\nReid was … [+2251 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Dean Balsamini", "title": "Rolling Stones top charts with 'Living in a Ghost Town' - New York Post ", "description": "On Thursday, the band released  “Living in a Ghost Town,” with an accompanying video, and the track jumped to the top of the iTunes’ song chart. It was the band’s first No. 1 hit in 40 y…", "url": "https://nypost.com/2020/04/25/rolling-stones-top-charts-with-living-in-a-ghost-town/", "urlToImage": null, "publishedAt": "2020-04-25T23:07:51Z", "content": "The legendary Rolling Stones got some satisfaction with a new chart-topping song, their first No. 1 hit on iTunes.\r\nOn Thursday, the band released  Living in a Ghost Town, with an accompanying video, and the track jumped to the top of the iTunes song chart, b… [+656 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Anita Bennett", "title": "Tom Hanks, Rita Wilson Donate Blood For Coronavirus Vaccine Research - Deadline", "description": "Tom Hanks and wife Rita Wilson are stepping up to help in the fight against coronavirus. Hanks revealed in a new interview that they volunteered to donate blood for COVID-19 research after recovering from the disease. “A lot of the question is, is what now? W…", "url": "https://deadline.com/2020/04/tom-hanks-rita-wilson-donate-blood-coronavirus-vaccine-1202917940/", "urlToImage": null, "publishedAt": "2020-04-25T23:05:42Z", "content": "Tom Hanks and wife Rita Wilson are stepping up to help in the fight against coronavirus. Hanks revealed in a new interview that they volunteered to donate blood for COVID-19research after recovering from the disease.\r\n“A lot of the question is, is what now? W… [+744 chars]"}, {"source": {"id": null, "name": "Variety.com"}, "author": "Jordan Moreau", "title": "Hamilton Bohannon, Disco and Motown Legend, Dies at 78 - Variety", "description": "Hamilton Bohannon, one of the great musicians of the disco era, died on Friday. He was 78. The Newnan Times-Herald, a local newspaper in Newnan, Ga., where Bohannon was born, reported the news on Saturday after speaking with several members of his family. Boh…", "url": "https://variety.com/2020/music/news/hamilton-bohannon-disco-motown-dead-dies-1234590041/", "urlToImage": null, "publishedAt": "2020-04-25T22:11:39Z", "content": "Hamilton Bohannon, one of the great musicians of the disco era, died on Friday. He was 78.\r\nThe Newnan Times-Herald, a local newspaper in Newnan, Ga., where Bohannon was born, reported the news on Saturday after speaking with several members of his family.\r\nB… [+1021 chars]"}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Matthew Trzcinski", "title": "Pink Floyd: Was 'The Phantom of the Opera' Stolen From Them? - Showbiz Cheat Sheet", "description": "Pink Floyd are an iconic progressive rock band. Their influence is incredible. Did they inspire Andrew Lloyd Webber's The Phantom of the Opera?", "url": "https://www.cheatsheet.com/entertainment/pink-floyd-was-the-phantom-of-the-opera-stolen-from-them.html/", "urlToImage": null, "publishedAt": "2020-04-25T21:45:38Z", "content": "The Phantom of the Operais still one of the most popular musicals ever. Its title song is one of the most popular songs in the history of musical theater. But did it originate with The Phantom of the Opera or Pink Floyd?\r\nThe song The Phantom of the Opera has… [+2854 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Defending Jacob Cast Guide: Where You've Seen The Actors Before - Screen Rant", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiPGh0dHBzOi8vc2NyZWVucmFudC5jb20vZGVmZW5kaW5nLWphY29iLWNhc3QtY2hhcmFjdGVyLWd1aWRlL9IBQGh0dHBzOi8vc2NyZWVucmFudC5jb20vZGVmZW5kaW5nLWphY29iLWNhc3QtY2hhcmFjdGVyLWd1aWRlL2FtcC8?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T21:42:00Z", "content": null}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Rachel Sharp For Dailymail.com", "title": "Mister Rogers told co-star Officer Clemmons not to come out as gay and to marry a woman - Daily Mail", "description": "Francois Clemmons, 75, recalled an incident where 'Mister' Fred Rogers told him he could not be a 'member of the Neighborhood' if he was openly gay.", "url": "https://www.dailymail.co.uk/news/article-8256973/Mister-Rogers-told-star-Officer-Clemmons-not-come-gay-marry-woman.html", "urlToImage": null, "publishedAt": "2020-04-25T21:40:02Z", "content": "Francois Clemmons, best known as Officer Clemmons on children's TV series 'Mister Rogers' Neighborhood', has said that TV star Fred Rogers told him to not come out as gay and to marry a woman because if he didn't, it would 'threaten his dream'.\r\nClemmons, 75,… [+2995 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alaa Elassar, CNN", "title": "The Beatles streamed 'Yellow Submarine' and hosted a sing-a-long watch party, and people loved it - CNN", "description": "Even during a global pandemic, the Beatles found a way for people to come together.", "url": "https://www.cnn.com/2020/04/25/us/the-beatles-yellow-submarine-trnd/index.html", "urlToImage": null, "publishedAt": "2020-04-25T21:24:55Z", "content": null}, {"source": {"id": null, "name": "Cinemablend.com"}, "author": "Sarah El-Mahmoud", "title": "Buffy The Vampire Fans Are Freaking Out About Dolly Parton Secretly Producing The Series - CinemaBlend", "description": "Wait... what?", "url": "https://www.cinemablend.com/television/2495130/buffy-the-vampire-fans-are-freaking-out-about-dolly-parton-secretly-producing-the-series", "urlToImage": null, "publishedAt": "2020-04-25T21:03:45Z", "content": "Its no secret Dolly Parton has had an incredibly accomplished career. The 74-year-old is a country music icon, famed star of 1980's 9 to 5 with Jane Fonda and Lily Tomlin, businesswoman, philanthropist and Buffy the Vampire Slayer producer. Wait, what?\r\nThats… [+2763 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Kimberley Richards", "title": "Nick Cordero's Wife Amanda Kloots Gives Health Update On The Broadway Star - HuffPost", "description": "The \"Rock of Ages\" actor was \"recovering well\" after a pacemaker procedure. He previously had his right leg amputated due to complications from COVID-19.", "url": "https://www.huffpost.com/entry/nick-cordero-amanda-kloots-coronavirus-health-update-broadway_n_5ea466ffc5b6d37635907b81", "urlToImage": null, "publishedAt": "2020-04-25T20:55:00Z", "content": "Former Radio City Rockette Amanda Kloots gave a health update on her husband, Broadway actor Nick Cordero, who had his right leg amputated last week due to complications from the coronavirus.\r\nKloots noted in a series of Instagram story videos on Friday that … [+1952 chars]"}, {"source": {"id": null, "name": "Nbcsports.com"}, "author": null, "title": "Russell Wilson & Ciara's ALL-IN Challenge closes at a whopping $240k - NBCSports.com", "description": "Last week, the Wilsons accepted the #ALLINCHALLENGE, a challenge to come together and feed the hungry during the COVID-19 pandemic.", "url": "https://www.nbcsports.com/northwest/seattle-seahawks/russell-wilson-ciaras-all-challenge-closes-whopping-240k", "urlToImage": null, "publishedAt": "2020-04-25T19:27:09Z", "content": "The Seattle Seahawks 2020 draft class is complete. John Schneider and Pete Carroll executed a trio of trades and made eight total selections.\r\nBelow is a breakdown of all eight picks in terms of who the players are, their best-case scenarios, who else on the … [+8642 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chloe Melas, CNN", "title": "Davido releases 'Dolce & Gabanna' music video and donates proceeds to coronavirus research after fiancée tests positive - CNN", "description": "Nigerian singer, Davido, is doing his part in the fight against COVID-19.", "url": "https://www.cnn.com/2020/04/25/entertainment/davido-dolce-gabbana-music-video-coronavirus/index.html", "urlToImage": null, "publishedAt": "2020-04-25T19:25:03Z", "content": "(CNN)Nigerian singer, Davido, is doing his part in the fight against COVID-19.\r\nThe internationally-known singer not only released his new music video, \"Dolce &amp; Gabbana,\" on Friday but also announced that all the proceeds from the video will go to support… [+1207 chars]"}, {"source": {"id": null, "name": "Slashfilm.com"}, "author": "Ethan Anderton", "title": "Sony Pictures Release Dates Shuffled for 2020 and 2021/Film - /FILM", "description": "Sony Pictures release dates have been shifted around for movies in 2020 and 2021 thanks to the production shutdown caused by coronavirua.", "url": "https://www.slashfilm.com/sony-pictures-release-dates-for-2020-and-2021/", "urlToImage": null, "publishedAt": "2020-04-25T19:00:39Z", "content": "After pushing back both Spider-Man 3 and Spider-Man: Into the Spider-Verse, Sony Pictures has also shuffled around a bunch of other upcoming release dates for movies slated to come out this year and through 2021. Some of the movies hopping around the theatric… [+2805 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alaa Elassar, CNN", "title": "Best moments from CNN and Sesame Street's coronavirus town hall for kids and parents - CNN", "description": "CNN partnered with Sesame Street for a special town hall about coronavirus to give kids the opportunity to learn more about the pandemic and ask questions.", "url": "https://www.cnn.com/2020/04/25/us/cnn-sesame-street-town-hall-coronavirus-trnd/index.html", "urlToImage": null, "publishedAt": "2020-04-25T18:44:46Z", "content": "By Alaa Elassar, CNN\r\nUpdated 2:35 PM ET, Sat April 25, 2020\r\nChat with us in Facebook Messenger. Find out what's happening in the world as it unfolds.\r\n(CNN)CNN partnered with Sesame Street for a special town hall about coronavirus to give kids the opportuni… [+5839 chars]"}, {"source": {"id": null, "name": "Vulture.com"}, "author": "Devon Ivie", "title": "Dead to Me Season 2 Trailer: Murder, They Wrote - Vulture", "description": "The female buddy dramedy returns, just when we need it.", "url": "https://www.vulture.com/2020/04/netflix-dead-to-me-season-2-trailer-2020-watch.html", "urlToImage": null, "publishedAt": "2020-04-25T17:59:21Z", "content": "If youre going to murder one of the most handsome men in the world, perhaps dont do it in your pool. So inelegant. So expected. And now, Jen (Christina Applegate) and Judy (Linda Cardellini) have to worry about draining all of that chlorine. The blood takes a… [+552 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Artemis Moshtaghian and Jay Croft, CNN", "title": "Actor Dimitri Diatchenko of 'Sons of Anarchy' dies at 52 - CNN", "description": "Actor Dimitri Diatchenko, best known as Uri on \"Chernobyl Diaries,\" was found dead in his home in Daytona Beach, Florida, police say.", "url": "https://www.cnn.com/2020/04/25/us/dimitri-diatchenko-actor-sons-of-anarchy-chernobyl-diaries-dead/index.html", "urlToImage": null, "publishedAt": "2020-04-25T17:24:58Z", "content": null}, {"source": {"id": null, "name": "Tomsguide.com"}, "author": "Henry T. Casey", "title": "Beastie Boys Story is so good you’ll want to pay for Apple TV Plus - Tom's Guide", "description": "Spike Jonze's latest film should show Apple how to make Apple TV Plus a hit", "url": "https://www.tomsguide.com/news/beastie-boys-story-review-apple-tv-plus", "urlToImage": null, "publishedAt": "2020-04-25T17:17:43Z", "content": "Out now, exclusively on Apple TV Plus\r\n, Beastie Boys Story might be my favorite thing I've watched during the 6 weeks I've been stuck inside under quarantine. It also got me thinking about the Apple TV Plus service, which probably hasn't been the home-run hi… [+7073 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Harley Quinn's Cuoco Jokes About Future of Harley and Ivy's Relationship - CBR - Comic Book Resources", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiP2h0dHBzOi8vd3d3LmNici5jb20vY3VvY28tam9rZXMtZnV0dXJlLWhhcmxleS1pdnktcmVsYXRpb25zaGlwL9IBQ2h0dHBzOi8vd3d3LmNici5jb20vY3VvY28tam9rZXMtZnV0dXJlLWhhcmxleS1pdnktcmVsYXRpb25zaGlwL2FtcC8?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T17:15:00Z", "content": null}, {"source": {"id": null, "name": "Slashfilm.com"}, "author": "Ethan Anderton", "title": "Marvel Pushes Back 'Doctor Strange in the Multiverse of Madness' and 'Spider-Man 3', Bumps Up 'Thor: Love & Thunder' Just a Smidge - /FILM", "description": "Marvel has pushed back the Doctor Strange in the Multiverse of Madness release date into spring 2022, but they've bumped up Thor: Love & Thunder a bit.", "url": "https://www.slashfilm.com/thor-love-and-thunder-and-doctor-strange-in-the-multiverse-of-madness-release-date/", "urlToImage": null, "publishedAt": "2020-04-25T17:00:21Z", "content": "Almost all the news about movies nowadays is about release dates being pushed back due to the shutdown of production during the coronavirus pandemic and also the closure of nearly all movie theaters around the United States. Marvel Studios recently made some … [+3754 chars]"}, {"source": {"id": null, "name": "Rollingstone.com"}, "author": "Daniel Kreps", "title": "See the Killers Debut New Song ‘Blowback,’ Cover Tom Petty on ‘CBS This Morning’ - Rolling Stone", "description": "Brandon Flowers and Ronnie Vannucci Jr. perform three tracks from Utah recording studio for \"Saturday Sessions\"", "url": "https://www.rollingstone.com/music/music-news/the-killers-blowback-tom-petty-cbs-this-morning-990007/", "urlToImage": null, "publishedAt": "2020-04-25T16:47:58Z", "content": "The Killers debuted their new song “Blowback” — off their delayed new album Imploding the Mirage — and covered Tom Petty for CBS This Morning’s Saturday Sessions.\r\nRecorded at the band’s Utah studio, Brandon Flowers and Ronnie Vannucci Jr. performed acoustic … [+710 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Anna MacSwan", "title": "Queen's life in lockdown with just a dozen staff and her budgies, but no horse rides - Mirror Online", "description": "The 94-year-old Queen is reportedly keeping in touch with family through video messenger and avidly watching the news as she and Prince Phillip spend lockdown at Windsor Castle", "url": "https://www.mirror.co.uk/news/uk-news/queens-life-lockdown-just-dozen-21924664", "urlToImage": null, "publishedAt": "2020-04-25T16:34:30Z", "content": "The Queen is reportedly being looked after by just a dozen staff and has been keeping in touch with family through video calls during lockdown.\r\n The 94-year-old monarch has been isolating with husband Prince Phillip, 98, at Windsor Castle amid the coronaviru… [+2811 chars]"}, {"source": {"id": null, "name": "Billboard.com"}, "author": "Mitchell Peters", "title": "Kanye West Is Now a Billionaire, Thanks Mostly to His Yeezy Sneaker Brand - Billboard", "description": "", "url": "https://www.billboard.com/articles/columns/hip-hop/9365910/kanye-west-is-now-a-billionaire-thanks-mostly-to-his-yeezy-sneaker-brand-forbes", "urlToImage": null, "publishedAt": "2020-04-25T15:30:45Z", "content": "It's official: Kanye West is now a billionaire.\r\nOver the years, West's finances have remained mostly a mystery. But now, Forbes reports that the rapper-turned-footwear mogul has an estimated net worth of $1.3 billion.\r\nWest can attribute his entry into the b… [+1643 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Paul Tassi", "title": "‘Fortnite’ Players Think This Travis Scott Clue May Lead To The Return Of The Old Map - Forbes", "description": "Is the old Fortnite Chapter 1 map coming back?", "url": "https://www.forbes.com/sites/paultassi/2020/04/25/fortnite-players-think-this-travis-scott-clue-may-lead-to-the-return-of-the-old-map/", "urlToImage": null, "publishedAt": "2020-04-25T15:19:15Z", "content": "Fortnite\r\nEpic/Lucas7Yoshi\r\nThe final two Travis Scott shows are today in Fortnite, and while theyre must-see events because of how damn cool they are, some Fortnite fans are starting to get excited about what they view as an easter egg that they believe coul… [+2544 chars]"}, {"source": {"id": null, "name": "Cosmopolitan.com"}, "author": "Alanna Lauren Greco", "title": "Tyler Cameron Says He and Hannah Brown Are \"Just Starting Off as Friends\" and \"Not in a Place\" to Date RN - Yahoo Lifestyle", "description": "That doesn't rule out the future, though! 👀", "url": "https://www.cosmopolitan.com/entertainment/tv/a32275994/tyler-cameron-hannah-brown-starting-off-friends-not-in-place-date/", "urlToImage": null, "publishedAt": "2020-04-25T15:19:00Z", "content": "<ul><li>Tyler Cameron just hinted that even though he's not dating his Bachelorette ex Hannah Brown at the moment, he wants to date her again in the future. </li><li>In a new vid he says, \"we're just starting off as friends and that's what it is right now.\"</… [+1280 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Emily Heller", "title": "9 super popular TV shows to finally watch on Netflix, HBO, and more - Polygon", "description": "Need a new show to watch in 2020? With many new releases delayed, there’s time to revisit your backlog, from Netflix fantasy The Witcher, HBO dramas like Euphoria and Watchmen, or charming sitcoms like Schitt’s Creek and Dickinson. Here are the best ones to c…", "url": "https://www.polygon.com/2020/4/25/21234419/popular-new-tv-shows-watch-2020-the-witcher-euphoria-mandalorian-netflix-disney-plus-hbo", "urlToImage": null, "publishedAt": "2020-04-25T15:02:55Z", "content": "In the era of Peak TV, its literally impossible to watch everything. According to FXs annual report, over 500 scripted TV series were broadcasted or streamed in the U.S. in 2019. When you add reality and documentary shows into the mix, as well as internationa… [+7009 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Brie Bella Defends Nikki's Close Bond With Birdie | Total Bellas Bonus Scene | E! - E! Entertainment", "description": "The \"Total Bellas\" star discusses her sister's bond with her daughter Birdie, after hearing her brother JJ wants Nikki and Vivienne to have the same bond. Wa...", "url": "https://www.youtube.com/watch?v=jKzw9Cfuakg", "urlToImage": null, "publishedAt": "2020-04-25T14:59:56Z", "content": null}, {"source": {"id": null, "name": "Xxlmag.com"}, "author": "cvernoncoleman", "title": "Lil Uzi Vert Denies Dissing Playboi Carti on New Song “Sasuke” - XXLMAG.COM", "description": "Read details here.", "url": "https://www.xxlmag.com/news/2020/04/lil-uzi-vert-denies-dissing-playboi-carti-sasuke/", "urlToImage": null, "publishedAt": "2020-04-25T14:21:00Z", "content": "Lil Uzi Vert is shooting down speculation that he is taking shots at Playboi Carti on his new single, \"Sasuke.\"\r\nAfter both rappers hinted at dropping new songs on Monday (April 20), neither rapper came through as promised, causing upset fans. However, Uzi de… [+1312 chars]"}, {"source": {"id": null, "name": "Ktla.com"}, "author": "Tracy Bloom", "title": "Disney theme parks may remain closed until 2021, financial analyst predicts - WGN-TV", "description": "Disney theme parks in the U.S. have been shuttered since mid-March and could remain that way until the beginning of 2021 due to the ongoing coronavirus health emergency, according to one analyst at…", "url": "https://ktla.com/news/local-news/disneyland-may-not-reopen-this-year-because-of-coronavirus-financial-analyst-predicts/", "urlToImage": null, "publishedAt": "2020-04-25T03:34:00Z", "content": "Disney theme parks in the U.S. have been shuttered since mid-March and could remain that way until the beginning of 2021 due to the ongoing coronavirus health emergency, according to one analyst at global financial firm UBS. \r\nIn a report released to clients … [+1857 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Rasha Ali", "title": "New York rapper Fred the Godson dead at 35 from coronavirus complications - USA TODAY", "description": "Bronx rapper, Fred the Godson, died Thursday after revealing he had contracted COVID-19 earlier this month.", "url": "https://www.usatoday.com/story/entertainment/celebrities/2020/04/24/coronavirus-fred-godson-dead-stars-react-today-sad-one/3013999001/", "urlToImage": null, "publishedAt": "2020-04-24T22:03:13Z", "content": "New York rapper Fred the Godson died after being hospitalized for the coronavirus. He was 35 years old.\r\nUSA TODAY\r\nNew York rapper Fred the Godson died Thursday after being diagnosed with COVID-19, his manager confirmed to USA TODAY. He was 35.\r\n\"New York Ci… [+2534 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Li Cohen", "title": "The \"Parks and Recreation\" cast is reuniting for a special coronavirus episode - CBS News", "description": "Put away The Cones of Dunshire and light your flames for Lil Sebastian — Leslie Knope, Ron Swanson, Ann Perkins, and the rest of Pawnee's crew are coming together to raise money for U.S. food banks.", "url": "https://www.cbsnews.com/news/parks-and-recreation-coronavirus-episode/", "urlToImage": null, "publishedAt": "2020-04-24T21:24:32Z", "content": "Not even a pandemic can keep Leslie Knope from trying to save the world. The cast of NBC's \"Parks and Recreation\" is reuniting for a single episode next Thursday to raise money for Feeding America's COVID-19 Response Fund, according to a press release from NB… [+2008 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Taylor Swift SLAMS Scooter Braun For New Album Release! - Clevver News", "description": "More Celebrity News ►► http://bit.ly/SubClevverNews #TaylorSwift #ScooterBraun #BigMachineRecords The world may be at a stand still but that’s not enough to ...", "url": "https://www.youtube.com/watch?v=26ZDaI5uisE", "urlToImage": null, "publishedAt": "2020-04-24T19:30:00Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Angelina Jolie's Confessions About Lockdown With All SIX of Her Kids - Entertainment Tonight", "description": "The actor and humanitarian talked about home life on lockdown with all six of her children to Time Magazine.", "url": "https://www.youtube.com/watch?v=ZkAm97DbjCo", "urlToImage": null, "publishedAt": "2020-04-24T19:00:08Z", "content": "The actor and humanitarian talked about home life on lockdown with all six of her children to Time Magazine."}, {"source": {"id": null, "name": "Today.com"}, "author": "Alexander Kacala", "title": "Andy Cohen says he couldn't donate plasma because he is gay - TODAY", "description": "Andy Cohen is speaking out about what he says is a discriminatory practice when it comes to LGBTQ people being able to donate blood and convalescent plasma.", "url": "https://www.today.com/health/andy-cohen-says-he-couldn-t-donate-plasma-because-he-t179881", "urlToImage": null, "publishedAt": "2020-04-24T18:16:37Z", "content": "Andy Cohen is speaking out about what he says is a discriminatory practice happening at the federal level when it comes to LGBTQ people being able to donate blood and convalescent plasma.\r\nThe 51-year-old talk show host tested positive for the coronavirus in … [+3733 chars]"}, {"source": {"id": null, "name": "Tmz.com"}, "author": "TMZ Staff", "title": "Juice WRLD's Posthumous Track 'Righteous' Details Drug Use - TMZ", "description": "Juice WRLD's family has dropped a new track, \"Righteous,\" which foreshadowed his drug problem.", "url": "https://www.tmz.com/2020/04/24/juice-wrld-family-releases-new-track-righteous-drug-use/", "urlToImage": null, "publishedAt": "2020-04-24T17:23:44Z", "content": "Juice WRLD's family has dropped a posthumous track from him, and its lyrics sadly foreshadow his eventual demise.\r\nThe late rapper's family dropped \"Righteous\" Thursday night and the track goes into extreme detail about his heavy drug use and the state of his… [+1220 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Dino-Ray Ramos", "title": "Western Thriller ‘True History Of Kelly Gang’ And ’60s Coming-Of-Age Drama ‘To The Stars’ Make Debuts – Specialty Streaming Preview - Deadline", "description": "The story of the notorious outlaw Ned Kelly is dropping on digital and on-demand today with the Justin Kurzel-directed True History of the Kelly Gang starring George MacKay (1917, Captain Fantastic), Russell Crowe (Boy Erased, The Loudest Voice) and Nicholas …", "url": "https://deadline.com/2020/04/true-history-of-kelly-gang-russell-crowe-justin-kurzel-to-the-stars-martha-stephens-specialty-streaming-preview-1202916073/", "urlToImage": null, "publishedAt": "2020-04-24T14:28:13Z", "content": "The story of the notorious outlaw Ned Kelly is dropping on digital and on-demand today with the Justin Kurzel-directed True History of the Kelly Gang starring George MacKay (1917, Captain Fantastic), Russell Crowe (Boy Erased, The Loudest Voice) and Nicholas … [+5477 chars]"}, {"source": {"id": null, "name": "Tvguide.com"}, "author": "Tim Surette", "title": "7 Shows Like Homeland That Aren't Homeland That You Should Watch If You Like Homeland - TV Guide", "description": "Including the show that was Homeland before Homeland was Homeland", "url": "https://www.tvguide.com/news/shows-like-homeland-season-8-what-to-watch-next/", "urlToImage": null, "publishedAt": "2020-04-24T13:45:30Z", "content": "The sweet blippity-screech-boop of Homeland's jazzy theme song will grate your ears for the last time this Sunday when the series finale of Homeland sends Showtime's celebrated thriller off for good. But for fans of the show, eight seasons of Homeland wasn't … [+7205 chars]"}]}