{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Nytimes.com"}, "author": "Dave Itzkoff", "title": "Brad Pitt Plays Dr. Anthony Fauci in an At-Home Edition of ‘S.N.L.’ - The New York Times", "description": "The latest remotely produced episode of “Saturday Night Live” also featured appearances from Miley Cyrus and Adam Sandler, among others.", "url": "https://www.nytimes.com/2020/04/26/arts/television/saturday-night-live-brad-pitt.html", "urlToImage": null, "publishedAt": "2020-04-26T09:48:26Z", "content": "Two weeks ago, Saturday Night Live returned to television with its first new episode of the at-home era: a collection of remotely produced sketches that were low on production value but high on spirit and innovation. It offered a window into what the show cou… [+6337 chars]"}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Stefan Preston", "title": "Meghan Markle Wants Baby Archie To Have a 'Pint-Size Little Buddy,' Says Friend - Showbiz Cheat Sheet", "description": "Find out why Meghan Markle wants Baby Archie to have a sibling. Find out why Meghan Markle wants Baby Archie to have a sibling.", "url": "https://www.cheatsheet.com/entertainment/meghan-markle-wants-baby-archie-to-have-a-pint-size-little-buddy-says-friend.html/", "urlToImage": null, "publishedAt": "2020-04-26T09:18:50Z", "content": "Prince Harry and Meghan, Duchess of Sussex are settling in their new Los Angeles-area home, and staying relatively under the radar, aside from being spotted out delivering meals to local families. Although some of their plans might have been sidelined due to … [+3199 chars]"}, {"source": {"id": null, "name": "Digitalspy.com"}, "author": "Chris Edwards", "title": "Jonas Brothers' movie Happiness Continues available to stream now - Digital Spy", "description": "With a Game of Thrones cameo (kind of).", "url": "https://www.digitalspy.com/movies/a32268846/jonas-brothers-new-movie-happiness-continues-stream/", "urlToImage": null, "publishedAt": "2020-04-26T08:08:01Z", "content": "The Jonas Brothers' new movie Happiness Continues: A Jonas Brothers Concert Film has arrived on Amazon Prime.\r\nThe documentary, which became available to stream today (April 24), follow's on from last year's Chasing Happiness and charts the group's rise to fa… [+1550 chars]"}, {"source": {"id": null, "name": "Tmz.com"}, "author": "TMZ Staff", "title": "Dave Chappelle, Bill Burr, Whitney Cummings Raise $100K for Comics - TMZ", "description": "Dave Chappelle, Bill Burr, Whitney Cummings and Chris D'Elia helped The Comedy Store raise $100,000 for struggling comics impacted by the coronavirus pandemic.", "url": "https://www.tmz.com/2020/04/26/dave-chappelle-bill-burr-whitney-cummings-chris-delia-raise-100k-for-comedians-struggling-during-pandemic-the-comedy-store-benefit/", "urlToImage": null, "publishedAt": "2020-04-26T07:50:00Z", "content": "Dave Chappelle, Bill Burr, Whitney Cummingsand Chris D'Eliaused their star power and brilliant humor to help out struggling comics hit hard by the pandemic.\r\nThe comedians teamed with the world-famous Comedy Store on Sunset Blvd. to raise $100k for their less… [+1138 chars]"}, {"source": {"id": null, "name": "Variety.com"}, "author": "Danielle Turchiano", "title": "‘Saturday Night Live’s’ Second ‘At Home’ Edition Includes Paul Rudd, Adam Sandler, Miley Cyrus (Watch) - Variety", "description": "The second-ever “Saturday Night Live: At Home” edition was a star-studded affair. Brad Pitt was the first special guest in the April 26 virtual episode of the NBC late-night sketch comedy show. Delivering a cold open in which he played Dr. Anthony Fauci and a…", "url": "https://variety.com/2020/tv/news/saturday-night-live-at-home-charles-barkley-bill-hader-dj-khaled-watch-1234590103/", "urlToImage": null, "publishedAt": "2020-04-26T05:16:28Z", "content": "The second-ever “Saturday Night Live: At Home” edition was a star-studded affair.\r\nBrad Pitt was the first special guest in the April 26 virtual episode of the NBC late-night sketch comedy show. Delivering a cold open in which he played Dr. Anthony Fauci and … [+2209 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Jayme Deerwester", "title": "'SNL': Pete Davidson, Adam Sandler rap about being 'Stuck in the House' during quarantine - USA TODAY", "description": "If six weeks of quarantining at home with your family has got you climbing the walls, you're not alone. Pete Davidson and Adam Sandler feel your pain.", "url": "https://www.usatoday.com/story/entertainment/tv/2020/04/26/saturday-night-live-pete-davidson-adam-sandler-lament-being-stuck-house/3029148001/", "urlToImage": null, "publishedAt": "2020-04-26T05:10:35Z", "content": "Tom Hanks hosted a historic remote 'Saturday Night Live' from cast members' homes.\r\nWochit\r\nIf six weeks of quarantining at home with your family has got you climbing the walls, you're not alone. During the second installment of \"Saturday Night Live at Home,\"… [+1770 chars]"}, {"source": {"id": null, "name": "Tvline.com"}, "author": "Matt Webb Mitovich", "title": "SNL Video: Jason Sudeikis Brings Virtual Dance to 'What Up With That?' - TVLine", "description": "What up with that? Jason Sudeikis’ ebullient backup dancer, that’s what. NBC’s Saturday Night Live returned this weekend with its second “At Home” edition of the pandemic, having first attempted socially distanced sketch comedy on April 11. In one of the most…", "url": "https://tvline.com/2020/04/25/snl-video-jason-sudeikis-what-up-with-that-saturday-night-live/", "urlToImage": null, "publishedAt": "2020-04-26T04:13:00Z", "content": "What up with that? Jason Sudeikis’ ebullient backup dancer, that’s what.\r\nNBC’s Saturday Night Live returned this weekend with its second “At Home” edition of the pandemic, having first attempted socially distanced sketch comedy on April 11.\r\nIn one of the mo… [+1184 chars]"}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Trey Mangum", "title": "'RuPaul's Secret Celebrity Drag Race': What Is Jermaine Fowler Most Known For? - Showbiz Cheat Sheet", "description": "RuPaul's Drag Race has perhaps pushed its furthest into the mainstream with a new edition of the show, RuPaul's Secret Celebrity Drag Race. Among the three celebrities featured on the show this week was Jermaine Fowler, who you probably recognize from several…", "url": "https://www.cheatsheet.com/entertainment/rupauls-secret-celebrity-drag-race-what-is-jermaine-fowler-most-known-for.html/", "urlToImage": null, "publishedAt": "2020-04-26T03:49:15Z", "content": "RuPaul’s Drag Racehas perhaps pushed its furthest into the mainstream with a new edition of the show, RuPaul’s Secret Celebrity Drag Race. Among the three celebrities featured on the show this week was Jermaine Fowler, who you probably recognize from several … [+2083 chars]"}, {"source": {"id": null, "name": "Hollywoodlife.com"}, "author": "Cassie Gill", "title": "Kylie Jenner, 22, Shows Off Sleek New Bob & Glam Makeup in Dior Top After Buying $36.5 Million Mansion - HollywoodLife", "description": "Kylie Jenner showed off her flawless Barbie-pink makeup and toned tummy! The cosmetics mogul stunned as she posed in front of her bathroom mirror for a selfie.", "url": "https://hollywoodlife.com/2020/04/25/kylie-jenner-shorter-hair-glam-makeup-bathroom-selfie-pic/", "urlToImage": null, "publishedAt": "2020-04-26T02:48:23Z", "content": "Kylie Jenner showed off her flawless Barbie-pink makeup and toned tummy! The cosmetics mogul stunned as she posed in front of her bathroom mirror for a selfie.\r\nKylie Jenner, 22, is right at home in her new $36.5 million estate! The Kylie Cosmetics founder sn… [+2196 chars]"}, {"source": {"id": null, "name": "Tomsguide.com"}, "author": "Kelly Woo", "title": "How to watch Penny Dreadful: City of Angels online, start time and channel - Tom's Guide UK", "description": "Watch Penny Dreadful: City of Angels online to see the supernatural spinoff's debut", "url": "https://www.tomsguide.com/news/how-to-watch-penny-dreadful-city-of-angels-online", "urlToImage": null, "publishedAt": "2020-04-26T02:32:19Z", "content": "Dark shadows loom over sunny California when you watch Penny Dreadful: City of Angels online. The supernatural spinoff of the gothic horror series Penny Dreadful premieres on Showtime this Sunday night and moves the action from Victorian England to Los Angele… [+7177 chars]"}, {"source": {"id": null, "name": "Thewrap.com"}, "author": "Reid Nakamura", "title": "Dimitri Diatchenko, 'Chernobyl Diaries' Actor, Dies at 52 - msnNOW", "description": "A co-worker told police that actor Dimitri Diatchenko had suffered an electrocution on the job and had been taking time off to recuperate.", "url": "http://www.thewrap.com/dimitri-diatchenko-chernobyl-diaries-actor-dies-at-52/", "urlToImage": null, "publishedAt": "2020-04-26T02:30:00Z", "content": "Dimitri Diatchenko, an actor best known for his role in the 2012 film “Chernobyl Diaries,” has died at the ago of 52, a representative confirmed.\r\nDiatchenko was found dead in his home in Daytona Beach, Florida, earlier this week. According to CNN, police wer… [+9538 chars]"}, {"source": {"id": null, "name": "Wrestlingnews.co"}, "author": "Paul Davis", "title": "REPORT: Vince McMahon’s new attitude at WWE SmackDown following the closing of XFL and WrestleMania Tampa cancellation - Wrestling News", "description": "There has been a lot said on social media in the last 24 hours about Vince McMahon’s appearance on WWE Friday Night SmackDown. For those of you that missed it, McMahon was on the show to celebrate Triple H’s 25 years with the company. McMahon had nice things …", "url": "https://wrestlingnews.co/wwe-news/report-vince-mcmahons-new-attitude-at-wwe-smackdown-following-the-closing-of-xfl-and-wrestlemania-tampa-cancellation/", "urlToImage": null, "publishedAt": "2020-04-26T01:55:03Z", "content": "There has been a lot said on social media in the last 24 hours about Vince McMahon’s appearance on WWE Friday Night SmackDown.\r\nFor those of you that missed it, McMahon was on the show to celebrate Triple H’s 25 years with the company. McMahon had nice things… [+1524 chars]"}, {"source": {"id": null, "name": "Tomsguide.com"}, "author": "Kelly Woo", "title": "How to watch Homeland online: Series finale start time and channel - Tom's Guide", "description": "Time to say goodbye and watch the Homeland series finale", "url": "https://www.tomsguide.com/news/how-to-watch-homeland-online", "urlToImage": null, "publishedAt": "2020-04-26T01:20:54Z", "content": "Can Carrie Mathison save her country again? You'll have to watch Homeland online to find out if she's able to do it in the series finale. The Showtime drama concludes its eighth and final season Sunday night, with Carrie (Claire Danes) once more working to de… [+5236 chars]"}, {"source": {"id": null, "name": "Nydailynews.com"}, "author": "Storm Gifford", "title": "Kids' stuff: Pratt and Schwarzenegger expecting - New York Daily News", "description": "Chris Pratt and Katherine Schwarzenegger are expecting their first child.", "url": "https://www.nydailynews.com/snyde/ny-kat-and-pratt-20200426-3ljz34ax7nb5xlfwrq5yez3hme-story.html", "urlToImage": null, "publishedAt": "2020-04-26T01:01:41Z", "content": null}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "James Laird", "title": "How to watch Bad Education: stream new Hugh Jackman movie online from anywhere - TechRadar", "description": "The fact-based TV movie is a critical hit", "url": "https://www.techradar.com/news/how-to-watch-bad-education-stream-new-hugh-jackman-movie-online-from-anywhere", "urlToImage": null, "publishedAt": "2020-04-26T00:30:48Z", "content": "It's being hailed as Hugh Jackman's best performance since The Greatest Showman and reportedly cost HBO $20 million to secure the distribution rights to - quite the figure for a film about a suburban district school board scandal. Yet it's won the critics ove… [+3871 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Mary Papenfuss", "title": "'A Spoonful Of Clorox': Randy Rainbow Channels Mary Poppins In Anti-Trump Parody - HuffPost", "description": "The president's dangerous suggestion was parody gold for the YouTube comedian.", "url": "https://www.huffpost.com/entry/randy-rainbow-spoonful-clorox-trump-covid-19_n_5ea4b0e3c5b6805f9ece2978", "urlToImage": null, "publishedAt": "2020-04-26T00:03:10Z", "content": "Comedian Randy Rainbow on Saturday posted a caustic attack on President Donald Trump and his suggestion that injecting disinfectant into human bodies might work to cure COVID-19.\r\n“When viral symptoms underlie, there are home remedies to apply,” the YouTube s… [+1314 chars]"}, {"source": {"id": null, "name": "Whsv.com"}, "author": "Cayley Urenko", "title": "Harold Reid, founding member of the Statler Brothers and valley native, dies at 80 - WHSV", "description": "Reid was fighting kidney failure and passed away in Staunton on Friday night.", "url": "https://www.whsv.com/content/news/Country-music-legend--569953651.html", "urlToImage": null, "publishedAt": "2020-04-25T23:41:36Z", "content": "STAUNTON, Va.(WHSV) -- Country music and Staunton legend Harold Reid, who sang bass for the Grammy-winning country group the Statler Brothers died last night at his home in Staunton. Reid had a long battle with kidney failure. He was 80 years old. \r\nReid was … [+2251 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Anita Bennett", "title": "‘Price Is Right’ Announcer George Gray Recovering After Suffering Multiple Heart Attacks - Deadline", "description": "George Gray, longtime announcer for The Price Is Right, is recovering after suffering three heart attacks earlier this week. “George is recovering at the hospital and is in good spirits,” his rep told Deadline Saturday. “He even cracked a couple of jokes on t…", "url": "https://deadline.com/2020/04/price-is-right-announcer-george-gray-recovering-after-suffering-multiple-heart-attacks-1202917950/", "urlToImage": null, "publishedAt": "2020-04-25T23:27:47Z", "content": "George Gray, longtime announcer for The Price Is Right, is recovering after suffering three heart attacks earlier this week.\r\n“George is recovering at the hospital and is in good spirits,” his rep told Deadline Saturday. “He even cracked a couple of jokes on … [+755 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Dean Balsamini", "title": "Rolling Stones top charts with 'Living in a Ghost Town' - New York Post ", "description": "On Thursday, the band released  “Living in a Ghost Town,” with an accompanying video, and the track jumped to the top of the iTunes’ song chart. It was the band’s first No. 1 hit in 40 y…", "url": "https://nypost.com/2020/04/25/rolling-stones-top-charts-with-living-in-a-ghost-town/", "urlToImage": null, "publishedAt": "2020-04-25T23:07:51Z", "content": "The legendary Rolling Stones got some satisfaction with a new chart-topping song, their first No. 1 hit on iTunes.\r\nOn Thursday, the band released  Living in a Ghost Town, with an accompanying video, and the track jumped to the top of the iTunes song chart, b… [+656 chars]"}, {"source": {"id": null, "name": "Insidethemagic.net"}, "author": null, "title": "Online Resort Check-In Now Required for Walt Disney World Vacations - Inside the Magic", "description": "It has been revealed on the official Walt Disney World app, My Disney Experience, that online check-in will now be required for all Disney World vacations.", "url": "https://insidethemagic.net/2020/04/online-check-required-disney-world-vacations-ba1/", "urlToImage": null, "publishedAt": "2020-04-25T23:07:09Z", "content": "It has been revealed on the official Walt Disney World app, My Disney Experience, that online check-in will now be required for all Disney World vacations.\r\nAn Inside the Magic reader sent in this screenshot of the My Disney Experience app showing her upcomin… [+2542 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ed Lavandera, CNN", "title": "New Orleans in the age of coronavirus is quiet and strange. But like after Katrina, musicians and artists are planning a revival - CNN", "description": "Creativity is the underlying pulse that gives New Orleans life, not death, and it's in quarantine. Walking the streets and funky neighborhoods of New Orleans makes you crave the city's rhythmic heartbeat. This city is quiet, and without music dancing in the a…", "url": "https://www.cnn.com/2020/04/25/us/new-orleans-life-coronavirus/index.html", "urlToImage": null, "publishedAt": "2020-04-25T22:54:56Z", "content": "New Orleans (CNN)Creativity is the underlying pulse that gives New Orleans life, not death, and it's in quarantine. Walking the streets and funky neighborhoods of New Orleans makes you crave the city's rhythmic heartbeat. This city is quiet, and without music… [+7948 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Minyvonne Burke", "title": "Connecticut dad, 32, writes heart-wrenching note to wife, kids before dying of coronavirus - NBC News", "description": "A Connecticut father of two who was battling the coronavirus wrote a heart-wrenching letter to his wife and children before he died.", "url": "https://www.nbcnews.com/news/us-news/connecticut-dad-32-writes-heart-wrenching-note-wife-kids-dying-n1192661", "urlToImage": null, "publishedAt": "2020-04-25T22:43:32Z", "content": "A Connecticut father who was battling the coronavirus wrote a letter to his wife and children telling them how much he loved them and how lucky he was to have them in his life.\r\nJonathan Coelho, 32, wrote the note the day before doctors at a hospital in Danbu… [+3303 chars]"}, {"source": {"id": null, "name": "Hollywoodlife.com"}, "author": "Emily Selleck", "title": "NeNe Leakes Leaves ‘RHOA’ Virtual Reunion After ‘A Lot Of Fighting’ With Eva, Kenya & Kandi - HollywoodLife", "description": "NeNe Leakes felt 'attacked' during the 'Real Housewives of Atlanta' virtual reunion, and was reportedly at the center of most of the drama.", "url": "https://hollywoodlife.com/2020/04/25/nene-leakes-leaves-rhoa-virtual-reunion-fighting/", "urlToImage": null, "publishedAt": "2020-04-25T22:10:35Z", "content": "NeNe Leakes felt ‘attacked’ during the ‘Real Housewives of Atlanta’ virtual reunion, and was reportedly at the center of most of the drama.\r\nAs per usual, NeNe Leakes, 52, is set to bring the drama on the upcoming Real Housewives of Atlanta virtual reunion ep… [+1787 chars]"}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Matthew Trzcinski", "title": "Pink Floyd: Was 'The Phantom of the Opera' Stolen From Them? - Showbiz Cheat Sheet", "description": "Pink Floyd are an iconic progressive rock band. Their influence is incredible. Did they inspire Andrew Lloyd Webber's The Phantom of the Opera?", "url": "https://www.cheatsheet.com/entertainment/pink-floyd-was-the-phantom-of-the-opera-stolen-from-them.html/", "urlToImage": null, "publishedAt": "2020-04-25T21:45:38Z", "content": "The Phantom of the Operais still one of the most popular musicals ever. Its title song is one of the most popular songs in the history of musical theater. But did it originate with The Phantom of the Opera or Pink Floyd?\r\nThe song The Phantom of the Opera has… [+2854 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Defending Jacob Cast Guide: Where You've Seen The Actors Before - Screen Rant", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiPGh0dHBzOi8vc2NyZWVucmFudC5jb20vZGVmZW5kaW5nLWphY29iLWNhc3QtY2hhcmFjdGVyLWd1aWRlL9IBQGh0dHBzOi8vc2NyZWVucmFudC5jb20vZGVmZW5kaW5nLWphY29iLWNhc3QtY2hhcmFjdGVyLWd1aWRlL2FtcC8?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T21:42:00Z", "content": null}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Rachel Sharp For Dailymail.com", "title": "Mister Rogers told co-star Officer Clemmons not to come out as gay and to marry a woman - Daily Mail", "description": "Francois Clemmons, 75, recalled an incident where 'Mister' Fred Rogers told him he could not be a 'member of the Neighborhood' if he was openly gay.", "url": "https://www.dailymail.co.uk/news/article-8256973/Mister-Rogers-told-star-Officer-Clemmons-not-come-gay-marry-woman.html", "urlToImage": null, "publishedAt": "2020-04-25T21:40:02Z", "content": "Francois Clemmons, best known as Officer Clemmons on children's TV series 'Mister Rogers' Neighborhood', has said that TV star Fred Rogers told him to not come out as gay and to marry a woman because if he didn't, it would 'threaten his dream'.\r\nClemmons, 75,… [+2995 chars]"}, {"source": {"id": null, "name": "Latimes.com"}, "author": "Stephen Battaglio", "title": "'Judge Judy' announcer Jerry Bishop dies at 84 - Los Angeles Times", "description": "Jerry Bishop, the voice of hit daytime courtroom show 'Judge Judy' was also a Los Angeles radio host.", "url": "https://www.latimes.com/entertainment-arts/tv/story/2020-04-25/judge-judy-announcer-jerry-bishop-dead", "urlToImage": null, "publishedAt": "2020-04-25T21:30:00Z", "content": "Jerry Bishop, the veteran radio personality who was the off-camera announcer for the courtroom television show Judge Judy, died Tuesday after a brief illness. He was 84.\r\nBishops death was confirmed by his granddaughter Allison Rosenbloom, who said he suffere… [+1928 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alaa Elassar, CNN", "title": "The Beatles streamed 'Yellow Submarine' and hosted a sing-a-long watch party, and people loved it - CNN", "description": "Even during a global pandemic, the Beatles found a way for people to come together.", "url": "https://www.cnn.com/2020/04/25/us/the-beatles-yellow-submarine-trnd/index.html", "urlToImage": null, "publishedAt": "2020-04-25T21:24:55Z", "content": null}, {"source": {"id": null, "name": "Cinemablend.com"}, "author": "Sarah El-Mahmoud", "title": "Buffy The Vampire Fans Are Freaking Out About Dolly Parton Secretly Producing The Series - CinemaBlend", "description": "Wait... what?", "url": "https://www.cinemablend.com/television/2495130/buffy-the-vampire-fans-are-freaking-out-about-dolly-parton-secretly-producing-the-series", "urlToImage": null, "publishedAt": "2020-04-25T21:03:45Z", "content": "Its no secret Dolly Parton has had an incredibly accomplished career. The 74-year-old is a country music icon, famed star of 1980's 9 to 5 with Jane Fonda and Lily Tomlin, businesswoman, philanthropist and Buffy the Vampire Slayer producer. Wait, what?\r\nThats… [+2763 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Jennifer Ouellette", "title": "Review: Chris Hemsworth shows his dramatic acting chops in Extraction - Ars Technica", "description": "Streaming services like Netflix provide a much-needed platform for mid-level films", "url": "https://arstechnica.com/gaming/2020/04/review-extraction-is-a-solid-action-thriller-with-killer-fight-sequences/", "urlToImage": null, "publishedAt": "2020-04-25T20:20:00Z", "content": "Enlarge/ Chris Hemsworth plays a ruthless mercenary whose latest mission calls for recusing a drug lord's kidnapped son from Bangladesh. \r\n3 with 3 posters participating\r\nChris Hemsworth gets a chance to stretch his acting chops as a hardened mercenary hired … [+6160 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Feeling the LOVE! You'll love HEART-MELTING Bhim Niroula EVERY DAY! | BGT 2020 - Britain's Got Talent", "description": "See more from Britain's Got Talent at http://itv.com/talent Watch Britain's Got Talent: Unseen on the ITV HUB: https://bit.ly/2RreDOp Vocal chords at the rea...", "url": "https://www.youtube.com/watch?v=O2q8-HEqE9c", "urlToImage": null, "publishedAt": "2020-04-25T20:11:20Z", "content": null}, {"source": {"id": null, "name": "Pagesix.com"}, "author": "Paula Froelich", "title": "Mike Tyson 'might have' bought his tigers from 'Tiger King' Joe Exotic - Page Six", "description": "He owned three tigers in the 1990s.", "url": "https://pagesix.com/2020/04/25/mike-tyson-might-have-bought-his-tigers-from-joe-exotic/", "urlToImage": null, "publishedAt": "2020-04-25T19:54:20Z", "content": "Mike Tyson says the three tigers he owned in the 1990s might have come from “Tiger King” Joe Exotic.\r\nTyson was one of the 64 million viewers around the world who watched the bizarre Netflix docuseries about ex-zookeeper and tiger collector Joe Exotic now in … [+1638 chars]"}, {"source": {"id": "entertainment-weekly", "name": "Entertainment Weekly"}, "author": "Tyler Aquilina", "title": "Courtney Love, Krist Novoselic react to Post Malone's Nirvana tribute concert: 'Goosebumps!' - Entertainment Weekly", "description": "Courtney Love and Nirvana bassist Krist Novoselic shared their approval of Post Malone's charity tribute concert on social media.", "url": "https://ew.com/music/post-malone-nirvana-coronavirus-concert-courtney-love-krist-novoselic/", "urlToImage": null, "publishedAt": "2020-04-25T19:54:19Z", "content": "There we were, and he entertained us. Post Malone staged his Nirvana tribute concert via livestream on Friday, raising over $2 million for coronavirus relief — and earning the approval of two key Nirvana figures.\r\nDuring the 80-minute livestream, Malone, back… [+1561 chars]"}, {"source": {"id": null, "name": "Rollingstone.com"}, "author": "Daniel Kreps", "title": "Live Nation Amends Ticket Refund Policy Following Criticism - Rolling Stone", "description": "\"Fans, we hear you. We don’t want you to be waiting in limbo while shows are being rescheduled,\" CEO Michael Rapino tweets", "url": "https://www.rollingstone.com/music/music-news/live-nation-tickermaster-refund-policy-990053/", "urlToImage": null, "publishedAt": "2020-04-25T19:31:14Z", "content": "Following continued criticism over their refund policies, Live Nation has amended its previously announced plan for concerts canceled or postponed by the coronavirus pandemic, the New York Times reported Saturday.\r\n“Fans, we hear you. We don’t want you to be … [+2553 chars]"}, {"source": {"id": null, "name": "Rollingstone.com"}, "author": "Tim Chan", "title": "SuperM Set Unprecedented Live Streaming Concert to Give Back to Fans - Rolling Stone", "description": "The one-night-only concert will be streamed live from Korea to more than 200 countries around the world", "url": "https://www.rollingstone.com/music/music-news/superm-beyond-live-streaming-concert-990019/", "urlToImage": null, "publishedAt": "2020-04-25T19:30:59Z", "content": "When SuperM made their debut last fall, the seven members of the Korean supergroup said they wanted to use their platform to bring something fresh to the industry and to raise the bar for the K-pop scene. This weekend, SuperM — assembled from four of the most… [+5329 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chloe Melas, CNN", "title": "Davido releases 'Dolce & Gabanna' music video and donates proceeds to coronavirus research after fiancée tests positive - CNN", "description": "Nigerian singer, Davido, is doing his part in the fight against COVID-19.", "url": "https://www.cnn.com/2020/04/25/entertainment/davido-dolce-gabbana-music-video-coronavirus/index.html", "urlToImage": null, "publishedAt": "2020-04-25T19:25:03Z", "content": "(CNN)Nigerian singer, Davido, is doing his part in the fight against COVID-19.\r\nThe internationally-known singer not only released his new music video, \"Dolce &amp; Gabbana,\" on Friday but also announced that all the proceeds from the video will go to support… [+1207 chars]"}, {"source": {"id": null, "name": "Variety.com"}, "author": "Jordan Moreau", "title": "Tom Hanks’ Blood Is Being Used to Develop Coronavirus Vaccine - Variety", "description": "After recovering from coronavirus, Tom Hanks and Rita Wilson have offered their blood to help develop a vaccine for coronavirus. In early March, the couple tested positive for COVID-19 while in Australia for Baz Luhrmann’s Elvis Presley biopic, in which Hanks…", "url": "https://variety.com/2020/film/news/tom-hanks-coronavirus-blood-research-vaccine-1234589978/", "urlToImage": null, "publishedAt": "2020-04-25T19:18:12Z", "content": "After recovering from coronavirus, Tom Hanks and Rita Wilson have offered their blood to help develop a vaccine for coronavirus.\r\nIn early March, the couple tested positive for COVID-19 while in Australia for Baz Luhrmann’s Elvis Presley biopic, in which Hank… [+1114 chars]"}, {"source": {"id": null, "name": "Sfchronicle.com"}, "author": "Steve Rubenstein", "title": "SF sings its heart out in unison with Tony Bennett to combat coronavirus blues - San Francisco Chronicle", "description": "At high noon, there was no getting away from the sound of “I Left My Heart in San Francisco” in the city’s first live-from-everyplace pandemic feel-good sing-along.", "url": "https://datebook.sfchronicle.com/music/sf-sings-its-heart-out-with-tony-bennett-to-combat-coronavirus-blues", "urlToImage": null, "publishedAt": "2020-04-25T19:16:22Z", "content": null}, {"source": {"id": null, "name": "Slashfilm.com"}, "author": "Ethan Anderton", "title": "Sony Pictures Release Dates Shuffled for 2020 and 2021/Film - /FILM", "description": "Sony Pictures release dates have been shifted around for movies in 2020 and 2021 thanks to the production shutdown caused by coronavirua.", "url": "https://www.slashfilm.com/sony-pictures-release-dates-for-2020-and-2021/", "urlToImage": null, "publishedAt": "2020-04-25T19:00:39Z", "content": "After pushing back both Spider-Man 3 and Spider-Man: Into the Spider-Verse, Sony Pictures has also shuffled around a bunch of other upcoming release dates for movies slated to come out this year and through 2021. Some of the movies hopping around the theatric… [+2805 chars]"}, {"source": {"id": null, "name": "Wdwnt.com"}, "author": null, "title": "AMC Theatres Not Reopening Until July, Waiting for Summer Blockbuster Films to be Released - wdwnt.com", "description": "According to The Hollywood Reporter, we won't see a reopening of AMC Theatres until summer", "url": "https://wdwnt.com/2020/04/amc-theatres-will-not-be-reopening-until-regular-schedule-of-new-theatrical-releases-beginning-this-summer/", "urlToImage": null, "publishedAt": "2020-04-25T19:00:10Z", "content": "This post may contain affiliate links; please read the disclosure for more information.\r\nAccording to The Hollywood Reporter, we won’t see a reopening of AMC Theatres until summer blockbuster films are ready to hit the screen.\r\nAMC Theatres has 630+ locations… [+1656 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alaa Elassar, CNN", "title": "Best moments from CNN and Sesame Street's coronavirus town hall for kids and parents - CNN", "description": "CNN partnered with Sesame Street for a special town hall about coronavirus to give kids the opportunity to learn more about the pandemic and ask questions.", "url": "https://www.cnn.com/2020/04/25/us/cnn-sesame-street-town-hall-coronavirus-trnd/index.html", "urlToImage": null, "publishedAt": "2020-04-25T18:44:46Z", "content": "By Alaa Elassar, CNN\r\nUpdated 2:35 PM ET, Sat April 25, 2020\r\nChat with us in Facebook Messenger. Find out what's happening in the world as it unfolds.\r\n(CNN)CNN partnered with Sesame Street for a special town hall about coronavirus to give kids the opportuni… [+5839 chars]"}, {"source": {"id": null, "name": "Pagesix.com"}, "author": "Jessica Bennett", "title": "Elisabeth Hasselbeck tells 'aggressive' Meghan McCain to 'turn off the meanness' - Page Six", "description": "Elisabeth Hasselbeck has called out “The View” panelist Meghan McCain for recent comments the conservative made during her Wednesday appearance on “Watch What Happens Live.”", "url": "https://pagesix.com/2020/04/25/elisabeth-hasselbeck-hits-back-at-aggressive-meghan-mccain/", "urlToImage": null, "publishedAt": "2020-04-25T18:35:23Z", "content": "Elisabeth Hasselbeck has called out “The View” panelist Meghan McCain for recent comments the conservative made during her Wednesday appearance on “Watch What Happens Live.”\r\nWhile virtually sitting down with host Andy Cohen, McCain, 35, took Hasselbeck to ta… [+1870 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Rasha Ali", "title": "Jeff Goldblum criticized for 'dangerous and hurtful' comments on Islam during 'RuPaul's Drag Race' - USA TODAY", "description": "Jeff Goldblum came under fire on social media for his questions about Islam during an episode of \"RuPaul's Drag Race.\"", "url": "https://www.usatoday.com/story/entertainment/celebrities/2020/04/25/jeff-goldblum-criticized-twitter-dangerous-comments-islam/3025998001/", "urlToImage": null, "publishedAt": "2020-04-25T18:19:50Z", "content": "Jeff Goldblum shares the inside scoop on his new show from National Geographic 'The World According to Jeff Goldblum' set to premiere on Disney+.\r\nUSA TODAY\r\nJeff Goldblum became a  topic of discussion on social media for his questions about Islam's treatment… [+4911 chars]"}, {"source": {"id": null, "name": "Vulture.com"}, "author": "Devon Ivie", "title": "Dead to Me Season 2 Trailer: Murder, They Wrote - Vulture", "description": "The female buddy dramedy returns, just when we need it.", "url": "https://www.vulture.com/2020/04/netflix-dead-to-me-season-2-trailer-2020-watch.html", "urlToImage": null, "publishedAt": "2020-04-25T17:59:21Z", "content": "If youre going to murder one of the most handsome men in the world, perhaps dont do it in your pool. So inelegant. So expected. And now, Jen (Christina Applegate) and Judy (Linda Cardellini) have to worry about draining all of that chlorine. The blood takes a… [+552 chars]"}, {"source": {"id": null, "name": "Harpersbazaar.com"}, "author": "Bianca Betancourt", "title": "Prince Louis Has a Twinning Moment With Prince William in New Birthday Photos - Yahoo Lifestyle", "description": "Like father, like son!", "url": "https://www.harpersbazaar.com/celebrity/latest/a32242852/prince-louis-twins-with-prince-william-birthday-photos/", "urlToImage": null, "publishedAt": "2020-04-25T17:57:00Z", "content": "<ul><li>The Duke and Duchess of Cambridge have shared new images of their youngest son, Prince Louis, ahead of his second birthday tomorrow. </li><li>In the photos, Prince Louis wears a checkered button-down shirt and navy slacks, an ensemble coincidently sim… [+1655 chars]"}, {"source": {"id": null, "name": "Variety.com"}, "author": "Jordan Moreau", "title": "Broadway Star Nick Cordero Gets Temporary Pacemaker After Leg Amputation - Variety", "description": "After doctors had to amputate his right leg last week, Broadway actor Nick Cordero has had a procedure to insert a temporary pacemaker in his heart, his wife Amanda Kloots announced. Kloots gave the update on Cordero’s health on her Instagram Story on Friday.…", "url": "https://variety.com/2020/legit/news/nick-cordero-pacemaker-amputation-coronavirus-1234589944/", "urlToImage": null, "publishedAt": "2020-04-25T17:33:06Z", "content": "After doctors had to amputate his right leg last week, Broadway actor Nick Cordero has had a procedure to insert a temporary pacemaker in his heart, his wife Amanda Kloots announced.\r\nKloots gave the update on Cordero’s health on her Instagram Story on Friday… [+1937 chars]"}, {"source": {"id": null, "name": "Tomsguide.com"}, "author": "Henry T. Casey", "title": "Beastie Boys Story is so good you’ll want to pay for Apple TV Plus - Tom's Guide", "description": "Spike Jonze's latest film should show Apple how to make Apple TV Plus a hit", "url": "https://www.tomsguide.com/news/beastie-boys-story-review-apple-tv-plus", "urlToImage": null, "publishedAt": "2020-04-25T17:17:43Z", "content": "Out now, exclusively on Apple TV Plus\r\n, Beastie Boys Story might be my favorite thing I've watched during the 6 weeks I've been stuck inside under quarantine. It also got me thinking about the Apple TV Plus service, which probably hasn't been the home-run hi… [+7073 chars]"}, {"source": {"id": null, "name": "Pagesix.com"}, "author": "Jessica Bennett", "title": "'Will & Grace' creators talk feud between Debra Messing and Megan Mullally - Page Six", "description": "Show creators confirmed that there were “squabbles” on set.", "url": "https://pagesix.com/2020/04/25/will-grace-creators-talk-feud-between-debra-messing-and-megan-mullally/", "urlToImage": null, "publishedAt": "2020-04-25T17:11:14Z", "content": "Creators of NBC favorite “Will &amp; Grace” David Kohan and Max Mutchnick have finally addressed the rumored rift between show stars Debra Messing and Megan Mullally, confirming that there were “squabbles” on set, but that they would never allow such things t… [+1247 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Anna MacSwan", "title": "Queen's life in lockdown with just a dozen staff and her budgies, but no horse rides - Mirror Online", "description": "The 94-year-old Queen is reportedly keeping in touch with family through video messenger and avidly watching the news as she and Prince Phillip spend lockdown at Windsor Castle", "url": "https://www.mirror.co.uk/news/uk-news/queens-life-lockdown-just-dozen-21924664", "urlToImage": null, "publishedAt": "2020-04-25T16:34:30Z", "content": "The Queen is reportedly being looked after by just a dozen staff and has been keeping in touch with family through video calls during lockdown.\r\n The 94-year-old monarch has been isolating with husband Prince Phillip, 98, at Windsor Castle amid the coronaviru… [+2811 chars]"}, {"source": {"id": null, "name": "Nme.com"}, "author": null, "title": "Watch The Killers debut new song ‘Blowback’ and cover Tom Petty’s ‘The Waiting’ - NME Live", "description": "The Killers have debuted another new song from their forthcoming album ‘Imploding The Mirage’ - click here to listen to 'Blowback'.", "url": "https://www.nme.com/news/music/watch-the-killers-debut-new-song-blowback-and-cover-tom-pettys-the-waiting-2653845", "urlToImage": null, "publishedAt": "2020-04-25T16:13:05Z", "content": "The Killers have debuted another new song from their forthcoming album Imploding The Mirage.\r\nThe band’s frontman Brandon Flowers and Ronnie Vannucci Jr. appeared on CBS This Morning today (April 25) for the shows recurring Saturday Sessions segment. While on… [+1292 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Scott Mendelson", "title": "Did ‘Spider-Man 3’ Spoil Marvel’s Post-‘Avengers: Endgame’ Plans? - Forbes", "description": "Thanks to 'Spider-Man 3,' 'Doctor Strange 2' may open out of order. 'Thor 4,' 'Doctor Strange 2,' 'Black Panther 2' and 'Captain Marvel 2' will open almost concurrently in 2022.", "url": "https://www.forbes.com/sites/scottmendelson/2020/04/25/spider-man-3-delay-puts-a-wrinkle-in-marvels-post-avengers-endgame-plans-for-thor-and-doctor-strange/", "urlToImage": null, "publishedAt": "2020-04-25T16:05:17Z", "content": "posters from 'Doctor Strange,' 'Spider-Man Far from Home' and 'Thor Ragnarok'\r\nWalt Disney and Marvel\r\nA date change for Sonys untitled third Spider-Man movie leaves Doctor Strange in the Multiverse of Madness opening out of order and results in Thor 4, Docto… [+7355 chars]"}, {"source": {"id": null, "name": "Billboard.com"}, "author": "Mitchell Peters", "title": "Kanye West Is Now a Billionaire, Thanks Mostly to His Yeezy Sneaker Brand - Billboard", "description": "", "url": "https://www.billboard.com/articles/columns/hip-hop/9365910/kanye-west-is-now-a-billionaire-thanks-mostly-to-his-yeezy-sneaker-brand-forbes", "urlToImage": null, "publishedAt": "2020-04-25T15:30:45Z", "content": "It's official: Kanye West is now a billionaire.\r\nOver the years, West's finances have remained mostly a mystery. But now, Forbes reports that the rapper-turned-footwear mogul has an estimated net worth of $1.3 billion.\r\nWest can attribute his entry into the b… [+1643 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Paul Tassi", "title": "‘Fortnite’ Players Think This Travis Scott Clue May Lead To The Return Of The Old Map - Forbes", "description": "Is the old Fortnite Chapter 1 map coming back?", "url": "https://www.forbes.com/sites/paultassi/2020/04/25/fortnite-players-think-this-travis-scott-clue-may-lead-to-the-return-of-the-old-map/", "urlToImage": null, "publishedAt": "2020-04-25T15:19:15Z", "content": "Fortnite\r\nEpic/Lucas7Yoshi\r\nThe final two Travis Scott shows are today in Fortnite, and while theyre must-see events because of how damn cool they are, some Fortnite fans are starting to get excited about what they view as an easter egg that they believe coul… [+2544 chars]"}, {"source": {"id": null, "name": "Cosmopolitan.com"}, "author": "Alanna Lauren Greco", "title": "Tyler Cameron Says He and Hannah Brown Are \"Just Starting Off as Friends\" and \"Not in a Place\" to Date RN - Yahoo Lifestyle", "description": "That doesn't rule out the future, though! 👀", "url": "https://www.cosmopolitan.com/entertainment/tv/a32275994/tyler-cameron-hannah-brown-starting-off-friends-not-in-place-date/", "urlToImage": null, "publishedAt": "2020-04-25T15:19:00Z", "content": "<ul><li>Tyler Cameron just hinted that even though he's not dating his Bachelorette ex Hannah Brown at the moment, he wants to date her again in the future. </li><li>In a new vid he says, \"we're just starting off as friends and that's what it is right now.\"</… [+1280 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Too Hot to Handle: Inside Sharron & Rhonda's Complicated Post-Show Relationship (Exclusive) - Entertainment Tonight", "description": "ET chatted with 'Too Hot to Handle' cast member Sharron Townsend about the status of his relationship with Rhonda Paul after filming. Exclusives from #ETonli...", "url": "https://www.youtube.com/watch?v=IVDAP8oB9xw", "urlToImage": null, "publishedAt": "2020-04-25T15:00:11Z", "content": "ET chatted with 'Too Hot to Handle' cast member Sharron Townsend about the status of his relationship with Rhonda Paul after filming.\r\nExclusives from #ETonline :https://www.youtube.com/playlist?list..."}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Brie Bella Defends Nikki's Close Bond With Birdie | Total Bellas Bonus Scene | E! - E! Entertainment", "description": "The \"Total Bellas\" star discusses her sister's bond with her daughter Birdie, after hearing her brother JJ wants Nikki and Vivienne to have the same bond. Wa...", "url": "https://www.youtube.com/watch?v=jKzw9Cfuakg", "urlToImage": null, "publishedAt": "2020-04-25T14:59:56Z", "content": null}, {"source": {"id": null, "name": "Pagesix.com"}, "author": "Jessica Bennett", "title": "Pauly D is unrecognizable with new 'quarantine beard' - Page Six", "description": "Pauly D of “Jersey Shore” fame shocked several fans with the reveal of his “quarantine beard.”", "url": "https://pagesix.com/2020/04/25/pauly-d-is-unrecognizable-with-new-quarantine-beard/", "urlToImage": null, "publishedAt": "2020-04-25T14:58:55Z", "content": "Pauly D of “Jersey Shore” fame shocked several fans with the reveal of his “quarantine beard.”\r\nThe reality star, 39, shared what appears to be an edited photo of himself rocking his newly-grown facial hair Friday, leading fans to question exactly which “Jers… [+904 chars]"}, {"source": {"id": null, "name": "Xxlmag.com"}, "author": "cvernoncoleman", "title": "Lil Uzi Vert Denies Dissing Playboi Carti on New Song “Sasuke” - XXLMAG.COM", "description": "Read details here.", "url": "https://www.xxlmag.com/news/2020/04/lil-uzi-vert-denies-dissing-playboi-carti-sasuke/", "urlToImage": null, "publishedAt": "2020-04-25T14:21:00Z", "content": "Lil Uzi Vert is shooting down speculation that he is taking shots at Playboi Carti on his new single, \"Sasuke.\"\r\nAfter both rappers hinted at dropping new songs on Monday (April 20), neither rapper came through as promised, causing upset fans. However, Uzi de… [+1312 chars]"}, {"source": {"id": null, "name": "Times-herald.com"}, "author": null, "title": "Music legend Bohannon passes - Newnan Times-Herald", "description": "Newnan music legend Hamilton Bohannon passed away Friday at the age of 78.", "url": "https://times-herald.com/news/2020/04/music-legend-bohannon-passes", "urlToImage": null, "publishedAt": "2020-04-25T14:14:13Z", "content": "Newnan music legend Hamilton Bohannon passed away Friday at the age of 78. Bohannon was a percussionist, band leader, songwriter and record producer, who was one of the leading figures in 1970s disco music.\r\nNewnan music legend Hamilton Bohannon passed away F… [+14098 chars]"}, {"source": {"id": null, "name": "Hollywoodreporter.com"}, "author": "Natalie Jarvey", "title": "Netflix Unpacks Coronavirus Pandemic With New Season of 'Explained' - Hollywood Reporter", "description": "The new episode, put together in two-and-a-half weeks, will debut Sunday, April 26.", "url": "https://www.hollywoodreporter.com/live-feed/netflix-unpacks-coronavirus-pandemic-new-season-explained-1291877", "urlToImage": null, "publishedAt": "2020-04-25T14:00:00Z", "content": "In November last year, Netflix released an episode of docuseries Explained that detailed the efforts underway to prevent the spread of a global pandemic. By mid-March, as Americans began to feel the effects of the novel coronavirus outbreak, the team behind E… [+3409 chars]"}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Robert Yaniz Jr.", "title": "'Avengers: Endgame': One Year Later, the Marvel Epic Is More Relevant than Ever - Showbiz Cheat Sheet", "description": "A full year has passed since 'Avengers: Endgame' hit theaters. Yet, the film feels more relevant to today's world than ever before.", "url": "https://www.cheatsheet.com/entertainment/avengers-endgame-one-year-later-the-marvel-epic-is-more-relevant-than-ever.html/", "urlToImage": null, "publishedAt": "2020-04-25T11:01:51Z", "content": "It feels like only yesterday, but believe it or not, a full year has passed since Captain America (Chris Evans) led the entire Marvel Cinematic Universe against Thanos (Josh Brolin) and his army. Accordingly, Avengers: Endgame proved to be a superhero blockbu… [+3864 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Rasha Ali", "title": "New York rapper Fred the Godson dead at 35 from coronavirus complications - USA TODAY", "description": "Bronx rapper, Fred the Godson, died Thursday after revealing he had contracted COVID-19 earlier this month.", "url": "https://www.usatoday.com/story/entertainment/celebrities/2020/04/24/coronavirus-fred-godson-dead-stars-react-today-sad-one/3013999001/", "urlToImage": null, "publishedAt": "2020-04-24T22:03:13Z", "content": "New York rapper Fred the Godson died after being hospitalized for the coronavirus. He was 35 years old.\r\nUSA TODAY\r\nNew York rapper Fred the Godson died Thursday after being diagnosed with COVID-19, his manager confirmed to USA TODAY. He was 35.\r\n\"New York Ci… [+2534 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Carly Mallenbaum", "title": "Nickelodeon's Kids' Choice Awards goes remote; Disney World presents virtual fireworks - USA TODAY", "description": "The Kids' Choice Awards will now a \"virtually produced,\" star-studded show on May 2. Need kid-friendly programming while you wait: Disney's fireworks.", "url": "https://www.usatoday.com/story/entertainment/tv/2020/04/24/kids-choice-awards-ariana-grande-rock-bts-appear-virtually/3023296001/", "urlToImage": null, "publishedAt": "2020-04-24T21:58:23Z", "content": "Comedians, actors, and musicians use their extra free time during coronavirus isolation to give back to fans and support charities.\r\nUSA TODAY\r\nThe Kids' Choice Awards show will go on, and the slime will flow in a \"virtually produced\" show.\r\nOriginally schedu… [+1739 chars]"}, {"source": {"id": null, "name": "Vogue.com"}, "author": "Emma Specter", "title": "The 17 Best '80s Movies and How to Watch Them - Vogue", "description": "We may be trapped indoors for the foreseeable future, but why not make the time pass quicker with a 1980s movie marathon? Here's how to stream everything from 'Die Hard' to 'Do the Right Thing.'", "url": "https://www.vogue.com/article/best-80s-movies", "urlToImage": null, "publishedAt": "2020-04-24T20:28:03Z", "content": "Let's be honest: The 2020s are nobody's favorite decade. In just four months, we've had our world rocked by a global pandemic, so why not retreat to the past with a nostalgic '80s-movie retrospective?\r\nSure, many of the films from that decade are dated, but t… [+4497 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Kate Middleton, Prince William And Their Children Applaud Health Workers On Video | TODAY - TODAY", "description": "In a newly released video, Kate Middleton, Prince William and their three children, George, Charlotte and Louis, are seen outside their country home applaudi...", "url": "https://www.youtube.com/watch?v=jBFXKrbT9Ew", "urlToImage": null, "publishedAt": "2020-04-24T20:00:20Z", "content": null}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Gary Dinges", "title": "Billy Porter speaks 'truth to power' in cover of Buffalo Springfield's 'For What It's Worth' - USA TODAY", "description": "A frequent critic of President Donald Trump, Porter says he was inspired by artists who recorded songs during times of conflict in U.S. history.", "url": "https://www.usatoday.com/story/entertainment/music/2020/04/24/billy-porter-covers-stephen-stills-classic-for-what-its-worth/5155035002/", "urlToImage": null, "publishedAt": "2020-04-24T19:32:25Z", "content": "Music producers battle with the Verzuz series as fans party along \r\nAP Entertainment\r\nBilly Porter is channeling the past by bringing you a message from the future.\r\nThe singer, actor and Broadway performer has covered Stephen Stills beloved Buffalo Springfie… [+2809 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Taylor Swift SLAMS Scooter Braun For New Album Release! - Clevver News", "description": "More Celebrity News ►► http://bit.ly/SubClevverNews #TaylorSwift #ScooterBraun #BigMachineRecords The world may be at a stand still but that’s not enough to ...", "url": "https://www.youtube.com/watch?v=26ZDaI5uisE", "urlToImage": null, "publishedAt": "2020-04-24T19:30:00Z", "content": null}, {"source": {"id": null, "name": "Today.com"}, "author": "Alexander Kacala", "title": "Andy Cohen says he couldn't donate plasma because he is gay - TODAY", "description": "Andy Cohen is speaking out about what he says is a discriminatory practice when it comes to LGBTQ people being able to donate blood and convalescent plasma.", "url": "https://www.today.com/health/andy-cohen-says-he-couldn-t-donate-plasma-because-he-t179881", "urlToImage": null, "publishedAt": "2020-04-24T18:16:37Z", "content": "Andy Cohen is speaking out about what he says is a discriminatory practice happening at the federal level when it comes to LGBTQ people being able to donate blood and convalescent plasma.\r\nThe 51-year-old talk show host tested positive for the coronavirus in … [+3733 chars]"}, {"source": {"id": null, "name": "Tmz.com"}, "author": "TMZ Staff", "title": "Juice WRLD's Posthumous Track 'Righteous' Details Drug Use - TMZ", "description": "Juice WRLD's family has dropped a new track, \"Righteous,\" which foreshadowed his drug problem.", "url": "https://www.tmz.com/2020/04/24/juice-wrld-family-releases-new-track-righteous-drug-use/", "urlToImage": null, "publishedAt": "2020-04-24T17:23:44Z", "content": "Juice WRLD's family has dropped a posthumous track from him, and its lyrics sadly foreshadow his eventual demise.\r\nThe late rapper's family dropped \"Righteous\" Thursday night and the track goes into extreme detail about his heavy drug use and the state of his… [+1220 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Dino-Ray Ramos", "title": "Western Thriller ‘True History Of Kelly Gang’ And ’60s Coming-Of-Age Drama ‘To The Stars’ Make Debuts – Specialty Streaming Preview - Deadline", "description": "The story of the notorious outlaw Ned Kelly is dropping on digital and on-demand today with the Justin Kurzel-directed True History of the Kelly Gang starring George MacKay (1917, Captain Fantastic), Russell Crowe (Boy Erased, The Loudest Voice) and Nicholas …", "url": "https://deadline.com/2020/04/true-history-of-kelly-gang-russell-crowe-justin-kurzel-to-the-stars-martha-stephens-specialty-streaming-preview-1202916073/", "urlToImage": null, "publishedAt": "2020-04-24T14:28:13Z", "content": "The story of the notorious outlaw Ned Kelly is dropping on digital and on-demand today with the Justin Kurzel-directed True History of the Kelly Gang starring George MacKay (1917, Captain Fantastic), Russell Crowe (Boy Erased, The Loudest Voice) and Nicholas … [+5477 chars]"}]}