{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": "usa-today", "name": "USA Today"}, "author": "Bryan Alexander", "title": "Adam Schlesinger tribute: Partner details final, heartbreaking moments of coronavirus battle - USA TODAY", "description": "Musician Adam Schlesinger died April 1 of complications from the coronavirus. His partner, Alexis Morley, paid loving tribute on Instagram Sunday.", "url": "https://www.usatoday.com/story/entertainment/music/2020/04/26/adam-schlesinger-tribute-partner-describes-singers-covid-19-battle/3031414001/", "urlToImage": null, "publishedAt": "2020-04-27T05:40:40Z", "content": "Emmy and Grammy winning musician and Fountains of Wayne bassist Adam Schlesinger has died of coronavirus complications at 52.\r\nUSA TODAY\r\nAdam Schlesinger's partner has opened up about the Fountains of Wayne musician's final, heartbreaking moments before dyin… [+5047 chars]"}, {"source": {"id": null, "name": "Cbslocal.com"}, "author": "CBS San Francisco", "title": "Coronavirus Update: Local Residents Join Tony Bennett's 'I Left My Heart In San Francisco' For Noon Singalong - CBS San Francisco", "description": "Someone has placed a protective mask on San Francisco's statue honoring famed crooner Tony Bennett -- a fitting tribute to the city's favorite adopted son who led a virtual singalong of his \"I Left My Heart In San Francisco\" classic Saturday to raise spirits …", "url": "https://sanfrancisco.cbslocal.com/2020/04/25/coronavirus-shelter-in-place-tony-bennetts-i-left-my-heart-in-san-francisco/", "urlToImage": null, "publishedAt": "2020-04-27T04:05:04Z", "content": "SAN FRANCISCO (CBS SF) — Someone has placed a protective mask on San Francisco’s statue honoring famed crooner Tony Bennett — a fitting tribute to the city’s favorite adopted son who led a virtual singalong of his “I Left My Heart In San Francisco” classic Sa… [+3517 chars]"}, {"source": {"id": null, "name": "People.com"}, "author": null, "title": "Jessie J Sends Ex Channing Tatum a Sweet Birthday Message: 'So Grateful You Were Born' - msnNOW", "description": "Jessie J and Channing Tatum split for a second time earlier this month", "url": "https://people.com/music/jessie-j-channing-tatum-birthday-message-after-split/", "urlToImage": null, "publishedAt": "2020-04-27T04:00:00Z", "content": "Jessie J has nothing but love for her ex Channing Tatum.\r\n© Tommaso Boddi/Getty\r\n Jessie J and Channing Tatum\r\nThe \"Domino\" singer, 32, sent the Magic Mike star several birthday messages on her Instagram Story Sunday, just a few weeks after the pair ended the… [+2348 chars]"}, {"source": {"id": null, "name": "Tvline.com"}, "author": "Charlie Mason", "title": "'Penny Dreadful: City of Angels' Recap: Season 1, Episode 1 — Premiere - TVLine", "description": "It’s in the prologue of Sunday’s premiere of Penny Dreadful: City of Angels that shapeshifting demon Magda (Natalie Dorman) asks what could pass for a rhetorical question: “Are you ready?” Of course we are. From the moment it was announced, we’ve been ready t…", "url": "https://tvline.com/2020/04/26/penny-dreadful-city-of-angels-recap-season-1-episode-1-premiere/", "urlToImage": null, "publishedAt": "2020-04-27T03:53:42Z", "content": "It’s in the prologue of Sunday’s premiere of Penny Dreadful: City of Angels that shapeshifting demon Magda (Natalie Dorman) asks what could pass for a rhetorical question: “Are you ready?” Of course we are. From the moment it was announced, we’ve been ready t… [+10542 chars]"}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Catherine Wright", "title": "Tom Hanks Writes Adorable Letter to Australian Boy Named Corona After the Kid Was Bullied for His Name - Showbiz Cheat Sheet", "description": "For a boy in Australia named Corona, it's getting tough to live through a pandemic. The kid recently wrote a letter to Toy Story actor Tom Hanks.", "url": "https://www.cheatsheet.com/entertainment/tom-hanks-writes-adorable-letter-to-australian-boy-named-corona-after-the-boy-was-bullied.html/", "urlToImage": null, "publishedAt": "2020-04-27T03:33:05Z", "content": "Tom Hanks and Rita Wilson became two of the most famous people to be diagnosed with coronavirus. Luckily, the Hollywood couple appears to have recovered from COVID-19. However, this pandemic affects all of us–in myriad different ways. For a boy in Australia n… [+2726 chars]"}, {"source": {"id": null, "name": "Thenewsopediaindia.co.in"}, "author": "rishixkumar00", "title": "Never Have I Ever review: American Born not so Confused Desi - The Newsopedia", "description": "Written by Ektaa Malik | Published: April 27, 2020 8:26:39 am Never Have I Ever is streaming on Netflix. Never Have I Ever cast: Maitreyi Ramakrishnan, Poorna Jagannathan, Darren", "url": "https://www.thenewsopediaindia.co.in/news/entertainment/never-have-i-ever-review-american-born-not-so-confused-desi/", "urlToImage": null, "publishedAt": "2020-04-27T03:29:04Z", "content": "Written by Ektaa Malik|Published: April 27, 2020 8:26:39 am\r\nNever Have I Ever is streaming on Netflix.\r\nNever Have I Ever cast: Maitreyi Ramakrishnan, Poorna Jagannathan, Darren BarnetNever Have I Ever creators: Mindy Kaling and Lang FisherNever Have I Ever … [+5843 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Bryan Alexander", "title": "Barbra Streisand, Pete Buttigieg, Adam Lambert voice support for GLAAD's 'Together In Pride' - USA TODAY", "description": "Pete Buttigieg and husband Chasten Glezman joined Sharon Stone, Barbra Streisand, Adam Lambert and other stars for GLAAD's \"Together In Pride\" Sunday.", "url": "https://www.usatoday.com/story/entertainment/tv/2020/04/26/together-pride-barbra-streisand-pete-buttigieg-join-glaad-event/3031315001/", "urlToImage": null, "publishedAt": "2020-04-27T03:21:20Z", "content": "One-time Democratic presidential candidate Pete Buttigieg and his husband, Chasten, joined Hollywood stars Barbra Streisand,Sharon Stone, Matthew Bomer and Adam Lambert for the \"Together In Pride: You Are Not Alone\" online fundraiser Sunday.\r\nThe livestreamed… [+2464 chars]"}, {"source": {"id": null, "name": "Yourtango.com"}, "author": "https://www.facebook.com/ariagmitterwriter/", "title": "Today's Mercury In Taurus Love Horoscopes For All Zodiac Signs On Monday, April 27, 2020 - YourTango", "description": "Mercury enters Taurus on Monday!", "url": "https://www.yourtango.com/2020333232/mercury-taurus-horoscopes-free-daily-love-each-zodiac-sign-april-27-2020-according-astrology", "urlToImage": null, "publishedAt": "2020-04-27T03:11:42Z", "content": "Mercury enters Taurus on Monday!\r\nYour daily astrology forecast is here with love horoscopes for you and all zodiac signs for tomorrow on Monday, April 27, 2020.\r\nThe Sun is in the zodiac sign of Taurus until May 19, and the Moon is in Gemini entering Cancer … [+8135 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Lyndsey Parker", "title": "'American Idol from Home' brings 'a little happiness' when we need it most - Yahoo Entertainment", "description": "'Idol' made history, and made America laugh, cheer, and cry, as it became the first major TV talent show to proceed during the coronavirus era.", "url": "https://www.yahoo.com/entertainment/american-idol-from-home-brings-a-little-happiness-when-we-need-it-most-024501782.html", "urlToImage": null, "publishedAt": "2020-04-27T02:54:54Z", "content": "Thank you for making American Idol your choice of entertainment tonight. The world is changing all around us, and we hope that this show is bringing a little happiness this way on your Sunday evening.Thus proclaimed Ryan Seacrest the one American Idol constan… [+15638 chars]"}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Greg Brian", "title": "People Are Rewatching Old MCU Trailers to Cope With Uncertain Times - Showbiz Cheat Sheet", "description": "Rewatching old MCU movie trailers back-to-back has now become a new favorite thing to do and prompting new debates on social media.", "url": "https://www.cheatsheet.com/entertainment/people-are-rewatching-old-mcu-trailers-to-cope-with-uncertain-times.html/", "urlToImage": null, "publishedAt": "2020-04-27T02:31:50Z", "content": "With so many people in a bewildered state due to COVID-19, millions stuck in quarantine turn to their favorite pastimes to feel halfway normal. For MCU fans, it may be hard realizing Phase Four will mostly release in 2021, other than Black Widow in November.\r… [+3675 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Danielle Garrand", "title": "Chris Matthews publicly addresses his \"inappropriate\" behavior for first time since MSNBC exit - CBS News", "description": "\"It's inappropriate in the workplace to compliment somebody on their appearance, this is in the makeup chair, and I did it,\" the former cable news host told Vanity Fair.", "url": "https://www.cbsnews.com/news/chris-matthews-addresses-inappropriate-comments-after-msnbc-exit-2020-04-26/", "urlToImage": null, "publishedAt": "2020-04-27T02:28:08Z", "content": "In March, Chris Matthews abruptly left MSNBC after decades at the network following a column by journalist Laura Bassett, who alleged the host had \"inappropriately flirted\" with her multiple times in the past. Matthews addressed his behavior for the first tim… [+3566 chars]"}, {"source": {"id": null, "name": "Insider.com"}, "author": "Kim Renfro", "title": "15 details you might have missed in the latest episode of 'Westworld' - Insider - INSIDER", "description": "HBO's hit sci-fi drama continued Sunday night with season three, episode seven: \"Passed Pawn.\" As always, Insider is here to explain the best moments.", "url": "https://www.insider.com/westworld-season-3-episode-7-details-analysis-explained-2020-4", "urlToImage": null, "publishedAt": "2020-04-27T02:19:22Z", "content": null}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Dominic Patten", "title": "‘Homeland’ Series Finale: Co-Creator Alex Gansa On The Final Twist, Potential Revival, Claire Danes, Mandy Patinkin & The Story They Never Got To Tell - Deadline", "description": "SPOILER ALERT: This article contains details of tonight’s Homeland series finale.  Hurling a Molotov cocktail in its fiery closing minutes, Homeland came to the end of its eight season run tonight and Showtime’s multiple Emmy winning spy thriller certainly en…", "url": "https://deadline.com/2020/04/homeland-series-finale-spoilers-claire-danes-mandy-patinkin-alex-gansa-interview-terrorism-war-showtime-1202917770/", "urlToImage": null, "publishedAt": "2020-04-27T02:12:35Z", "content": "SPOILER ALERT: This article contains details of tonight’sHomeland series finale. \r\nHurling a Molotov cocktail in its fiery closing minutes, Homeland came to the end of its eight season run tonight and Showtime’s multiple Emmy winning spy thriller certainly en… [+22587 chars]"}, {"source": {"id": null, "name": "Pagesix.com"}, "author": "Sara Nathan", "title": "Stephen Sondheim's 90th birthday special comes down with technical issues - Page Six", "description": "The concert quickly became the top trending Twitter topic of the night as Lin Manuel tweeted: “Hope someone is rolling on the Noises Off production happening right now at #Sondheim90Concert.&…", "url": "https://pagesix.com/2020/04/26/stephen-sondheims-90th-birthday-special-had-technical-issues/", "urlToImage": null, "publishedAt": "2020-04-27T01:52:56Z", "content": "Stars flocked to pay tribute to Stephen Sondheim for his 90th birthday virtual concert Sunday night – but the curtain came down quickly amid a mess of technical hitches.\r\nThe show, which signed up a slew of big names from Meryl Streep to Patti LuPone and Hami… [+1685 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Susan Haas, Bryan Alexander", "title": "Ryan Reynolds' tiny ponytail and other dramatic celebrity quarantine hair transformations - USA TODAY", "description": "Celebrities are letting it their hair go, cutting it off, or coloring it while in quarantine.", "url": "https://www.usatoday.com/story/entertainment/celebrities/2020/04/26/miley-cyrus-bangs-other-drastic-celebrity-quarantine-makeovers/5142958002/", "urlToImage": null, "publishedAt": "2020-04-27T01:32:36Z", "content": "Hugh Jackman and Ryan Reynolds call a truce to donate to the \"All-In-Challenge.\" But Jackman tells USA TODAY that the \"feud\" is far from over.\r\nUSA TODAY\r\nRyan Reynolds with a ponytail? This is happening during the coronavirus pandemic, with celebrities stuck… [+3513 chars]"}, {"source": {"id": "entertainment-weekly", "name": "Entertainment Weekly"}, "author": "Maureen Lee Lenker", "title": "Outlander recap: Season 5, Episode 10 - Entertainment Weekly", "description": "The plot for vengeance against Stephen Bonnet takes a terrible turn.", "url": "https://ew.com/tv/recaps/outlander-season-5-episode-10/", "urlToImage": null, "publishedAt": "2020-04-27T01:12:50Z", "content": "Stephen Bonnet is back in this week's episode of Outlander! And while I don’t favor his evil ways, he’s a sight for sore eyes, considering his antics made for one of the most compelling episodes of the season. It’s a swan song for him, but he at least gets to… [+11948 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "When Calls the Heart Cast Reacts to SHOCKING Season 7 Finale (Exclusive) - Entertainment Tonight", "description": "ET's Deidre Behar spoke with 'When Calls the Heart' stars Erin Krakow, Chris McNally and Kevin McGarry about the shocking season 7 cliffhanger, where viewers...", "url": "https://www.youtube.com/watch?v=tbWxeUvV8Ro", "urlToImage": null, "publishedAt": "2020-04-27T01:09:27Z", "content": null}, {"source": {"id": null, "name": "Tmz.com"}, "author": "TMZ Staff", "title": "Kodak Black Wants to Meet Trump for 'Brilliant' Idea, Offers His Life - TMZ", "description": "Mr. President, meet Kodak Black. He's got something important to tell you.", "url": "https://www.tmz.com/2020/04/26/kodak-black-wants-to-meet-trump-brilliant-idea-kill-me/", "urlToImage": null, "publishedAt": "2020-04-27T00:22:00Z", "content": "Kodak Black says he wants to meet President Trump to pass on some knowledge he feels can be useful -- and if DT ain't into it ... KB says the man can take him out, literally.\r\nThe incarcerated rapper posted a bizarre message on social media Sunday, tagging hi… [+1224 chars]"}, {"source": {"id": null, "name": "Variety.com"}, "author": "Klaritza Rico", "title": "Gene Dynarski, ‘Seinfeld’ and ‘Star Trek’ Actor, Dies at 86 - Variety", "description": "Gene Dynarski, who appeared as Izzy Mandelbaum Jr. on “Seinfeld” and on the original “Star Trek” television series, has died. He was 86. Dynarski died on Feb. 27 at a rehabilitation center in Studio City, his friend, playwright Ernest Kearney announced. The a…", "url": "https://variety.com/2020/tv/obituaries-people-news/gene-dynarski-seinfeld-star-trek-actor-dies-dead-1234589717/", "urlToImage": null, "publishedAt": "2020-04-27T00:21:11Z", "content": "Gene Dynarski, who appeared as Izzy Mandelbaum Jr. on “Seinfeld” and on the original “Star Trek” television series, has died. He was 86.\r\nDynarski died on Feb. 27 at a rehabilitation center in Studio City, his friend, playwright Ernest Kearney announced.\r\nThe… [+2039 chars]"}, {"source": {"id": null, "name": "Dailysoapdish.com"}, "author": "Joanna Mazewski", "title": "CBS ‘The Bold and the Beautiful’ Spoilers: Sally Spectra Won’t Let Anyone Stand In The Way Of Her Dream Life - Daily Soap Dish", "description": "CBS 'The Bold and the Beautiful' (B&B) spoilers indicate that Sally Spectra (Courtney Hope) is willing to do just about anything to stay in the arms of her one true love Wyatt Spencer (Darin Brooks) even though he probably doesn’t feel the same a", "url": "https://dailysoapdish.com/2020/04/cbs-the-bold-and-the-beautiful-spoilers-sally-spectra-wont-let-anyone-stand-in-the-way-of-her-dream-life/", "urlToImage": null, "publishedAt": "2020-04-27T00:12:15Z", "content": "CBS ‘The Bold and the Beautiful’ (B&amp;B) spoilers indicate that Sally Spectra (Courtney Hope) is willing to do just about anything to stay in the arms of her one true love Wyatt Spencer (Darin Brooks) even though he probably doesnt feel the same about her. … [+1998 chars]"}, {"source": {"id": null, "name": "Dailysoapdish.com"}, "author": "Mistydawn Travieso", "title": "TLC ’90 Day Fiancé’ Spoilers: What Happened To Usman Umar On Before the 90 Days? - Daily Soap Dish", "description": "TLC '90 Day Fiancé' Spoilers: Before the 90 Days finds that with a global pandemic on our hands, it has been tough for many of the couples on 90 Day Fiancé. One of the couples from 90 Day Fiancé: Before the 90 Days, Lisa Hamme and Usman Umar are deal", "url": "https://dailysoapdish.com/2020/04/tlc-90-day-fiance-spoilers-what-happened-to-usman-umar-on-before-the-90-days/", "urlToImage": null, "publishedAt": "2020-04-27T00:12:05Z", "content": "TLC ’90 Day Fiancé’ Spoilers: Before the 90 Days finds that with a global pandemic on our hands, it has been tough for many of the couples on 90 Day Fiancé. One of the couples from 90 Day Fiancé: Before the 90 Days, Lisa Hamme and Usman Umar are dealing with … [+2383 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Nate Day", "title": "Adam Sandler, Pete Davidson team for quarantine song during remote 'SNL' special - Fox News", "description": "Adam Sandler and Pete Davidson are expressing themselves through song.", "url": "https://www.foxnews.com/entertainment/adam-sandler-pete-davidson-quarantine-song-snl", "urlToImage": null, "publishedAt": "2020-04-26T23:51:15Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox.  Sign up here.\r\nAdam Sandler and Pete Davidson are expressing themselves through song, with the help of another '90s comic.\r\nThe two appeared in the latest at-home episode of \"Satu… [+2158 chars]"}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Aramide Tinubu", "title": "There's Only a 'Small' Chance Prince Harry Will Be Happy in LA, Royal Expert Claims - Showbiz Cheat Sheet", "description": "Prince Harry and Meghan Markle have been spending family time since they arrived in LA. But there's only a small chance the duke will be happy.", "url": "https://www.cheatsheet.com/entertainment/royal-expert-small-chance-prince-harry-happy-los-angeles.html/", "urlToImage": null, "publishedAt": "2020-04-26T23:30:29Z", "content": "When Prince Harry and Meghan, Duchess of Sussex announced Megxit in January 2020, they had a very clear and well-thought-out idea of what they wanted from their lives. At the time, the duke spoke very clearly about why he ultimately made the choice to step aw… [+5896 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Eddie Makuch", "title": "Avengers: Endgame Is The Most Profitable Movie In History - GameSpot", "description": "And Robert Downey Jr. is reportedly walking away with $55 million for his role as Iron Man.", "url": "https://www.gamespot.com/articles/avengers-endgame-is-the-most-profitable-movie-in-h/1100-6476509/", "urlToImage": null, "publishedAt": "2020-04-26T23:24:00Z", "content": "Avengers: Endgame is the most commercially successful movie of all time, with $2.79 billion at the global box office. The movie was extremely expensive to produce, as well, but the epic comic book film made enough money to become the most profitable film in h… [+1661 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Kristin Cavallari & Jay Cutler Divorcing After 10 Years Together - E! News", "description": "The \"Very Cavallari\" star shares the sad news that she & husband Jay have come to \"a loving conclusion to get a divorce.\" Get all the details on what went wr...", "url": "https://www.youtube.com/watch?v=DSZE5afGoKo", "urlToImage": null, "publishedAt": "2020-04-26T23:21:17Z", "content": "The \"Very Cavallari\" star shares the sad news that she &amp; husband Jay have come to \"a loving conclusion to get a divorce.\" Get all the details on what went wrong.\r\n#KristinCavalleri#ENews#CelebrityNews#JayCutler\r\nSubscribe: http://bit.ly/enewssub\r\nAbout E!… [+737 chars]"}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Abeni Tinubu", "title": "Kylie Jenner Fans Think Her Sisters and Friends Were Jealous of Jordyn Woods - Showbiz Cheat Sheet", "description": "With Tristan Thompson being welcomed back into the KarJenner fold, fans are once again directing their attention to Jordyn Woods, Kylie Jenner's former", "url": "https://www.cheatsheet.com/entertainment/kylie-jenner-sisters-jealous-jordyn-woods.html/", "urlToImage": null, "publishedAt": "2020-04-26T22:07:52Z", "content": "With Tristan Thompson being welcomed back into the KarJenner fold, fans are once again directing their attention to Jordyn Woods, Kylie Jenner’s former best friend. The pair were inseparable for years and Woods even lived with the billionaire in her Hidden Hi… [+3005 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Penelope Green", "title": "Betsy Wyeth, Andrew Wyeth’s Widow and Collaborator, Dies at 98 - The New York Times", "description": "She was just 17 when she met her future husband. She went on to guide his career and became an avid preservationist of vernacular architecture.", "url": "https://www.nytimes.com/2020/04/26/arts/betsy-wyeth-dead.html", "urlToImage": null, "publishedAt": "2020-04-26T22:06:58Z", "content": "Betsy James Wyeth, the indomitable widow, collaborator and muse of the painter Andrew Wyeth, died on April 21 at her home in Chadds Ford, Pa. She was 98.\r\nShe had been in declining health for years, her son Jamie Wyeth said in confirming the death.\r\nThe coupl… [+7912 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Watch Brad Pitt Portray Dr. Anthony Fauci on 'SNL' | NowThis - NowThis News", "description": "Watch Brad Pitt transform into Dr. Anthony Fauci for the second remote segment of ‘SNL’ 👀 » Subscribe to NowThis: http://go.nowth.is/News_Subscribe » Sign up...", "url": "https://www.youtube.com/watch?v=oiWA4s-4i-A", "urlToImage": null, "publishedAt": "2020-04-26T22:00:16Z", "content": "Watch Brad Pitt transform into Dr. Anthony Fauci for the second remote segment of SNL » Subscribe to NowThis: http://go.nowth.is/News_Subscribe» Sign up for our newsletter KnowThis to get the biggest stories of the day delivered straight to your inbox: https:… [+1314 chars]"}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Trey Mangum", "title": "'RuPaul's Secret Celebrity Drag Race': What Is Jordan Connor Most Known For? - Showbiz Cheat Sheet", "description": "A winner was crowned Friday night on the first installment of RuPaul's Celebrity Drag Race. Among the contestants was actor Jordan Connor, recognizable from one of the biggest teen drama series out right now.", "url": "https://www.cheatsheet.com/entertainment/rupauls-secret-celebrity-drag-race-what-is-jordan-connor-most-known-for.html/", "urlToImage": null, "publishedAt": "2020-04-26T21:08:34Z", "content": "A winner was crowned Friday night on the first installment of RuPaul’s Secret Celebrity Drag Race. Among the contestants was actor Jordan Connor, recognizable from one of the biggest teen drama series out right now. \r\nJordan Connor | Andrew Chin/Getty Images\r… [+2221 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Katherine Schwarzenegger Pratt Is PREGNANT! - Entertainment Tonight", "description": "Katherine Schwarzenegger and her hubby Chris Pratt are expecting their first child together.", "url": "https://www.youtube.com/watch?v=CUFR8ycaZA0", "urlToImage": null, "publishedAt": "2020-04-26T21:00:03Z", "content": null}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Nate Day", "title": "Kristen Bell records Dax Shepard performing surgery on himself during coronavirus pandemic - Fox News", "description": "Self-isolating has people turning to their own devices for everything -- even surgery.", "url": "https://www.foxnews.com/entertainment/kristen-bell-dax-shepard-performing-surgery-himself-coronavirus", "urlToImage": null, "publishedAt": "2020-04-26T20:51:34Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox.  Sign up here.\r\nSelf-isolating has people turning to their own devices for everything -- even surgery.\r\nAfter recently injuring his arm, Dax Shepard chose to remove pins from his h… [+1209 chars]"}, {"source": {"id": null, "name": "Hollywoodlife.com"}, "author": "Ryan Shea", "title": "Salma Hayek, 53, Looks Half Her Age While Posing Makeup-Free In Bed — Pic - HollywoodLife", "description": "Salma Hayek once again left her fans in a state of shock when she posted an absolutely gorgeous photo of herself in bed!", "url": "https://hollywoodlife.com/2020/04/26/salma-hayek-makeup-free-bed-pic/", "urlToImage": null, "publishedAt": "2020-04-26T20:43:03Z", "content": "Salma Hayek once again left her fans in a state of shock when she posted an absolutely gorgeous photo of herself in bed!\r\nSalma Hayek, 53, is proof that beauty has no age. The Oscar nominated actress continues to stun with every picture she takes and every mo… [+1804 chars]"}, {"source": {"id": null, "name": "Thenewsstar.com"}, "author": "Greg Hilburn", "title": "Drive-by shooters spray Duck Dynasty star Willie Robertson's estate with bullets - The News Star", "description": "One bullet lodged in the bedroom wall of son John Luke Robertson's and his wife Mary Kate McEachern's home.", "url": "https://www.thenewsstar.com/story/news/2020/04/26/drive-by-shooters-spray-duck-dynasty-star-willie-robertsons-estate-eoyj-bullets/3030079001/", "urlToImage": null, "publishedAt": "2020-04-26T20:00:02Z", "content": "The \"Duck Dynasty\" stars lives and careers are featured in a new interactive museum at the Duck Commander headquarters in West Monroe called Duck Commander The Tour.\r\n\"Duck Dynasty\" star Willie Robertson said his family was the victim of a drive-by shooting F… [+2546 chars]"}, {"source": {"id": "buzzfeed", "name": "Buzzfeed"}, "author": "[{\"@type\":\"Person\",\"name\":\"Natasha Jokic\",\"url\":\"https://www.buzzfeed.com/natashajokic1\",\"jobTitle\":\"BuzzFeed Staff\"}]", "title": "Demi Lovato Opened Up About Being \"Miserable\" During \"Sonny With A Chance\" - BuzzFeed", "description": "\"I felt like I was being overworked.\"", "url": "https://www.buzzfeed.com/natashajokic1/demi-lovato-sonny-with-a-chance-reunion", "urlToImage": null, "publishedAt": "2020-04-26T19:46:00Z", "content": "\"I felt like I was being overworked.\""}, {"source": {"id": null, "name": "Sportskeeda.com"}, "author": "Matty Paddock", "title": "WWE Rumors - Young Superstar being touted as future main event star by Vince McMahon - Sportskeeda", "description": "One youngster has been making a huge impression on McMahon and other staff!", "url": "https://www.sportskeeda.com/wwe/wwe-rumors-young-superstar-being-touted-as-future-main-event-star-by-vince-mcmahon", "urlToImage": null, "publishedAt": "2020-04-26T19:39:24Z", "content": "Vince McMahon has been impressed with this youngster\r\nSecond-generation wrestler Cal Bloom is reportedly being lined up for a major future at the top of WWE, according to reports.\r\nBloom, the youngster who recently faced Sheamus on Friday Night SmackDown, is … [+1465 chars]"}, {"source": {"id": null, "name": "Avclub.com"}, "author": "Sam Barsanti", "title": "Congratulations to Kanye West, America's newest and pettiest billionaire - The A.V. Club", "description": "It's very important to Kanye West that everyone knows that he has a lot of money.", "url": "https://news.avclub.com/congratulations-to-kanye-west-americas-newest-and-pett-1843089313", "urlToImage": null, "publishedAt": "2020-04-26T19:35:00Z", "content": "Its Sunday, the day reserved for paying attention to Kanye West, and today theres a big reason why were paying attention to him or, to be more accurate, theres a billion reasons why were paying attention to him: According to a Forbes profile, Kanye West is of… [+2428 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "John Wick Squares Off Against Hemsworth's Rake in Extraction Fan Art - Screen Rant", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiUGh0dHBzOi8vc2NyZWVucmFudC5jb20vam9obi13aWNrLWtlYW51LXJlZXZlcy1jaHJpcy1oZW1zd29ydGgtZXh0cmFjdGlvbi1mYW5hcnQv0gFUaHR0cHM6Ly9zY3JlZW5yYW50LmNvbS9qb2huLXdpY2sta2VhbnUtcmVldmVzLWNocmlzLWhlbXN3b3J0aC1leHRyYWN0aW9uLWZhbmFydC9hbXAv?oc=5", "urlToImage": null, "publishedAt": "2020-04-26T19:24:11Z", "content": null}, {"source": {"id": null, "name": "Today.com"}, "author": "Francesca Gariano", "title": "Michael Bublé's son Noah, 6, appears on Instagram after cancer diagnosis - TODAY", "description": "Michael Bublé's 6-year-old son, Noah, surprised his parents and their fans when he appeared on Instagram Live. In 2016, Noah was diagnosed with liver cancer.", "url": "https://www.today.com/parents/michael-bubl-s-son-noah-6-appears-instagram-after-cancer-t179944", "urlToImage": null, "publishedAt": "2020-04-26T18:44:42Z", "content": "Michael Bublé and wife Luisana Lopilato had a surprising, special guest during their latest Instagram Live stream: their 6-year-old son, Noah. In 2016, Noah was diagnosed with liver cancer at 3 years old. Fortunately, he's since gone into remission.\r\nOn Frida… [+2309 chars]"}, {"source": {"id": null, "name": "Vulture.com"}, "author": "Devon Ivie", "title": "SNL Promotes Kate McKinnon’s Cat to Featured Player - Vulture", "description": "He has the range.", "url": "https://www.vulture.com/2020/04/snl-kate-mckinnon-and-her-cat-star-in-whiskers-r-we-watch.html", "urlToImage": null, "publishedAt": "2020-04-26T18:39:12Z", "content": "The longing for cute and cuddly pet adoptions has never been higher thanks to our perpetual self-quarantine era, and what perfect timing is this: Whiskers R We owner Barbara DeDrew (Kate McKinnon), denied her small-business loan, has to make a commercial from… [+467 chars]"}, {"source": {"id": null, "name": "Jambase.com"}, "author": "Nate Todd", "title": "Post Malone Performs Nirvana Tribute - JamBase", "description": "Post Malone conducted a Nirvana livestream tribute on Friday benefitting The United Nations Foundation’s COVID-19 Solidarity Response Fund for The World Health Organization.", "url": "https://www.jambase.com/article/post-malone-nirvana-tribute", "urlToImage": null, "publishedAt": "2020-04-26T18:21:09Z", "content": "Post Malone delivered a Nirvana tribute livestream set on Friday. Post performed from home with virtual contributions from drummer Travis Barker of Blink-182, bassist Brian Lee and guitarist Nick Mac.\r\nPost Malone opened up the tribute set benefitting The Uni… [+1717 chars]"}, {"source": {"id": null, "name": "Thewrap.com"}, "author": null, "title": "'The Price Is Right' Announcer George Gray 'in Good Spirits' After 3 Heart Attacks - msnNOW", "description": "George Gray, the announcer for \"The Price Is Right,\" is currently recovering in the hospital after suffering three massive heart attacks, but according to his publicist, he is \"in good spirits.\" Gray was first hospitalized in Arizona last week after suffering…", "url": "https://www.thewrap.com/the-price-is-right-announcer-george-gray-in-good-spirits-after-3-heart-attacks/", "urlToImage": null, "publishedAt": "2020-04-26T18:02:00Z", "content": "George Gray, the announcer for \"The Price Is Right,\" is currently recovering in the hospital after suffering three massive heart attacks, but according to his publicist, he is \"in good spirits.\"\r\n© TheWrap\r\n George Gray The Price Is Right\r\nGray was first hosp… [+1079 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Minyvonne Burke", "title": "Dad, 32, writes heart-wrenching note to wife, kids before dying of coronavirus - Yahoo News", "description": "\"I love you guys with all my heart and you’ve given me the best life I could have ever asked for,\" Jonathan Coelho wrote.", "url": "https://news.yahoo.com/dad-32-writes-heart-wrenching-205417242.html", "urlToImage": null, "publishedAt": "2020-04-26T17:50:20Z", "content": "A Connecticut father who was battling the coronavirus wrote a letter to his wife and children telling them how much he loved them and how lucky he was to have them in his life.\r\nJonathan Coelho, 32, wrote the note the day before doctors at a hospital in Danbu… [+3272 chars]"}, {"source": {"id": "entertainment-weekly", "name": "Entertainment Weekly"}, "author": "Rosy Cordero", "title": "Dave Chappelle helps raise over $100k for struggling comics during coronavirus pandemic - Entertainment Weekly", "description": "Dave Chappelle was a surprise guest at The Comedy Store live fundraiser event that raised over $100k for struggling comic during the coronavirus pandemic.", "url": "https://ew.com/tv/dave-chappelle-comedy-store-fundrasier-coronavirus/", "urlToImage": null, "publishedAt": "2020-04-26T17:50:08Z", "content": "The Comedy Store may be closed during the coronavirus pandemic, but they haven't forgotten the talent who've graced their stage who are now struggling to make ends meet.\r\nThe famous Los Angeles stand-up comedy venue hosted a live three-part podcast benefit on… [+1216 chars]"}, {"source": {"id": null, "name": "Cinemablend.com"}, "author": "Mack Rawden", "title": "When Will Disney World Reopen? One Analyst Is Really Pessimistic - CinemaBlend", "description": "No one is exactly sure at this point when Disney World might reopen its doors to the general public, but one prediction from a major financial analyst is pretty bleak.", "url": "https://www.cinemablend.com/news/2495138/when-will-disney-world-reopen-one-analyst-is-really-pessimistic", "urlToImage": null, "publishedAt": "2020-04-26T17:48:33Z", "content": "No one is exactly sure at this point when Disney World might reopen its doors to the general public, but one prediction from a major financial analyst is pretty bleak. John Hodulik, a managing director at UBS, a leading financial firm, published a paper this … [+3975 chars]"}, {"source": {"id": null, "name": "Thenews.com.pk"}, "author": "Web  Desk", "title": "Chernobyl Diaries actor Dimitri Diatchenko dies at 52 - The News International", "description": "'Chernobyl Diaries' actor Dimitri Diatchenko dies at 52", "url": "https://www.thenews.com.pk/latest/650194-chernobyl-diaries-actor-dimitri-diatchenko-dies-at-52", "urlToImage": null, "publishedAt": "2020-04-26T17:16:25Z", "content": "Police in Florida found actor   Dimitri Diatchenko dead in his house, according to reports.\r\nThe \"Sons of Anarchy\" actor was 52.\r\nCNN reported that police found him unresponsive and keeling with his face down in a reclining chair in his living room on Wednesd… [+490 chars]"}, {"source": {"id": null, "name": "Dailywire.com"}, "author": "Joseph Curl", "title": "Mick Jagger Tells Paul McCartney The Rolling Stones Are Better Than The Beatles: One Band 'Still Playing Stadiums, The Other Band Doesn't Exist' - The Daily Wire", "description": "It’s the eternal debate: Who’s better, The Rolling Stones or The Beatles? Paul McCartney, 77, says it’s clearly The Beatles. In an interview with Howard Stern on his Sirius-XM radio show last week, McCartney said “I love the Stones but The Beatles were better…", "url": "https://www.dailywire.com/news/mick-jagger-tells-paul-mccartney-the-rolling-stones-are-better-than-the-beatles-one-band-still-playing-stadiums-the-other-band-doesnt-exist", "urlToImage": null, "publishedAt": "2020-04-26T16:48:00Z", "content": "Its the eternal debate: Whos better, The Rolling Stones or The Beatles?\r\nPaul McCartney, 77, says its clearly The Beatles.\r\nIn an interview with Howard Stern on his Sirius-XM radio show last week, McCartney said I love the Stones but The Beatles were better.\r… [+2692 chars]"}, {"source": {"id": null, "name": "Wrestlingnews.co"}, "author": "Andrew Ravens", "title": "Joe Exotic thought ROH wrestlers were spies for Carol Baskin - Wrestling News", "description": "Since the premiere of “Tiger King: Murder, Mayhem and Madness” on Netflix, the series has taken the internet by storm with various memes. It turns out that Joe Exotic, the star of the documentary, had some loose ties with pro wrestling as a few ROH wrestlers …", "url": "https://wrestlingnews.co/roh-news/joe-exotic-thought-roh-wrestlers-were-spies-for-carol-baskin/", "urlToImage": null, "publishedAt": "2020-04-26T15:50:30Z", "content": "Since the premiere of Tiger King: Murder, Mayhem and Madness on Netflix, the series has taken the internet by storm with various memes.\r\nIt turns out that Joe Exotic, the star of the documentary, had some loose ties with pro wrestling as a few ROH wrestlers t… [+1644 chars]"}, {"source": {"id": null, "name": "Vulture.com"}, "author": "Matthew Love", "title": "Saturday Night Live Recap: At-Home Improvement - Vulture", "description": "SNL is proving that the At-Home experiment can work, with a little extra polish and strong cameos from Brad Pitt, Paul Rudd, and Adam Sandler.", "url": "http://www.vulture.com/2020/04/snl-at-home-recap-season-45-episode-17.html", "urlToImage": null, "publishedAt": "2020-04-26T15:42:10Z", "content": "The first Saturday Night Live at Home which aired a couple of weeks ago, or maybe a few years ago, or possibly yesterday illustrated the good and bad of shows created in quarantine. The Zoom sketches made clear the limitations of the app, and pre-recorded vid… [+11054 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Reservoir Dogs' Mr. Blonde Cuts Off Family's Ears While In Quarantine - Screen Rant", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiUGh0dHBzOi8vc2NyZWVucmFudC5jb20vcmVzZXJ2b2lyLWRvZ3MtbXItYmxvbmRlLW1pY2hhZWwtbWFkc2VuLXF1YXJhbnRpbmUtdmlkZW8v0gFUaHR0cHM6Ly9zY3JlZW5yYW50LmNvbS9yZXNlcnZvaXItZG9ncy1tci1ibG9uZGUtbWljaGFlbC1tYWRzZW4tcXVhcmFudGluZS12aWRlby9hbXAv?oc=5", "urlToImage": null, "publishedAt": "2020-04-26T15:30:54Z", "content": null}, {"source": {"id": "cnbc", "name": "CNBC"}, "author": "Cory Stieg", "title": "Disney has free animation classes online—and drawing can help you relax and focus during the pandemic - CNBC", "description": "Disney has free drawing classes on YouTube that teach you how to doodle your favorite characters, right from the pros. Studies suggest it could help with stress, sadness and concentration amid Covid-19.", "url": "https://www.cnbc.com/2020/04/26/free-disney-animation-courses-on-youtube-can-relieve-covid-19-stress.html", "urlToImage": null, "publishedAt": "2020-04-26T15:11:19Z", "content": "From baking to puzzles, the Covid-19 quarantine might have you turning to hobbies that you never had time for before.\r\nIf you're looking for a calming weekend art project, Disney has free drawing classes on YouTube.\r\nYou can learn how to draw some of the most… [+1891 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Charlie Puth Plays Selena Gomez's 'Boyfriend' | Capital - Capital FM", "description": "What better way to learn the piano than being taught by the musical genius that is Charlie Puth? Host of Capital Breakfast Roman Kemp got the chance of a 1-2...", "url": "https://www.youtube.com/watch?v=5FqC_7RJebY", "urlToImage": null, "publishedAt": "2020-04-26T14:38:06Z", "content": null}, {"source": {"id": null, "name": "Pitchfork.com"}, "author": "Evan Minsker", "title": "Watch Bad Bunny Try to Sell You Sweatpants on SNL - Pitchfork", "description": "The episode also featured a collaborative Adam Sandler and Pete Davidson music video", "url": "https://pitchfork.com/news/watch-bad-bunny-try-to-sell-you-sweatpants-on-snl/", "urlToImage": null, "publishedAt": "2020-04-26T14:11:32Z", "content": "This weeks Saturday Night Live featured a sketch called Big Papi Cooking Show, wherein Kenan Thompson offers a cooking tutorial (sort of) as former Boston Red Sox player David Ortiz. During the sketch, Thompson introduced Big Bunny, which of course was Bad Bu… [+594 chars]"}, {"source": {"id": null, "name": "Pagesix.com"}, "author": "Jackie Salo", "title": "Meghan Markle, Prince Harry reportedly give interview for tell-all book - Page Six", "description": "The couple quit the royal family in January.", "url": "https://pagesix.com/2020/04/26/meghan-markle-prince-harry-reportedly-give-interview-for-tell-all-book/", "urlToImage": null, "publishedAt": "2020-04-26T14:03:56Z", "content": "Meghan Markle and Prince Harry are giving their side of a story in a new tell-all book about their explosive time as royals, according to a report.\r\nThe Duke and Duchess of Sussex have given an interview for a biography titled “Thoroughly Modern Royals: The R… [+687 chars]"}, {"source": {"id": null, "name": "Nme.com"}, "author": null, "title": "‘Spider-Man’ star Tom Holland is hosting a Marvel-themed charity pub quiz - NME Live", "description": "It comes in aid of The Brothers Trust, set up by Holland's family", "url": "https://www.nme.com/news/film/spider-man-star-tom-holland-is-hosting-a-marvel-themed-charity-pub-quiz-2654025", "urlToImage": null, "publishedAt": "2020-04-26T13:55:20Z", "content": "Spider-Man star Tom Holland is set to host a Marvel-themed charity pub quiz next week.\r\nOn Wednesday night (April 29) at 8pm BST, Holland will quiz fans on all things MCU in aid of his family’s Brothers Trust.\r\nHolland announced details of the quiz when appea… [+1019 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Too Hot to Handle: Matthew Explains Why Leaving The Show Early Helped Some of The Guys (Exclusi… - Entertainment Tonight", "description": "ET chatted with 'Too Hot to Handle' cast member Matthew Smith about why he decided to leave the show early. Exclusives from #ETonline : https://www.youtube.c...", "url": "https://www.youtube.com/watch?v=p5R3NbncxoQ", "urlToImage": null, "publishedAt": "2020-04-26T13:00:25Z", "content": "ET chatted with 'Too Hot to Handle' cast member Matthew Smith about why he decided to leave the show early.\r\nExclusives from #ETonline :https://www.youtube.com/playlist?list..."}, {"source": {"id": null, "name": "Avclub.com"}, "author": "Danette Chavez", "title": "Cory Finley on Bad Education, capitalism, and Hugh Jackman’s walk of shame - The A.V. Club", "description": "\"Directing a story where you want to place an emphasis on the words puts the onus on the director to find intentional ways to frame each scene so that it’s not just sort of a long series of conversations that are shot in exactly the same way.\"", "url": "https://tv.avclub.com/cory-finley-on-bad-education-capitalism-and-hugh-jack-1843031267", "urlToImage": null, "publishedAt": "2020-04-26T13:00:00Z", "content": "With dark humor and one of Hugh Jackmans finest onscreen performances, HBOs Bad Education puts the lie to Horace Manns declaration that education is the great equalizer. The film, which premiered at the Toronto International Film Festival last year, is based … [+13318 chars]"}, {"source": {"id": null, "name": "Ultimateclassicrock.com"}, "author": "martinkielty", "title": "Watch Miley Cyrus Cover Pink Floyd's 'Wish You Were Here' - Ultimate Classic Rock", "description": "Miley Cyrus covered Pink Floyd's WIsh You Were Here while the Killers covered Tom Petty in April 2020.", "url": "https://ultimateclassicrock.com/miley-cyrus-pink-floyd-wish-you-were-here/", "urlToImage": null, "publishedAt": "2020-04-26T12:53:00Z", "content": "Miley Cyrus appeared on Saturday Night Live to perform a cover of Pink Floyd classic Wish You Were Here.\r\nThe pop singer, whos crossed over into rock music several times in recent years, delivered the 1975 song from a campfire setting at home, as coronavirus … [+1427 chars]"}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Suse Forrest", "title": "Why Amy Poehler Is Making Her Kids Binge 'Parks and Recreation' - Showbiz Cheat Sheet", "description": "Find out why actress Amy Poehler is making her children binge-watch her NBC hit sitcom 'Parks and Rec.' Find out why actress Amy Poehler is making her children binge-watch her NBC hit sitcom 'Parks and Rec.'", "url": "https://www.cheatsheet.com/entertainment/why-amy-poehler-is-making-her-kids-binge-parks-and-recreation.html/", "urlToImage": null, "publishedAt": "2020-04-26T11:41:08Z", "content": "Many parents are finding the COVID-19 lockdown very difficult. Not only are they having to try and keep their kids entertained all day while making sure that they stay indoors, but they are also having to perform a new role as their children’s teacher as scho… [+4343 chars]"}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Eryn Murphy", "title": "How to Watch SuperM's 'Beyond LIVE' Online Concert - Showbiz Cheat Sheet", "description": "On April 26, SuperM will kick off the new 'Beyond Live' virtual concert series. Here's how to watch their performance.", "url": "https://www.cheatsheet.com/entertainment/how-to-watch-superm-beyond-live-online-concert-kpop-sm-entertainment.html/", "urlToImage": null, "publishedAt": "2020-04-26T05:12:00Z", "content": "For fans who want the chance to see SuperM, WayV, NCT Dream, and NCT 127 in concert, the wait is almost over. SM Entertainment has partnered with Naver and will be broadcasting the groups’ live concert performances to start the live concert streaming service … [+2679 chars]"}, {"source": {"id": null, "name": "Hiphopdx.com"}, "author": "Kyle Eustice", "title": "Lil Uzi Vert Claims He Fought Playboi Carti To Squash 'Beef' - HipHopDX", "description": "Lil Uzi Vert once again set his sights on former collaborator Playboi Carti earlier this month, calling Carti's new \"Meh\" single \"just meh\"", "url": "https://hiphopdx.com/news/id.55602/title.lil-uzi-vert-claims-he-fought-playboi-carti-to-squash-beef", "urlToImage": null, "publishedAt": "2020-04-26T02:30:00Z", "content": "Lil Uzi Vert once again set his sights on former collaborator Playboi Carti last week, calling Carti’s new “Meh” single “just meh” and promising to drop new music on the same day Carti did. Their fans couldn’t quite figure out what was going on between the tw… [+1020 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Jayme Deerwester", "title": "Live Nation updates COVID-19 policy, automatically issuing refunds for canceled shows - USA TODAY", "description": "Effective May 1, Live Nation customers will automatically receive a refund if the event they bought tickets for is canceled due to coronavirus.", "url": "https://www.usatoday.com/story/entertainment/music/2020/04/25/live-nation-customers-get-automatic-refunds-canceled-shows/3028772001/", "urlToImage": null, "publishedAt": "2020-04-26T02:17:50Z", "content": "Country star Eric Church says he doesnt know when concerts might resume, but he wants people to feel safe when they do. (April 24)\r\nAP Entertainment\r\nIt's official: Live Nation customers will now automatically receive a refund if the concert or show they boug… [+3402 chars]"}, {"source": {"id": null, "name": "Nypost.com"}, "author": "Dean Balsamini", "title": "Rolling Stones top charts with 'Living in a Ghost Town' - New York Post ", "description": "On Thursday, the band released  “Living in a Ghost Town,” with an accompanying video, and the track jumped to the top of the iTunes’ song chart. It was the band’s first No. 1 hit in 40 y…", "url": "https://nypost.com/2020/04/25/rolling-stones-top-charts-with-living-in-a-ghost-town/", "urlToImage": null, "publishedAt": "2020-04-25T23:07:51Z", "content": "The legendary Rolling Stones got some satisfaction with a new chart-topping song, their first No. 1 hit on iTunes.\r\nOn Thursday, the band released  Living in a Ghost Town, with an accompanying video, and the track jumped to the top of the iTunes song chart, b… [+656 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "James Crowley", "title": "Country Music Community Mourns Loss of Statler Brothers Singer Harold Reid - Newsweek", "description": "Reid, 80, was a founding member of the Statler Brothers, who often performed with country icon Johnny Cash.", "url": "https://www.newsweek.com/rip-harold-reid-statler-brothers-member-1500241", "urlToImage": null, "publishedAt": "2020-04-25T21:19:50Z", "content": "Statler Brothers baritone Harold Reid died on Friday at 80 years old.\r\nReid struggled with a battle with kidney failure and died in his Staunton, Virginia home, according to his bandmate Jimmy Fortune as reported by Rolling Stone.\r\nReid was a founding member … [+3928 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alaa Elassar, CNN", "title": "Best moments from CNN and Sesame Street's coronavirus town hall for kids and parents - CNN", "description": "CNN partnered with Sesame Street for a special town hall about coronavirus to give kids the opportunity to learn more about the pandemic and ask questions.", "url": "https://www.cnn.com/2020/04/25/us/cnn-sesame-street-town-hall-coronavirus-trnd/index.html", "urlToImage": null, "publishedAt": "2020-04-25T18:44:46Z", "content": "By Alaa Elassar, CNN\r\nUpdated 2:35 PM ET, Sat April 25, 2020\r\nChat with us in Facebook Messenger. Find out what's happening in the world as it unfolds.\r\n(CNN)CNN partnered with Sesame Street for a special town hall about coronavirus to give kids the opportuni… [+5839 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Rasha Ali", "title": "Jeff Goldblum criticized for 'dangerous and hurtful' comments on Islam during 'RuPaul's Drag Race' - USA TODAY", "description": "Jeff Goldblum came under fire on social media for his questions about Islam during an episode of \"RuPaul's Drag Race.\"", "url": "https://www.usatoday.com/story/entertainment/celebrities/2020/04/25/jeff-goldblum-criticized-twitter-dangerous-comments-islam/3025998001/", "urlToImage": null, "publishedAt": "2020-04-25T18:19:50Z", "content": "Jeff Goldblum shares the inside scoop on his new show from National Geographic 'The World According to Jeff Goldblum' set to premiere on Disney+.\r\nUSA TODAY\r\nJeff Goldblum became a  topic of discussion on social media for his questions about Islam's treatment… [+4911 chars]"}, {"source": {"id": null, "name": "Mirror.co.uk"}, "author": "Anna MacSwan", "title": "Queen's life in lockdown with just a dozen staff and her budgies, but no horse rides - Mirror Online", "description": "The 94-year-old Queen is reportedly keeping in touch with family through video messenger and avidly watching the news as she and Prince Phillip spend lockdown at Windsor Castle", "url": "https://www.mirror.co.uk/news/uk-news/queens-life-lockdown-just-dozen-21924664", "urlToImage": null, "publishedAt": "2020-04-25T16:34:30Z", "content": "The Queen is reportedly being looked after by just a dozen staff and has been keeping in touch with family through video calls during lockdown.\r\n The 94-year-old monarch has been isolating with husband Prince Phillip, 98, at Windsor Castle amid the coronaviru… [+2811 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Paul Tassi", "title": "‘Fortnite’ Players Think This Travis Scott Clue May Lead To The Return Of The Old Map - Forbes", "description": "Is the old Fortnite Chapter 1 map coming back?", "url": "https://www.forbes.com/sites/paultassi/2020/04/25/fortnite-players-think-this-travis-scott-clue-may-lead-to-the-return-of-the-old-map/", "urlToImage": null, "publishedAt": "2020-04-25T15:19:15Z", "content": "Fortnite\r\nEpic/Lucas7Yoshi\r\nThe final two Travis Scott shows are today in Fortnite, and while theyre must-see events because of how damn cool they are, some Fortnite fans are starting to get excited about what they view as an easter egg that they believe coul… [+2544 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Brie Bella Defends Nikki's Close Bond With Birdie | Total Bellas Bonus Scene | E! - E! Entertainment", "description": "The \"Total Bellas\" star discusses her sister's bond with her daughter Birdie, after hearing her brother JJ wants Nikki and Vivienne to have the same bond. Wa...", "url": "https://www.youtube.com/watch?v=jKzw9Cfuakg", "urlToImage": null, "publishedAt": "2020-04-25T14:59:56Z", "content": "The \"Total Bellas\" star discusses her sister's bond with her daughter Birdie, after hearing her brother JJ wants Nikki and Vivienne to have the same bond. Watch!\r\n#TotalBellas#EEntertainment#BellaTwins#BrieBella#NikkiBella#BirdieJoeDanielson\r\nSUBSCRIBE: http:… [+1371 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "6 Ways Doctor Strange 2 Could Be A Game-Changer For The MCU - CBR", "description": "Multiverse of Madness Could Change the MCU Forever SUBSCRIBE NOW to CBR! Click here: http://bit.ly/Subscribe-to-CBR We all know that the Infinity Saga was a ...", "url": "https://www.youtube.com/watch?v=_f0Jc21vK5Q", "urlToImage": null, "publishedAt": "2020-04-25T13:45:00Z", "content": "Multiverse of Madness Could Change the MCU ForeverSUBSCRIBE NOW to CBR! Click here: http://bit.ly/Subscribe-to-CBR\r\nWe all know that the Infinity Saga was a major game changer for the Marvel Cinematic Universe, but lets not forget about Phase Fours Doctor Str… [+1433 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "James Crowley", "title": "Broadway Star Nick Cordero Receives Temporary Pacemaker, Says His Wife - Newsweek", "description": "Cordero's wife, Amanda Kloots, shared an updated with fans on Friday and also said that the Broadway actor had tested negative in two COVID-19 tests.", "url": "https://www.newsweek.com/nick-cordero-temporary-pacemaker-broadway-star-1500209", "urlToImage": null, "publishedAt": "2020-04-25T13:40:44Z", "content": "Actor Nick Cordero, whose leg was recently amputated due to coronavirus complications, has received a temporary pacemaker after doctors noticed an irregular heartbeat.\r\nCordero's wife, former Broadway dancer and celebrity trainer Amanda Kloots, spoke about th… [+2337 chars]"}]}