{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Yourtango.com"}, "author": "https://www.facebook.com/ariagmitterwriter/", "title": "Today's Love Horoscopes + Tarot Card Readings For All Zodiac Signs On Saturday, April 25, 2020 - YourTango", "description": "Today's free love horoscopes and tarot card readings for all zodiac signs in astrology offer predictions based on numerology Life Path Number 6, with the Sun in Taurus and Moon in Taurus entering Gemini on Saturday, April 25, 2020.", "url": "https://www.yourtango.com/2020333143/horoscopes-free-daily-love-tarot-card-readings-each-zodiac-sign-april-25-2020-according-astrology", "urlToImage": null, "publishedAt": "2020-04-25T11:52:21Z", "content": "Today's love horoscopes and tarot card readings are here for all zodiac signs in astrology on Saturday, April 25, 2020.\r\nThe Sun and the Moon are in Taurus. The waxing crescent Moon leaves Taurus to enter Gemini at 3:19 a.m., EST.\r\nWhat do today's love horosc… [+7416 chars]"}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Lauren Anderson", "title": "American Idol': How Producers Are Going to Pull Off Live Shows This Season - Showbiz Cheat Sheet", "description": "The coronavirus (COVID-19) has drastically changed how 'American Idol' will handle the live portion of season 3.", "url": "https://www.cheatsheet.com/entertainment/american-idol-how-live-shows-will-work-from-home.html/", "urlToImage": null, "publishedAt": "2020-04-25T11:44:21Z", "content": "American Idol has had quite a season thus far. After a successful round of auditions and a thrilling week in Hollywood, the coronavirus (COVID-19) pandemic threw producers for a loop. The restrictions on social gatherings have forced producers to get creative… [+3243 chars]"}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Mishal Ali Zafar", "title": "Bill Maher Compares 'Tiger King' Joe Exotic to Darth Vader - Showbiz Cheat Sheet", "description": "Bill Maher doesn't understand why the 'woke' left isn't more outraged by 'Tiger King' star Joe Exotic. On his HBO series, the host compared the zookeeper to Darth Vader.", "url": "https://www.cheatsheet.com/entertainment/bill-maher-compares-tiger-king-joe-exotic-to-darth-vader.html/", "urlToImage": null, "publishedAt": "2020-04-25T11:01:55Z", "content": "Ever since Tiger King premiered on Netflix, its become somewhat of a cultural phenomenon. It is centered around Joseph Maldonado-Passage, aka Joe Exotic, an Oklahoma zookeeper who hired a hitman to kill his rival, Carole Baskin. On his HBO talk show, Bill Mah… [+3213 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amy Woodyatt", "title": "Kanye West is finally a billionaire, Forbes says. He sent the magazine a text to say it undervalued him - CNN", "description": "Kanye West has long coveted the title of \"billionaire.\"", "url": "https://www.cnn.com/2020/04/25/celebrities/kanye-west-billionaire-intl-scli/index.html", "urlToImage": null, "publishedAt": "2020-04-25T10:24:56Z", "content": null}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Eduard Varnham", "title": "'KUWTK': Why Don't the Kardashians Post More Recent Photos of Rob? - Showbiz Cheat Sheet", "description": "Fans are confused why the Kardashian-Jenner sisters don't post more pictures of Rob Kardashian. Fans are confused why the Kardashian-Jenner sisters don't post more pictures of Rob Kardashian.", "url": "https://www.cheatsheet.com/entertainment/kuwtk-why-dont-the-kardashians-post-more-recent-photos-of-rob.html/", "urlToImage": null, "publishedAt": "2020-04-25T10:24:15Z", "content": "The Kardashians are famous for being famous, so seeing one of their own family members more or less drop off the public radar has been more than a little disturbing. At one point, Rob Kardashian was a major part of the family’s show and public appearances.\r\nB… [+3487 chars]"}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Stefan Preston", "title": "Prince Harry's LA Life Is a 'Breath of Fresh Air' From Royal Life, Says Source - Showbiz Cheat Sheet", "description": "Find out how Prince Harry's new life in LA is different from his royal life in the United Kingdom. Find out how Prince Harry's new life in LA is different from his royal life in the United Kingdom.", "url": "https://www.cheatsheet.com/entertainment/prince-harrys-l-a-life-is-a-breath-of-fresh-air-from-royal-life-says-source.html/", "urlToImage": null, "publishedAt": "2020-04-25T09:25:51Z", "content": "Prince Harry is now settled in Los Angeles along with his wife, Meghan, Duchess of Sussex, and their young son, Archie Harrison. The former senior royal couple is lying low in the wake of the COVID-19 pandemic, so any major projects that they have in the work… [+6220 chars]"}, {"source": {"id": null, "name": "Digitalspy.com"}, "author": "Chris Edwards", "title": "Jonas Brothers' movie Happiness Continues available to stream now - Digital Spy", "description": "With a Game of Thrones cameo (kind of).", "url": "https://www.digitalspy.com/movies/a32268846/jonas-brothers-new-movie-happiness-continues-stream/", "urlToImage": null, "publishedAt": "2020-04-25T09:07:53Z", "content": "The Jonas Brothers' new movie Happiness Continues: A Jonas Brothers Concert Film has arrived on Amazon Prime.\r\nThe documentary, which became available to stream today (April 24), follow's on from last year's Chasing Happiness and charts the group's rise to fa… [+1550 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Roisin O'Connor", "title": "RuPaul's Drag Race: Jeff Goldblum receives backlash for Islam comments to Jackie Cox - The Independent", "description": "‘As if America hasn’t been anti-gay and anti-woman from the outset, or killed and displaced millions of Muslims, including women and queers,’ one critic retorted", "url": "https://www.independent.co.uk/arts-entertainment/tv/news/jeff-goldblum-islam-rupaul-drag-race-jackie-cox-women-homosexuality-a9483536.html", "urlToImage": null, "publishedAt": "2020-04-25T08:14:31Z", "content": "Jeff Goldblum has found himself the subject of a backlash after asking a contestant on RuPauls Drag Race if Islam is anti-homosexuality and anti-woman.\r\nThe actor and musician appeared as a guest judge on an episode of the shows 12th season, in which the seve… [+29238 chars]"}, {"source": {"id": null, "name": "Tmz.com"}, "author": "TMZ Staff", "title": "Tyler Perry Working On Safe Way to Reopen Atlanta Studios - TMZ", "description": "Tyler Perry isn't jumping to reopen his 330-acre Atlanta studio complex, but we've learned he's working on a really unique, interesting and safe way to shoot TV shows there during the coronavirus pandemic.", "url": "https://www.tmz.com/2020/04/25/tyler-perry-working-on-safe-way-to-reopen-atlanta-studio/", "urlToImage": null, "publishedAt": "2020-04-25T08:00:00Z", "content": "Tyler Perry isn't jumping to reopen his 330-acre Atlanta studio complex, but we've learned he's working on a really unique, interesting and safe way to shoot TV shows there during the coronavirus pandemic.\r\nStudio sources tell TMZ, Tyler has a plan he's curre… [+1604 chars]"}, {"source": {"id": null, "name": "Cheatsheet.com"}, "author": "Connie Liou", "title": "Who Plays Magda on 'Penny Dreadful: City of Angels'? Natalie Dormer Portrays Showtime's Latest Supernatural Antagonist - Showbiz Cheat Sheet", "description": "Who plays Magda, Elsa, Rio, and Alex on 'Penny Dreadful: City of Angels'? Here's Natalie Dormer's latest project after 'Game of Thrones'.", "url": "https://www.cheatsheet.com/entertainment/magda-penny-dreadful-city-of-angels-natalie-dormer-alex-rio-elsa.html/", "urlToImage": null, "publishedAt": "2020-04-25T04:33:27Z", "content": "ThePenny Dreadful spinoff, City of Angels, may not star Eva Green, but the shows cast still packs a powerful punch. The new Showtime original series includes fan-favorites such as Nathan Lane and Alex Rodriguez. But Natalie Dormer — who plays Magda, Elsa, Rio… [+4684 chars]"}, {"source": {"id": null, "name": "Vulture.com"}, "author": "Halle Kiefer", "title": "Andrew Lloyd Webber’s Phantom of the Opera Sequel Love Never Dies Is Here, Inside Your Living Room - Vulture", "description": "It never made Broadway, but hopefully it will make your weekend.", "url": "https://www.vulture.com/2020/04/phantom-of-the-opera-sequel-love-never-dies-free-to-stream.html", "urlToImage": null, "publishedAt": "2020-04-25T02:40:33Z", "content": "In case you were unaware, Andrew Lloyd Webbers smash hit musical The Phantom of the Opera has a sequel. Love Never Dies, set ten years after the events of Phantom and located in 1907 Coney Island, made its West End debut in 2010, where it received, to put it … [+1123 chars]"}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Jon Caramanica", "title": "Fred the Godson, Nimble New York Rapper, Dies at 41 - The New York Times", "description": "The Bronx musician was a forceful presence on mixtapes, filling his rhymes with clever punch lines.", "url": "https://www.nytimes.com/2020/04/24/arts/music/fred-the-godson-dead-coronavirus.html", "urlToImage": null, "publishedAt": "2020-04-25T02:39:03Z", "content": "This obituary is part of a series about people who have died in the coronavirus pandemic. Read about others here.\r\nFred the Godson, who for more than a decade was a respected figure in New York hip-hop, an understated master of wordplay with a signature flow,… [+2831 chars]"}, {"source": {"id": null, "name": "Wrestlingnews.co"}, "author": "Paul Davis", "title": "Vince McMahon made a surprise appearance for Triple H 25th anniversary celebration on WWE SmackDown - Wrestling News", "description": "Vince McMahon made a surprise appearance this week on WWE Friday Night SmackDown as part of the 25th anniversary celebration for Triple H. McMahon joked about some of the “rotten” segments from Triple H’s past and he ended by telling him that he loves him. Mc…", "url": "https://wrestlingnews.co/wwe-news/vince-mcmahon-made-a-surprise-appearance-for-triple-h-25th-anniversary-celebration-on-wwe-smackdown/", "urlToImage": null, "publishedAt": "2020-04-25T02:38:02Z", "content": "Vince McMahon made a surprise appearance this week on WWE Friday Night SmackDown as part of the 25th anniversary celebration for Triple H.\r\nMcMahon joked about some of the “rotten” segments from Triple H’s past and he ended by telling him that he loves him. M… [+934 chars]"}, {"source": {"id": null, "name": "Wesh.com"}, "author": "National Desk Staff", "title": "Disneyland, Disney World may not reopen until 2021, independent financial report says - Smash Newz", "description": "Disney theme parks may stay closed for the rest of this year, according to an analyst.", "url": "https://www.wesh.com/article/disneyland-disney-world-may-not-reopen-until-2021-independent-financial-report-says/32273537", "urlToImage": null, "publishedAt": "2020-04-25T02:14:00Z", "content": "Disney theme parks may stay closed for the rest of this year.\r\nThats the newest advice from financial firm UBS for Disneyland in California and Walt Disney World in Florida.\r\nUBS said it now expects the parks to open Jan. 1 at 50% capacity for the first six m… [+1157 chars]"}, {"source": {"id": null, "name": "Latimes.com"}, "author": "Adam Tschorn", "title": "'Making the Cut' on Amazon: Meet winner Jonny Cota - Los Angeles Times", "description": "Season one's winner talks halo effects, career boosts and 'the most beautiful alien I have ever seen.'", "url": "https://www.latimes.com/entertainment-arts/tv/story/2020-04-24/amazon-making-the-cut-winner-interview", "urlToImage": null, "publishedAt": "2020-04-25T01:43:23Z", "content": "Even if it hadnt debuted just as the global coronavirus pandemic was profoundly reshaping the worlds of entertainment, fashion and retail, Amazons foray into reality television the 10-episode Making the Cut, which concluded its first season Friday was destine… [+9062 chars]"}, {"source": {"id": null, "name": "Vogue.com"}, "author": "Rachel Hahn", "title": "Post Malone Recreated an Iconic Kurt Cobain Look for His Nirvana Tribute Show - Vogue", "description": "Post Malone did a live Nirvana tribute in support of the WHO’s COVID-10 Solidarity Response Fund.", "url": "https://www.vogue.com/article/post-malone-nirvana-tribute-dress-kurt-cobain-style-youtube-covid-fundraiser-who", "urlToImage": null, "publishedAt": "2020-04-25T01:31:57Z", "content": "Post Malone has a certain charm that one might politely call unkempt, but his style doesnt necessarily skew towards grunge in the traditional sense. Posty, as hes affectionately called by his fans, can usually be seen in a variation of the classic Nudie suit,… [+1632 chars]"}, {"source": {"id": null, "name": "Denofgeek.com"}, "author": null, "title": "Netflix’s Extraction: Ending Explained - Den of Geek UK", "description": "Extraction director Sam Hargrave digs into the enigmatic ending of his Chris Hemsworth action thriller.", "url": "https://www.denofgeek.com/movies/netflix-extraction-ending-explained/", "urlToImage": null, "publishedAt": "2020-04-25T01:30:00Z", "content": "That leaves it up to Rake to get Ovi across to his team leader Nik Khan (Golshifteh Farahani), but even as he gets the boy to safety, Rake is first badly wounded by the leader of the military and then given the seemingly fatal shot by a vengeful street youth … [+1415 chars]"}, {"source": {"id": null, "name": "Tmz.com"}, "author": "TMZ Staff", "title": "'Judge Judy' Announcer Jerry Bishop Dead at 84 - TMZ", "description": "\"Judge Judy\" announcer Jerry Bishop is dead at 84.", "url": "https://www.tmz.com/2020/04/24/judge-judy-announcer-jerry-bishop-dead-dies-radio-voice-los-angeles/", "urlToImage": null, "publishedAt": "2020-04-25T01:07:00Z", "content": "Jerry Bishop -- famous for being the announcer on \"Judge Judy\" -- is dead.\r\nJerry died Tuesday of heart disease, according to the show, and Judge Judy says she's gonna miss him.\r\nJudy remembered her longtime announcer in a statement, saying ... \"Jerry Bishop … [+688 chars]"}, {"source": {"id": null, "name": "Cinemablend.com"}, "author": "Laura Hurley", "title": "Blue Bloods Actor Nick Cordero's Wife Says He Should Have Woken From Coma By Now - CinemaBlend", "description": "Amanda Kloots provides an update on her husband's condition.", "url": "https://www.cinemablend.com/television/2495108/blue-bloods-actor-nick-corderos-wife-says-he-should-have-woken-from-coma-by-now", "urlToImage": null, "publishedAt": "2020-04-25T00:23:14Z", "content": "Blue Bloods actor and popular TV guest star Nick Cordero has been fighting for his life after a diagnosis with COVID-19, and his wife Amanda Kloots has been providing regular updates on his condition. Her updates have provided a window into the illness as wel… [+2833 chars]"}, {"source": {"id": null, "name": "Hotnewhiphop.com"}, "author": "Alexander Cole", "title": "Lil Uzi Vert Unveils Name And Cover Art For Song Dropping Tonight - HotNewHipHop", "description": "Lil Uzi Vert has a brand new song dropping at 10 PM tonight.", "url": "https://www.hotnewhiphop.com/lil-uzi-vert-unveils-name-and-cover-art-for-song-dropping-tonight-news.109161.html", "urlToImage": null, "publishedAt": "2020-04-24T23:36:35Z", "content": "Lil Uzi Vert has been on a roll in 2020. He dropped Eternal Atake back in March and just a week later, he dropped a deluxe version which had 14 new tracks. Since then, he has been very active on social media where he interacts with his fans on a plethora of m… [+830 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Demi Lovato BREAKS SILENCE On Selena Gomez Drama! - Clevver News", "description": "More Celebrity News ►► http://bit.ly/SubClevverNews #demilovato #selenagomez #finsta Last week, Demi Lovato’s alleged ‘Finsta’ account that trashed Selena Go...", "url": "https://www.youtube.com/watch?v=OSpAjBo6njE", "urlToImage": null, "publishedAt": "2020-04-24T23:30:00Z", "content": null}, {"source": {"id": null, "name": "Nytimes.com"}, "author": "Joshua Barone", "title": "How the Met Opera Is Throwing a Gala Concert With Smartphones - The New York Times", "description": "Closed by the coronavirus, the company is streaming its biggest stars, performing live across nine time zones.", "url": "https://www.nytimes.com/2020/04/24/arts/music/met-opera-at-home-gala.html", "urlToImage": null, "publishedAt": "2020-04-24T23:29:06Z", "content": "Is this enough light? asked the baritone Peter Mattei.\r\nHe was in the living room of his home outside Stockholm, speaking over Skype with a small group of Metropolitan Opera staff members who were giving him directions to prepare for the companys At-Home Gala… [+7069 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "David Moye", "title": "Tom Hanks Gives Typewriter To Boy Bullied Because His Name Is Corona - HuffPost", "description": "The actor told Corona DeVries, 8, “I thought this typewriter would suit you... Ask a grown-up how it works. And use it to write me back.”", "url": "https://www.huffpost.com/entry/tom-hanks-corona-typewriter-corona-devries_n_5ea35af6c5b669fd8924e00a", "urlToImage": null, "publishedAt": "2020-04-24T23:21:58Z", "content": "An 8-year-old boy named Corona has got a friend in Tom Hanks  as well as a gift stemming from the actors offbeat hobby of collecting typewriters.\r\nIt all started when Corona De Vries of Queensland, Australia, sent a get-well letter after the actor, who he kne… [+1551 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Curtis M. Wong", "title": "Matt Damon Adopts Irish Seaside Town As Lockdown Home Amid Coronavirus Crisis - HuffPost", "description": "Residents of Dalkey, Ireland, are proud of their new resident, who came to town for a movie but opted to stick around as stay-at-home restrictions took hold.", "url": "https://www.huffpost.com/entry/matt-damon-ireland-lockdown_n_5ea3145cc5b6f96398143c36", "urlToImage": null, "publishedAt": "2020-04-24T23:16:26Z", "content": "Matt Damon has established a new home away from home during the coronavirus pandemic.\r\nIn March, the “Good Will Hunting” star touched down in Dalkey, Ireland, where he was slated to shoot scenes for Ridley Scott’s “The Last Duel.” Filming was quickly halted, … [+1605 chars]"}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Marina Fang", "title": "The Largest US Movie Theater Chain Won't Reopen Even If States Say It Can - HuffPost", "description": "Some states are allowing theaters to resume operations, even though public health experts advise against it. But there aren't even any new movies to show.", "url": "https://www.huffpost.com/entry/amc-movie-theaters-reopening_n_5ea334d5c5b6d376358f3f7d", "urlToImage": null, "publishedAt": "2020-04-24T23:04:41Z", "content": "Although states are slowly starting to allow movie theaters to resume operations against the recommendations of public health experts, AMC Theatres, the largest movie theater chain in the U.S., won’t reopen its locations until at least this summer.\r\n“As we pl… [+2804 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Corinne Reichert", "title": "Disney reshuffles Marvel movie release dates out to 2022 - CNET", "description": "Doctor Strange and Thor have been moved, while Into the Spider-Verse has also been delayed by Sony.", "url": "https://www.cnet.com/news/disney-reshuffles-marvel-movie-release-dates-out-to-2022/", "urlToImage": null, "publishedAt": "2020-04-24T23:02:30Z", "content": "Disney\r\nWalt Disney Studios has moved around a few more release dates following the delay of movies amid COVID-19 lockdowns and quarantines, including two Marvel Cinematic Universe movies. The Doctor Strange sequel has been pushed from 2021 to 2022, Disney sa… [+849 chars]"}, {"source": {"id": "entertainment-weekly", "name": "Entertainment Weekly"}, "author": "Tyler Aquilina", "title": "'Seinfeld,' 'Star Trek' actor Gene Dynarski dies at 86 - The-Latest News", "description": "Character actor Gene Dynarski, who also appeared on 'Batman' and in Steven Spielberg's 'Duel' and 'Close Encounters of the Third Kind,' among other projects, had died at 86.", "url": "https://ew.com/tv/gene-dynarski-dead-seinfeld-star-trek-actor-obit/", "urlToImage": null, "publishedAt": "2020-04-24T22:49:15Z", "content": "Gene Dynarski, a character actor known for his roles on Seinfeld and in Steven Spielberg's Close Encounters of the Third Kind, has died. He was 86.\r\nDynarski died Feb. 27 in a rehabilitation center in Studio City, Calif., according to The Hollywood Reporter, … [+1431 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Julia Alexander", "title": "Sony delays Spider-Man films, forcing Marvel to move Doctor Strange and Thor sequels again - The Verge", "description": "Spider-Man: Into the Spider-Verse and the third movie in the Spider-Man: Homecoming trilogy are getting delayed as Sony messes with its release schedule. As a result, Doctor Strange into the Multiverse and Thor: Love and Thunder have been delayed for a second…", "url": "https://www.theverge.com/2020/4/24/21235283/spider-man-spiderverse-homecoming-delay-release-date-trilogy-marvel-venom-doctor-strange-thor", "urlToImage": null, "publishedAt": "2020-04-24T22:45:42Z", "content": "But Uncharted gets an early release date\r\nPhoto: Sony Pictures Entertainment\r\nLike almost every other studio, Sony is moving around its film schedule because of the novel coronavirus. That means its two biggest Spider-Man movies will be delayed. \r\nThe sequel … [+1662 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By George Stark For Dailymail.com", "title": "Will & Grace stars Debra Messing and Megan Mullally's rumored feud gets addressed - Daily Mail", "description": "Will & Grace creators David Kohan and Max Mutchnick have added fuel to the rumours the co-stars Debra Messing and Meghan Mullally have harbored a secret feud with each other.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8255239/Will-Grace-stars-Debra-Messing-Megan-Mullallys-rumored-feud-gets-addressed.html", "urlToImage": null, "publishedAt": "2020-04-24T22:32:15Z", "content": "Will &amp; Grace creators David Kohan and Max Mutchnick have added fuel to the rumours the co-stars Debra Messing, 51, and Megan Mullally, 61, have harbored a secret feud with each other.\r\nKohan and Mutchnick were asked about the alleged clash in a recent Q&a… [+2240 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "How the Latest Clone Wars Broke Fans' Hearts! (Nerdist News w/ Dan Casey) - Nerdist", "description": "Could this week's heartbreaking episode of The Clone Wars be one of the series best? Dan takes a closer look in today's episode of Nerdist News! What's your ...", "url": "https://www.youtube.com/watch?v=CmU8SWLI97k", "urlToImage": null, "publishedAt": "2020-04-24T22:31:09Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lisa Respers France, CNN", "title": "Alicia Keys debuts powerful anthem in partnership with CNN - CNN", "description": "If you find yourself in tears watching the visual for Alicia Keys' new song, know that the singer had the same reaction the first time she saw it.", "url": "https://www.cnn.com/2020/04/23/entertainment/alicia-keys-cnn-song/index.html", "urlToImage": null, "publishedAt": "2020-04-24T22:05:48Z", "content": null}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Carly Mallenbaum", "title": "Nickelodeon's Kids' Choice Awards goes remote; Disney World presents virtual fireworks - USA TODAY", "description": "The Kids' Choice Awards will now a \"virtually produced,\" star-studded show on May 2. Need kid-friendly programming while you wait: Disney's fireworks.", "url": "https://www.usatoday.com/story/entertainment/tv/2020/04/24/kids-choice-awards-ariana-grande-rock-bts-appear-virtually/3023296001/", "urlToImage": null, "publishedAt": "2020-04-24T21:58:23Z", "content": "Comedians, actors, and musicians use their extra free time during coronavirus isolation to give back to fans and support charities.\r\nUSA TODAY\r\nThe Kids' Choice Awards show will go on, and the slime will flow in a \"virtually produced\" show.\r\nOriginally schedu… [+1739 chars]"}, {"source": {"id": null, "name": "Salon.com"}, "author": "Melanie McFarland", "title": "In taut legal drama \"Defending Jacob,\" Chris Evans shows up as the daddy America needs - Salon", "description": "The latest Apple TV+ family drama is a crisply tailored crime and courtroom mystery. It's also an Evans showcase", "url": "https://www.salon.com/2020/04/24/in-taut-legal-drama-defending-jacob-chris-evans-shows-up-as-the-daddy-america-needs/", "urlToImage": null, "publishedAt": "2020-04-24T21:52:17Z", "content": "\"Any man can be a father, but it takes a hot, middle-aged guy with a big job to be a daddy.\" A wise man once said that. Wait — no, my bad, it was Matt Damon. That doesn't make it any less true. The difference between a father and a daddy is significant and mi… [+6609 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Luke Hawker", "title": "Kate and William honour Anzac Day and share resources to celebrate ‘in spirit’ - Express", "description": "KATE, the Duchess of Cambridge and Prince William have paid tribute all the fallen Australian and New Zealand military personnel who lost their life during conflicts around the world for Anzac Day", "url": "https://www.express.co.uk/news/royal/1273651/kate-middleton-news-latest-prince-william-anzac-day-celebrations-australia-new-zealand", "urlToImage": null, "publishedAt": "2020-04-24T21:48:07Z", "content": null}, {"source": {"id": null, "name": "Vulture.com"}, "author": "Chris Murphy", "title": "Billy Kimmel’s Third Birthday Party Won Late Night This Week - Vulture", "description": "With surprise guest Spider-Man.", "url": "http://www.vulture.com/2020/04/this-week-in-late-night-billy-kimmel-birthday-tom-holland.html", "urlToImage": null, "publishedAt": "2020-04-24T21:32:46Z", "content": "Whats new, pussycats? Well, the president of the United States of America has suggested that people start injecting disinfectants, and I just started a 1,500-piece puzzle, which seems equally as futile and somehow twice as dangerous. As for late-night televis… [+5681 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Li Cohen", "title": "The \"Parks and Recreation\" cast is reuniting for a special coronavirus episode - CBS News", "description": "Put away The Cones of Dunshire and light your flames for Lil Sebastian — Leslie Knope, Ron Swanson, Ann Perkins, and the rest of Pawnee's crew are coming together to raise money for U.S. food banks.", "url": "https://www.cbsnews.com/news/parks-and-recreation-coronavirus-episode/", "urlToImage": null, "publishedAt": "2020-04-24T21:24:32Z", "content": "Not even a pandemic can keep Leslie Knope from trying to save the world. The cast of NBC's \"Parks and Recreation\" is reuniting for a single episode next Thursday to raise money for Feeding America's COVID-19 Response Fund, according to a press release from NB… [+2008 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Tasha Robinson", "title": "Bad Education review: new HBO movie gives Hugh Jackman a chance to squirm - Polygon", "description": "Hugh Jackman and Allison Janney star in HBO’s true crime drama Bad Education, about a Long Island student who uncovers a massive embezzlement scandal in her school district. The best new movie to watch this week at home is on HBO GO and HBO NOW right now.", "url": "https://www.polygon.com/2020/4/24/21234625/bad-education-review-hbo-hugh-jackman-allison-janney-based-on-a-true-story", "urlToImage": null, "publishedAt": "2020-04-24T21:01:56Z", "content": "The inciting incident in Cory Finleys sharp, entertaining HBO drama Bad Education may strike some viewers as far too on-the-nose. When student journalist Rachel (Miracle Workers Geraldine Viswanathan) drops by the office of Long Island school superintendent F… [+6079 chars]"}, {"source": {"id": null, "name": "Blabbermouth.net"}, "author": "Blabbermouth", "title": "This Year's Louder Than Life Festival Is Officially Canceled - BLABBERMOUTH.NET", "description": "This year's Louder Than Life festival, which was scheduled to take place in September in Louisville, Kentucky, has been officially canceled due to the COVID-19 pandemic.\n\n\"Even though the festivals...", "url": "https://www.blabbermouth.net/news/this-years-louder-than-life-festival-is-officially-canceled/", "urlToImage": null, "publishedAt": "2020-04-24T20:56:39Z", "content": "This year's Louder Than Life festival, which was scheduled to take place in September in Louisville, Kentucky, has been officially canceled due to the COVID-19 pandemic.\r\n\"Even though the festivals are not until September, the advanced planning realities of p… [+2702 chars]"}, {"source": {"id": null, "name": "Timesofisrael.com"}, "author": null, "title": "Taylor Swift calls out Soros family's 'shameless greed' in beef with record co. - The Times of Israel", "description": "Pop superstar draws criticism as white supremacists seen associating her post with widespread anti-Semitic conspiracy theories about Soros", "url": "https://www.timesofisrael.com/taylor-swift-calls-out-soros-familys-shameless-greed-in-beef-with-record-co/", "urlToImage": null, "publishedAt": "2020-04-24T20:55:57Z", "content": "JTA — Taylor Swift is drawing criticism and apparent applause among her neo-Nazi fan base for calling out the Soros family in an Instagram post. Its the latest salvo in the pop superstars ongoing battle with her former record label.\r\nThe family long has been … [+2957 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Prince William Won't Watch 'Tiger King' - ET Canada", "description": "After Prince William said why he won't watch \"Tiger King\", Sangita Patel and Graeme O'Neil react to his family paying tribute to frontline workers during \"ET...", "url": "https://www.youtube.com/watch?v=9lsadkoCXYA", "urlToImage": null, "publishedAt": "2020-04-24T20:52:38Z", "content": "After Prince William said why he won't watch \"Tiger King\", Sangita Patel and Graeme O'Neil react to his family paying tribute to frontline workers during \"ET Canada Live\".\r\nSUBSCRIBE to our channel:\r\nhttps://www.youtube.com/user/ETCanada...\r\nFOLLOW us here:\r\n… [+181 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Brian Flood", "title": "Andy Cohen says blood is 'boiling' because he can't donate plasma as a gay man: 'My blood could save a life' - Fox News", "description": "Bravo’s Andy Cohen, who recently recovered from coronavirus, said his blood  “could save a life but instead it’s over here boiling” because rules prevent him from donating plasma as a gay man.", "url": "https://www.foxnews.com/entertainment/andy-cohen-blood-boiling-cant-donate-plasma", "urlToImage": null, "publishedAt": "2020-04-24T20:45:13Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox.  Sign up here.\r\nBravo’s Andy Cohen, who recently recovered from coronavirus, said his “blood could save a life but instead it’s over here boiling” because rules prevent him from do… [+1802 chars]"}, {"source": {"id": null, "name": "Vulture.com"}, "author": "Justin Curto", "title": "Which Moment in This New Kids on the Block Video Will Break You? - Vulture", "description": "Put this in the quarantine museum.", "url": "https://www.vulture.com/2020/04/new-kids-on-the-block-house-party-video.html", "urlToImage": null, "publishedAt": "2020-04-24T20:16:45Z", "content": "As it was prophesied, the coronavirus has ushered in a new era of art, albeit marked by tone-deaf celebrity videos along with bathtubs, basements, and broken records. Add this video to the museum too. New Kids on the Block brought together their friends Boyz … [+1455 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Louis Casiano", "title": "Eminem sends 'Mom’s Spaghetti' pasta to Detroit health care workers on coronavirus frontline - Fox News", "description": "Health care workers in Detriot \"lost themselves\" in spaghetti courtesy of rapper Eminem, who sent the pasta to those battling the coronavirus on the front lines.", "url": "https://www.foxnews.com/entertainment/eminem-sends-pasta-detroit-health-care-workers-coronavirus-frontline", "urlToImage": null, "publishedAt": "2020-04-24T20:16:31Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox. Sign up here.\r\nHealth care workers in Detriot \"lost themselves\" in spaghetti courtesy of rapperEminem, who sent the pasta to those battling the coronavirus on the front lines.\r\nThe… [+1088 chars]"}, {"source": {"id": null, "name": "Wesh.com"}, "author": null, "title": "Universal Orlando to auto-enroll workers in Florida’s unemployment system - WESH 2 Orlando", "description": "Universal Orlando said Friday that it will auto-enroll its furloughed workers into Florida’s unemployment system.", "url": "https://www.wesh.com/article/universal-orlando-auto-enroll-unemployment/32270929", "urlToImage": null, "publishedAt": "2020-04-24T19:34:07Z", "content": "ORLANDO, Fla. —Universal Orlando said Friday that it will auto-enroll its furloughed workers into Floridas unemployment system. \r\nThe company is furloughing part-time hourly workers beginning on May 3. \r\nBy working with the state to auto-enroll the furloughed… [+579 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Gary Dinges", "title": "Billy Porter speaks 'truth to power' in cover of Buffalo Springfield's 'For What It's Worth' - USA TODAY", "description": "A frequent critic of President Donald Trump, Porter says he was inspired by artists who recorded songs during times of conflict in U.S. history.", "url": "https://www.usatoday.com/story/entertainment/music/2020/04/24/billy-porter-covers-stephen-stills-classic-for-what-its-worth/5155035002/", "urlToImage": null, "publishedAt": "2020-04-24T19:32:25Z", "content": "Music producers battle with the Verzuz series as fans party along \r\nAP Entertainment\r\nBilly Porter is channeling the past by bringing you a message from the future.\r\nThe singer, actor and Broadway performer has covered Stephen Stills beloved Buffalo Springfie… [+2809 chars]"}, {"source": {"id": null, "name": "Billboard.com"}, "author": "Gil Kaufman", "title": "Here's What Mick Jagger Has to Say to Paul McCartney's Beatles-vs.-Stones Thoughts - Billboard", "description": "", "url": "https://www.billboard.com/articles/columns/rock/9365433/mick-jagger-interview-living-in-a-ghost-town-origin-beatles-vs-rolling-stones", "urlToImage": null, "publishedAt": "2020-04-24T18:44:05Z", "content": "Sometimes you accidentally write a song that perfectly fits the moment. That's basically what Mick Jagger told Apple Music's Zane Lowe on Friday morning (April 24), in a chat that included the origin story of the eerily prescient new Rolling Stones single \"Li… [+3640 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chloe Melas, CNN", "title": "Richard Gere and his wife welcome baby boy - CNN", "description": "Richard Gere and his wife, Alejandra Silva, have welcomed their second son, a rep for the actor confirms to CNN.", "url": "https://www.cnn.com/2020/04/24/entertainment/richard-gere-baby-boy-trnd/index.html", "urlToImage": null, "publishedAt": "2020-04-24T18:14:54Z", "content": "(CNN)Richard Gere and his wife, Alejandra Silva, have welcomed their second son, a rep for the actor confirms to CNN.\r\nGere, 70 and Silva, 37, already have 14-month-old Alexander. Gere also has a 20-year-old son from a previous marriage. Silva has a son with … [+419 chars]"}, {"source": {"id": null, "name": "Harpersbazaar.com"}, "author": "Amy Mackelden", "title": "Gigi Hadid Adorably Spent Her 25th Birthday with Bella & Yolanda in Quarantine - HarpersBAZAAR.com", "description": "Even Taylor Swift and Joe Alwyn got in on the birthday action.", "url": "https://www.harpersbazaar.com/celebrity/latest/a32268606/gigi-hadid-birthday-quarantine-bella-photos/", "urlToImage": null, "publishedAt": "2020-04-24T18:06:00Z", "content": "<ul><li>Gigi Hadid celebrated her 25th birthday while social distancing during the coronavirus pandemic.</li><li>Bella Hadid posted photos of her sister's birthday celebrations on her Instagram Stories.</li><li>Yolanda Hadid shared a gorgeous mother-daughter … [+1355 chars]"}, {"source": {"id": null, "name": "Rollingstone.com"}, "author": "Charles Holmes", "title": "I’ve Never Played Fortnite, But Was Forced to Attend Travis Scott’s Fortnite Concert - Rolling Stone", "description": "One intrepid writer attempted to understand the wildly popular battle royale game and hear a new Travis Scott song. It didn't go well.", "url": "https://www.rollingstone.com/music/music-features/travis-scott-fortnite-concert-989209/", "urlToImage": null, "publishedAt": "2020-04-24T17:59:14Z", "content": "On Monday, Travis Scott ruined my life. That was the day the rapper announced he would be holding a concert in Fortnite, the wildly popular battle royale game, and my editor informed me that I would be covering it. My response was immediate.\r\n“Not going to li… [+5545 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Carly Mallenbaum", "title": "Ellen Pompeo explains her old Harvey Weinstein comments that have come under fire - USA TODAY", "description": "Ellen Pompeo took to Twitter to clarify controversial comments she made in a 2018 panel about Harvey Weinstein and victims of sexual harassment.", "url": "https://www.usatoday.com/story/entertainment/celebrities/2020/04/23/ellen-pompeo-clarifies-controversial-harvey-weinstein-comments/3015938001/", "urlToImage": null, "publishedAt": "2020-04-24T17:27:59Z", "content": "Formerly powerful movie mogul Harvey Weinstein was indicted in May 2018 and charged with five sex crimes. He was found guilty on two charges.\r\nUSA TODAY\r\nEllen Pompeo is taking to Twitter to clarify Harvey Weinstein comments she made a couple of years ago.\r\nT… [+4853 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Anthony D'Alessandro", "title": "‘Don’t Worry Darling’: Florence Pugh, Shia LaBeouf & Chris Pine Set For Olivia Wilde New Line Thriller - Deadline", "description": "Little Women Oscar nominee Florence Pugh, Shia LaBeouf and Chris Pine are set to star in Olivia Wilde’s genre feature Don’t Worry Darling at New Line. Deadline first broke the news about the auction for Wilde’s highly anticipated follow-up directorial after l…", "url": "https://deadline.com/2020/04/dont-worry-darling-florence-pugh-shia-labeouf-chris-pine-star-in-olivia-wilde-movie-1202917171/", "urlToImage": null, "publishedAt": "2020-04-24T17:08:41Z", "content": "Little Women Oscar nominee Florence Pugh, Shia LaBeouf and Chris Pine are set to star in Olivia Wilde’s genre feature Don’t Worry Darling at New Line.\r\nDeadline first broke the news about the auction for Wilde’s highly anticipated follow-up directorial after … [+2249 chars]"}, {"source": {"id": null, "name": "Nme.com"}, "author": null, "title": "Captain Moore beats The Weeknd to Number One with ‘You’ll Never Walk Alone’ - NME Live", "description": "Captain Tom Moore has scored his first Number One single on the Official UK Singles Chart, after The Weeknd urged fans to back the 99-year-old.", "url": "https://www.nme.com/news/music/captain-moore-beats-the-weeknd-number-one-youll-never-walk-alone-2653411", "urlToImage": null, "publishedAt": "2020-04-24T17:04:57Z", "content": "Captain Tom Moore has scored his first Number One single on the Official UK Singles Chart this week (April 24), after The Weeknd urged fans to back the war vet.\r\nThe Canadian stars Blinding Lights was Number One last week and looked set to overtake the 99-yea… [+2013 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "90 Day Fiance: Big Ed NEEDS Answers From Rose Before He Commits - Entertainment Tonight", "description": "Big Ed and Rose discuss their future over a romantic dinner in this exclusive clip from '90 Day Fiance: Before the 90 Days,' airing Sunday on TLC. Exclusives...", "url": "https://www.youtube.com/watch?v=NmB6RGE8jpk", "urlToImage": null, "publishedAt": "2020-04-24T17:00:13Z", "content": "Big Ed and Rose discuss their future over a romantic dinner in this exclusive clip from '90 Day Fiance: Before the 90 Days,' airing Sunday on TLC.\r\nExclusives from #ETonline :https://www.youtube.com/playlist?list..."}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Martina Bet", "title": "Royal outrage: How US President shocked the Queen Mother with kiss on the lips - Express", "description": "THE QUEEN MOTHER was left in shock when former US President Jimmy Carter greeted her with a kiss on the lips in 1977, unearthed reports reveal.", "url": "https://www.express.co.uk/news/royal/1273552/royal-news-queen-mother-us-president-jimmy-carter-kiss-spt", "urlToImage": null, "publishedAt": "2020-04-24T16:33:22Z", "content": null}, {"source": {"id": null, "name": "Huffpost.com"}, "author": "Ron Dicker", "title": "Kaley Cuoco Is Binge-Watching Sitcom Couple She Was Told To Avoid - HuffPost", "description": "\"The Big Bang Theory\" alum is catching up on her TV during the coronavirus pandemic.", "url": "https://www.huffpost.com/entry/kaley-cuoco-cheers-conan_n_5ea2f8e3c5b6f9639813bfba", "urlToImage": null, "publishedAt": "2020-04-24T16:31:23Z", "content": "Kaley Cuoco is now binge-watching the sitcom couple she and her costar, Johnny Galecki, were told not to emulate on “The Big Bang Theory.”\r\nThat would be Sam and Diane, the dumb jock and the snooty intellectual brilliantly played by Ted Danson and Shelley Lon… [+886 chars]"}, {"source": {"id": null, "name": "Sltrib.com"}, "author": "https://www.facebook.com/SeanPMeansCricket", "title": "Redwood Drive-In's reopening will wait, after Salt Lake County Health Department steps in - Salt Lake Tribune", "description": "The Redwood Drive-In’s plans to open this weekend are on hold, after the Salt Lake County Health Department reminded the management that opening a movie theater would violate a public health order.", "url": "https://www.sltrib.com/artsliving/2020/04/24/redwood-drive-in-reopen/", "urlToImage": null, "publishedAt": "2020-04-24T14:35:39Z", "content": "The Redwood Drive-Ins plans to open this weekend are on hold, after the Salt Lake County Health Department reminded the management that opening a movie theater would violate a public health order.\r\n The Salt Lake County Health Department posted a warning on t… [+3653 chars]"}, {"source": {"id": null, "name": "Deadline.com"}, "author": "Dino-Ray Ramos", "title": "Western Thriller ‘True History Of Kelly Gang’ And ’60s Coming-Of-Age Drama ‘To The Stars’ Make Debuts – Specialty Streaming Preview - Deadline", "description": "The story of the notorious outlaw Ned Kelly is dropping on digital and on-demand today with the Justin Kurzel-directed True History of the Kelly Gang starring George MacKay (1917, Captain Fantastic), Russell Crowe (Boy Erased, The Loudest Voice) and Nicholas …", "url": "https://deadline.com/2020/04/true-history-of-kelly-gang-russell-crowe-justin-kurzel-to-the-stars-martha-stephens-specialty-streaming-preview-1202916073/", "urlToImage": null, "publishedAt": "2020-04-24T14:28:13Z", "content": "The story of the notorious outlaw Ned Kelly is dropping on digital and on-demand today with the Justin Kurzel-directed True History of the Kelly Gang starring George MacKay (1917, Captain Fantastic), Russell Crowe (Boy Erased, The Loudest Voice) and Nicholas … [+5477 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Brian Lowry, CNN", "title": "'Avengers: Endgame' premiered a year ago. A whole lot has changed since then - CNN", "description": "The Marvel blockbuster premiered one year ago, on April 26, 2019, although just imagining people crowding into theaters, it surely feels a whole lot longer. The movie went on to amass $2.8 billion worldwide, surpassing the benchmark set by \"Avatar.\"", "url": "https://www.cnn.com/2020/04/24/entertainment/avengers-endgame-one-year-later/index.html", "urlToImage": null, "publishedAt": "2020-04-24T13:55:01Z", "content": "(CNN)With what felt like a snap, \"Avengers: Endgame\" shattered opening-weekend box-office records, earning $357 million in North America -- roughly $100 million more than its predecessor. The movie went on to amass $2.8 billion worldwide, surpassing the bench… [+3766 chars]"}, {"source": {"id": null, "name": "Pagesix.com"}, "author": "Eileen Reslen", "title": "Alex Rodriguez suggests 'drive-through wedding' with Jennifer Lopez - Page Six", "description": "Love don’t cost a thing.", "url": "https://pagesix.com/2020/04/24/alex-rodriguez-suggests-drive-through-wedding-with-jennifer-lopez/", "urlToImage": null, "publishedAt": "2020-04-24T13:47:40Z", "content": "Love don’t have to cost a thing.\r\nAlex Rodriguez has confirmed that his wedding to Jennifer Lopez which was supposed to take place this summer has been postponed due to the coronavirus pandemic, but says he is now open to “cheaper” and socially-distanced alte… [+972 chars]"}, {"source": {"id": null, "name": "Theringer.com"}, "author": "Rob Harvilla", "title": "‘Beastie Boys Story’ Revels in the Blurriness of the Trio’s Mythology - The Ringer", "description": "Directed by Spike Jonze, the Apple TV+ documentary wades through the past as Mike D and Ad-Rock look on with smiles, but also through their fingers", "url": "https://www.theringer.com/music/2020/4/24/21234309/beastie-boys-story-apple-tv-plus-documentary-review", "urlToImage": null, "publishedAt": "2020-04-24T13:42:10Z", "content": "Adam Horovitz, a.k.a. Ad-Rock, a.k.a. one-third of the beloved NYC rap trio Beastie Boys, is back where he belongs: onstage, performing the groups classic song Girls. Yes! Girls! Everyone loves Girls! You know Girls, off their smash debut LP, 1986s License to… [+8977 chars]"}, {"source": {"id": null, "name": "Newser.com"}, "author": "Arden Dier", "title": "Former Right-Hand Man: Wintour Gave Me 'Scars' - Newser", "description": "Andre Leon Talley tells of 'huge emotional and psychological scars' in new book", "url": "https://www.newser.com/story/290013/former-right-hand-man-wintour-gave-me-scars.html", "urlToImage": null, "publishedAt": "2020-04-24T13:25:00Z", "content": "(Newser)\r\nIt was the 2003 novel The Devil Wears Prada, written by a former assistant of Anna Wintour, that cast the Vogue editor-in-chief as a nightmare. Almost two decades later, a new book from her former right-hand man reportedly confirms some of the narra… [+1228 chars]"}, {"source": {"id": null, "name": "Wthr.com"}, "author": "TEGNA", "title": "Everything coming and leaving Netflix in May 2020 - WTHR", "description": "May features the debut of Steve Carrell's newest workplace comedy, the return of 'The Unbreakable Kimmy Schmidt,' and several new binge-worthy Netflix shows.", "url": "https://www.wthr.com/article/everything-coming-and-leaving-netflix-may-2020", "urlToImage": null, "publishedAt": "2020-04-24T13:09:38Z", "content": "LOS GATOS, Calif. Netflix has released its list of new shows and movies coming to the streaming site in May, which is perfect timing for those stands who are extending coronavirus stay-at-home orders. The May list includes several brand new comedy specials, d… [+5243 chars]"}, {"source": {"id": null, "name": "Xxlmag.com"}, "author": "xxlstaff", "title": "New Juice Wrld and J. Cole Song on the Way? - XXLMAG.COM", "description": "Watch here.", "url": "https://www.xxlmag.com/news/2020/04/juice-wrld-j-cole-song/", "urlToImage": null, "publishedAt": "2020-04-24T12:59:00Z", "content": "Last night marked two important moments in Juice Wrld's posthumous career: the release of an official posthumous single and the possibility that a Juice and J. Cole collaboration exists.\r\nJuice's estate premiered the Nick Mira and Charlie Handsome-produced tr… [+1601 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Guillermo & Russell Wilson Prep Joe Burrow for NFL Draft - Sponsored by Bose - Jimmy Kimmel Live", "description": "If you watched the NFL Draft on ABC, you know it was a big night for NFL hopeful Joe Burrow. Getting drafted from home is a tricky thing though, so to prep f...", "url": "https://www.youtube.com/watch?v=qr_TDbXsjPM", "urlToImage": null, "publishedAt": "2020-04-24T05:30:31Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Disney Gallery: Star Wars The Mandalorian - Official Trailer (Jon Favreau, Taika Waititi) - IGN", "description": "In Disney Gallery: The Mandalorian, Executive Producer Jon Favreau invites the cast and crew to share an unprecedented look at the making of the series which...", "url": "https://www.youtube.com/watch?v=f_miMhjdvvs", "urlToImage": null, "publishedAt": "2020-04-23T20:30:02Z", "content": "In Disney Gallery: The Mandalorian, Executive Producer Jon Favreau invites the cast and crew to share an unprecedented look at the making of the series which quickly became a pop culture phenomenon after premiering in November.\r\nDebuting on the day that a wor… [+406 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The Masked Singer Season 3 | Episode 12 Spoilers, Clues & Guesses - CinemaBlend", "description": "The Masked Singer has captivated America, and it isn’t hard to see why. The elaborate costumes, the performances, and the big mystery behind the identities o...", "url": "https://www.youtube.com/watch?v=Tp_OTEMzpMI", "urlToImage": null, "publishedAt": "2020-04-23T19:26:16Z", "content": null}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Gael Fashingbauer Cooper", "title": "YouTube turns 15 today. Watch the first video it posted - CNET", "description": "One of the founders visited the zoo. Let's just say the video site's content has improved a lot since 2005.", "url": "https://www.cnet.com/news/youtube-turns-15-today-watch-the-first-video-it-posted/", "urlToImage": null, "publishedAt": "2020-04-23T19:02:24Z", "content": "The clip is just 18 seconds long, but 15 years ago, it kicked off an online video revolution.  Thursday marks the 15th anniversary of the first-ever YouTube video, which shows company co-founder Jawed Karim standing in front of an elephant enclosure at the Sa… [+1519 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Joan E. Solsman", "title": "HBO Max: Launch date, prices, shows and movies to expect - CNET", "description": "HBO Max will launch May 27 with HBO's programs and movies, licensed hits and exclusive originals (at least, the ones that aren't delayed by coronavirus).", "url": "https://www.cnet.com/news/hbo-max-launch-date-may-27-prices-shows-movies-free-trials-promos-friends/", "urlToImage": null, "publishedAt": "2020-04-23T17:56:54Z", "content": "HBO Max promises a lot.\r\nScreenshot by CNET\r\nHBO Max, the HBO-anchored streaming service finally announced to be launching May 27, has much in common with its competitors in the streaming wars like Disney Plus and Peacock, not to mention Netflix. Like those, … [+18823 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Karen Han", "title": "Watch the trailer for Jerry Seinfeld’s first original comedy special in 22 years - Polygon", "description": "In 23 Hours to Kill, Jerry Seinfeld returns to stand-up, releasing his first original comedy special in 22 years. The special’s release date on Netflix is May 5.", "url": "https://www.polygon.com/2020/4/23/21232677/jerry-seinfeld-23-hours-to-kill-trailer-netflix", "urlToImage": null, "publishedAt": "2020-04-23T15:20:34Z", "content": "23 Hours to Kill hits Netflix on May 5"}, {"source": {"id": null, "name": "Qz.com"}, "author": "Justin Rohrlich, Max de Haldevang", "title": "Inside the hunt for the stolen Van Gogh - Quartz", "description": "The art world's most notorious cops and robbers discuss the recent theft, and what happens next.", "url": "https://qz.com/1841045/inside-the-hunt-for-the-stolen-van-gogh/", "urlToImage": null, "publishedAt": "2020-04-23T11:07:58Z", "content": "When a thief stole a multimillion-dollar painting by Vincent van Gogh from a small museum in the Netherlands last month, Octave Durham almost immediately found himself a person of interest.\r\nIts not a coincidence, because most of the time I did it, Durham, wh… [+15988 chars]"}]}