{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": "wired", "name": "Wired"}, "author": "WIRED Staff", "title": "12 Best Weekend Deals on Robot Vacuums, Games, and More - WIRED", "description": "Noise-canceling headphones and running shoes are both ways to get some socially distanced space.", "url": "https://www.wired.com/story/weekend-deals-april-25-2020/", "urlToImage": null, "publishedAt": "2020-04-25T11:08:37Z", "content": "Even if you're safe and healthy while sheltering in place, weeks and weeks of social distancing can begin to wear you down. We've been working overtime to find ways to reestablish a few small routines that coronavirus quarantines may have disrupted. We have t… [+680 chars]"}, {"source": {"id": null, "name": "Nintendolife.com"}, "author": "Nintendo Life", "title": "Random: Cadence Of Hyrule Guitarist Petitions For Time Travel Cheater Stamp In Animal Crossing - Nintendo Life", "description": "Insists he was \"just poking some fun\"", "url": "http://www.nintendolife.com/news/2020/04/random_cadence_of_hyrule_guitarist_petitions_for_time_travel_cheater_stamp_in_animal_crossing", "urlToImage": null, "publishedAt": "2020-04-25T08:00:00Z", "content": "Update: Jules insists this was a joke specifically targeting a friend of his and further explained how he thinks time travel is still a valid way to play and enjoy Animal Crossing: New Horizons:\r\nOriginal article: One heated topic that keeps resurfacing on a … [+1394 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "Brett Wadelton", "title": "Google removes 103 Android apps from the Play Store with 69 million installs - 7NEWS.com.au", "description": "What actually happens is that most of these apps continue to run in the background and serve the user’s phone with intrusive ads.", "url": "https://7news.com.au/technology/google-removes-103-android-apps-from-the-play-store-with-69-million-installs-c-997272", "urlToImage": null, "publishedAt": "2020-04-25T07:27:42Z", "content": "Google has removed a whopping 103 apps from Androids Play Store after they were found bypass security checks, contain adware and descriptions that were deemed to be misleading.\r\nMore alarmingly is the amount of installs that these apps had accumulated.\r\nThese… [+7517 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Oppo Find X2 Pro camera review - GSMArena Official", "description": "ALL YOU NEED TO KNOW about the Find X2 Pro's camera performance in a dedicated video full of camera samples and the occasional comparison vs. the Galaxy S20 ...", "url": "https://www.youtube.com/watch?v=rbo4mQ874fc", "urlToImage": null, "publishedAt": "2020-04-25T06:18:47Z", "content": "ALL YOU NEED TO KNOW about the Find X2 Pro's camera performance in a dedicated video full of camera samples and the occasional comparison vs. the Galaxy S20 Ultra. \r\nOur full Find X2 Pro video review: https://www.youtube.com/watch?v=LPCqf...\r\nTo learn more, r… [+288 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Dion Dassanayake", "title": "Windows 10 update could DELETE your files and bricks PCs in fresh blow to Microsoft users - Express", "description": "WINDOWS 10 users have been dealt yet another download blow, with a new Microsoft update capable of deleting user files and bricking your PC.", "url": "https://www.express.co.uk/life-style/science-technology/1273596/Windows-10-update-deletes-files-bricks-PCs-Microsoft", "urlToImage": null, "publishedAt": "2020-04-25T06:06:53Z", "content": "And another posted: \"My system automatically updated on the 19th of April. I lost some important word files of my university. And a folder.\r\n\"I have looked on the temporary folders and I have tried to uninstall the update but they do not appear\".\r\nWindows Lat… [+612 chars]"}, {"source": {"id": null, "name": "Digitalinformationworld.com"}, "author": "Arooj Ahmed", "title": "A Researcher Created A Website Highlighting What A Smartphone sees While Using Bluetooth And Discovered One Of The Biggest Challenges COVID-19 Tracking Technology Will Face - Digital Information World", "description": "One of the hurdles in the creation of this technology is that Bluetooth also detects devices through walls or other bodies that may not transmit the virus.", "url": "https://www.digitalinformationworld.com/2020/04/website-delenates-what-a-smartphone-sees-while-using-bluetooth-and-challenges-covid-19-tracking-technology-will-face.html", "urlToImage": null, "publishedAt": "2020-04-25T06:06:04Z", "content": "<ul><li>Claudio Guarnieri, an artist and security researcher created a website visualizing what a smartphone sees while the Bluetooth is turned on.</li><li>Apple and Google are creating a contact tracing technology to trace COVID-19 spread using Bluetooth ins… [+2045 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "NVIDIA RTX Voice Benchmark on GTX vs. RTX GPUs, Gaming Performance, & Voice Quality - Gamers Nexus", "description": "This benchmark tests NVIDIA RTX Voice for gaming performance impact, mostly to determine if RT hardware is even being used. 2080 Super, 2060, and GTX 1080 in...", "url": "https://www.youtube.com/watch?v=f_obMmLXlP4", "urlToImage": null, "publishedAt": "2020-04-25T04:03:07Z", "content": null}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Desire Athow", "title": "This AMD Ryzen notebook deal is probably the best we've ever seen - TechRadar", "description": "Lenovo and AMD provide a glimpse into the future", "url": "https://www.techradar.com/news/this-amd-ryzen-laptop-is-the-probably-the-best-notebook-deal-ever", "urlToImage": null, "publishedAt": "2020-04-25T03:00:00Z", "content": "We reviewers are used to obsessing over incremental technology changes, but every now and then a supernova appears on our radar - something that can single handedly change the status quo.\r\nThe AMD Ryzen 4000 family is one such supernova and promises to bring … [+1829 chars]"}, {"source": {"id": "ign", "name": "IGN"}, "author": "Felicia Miranda", "title": "FF7 Remake Hard Mode Guide: Tips on MP Recovery, Healing, and the Best Materia - IGN - IGN", "description": "Get through hard mode in FF7 Remake with our guide which includes ways to preserve MP, recover MP and HP, and our suggestions for the best materia to use.", "url": "https://www.ign.com/articles/ff7-remake-hard-mode-guide", "urlToImage": null, "publishedAt": "2020-04-25T02:29:59Z", "content": "FF7 Remakes hard mode brings a new layer of difficulty to Clouds adventure in Midgar, challenging players to really step up their strategy and perfect their combat skills. The biggest differences to expect in FF7Rs hard mode are stronger enemies, unusable ite… [+3714 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Oscar Gonzalez", "title": "Travis Scott event in Fortnite: How to watch the encore and find the Giant Astro Heads - CNET", "description": "The rapper dropped new tracks in a jaw-dropping concert. Catch the next show at midnight.", "url": "https://www.cnet.com/news/travis-scott-event-in-fortnite-how-to-watch-the-encore-and-find-the-giant-astro-heads/", "urlToImage": null, "publishedAt": "2020-04-25T01:02:37Z", "content": "Play some Fortnite and listen to a new track from Travis Scott.\r\nEpic Games\r\nFortnite events aren't only for players to check out new content from developer Epic Games. The popular battle royale game has also played host to multiple premieres and collaboratio… [+3718 chars]"}, {"source": {"id": null, "name": "Ubergizmo.com"}, "author": "Tyler Lee", "title": "Samsung’s Smartwatches Get A New Blood Pressure Monitoring App - Ubergizmo", "description": "Our smartwatches are getting better at what they do, where they can monitor more than just our daily activities like our steps taken, calories burnt, and so on. For example, the Apple Watch comes with an ECG monitoring tool that can alert the wearer if there …", "url": "https://www.ubergizmo.com/2020/04/samsung-smartwatch-blood-pressure-monitor/", "urlToImage": null, "publishedAt": "2020-04-25T00:42:49Z", "content": "Our smartwatches are getting better at what they do, where they can monitor more than just our daily activities like our steps taken, calories burnt, and so on. For example, the Apple Watch comes with an ECG monitoring tool that can alert the wearer if there … [+1254 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "GameCentral", "title": "Reason and irrationality in the choice of console purchases - Metro.co.uk", "description": "A reader is surprised to find people choosing between PS5 and Xbox Series X already, and examines the psychology of their decisions.", "url": "https://metro.co.uk/2020/04/25/undivided-loyalties-reason-irrationality-choice-console-purchases-readers-feature-12607795/", "urlToImage": null, "publishedAt": "2020-04-25T00:36:33Z", "content": "How do you choose yours? (pic: Sony)\r\nA reader is surprised to find people choosing between PS5 and Xbox Series X already, and examines the psychology of their decisions.\r\nMy favourite games are made by Nintendo, the flagship Mario and Zelda titles in particu… [+4815 chars]"}, {"source": {"id": null, "name": "Venturebeat.com"}, "author": "Jeff Grubb", "title": "How Xbox Game Pass freed The Coalition to make Gears Tactics for PC - VentureBeat", "description": "Gears Tactics is the next big first-party Microsoft launch for Xbox Game Pass. Developer The Coalition made the game in part because of Game Pass.", "url": "https://venturebeat.com/2020/04/24/gears-tactics-xbox-game-pass/", "urlToImage": null, "publishedAt": "2020-04-24T23:33:30Z", "content": "Gears Tactics is launching April 28 for Windows 10, Xbox Game Pass for PC, and Steam. On How Games Make Money this week, host Jeff Grubb sits down to talk with The Coalition operations director Mike Crump and Xbox marketing general manager Ben Decker about th… [+4308 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Naruto Shippuden: Ultimate Ninja Storm 4 Road to Boruto - Official Switch Trailer - IGN", "description": "Experience the Fourth Great Ninja War and see through the conclusion of the Naruto Shippuden storyline in the game, available now on Nintendo Switch. Check o...", "url": "https://www.youtube.com/watch?v=H_T9pPijWPc", "urlToImage": null, "publishedAt": "2020-04-24T22:43:40Z", "content": null}, {"source": {"id": null, "name": "Micky.com.au"}, "author": "www.facebook.com/christian.n.puno", "title": "Ford Mustang Cobra Jet 1400: Time for electric cars to take the limelight - Micky News", "description": "Time for electric cars to take limelight, Ford mechanics and scientists took this further. The result? 'Ford Mustang Cobra Jet 1400'", "url": "https://micky.com.au/ford-mustang-cobra-jet-1400-time-for-electric-cars-to-take-the-limelight/", "urlToImage": null, "publishedAt": "2020-04-24T22:43:00Z", "content": "The Ford Mustang Cobra Jet 1400 isnt a typical electric car. This cars creation coincided with drag racing in mind. Imagine how much electrical power it needs to go on such high speed. According to its creators, this monster car can reach a fourth of a mile w… [+2234 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Nathan Grayson", "title": "Valorant Twitch Streamers Are Gaming The System With 24/7 Streams That Rack Up Viewers - Kotaku Australia", "description": "If you take a look at many of Twitch’s top Valorant streams right now, you’ll note that they claim to be running “24/7.” This might strike you as odd, given that human beings generally need to eat, sleep, and all that fancy, life-sustaining jazz. Most of thes…", "url": "https://www.kotaku.com.au/2020/04/valorant-twitch-streamers-are-gaming-the-system-with-247-streams-that-rack-up-viewers/", "urlToImage": null, "publishedAt": "2020-04-24T22:10:00Z", "content": "If you take a look at many of Twitchs top Valorant streams right now, youll note that they claim to be running 24/7. This might strike you as odd, given that human beings generally need to eat, sleep, and all that fancy, life-sustaining jazz. Most of these st… [+9348 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Logitech G G203 LIGHTSYNC Promo Video - Techaeris", "description": "This is an overview of the new Logitech G G203 LIGHTSYNC Gaming Mouse. The video was provided by Logitech for resharing. Available in May buy here: https://w...", "url": "https://www.youtube.com/watch?v=i3_Ale_138I", "urlToImage": null, "publishedAt": "2020-04-24T21:57:36Z", "content": null}, {"source": {"id": null, "name": "Caradvice.com.au"}, "author": "Justin Narayan", "title": "Ford Mustang crowned the most successful sports car of 2019 - CarAdvice", "description": "America just wasn’t enough for the original pony car. The Ford Mustang has officially gone global. Last year saw the Mustang rise to the top of the sports car world, with recognition from fans from...", "url": "https://www.caradvice.com.au/845186/ford-mustang-crowned-the-most-successful-sports-car-of-2019/", "urlToImage": null, "publishedAt": "2020-04-24T20:05:00Z", "content": "More than 100,000 Mustangs were sold globally last year. Even though sales have waned in Australia, it remains one of Ford's most popular models.\r\nAmerica just wasn’t enough for the original pony car. The Ford Mustang has officially gone global.\r\nLast year sa… [+1907 chars]"}, {"source": {"id": null, "name": "Otakukart.com"}, "author": null, "title": "Arch-Tempered Namielle Release Date and All You Need To Know - OtakuKart", "description": "Monster Hunter Iceborne, which was recently launched on PC, has its latest update dropping soon called Title Update 13.5. The latest update is to be available o", "url": "https://otakukart.com/113224/arch-tempered-namielle-release-date-and-all-you-need-to-know/", "urlToImage": null, "publishedAt": "2020-04-24T20:00:15Z", "content": "Monster Hunter Iceborne, which was recently launched on PC, has its latest update dropping soon called Title Update 13.5. The latest update is to be available on PS4, Xbox One, and PC soon! Two new monster variants are to be introduced in the Title Update 13.… [+3073 chars]"}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "Apple Starts iPhone SE 2020 Sales in 40 Countries - Somag News", "description": "Apple, which introduced a surprisingly new generation iPhone SE model in the past days, has now started the first sales of the device in 40 countries. In the first wave, supply is expected to be limited, but most customers who pre-ordered on April 17 are said…", "url": "https://www.somagnews.com/apple-starts-iphone-se-2020-sales-40-countries/", "urlToImage": null, "publishedAt": "2020-04-24T19:51:00Z", "content": "Apple, which introduced a surprisingly new generation iPhone SE model in the past days, has now started the first sales of the device in 40 countries. In the first wave, supply is expected to be limited, but most customers who pre-ordered on April 17 are said… [+1666 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The Best Free Alternatives to Zoom - Lifehacker", "description": "While the popularity of the video conferencing service Zoom has skyrocketed since the outbreak of the coronavirus, recent news of its many security and priva...", "url": "https://www.youtube.com/watch?v=g7SIqs8dos4", "urlToImage": null, "publishedAt": "2020-04-24T19:48:38Z", "content": "While the popularity of the video conferencing service Zoom has skyrocketed since the outbreak of the coronavirus, recent news of its many security and privacy issues might have you feeling nervous about using it. In the video above, I share three free altern… [+1048 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "10 Fake Consoles That Actually Work - TheGamer", "description": "Sony, Microsoft, and Nintendo have all had their famous consoles ripped off. But have you ever wondered what it's like to own one of them? or even if they wo...", "url": "https://www.youtube.com/watch?v=G5P0soLY6zo", "urlToImage": null, "publishedAt": "2020-04-24T19:45:01Z", "content": null}, {"source": {"id": null, "name": "Businessinsider.com.au"}, "author": "Mary Meisenzahl", "title": "Facebook's new video chat Zoom competitor is coming soon — here's how the new feature works - Business Insider Australia", "description": "Facebook CEO Mark Zuckerberg announced on Friday the company is introducing 50-person video chatrooms.", "url": "https://www.businessinsider.com.au/facebook-messenger-rooms-video-chat-zoom-walkthrough-like-zoom-2020-4", "urlToImage": null, "publishedAt": "2020-04-24T19:44:33Z", "content": "<ul><li>Facebook just announced 50-person video chatrooms called Messenger Rooms.</li><li>\r\nThe new Messenger Rooms have some features in common with other video calling apps, like Zoom and Houseparty.\r\n</li><li>\r\nThe company says Messenger Rooms will be comi… [+3605 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "", "title": "Telegram promises secure group video calls sometime this year - Engadget", "description": "Telegram says it will add secure group video calls in 2020.", "url": "https://www.engadget.com/telegram-secure-group-video-calls-142035892.html", "urlToImage": null, "publishedAt": "2020-04-24T19:41:19Z", "content": "While Telegram didn’t release many details about the feature, it appears to be taking a dig at Zoom, which is facing pressure to fix several privacy issues. In response, Zoom has created a security council and promised upgrades, but that won’t stop competitor… [+831 chars]"}, {"source": {"id": null, "name": "Lifehacker.com.au"}, "author": "David Murphy", "title": "Are You Charging Your MacBook On The Wrong Side? - Lifehacker Australia", "description": "Yes, you read that headline correctly. There is apparently a “right” way and a “wrong” way to connect devices to a MacBook with Thunderbolt/USB-C ports on both sides. Doing it wrong can affect your computer’s performance....", "url": "https://www.lifehacker.com.au/2020/04/are-you-charging-your-macbook-on-the-wrong-side/", "urlToImage": null, "publishedAt": "2020-04-24T19:30:00Z", "content": "Yes, you read that headline correctly. There is apparently a right way and a wrong way to connect devices to a MacBook with Thunderbolt/USB-C ports on both sides. Doing it wrong can affect your computers performance.\r\nI recently encountered this knowledge on … [+3969 chars]"}, {"source": {"id": null, "name": "Gizmodo.com.au"}, "author": "Catie Keck", "title": "Your Nintendo Account May Have Been Exposed, So Here's How To Enable 2FA - Gizmodo Australia", "description": "Following a growing number of reports of Nintendo users claiming their accounts had been hacked, Nintendo has confirmed that roughly 160,000 may have been accessed and exposed personally identifiable information about those users....", "url": "https://www.gizmodo.com.au/2020/04/your-nintendo-account-may-have-been-exposed-so-heres-how-to-enable-2fa/", "urlToImage": null, "publishedAt": "2020-04-24T19:15:00Z", "content": "Following a growing number of reports of Nintendo users claiming their accounts had been hacked, Nintendo has confirmed that roughly 160,000 may have been accessed and exposed personally identifiable information about those users.\r\nIn a statement on its Japan… [+2041 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Ian Walker", "title": "Final Fantasy VII Remake Made Me Climb 59 Flights Of Stairs And I Loved It - Kotaku Australia", "description": "I recently arrived at Shinra headquarters in my playthrough of Final Fantasy VII Remake. After Cloud and his squad fight their way through the parking garage, they enter the spacious reception area to find the place deserted. Our heroes have two ways to reach…", "url": "https://www.kotaku.com.au/2020/04/final-fantasy-vii-remake-made-me-climb-59-flights-of-stairs-and-i-loved-it/", "urlToImage": null, "publishedAt": "2020-04-24T19:00:00Z", "content": "I recently arrived at Shinra headquarters in my playthrough of Final Fantasy VII Remake. After Cloud and his squad fight their way through the parking garage, they enter the spacious reception area to find the place deserted. Our heroes have two ways to reach… [+3078 chars]"}, {"source": {"id": null, "name": "Slashgear.com"}, "author": "Chris Burns", "title": "PAC-MAN game now free for quarantine gamers - SlashGear", "description": "Today the folks at Bandai Namco US delivered a message of thanks to the public with their “goodwill ambassador” PAC-MAN. Their announcement was that they’ll be “asking fans …", "url": "https://www.slashgear.com/pac-man-game-now-free-for-quarantine-gamers-24618193/", "urlToImage": null, "publishedAt": "2020-04-24T18:49:21Z", "content": "Today the folks at Bandai Namco US delivered a message of thanks to the public with their “goodwill ambassador” PAC-MAN. Their announcement was that they’ll be “asking fans to do their part and have More Fun For Everyone at home” – the “more fun for everyone”… [+2504 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Valve Source Code LEAKED - Hot off the Press Start #34 - GameFront", "description": "Support us on Patreon! - https://www.patreon.com/gamefront - James is back once more with the latest gaming news, including more bad news for GeForce Now, ju...", "url": "https://www.youtube.com/watch?v=D37UfGQ1x1o", "urlToImage": null, "publishedAt": "2020-04-24T18:47:41Z", "content": "Support us on Patreon! - https://www.patreon.com/gamefront - James is back once more with the latest gaming news, including more bad news for GeForce Now, justice for Warzone cheaters, and the source code for Team Fortress 2 and CS:GO leaking online.\r\n#GeForc… [+287 chars]"}, {"source": {"id": null, "name": "Androidcentral.com"}, "author": "Samantha Nelson", "title": "Google Stadia vs. PlayStation Now: Which is better? - Android Central", "description": "Google Stadia and PlayStation Now both allow you to pay $10/month to stream games across devices. Both services offer free trials so you can test them yourself, but our guide lays out the features to help you figure out what's right for you.", "url": "https://www.androidcentral.com/google-stadia-vs-playstation-now", "urlToImage": null, "publishedAt": "2020-04-24T18:12:57Z", "content": "Google Stadia launched in November, offering subscribers the chance to play new AAA games across their PC, TV, and Android devices without any downloads or updates. Google has promised to continue to expand its games library and add new features to the still-… [+10145 chars]"}, {"source": {"id": null, "name": "Motor1.com"}, "author": "Anthony Alaniz", "title": "2021 Jaguar F-Pace SVR Caught Making Noise At The Nurburgring - Motor1 ", "description": "The supercharged 5.0-liter V8 sounds glorious.", "url": "https://www.motor1.com/news/414679/2021-jaguar-f-pace-svr-spied/", "urlToImage": null, "publishedAt": "2020-04-24T18:02:03Z", "content": "The Jaguar F-Pace has quickly become the automakers best-selling vehicle. In 2019, it accounted for half of all U.S. Jaguar sales. Jaguar is hoping to continue the SUVs success with a mid-cycle refresh for the 2021 model year, and that includes giving the hig… [+1844 chars]"}, {"source": {"id": null, "name": "Macrumors.com"}, "author": "Juli Clover", "title": "'Defending Jacob' and 'Beastie Boys Story' Now Available on Apple TV+ - MacRumors", "description": "The first three episodes of Apple TV+'s latest series, \"Defending Jacob,\" are available as of today in the Apple TV app on iPhone, iPad,...", "url": "https://www.macrumors.com/2020/04/24/apple-tv-plus-beastie-boys-defending-jacob/", "urlToImage": null, "publishedAt": "2020-04-24T17:32:03Z", "content": "The first three episodes of Apple TV+'s latest series, \"Defending Jacob,\" are available as of today in the ‌Apple TV‌ app on iPhone, iPad, Mac, ‌Apple TV‌, and select smart TVs.\r\nThe show, which is based on the William Landay novel of the same name, follows a… [+1760 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Valentina Palladino", "title": "The best deals we found this week: the iPad, Google Nest WiFi and more - Yahoo Finance Australia", "description": "The best deals from this week include the base, 10.2-inch iPad for $300, a Nest WiFi bundle for $200, and $100 off the Apple Watch Series 5.", "url": "https://au.news.yahoo.com/weekly-deals-ipad-google-nest-wifi-172049113.html", "urlToImage": null, "publishedAt": "2020-04-24T17:20:00Z", "content": "Nows a great time to buy an Apple or a Google product. This week brought a number of deals on wearables, smartphones, smart home products and other devices from the two tech giants. You can still get $30 off the base iPad and $100 off an Apple Watch Series 5.… [+7041 chars]"}, {"source": {"id": null, "name": "Lifehacker.com.au"}, "author": "Brendan Hesse", "title": "Don't Let Microsoft Word Judge You For Using Two Spaces Between Sentences - Lifehacker Australia", "description": "Microsoft has taken an official stance on one of the internet’s most divisive questions, firmly coming down on the side of minimalism in the “one-space versus two-spaces after a sentence” debate. Word’s automatic spelling and grammar checker will now flag any…", "url": "https://www.lifehacker.com.au/2020/04/dont-let-microsoft-word-judge-you-for-using-two-spaces-between-sentences/", "urlToImage": null, "publishedAt": "2020-04-24T17:15:00Z", "content": "Microsoft has taken an official stance on one of the internets most divisive questions, firmly coming down on the side of minimalism in the one-space versus two-spaces after a sentence debate. Words automatic spelling and grammar checker will now flag anythin… [+1903 chars]"}, {"source": {"id": null, "name": "Androidpolice.com"}, "author": "https://www.facebook.com/corbin.davenport.50", "title": "Sony WH-C710N review: Great noise-cancelling headphones for under $200 - Android Police", "description": "Sony makes some of the best noise-canceling headphones around, especially the WH-1000XM3 (which is overdue for a replacement). The WH1000XM3 is a premium", "url": "https://www.androidpolice.com/2020/04/24/sony-wh-ch710n-review/", "urlToImage": null, "publishedAt": "2020-04-24T17:00:43Z", "content": "Sony makes some of the best noise-canceling headphones around, especially the WH-1000XM3 (which is overdue for a replacement). The WH1000XM3 is a premium set of headphones that regularly goes for around $300, and competing products like the Bose QuietComfort … [+4387 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Heather Alexandra", "title": "The Good, The Bad, And The Annoying Of Borderlands 3's \"Revenge Of The Cartels\" Event - Kotaku Australia", "description": "It’s been less than a month since Borderlands 3’s latest big expansion landed with a bang, but vault hunters already have access to another brand-new playground in which they can fire 87 bazillion guns. It’s called Villa Ultraviolet. It’s drenched in neon and…", "url": "https://www.kotaku.com.au/2020/04/the-good-the-bad-and-the-annoying-of-borderlands-3s-revenge-of-the-cartels-event/", "urlToImage": null, "publishedAt": "2020-04-24T17:00:00Z", "content": "Its been less than a month since Borderlands 3s latest big expansion landed with a bang, but vault hunters already have access to another brand-new playground in which they can fire 87 bazillion guns. Its called Villa Ultraviolet. Its drenched in neon and gau… [+4795 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "India TV Tech Desk", "title": "WhatsApp to soon start showing ads, rollout delayed by Facebook: Here’s what happened - India TV News", "description": "WhatsApp has become one of the most popular cross-platform instant messaging apps around the globe and it is now gearing up to serve advertisements to its users.", "url": "https://www.indiatvnews.com/technology/news-whatsapp-to-soon-start-showing-ads-rollout-delayed-by-facebook-610976", "urlToImage": null, "publishedAt": "2020-04-24T15:20:34Z", "content": "WhatsApp to soon introduce ads.\r\nWhatsApp has become one of the most popular cross-platform instant messaging apps around the globe. The Facebook-owned giant is now gearing up to serve advertisements to its users. The application has been free for a long time… [+1422 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "iPhone SE review, Canon EOS R5 new specs and Surface Pro 8 rumors | Noise Cancelling Podcast 008 - TechRadar", "description": "More tech news and painfully honest reviews from Gareth and Sherri as they’re joined by two new voices: Kimberly Gedeon of Laptop Mag and TechRadar Cameras e...", "url": "https://www.youtube.com/watch?v=bPYeSWVgSXw", "urlToImage": null, "publishedAt": "2020-04-24T15:00:19Z", "content": "More tech news and painfully honest reviews from Gareth and Sherri as theyre joined by two new voices: Kimberly Gedeon of Laptop Mag and TechRadar Cameras editor, Mark Wilson. \r\nTOPIC TIMESTAMPS03:52 - Canon EOS R508:36 - PS5 Robot Friends12:46 - Surface Pro … [+992 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Future Games Show Announcement Trailer - Coming June 2020 - GamesRadar", "description": "See the most exciting console, mobile and streaming games of 2020 in one show with a mixture of exclusives, deep dives and developer interviews. Coming June ...", "url": "https://www.youtube.com/watch?v=DbLFsALqD_0", "urlToImage": null, "publishedAt": "2020-04-24T15:00:12Z", "content": "See the most exciting console, mobile and streaming games of 2020 in one show with a mixture of exclusives, deep dives and developer interviews. Coming June 2020.Subscribe to Gamesradar: http://goo.gl/cnjsn1"}, {"source": {"id": null, "name": "Onmsft.com"}, "author": "Rabia Noureen", "title": "Microsoft has started promoting its new Edge browser on Outlook.com - OnMSFT", "description": "Non-Edge users are now seeing messages promoting Microsoft’s new web browser on Outlook.com.", "url": "https://www.onmsft.com/news/microsoft-has-started-promoting-its-new-edge-browser-on-outlook-com", "urlToImage": null, "publishedAt": "2020-04-24T13:56:00Z", "content": "While Microsoft has already praised the capabilities of its new Microsoft Edge on various occasions, the company has now started promoting the new web browser on Outlook.com (via Windows Latest). Interestingly, non-Edge users who access their inbox on Outlook… [+1415 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": "www.facebook.com/christian.n.puno", "title": "Apple will release a new Mac laptop away from Intel - Micky News", "description": "Apple will release a new Mac laptop next year with its processors away from intel, giving users better performance.", "url": "https://micky.com.au/apple-will-release-a-new-mac-laptop-away-from-intel/", "urlToImage": null, "publishedAt": "2020-04-24T13:52:47Z", "content": "It is no doubt that Apple products usually cost high, but users often report it has excellent performance. Apple will release its new Mac laptop next year, according to Bloomberg. It is also said to have more improvements included.\r\nWhat is With the New Mac L… [+3233 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "India TV Tech Desk", "title": "Huawei MatePad with Kirin 810 launched: Price, specifications and more - India TV News", "description": "The all-new Huawei MatePad is basically a toned-down version of the MatePad Pro 5G, whcih was launched back in November 2019.", "url": "https://www.indiatvnews.com/technology/news-huawei-matepad-launched-price-specifications-610927", "urlToImage": null, "publishedAt": "2020-04-24T13:03:37Z", "content": "Huawei MediaPad comes with a massive 7,250mAh battery.\r\nHuawei has announced the launch of yet another Android-based tablet in China. The all-new Huawei MatePad is basically a toned-down version of the MatePad Pro 5G, whcih was launched back in November 2019.… [+1552 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Joan E. Solsman", "title": "This Oculus Quest fitness app worked me so hard I forgot to breathe - CNET", "description": "Supernatural is a new spin on virtual reality fitness, and it may save me from backsliding into a lazy slug during lockdown.", "url": "https://www.cnet.com/news/supernatural-vr-fitness-mashup-of-pelaton-and-beat-saber-oculus-quest/", "urlToImage": null, "publishedAt": "2020-04-24T12:57:15Z", "content": "Supernatural sets game-ified, choreographed workouts to popular music in virtual reality. \r\nWithin\r\nSupernatural, a new virtual realityfitness game you can play in your home, isn't playing around. I sweat so hard I have to guzzle five glasses of water for eve… [+9525 chars]"}, {"source": {"id": null, "name": "Techspot.com"}, "author": "Rob Thubron", "title": "Malwarebytes steps into the VPN space with WireGuard-based service - TechSpot", "description": "Available now for Windows 7 and higher—Mac, Android, iOS, and Chrome OS are coming soon—Malwarebytes Privacy costs $59.99 per year. You can also get it bundled with a 1-year license of Malwarebytes Premium for $89.99, saving buyers $49.99. Both options&hellip;", "url": "https://www.techspot.com/news/84974-malwarebytes-steps-vpn-space-wireguard-based-service.html", "urlToImage": null, "publishedAt": "2020-04-24T12:37:00Z", "content": "In brief: Malwarebytes is joining the list of antivirus companies that also offer a VPN. Called Malwarebytes Privacy, the service uses a newer and faster protocol: WireGuard. \r\nAvailable now for Windows 7 and higherMac, Android, iOS, and Chrome OS are coming … [+1527 chars]"}, {"source": {"id": null, "name": "Happygamer.com"}, "author": "Joshua Goodpastor", "title": "Minimal Affect Is A New Parody Action RPG That Pays Homage To Some Of The Greatest Sci-Fi Movies And Games In One Small Package - Happy Gamer", "description": "Toadman Studios has entered the dangerous world of parody and announced its upcoming game Minimal Affect. This is an obvious parody on the title of...", "url": "https://happygamer.com/minimal-affect-is-a-new-parody-action-rpg-that-pays-homage-to-some-of-the-greatest-sci-fi-movies-and-games-in-one-small-package-63649/", "urlToImage": null, "publishedAt": "2020-04-24T10:52:12Z", "content": "Toadman Studios has entered the dangerous world of parody and announced its upcoming game Minimal Affect. This is an obvious parody on the title of the famous Mass Effect series, but quick observation shows that this game spans much more than one franchise.\r\n… [+2256 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Tom Bedford", "title": "The new iPhone SE is on sale today: here's how you can get one - TechRadar", "description": "No premium prices here", "url": "https://www.techradar.com/news/the-new-iphone-se-is-out-today-and-heres-how-you-can-get-one", "urlToImage": null, "publishedAt": "2020-04-24T10:09:00Z", "content": "Apple's new iPhone SE is available to buy now around the world. If you've been waiting to pick up a new iPhone that doesn't cost as much as a member of the iPhone 11 range, now is the time to do it.\r\nThe new iPhone SE has a 4.7-inch screen, the modern A13 Bio… [+987 chars]"}, {"source": {"id": null, "name": "Happygamer.com"}, "author": "Joshua Goodpastor", "title": "SoundSelf: A Technodelic Is A Unique Soundbased VR Experience Now Availiable For Both PC And Mac VR Systems - Happy Gamer", "description": "Andromeda Entertainment has announced a unique video game experience in an immersive VR world. SoundSelf: A Technodelic is a unique and entrancing...", "url": "https://happygamer.com/soundself-a-technodelic-is-a-unique-soundbased-vr-experience-now-availiable-for-both-pc-and-mac-vr-systems-63644/", "urlToImage": null, "publishedAt": "2020-04-24T09:42:12Z", "content": "Andromeda Entertainment has announced a unique video game experience in an immersive VR world. SoundSelf: A Technodelic is a unique and entrancing experience that takes players on a meditative journey. The game is controlled using your own voice as you hum an… [+2237 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Leah Williams", "title": "Animal Crossing Adds The Worst Character Ever - Kotaku Australia", "description": "Animal Crossing: New Horizons' recent update reintroduced a familiar face to the Animal Crossing universe. Redd, a fox art dealer is now a special guest character that can appear on your island. He sells intricate art pieces on his rickety boat, but be warned…", "url": "https://www.kotaku.com.au/2020/04/animal-crossing-new-horizons-redd-artworks/", "urlToImage": null, "publishedAt": "2020-04-24T05:33:00Z", "content": "Animal Crossing: New Horizons' recent update reintroduced a familiar face to the Animal Crossing universe. Redd, a fox art dealer is now a special guest character that can appear on your island. He sells intricate art pieces on his rickety boat, but be warned… [+3016 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Red Dead Redemption 2 Joins Game Pass | Save State - GameSpot", "description": "Persia brings you all the biggest gaming stories for your April 23 Save State. Red Dead Redemption 2 is coming to Xbox One's Game Pass on May 7 and is alread...", "url": "https://www.youtube.com/watch?v=AZzzSV-F_B8", "urlToImage": null, "publishedAt": "2020-04-24T01:00:02Z", "content": "Persia brings you all the biggest gaming stories for your April 23 Save State. Red Dead Redemption 2 is coming to Xbox One's Game Pass on May 7 and is already available for pre-download. It will also include Red Dead Online. GTA V will be leaving the service … [+447 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "Digital Staff", "title": "‘He should know better’: Fevola criticised over ‘irresponsible’ ad - 7NEWS.com.au", "description": "Brendan Fevola is promoting an online app that experts are calling a “gateway to gambling addiction”.", "url": "https://7news.com.au/sport/afl/he-should-know-better-fevola-criticised-over-irresponsible-ad-c-996642", "urlToImage": null, "publishedAt": "2020-04-24T00:45:41Z", "content": "AFL great Brendan Fevola has been criticised for promoting an online poker machine app despite his own problems with gambling.\r\nThe 39-year-old took to Instagram this week to share what appeared to be a sponsored post for poker machine app Slotomania.\r\nFevola… [+3393 chars]"}, {"source": {"id": null, "name": "Press-start.com.au"}, "author": "Shannon Grixti", "title": "WWE 2K21 Has Been Cancelled And Won’t Be Released This Year - Press Start Australia", "description": "The WWE has announced on its earnings call this morning that there won't be a mainline WWE 2K game released this year. This comes after the release of WWE 2K20 which was absolutely panned for its massive amount of bugs and the fact that it was barely playable…", "url": "https://press-start.com.au/news/playstation/2020/04/24/wwe-2k21-has-been-cancelled-and-wont-be-released-this-year/", "urlToImage": null, "publishedAt": "2020-04-23T23:33:45Z", "content": "The WWE has announced on its earnings call this morning that there won’t be a mainline WWE 2K game released this year.\r\nThis comes after the release of WWE 2K20 which was absolutely panned for its massive amount of bugs and the fact that it was barely playabl… [+450 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Leah Williams", "title": "Steam's Weekend Deals Feature Some Must-Have Indies - Kotaku Australia", "description": "Every weekend lately, Steam has been spotlighting sales from indie developers. This weekend, it's Annapurna Interactive's turn — and there's a bunch of fantastic games on sale that come highly recommended....", "url": "https://www.kotaku.com.au/2020/04/steam-weekend-indie-sale/", "urlToImage": null, "publishedAt": "2020-04-23T23:33:00Z", "content": "Every weekend lately, Steam has been spotlighting sales from indie developers. This weekend, it's Annapurna Interactive's turn and there's a bunch of fantastic games on sale that come highly recommended.\r\nEmotional family tale What Remains of Edith Finch lead… [+2320 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Leah Williams", "title": "Horizon Zero Dawn 2 Rumours Spread After Developers Delete A Tweet - Kotaku Australia", "description": "In a now-deleted tweet, Horizon Zero Dawn developers Guerilla Games listed a job posting for a Senior AI Programmer that included the hashtag #ps5. It's kicked off speculation that the team could be working on an exclusive PlayStation 5 sequel for the much-lo…", "url": "https://www.kotaku.com.au/2020/04/horizon-zero-dawn-2-rumours/", "urlToImage": null, "publishedAt": "2020-04-23T23:31:00Z", "content": "In a now-deleted tweet, Horizon Zero Dawn developers Guerilla Games listed a job posting for a Senior AI Programmer that included the hashtag #ps5. It's kicked off speculation that the team could be working on an exclusive PlayStation 5 sequel for the much-lo… [+2268 chars]"}, {"source": {"id": null, "name": "Lifehacker.com.au"}, "author": "David Murphy", "title": "How To Customise Your Background In Skype Video Calls - Lifehacker Australia", "description": "There’s little I enjoy more than a the well-executed use of a silly background in a video chat. While this quirky feature used to be exclusive to Zoom, more apps are integrating the functionality—including, recently, Microsoft Teams, and now, Microsoft’s own …", "url": "https://www.lifehacker.com.au/2020/04/how-to-customize-your-background-in-skype-video-calls/", "urlToImage": null, "publishedAt": "2020-04-23T23:30:00Z", "content": "Theres little I enjoy more than a the well-executed use of a silly background in a video chat. While this quirky feature used to be exclusive to Zoom, more apps are integrating the functionalityincluding, recently, Microsoft Teams, and now, Microsofts own Sky… [+1265 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Nathan Grayson", "title": "You Can Finally Apologise For Being Trash In Overwatch - Kotaku Australia", "description": "Who doesn’t love voice lines in Overwatch? They let you say hello. They can help your teammates stay abreast of your ultimate percentage. If you play DPS, you can use them to spam messages about how you need healing until everybody else’s ears seal closed lik…", "url": "https://www.kotaku.com.au/2020/04/you-can-finally-apologize-for-being-trash-in-overwatch/", "urlToImage": null, "publishedAt": "2020-04-23T23:30:00Z", "content": "Who doesnt love voice lines in Overwatch? They let you say hello. They can help your teammates stay abreast of your ultimate percentage. If you play DPS, you can use them to spam messages about how you need healing until everybody elses ears seal closed like … [+2085 chars]"}, {"source": {"id": null, "name": "Ausdroid.net"}, "author": null, "title": "Google rolling out Android 11 DP3 to various Pixel phones today - Ausdroid", "description": "This year Google’s developer previews for Android 11 has been not just premonitions for Android 11 but also for Pixel phones this year with some of the new features we are seeing in developer previews making it into stable Android 10 builds on a monthly basis…", "url": "https://ausdroid.net/2020/04/24/google-rolling-out-android-11-dp3-to-various-pixel-phones-today/", "urlToImage": null, "publishedAt": "2020-04-23T22:48:14Z", "content": "This year Google’s developer previews for Android 11 has been not just premonitions for Android 11 but also for Pixel phones this year with some of the new features we are seeing in developer previews making it into stable Android 10 builds on a monthly basis… [+1551 chars]"}, {"source": {"id": null, "name": "Kotaku.com"}, "author": "Ian Walker", "title": "Binding Of Isaac Mod Helps Woman Propose To Her Significant Other - Kotaku", "description": "I’ve never proposed to anybody, but I can imagine it would be pretty anxiety-provoking. I totally understand why some folks prefer to let their favorite video games do the talking. Last week, an Australian woman sat her significant other down to play a modded…", "url": "https://kotaku.com/binding-of-isaac-mod-helps-woman-propose-to-her-signifi-1843029000", "urlToImage": null, "publishedAt": "2020-04-23T21:15:37Z", "content": "Ive never proposed to anybody, but I can imagine it would be pretty anxiety-provoking. I totally understand why some folks prefer to let their favorite video games do the talking. Last week, an Australian woman sat her significant other down to play a modded … [+2707 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Oscar Gonzalez", "title": "Call of Duty Warzone: Cheaters punished, new modes and everything else you need to know - CNET", "description": "Drop in and survive the 150-player battle royale match.", "url": "https://www.cnet.com/news/call-of-duty-warzone-cheaters-punished-new-modes-and-everything-else-you-need-to-know/", "urlToImage": null, "publishedAt": "2020-04-23T20:54:57Z", "content": "Don't expect to build any forts in Warzone.\r\nActivision\r\nCall of Duty: Warzone is the upcoming battle royale mode for the popular military FPS game. Similar to games like Fortnite and Apex Legends, players will compete against other players to survive until t… [+5699 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Here's What You Need to Know About the NEW Sonos Radio Service - GetConnected Media", "description": "https://getconnectedmedia.com - Sonos Radio is arriving in Canada. The FREE ad-supported service is available exclusively to Sonos users and ties together ov...", "url": "https://www.youtube.com/watch?v=-dq1aWvaCtQ", "urlToImage": null, "publishedAt": "2020-04-23T20:52:48Z", "content": "https://getconnectedmedia.com - Sonos Radio is arriving in Canada. The FREE ad-supported service is available exclusively to Sonos users and ties together over 60,000 radio stations from around the world. This dedicated experience offers better categorization… [+1550 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Fortnite: How to Visit the Agency, Hayman, and Greasy Graves in A Single Match - GameRant", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiP2h0dHBzOi8vZ2FtZXJhbnQuY29tL2ZvcnRuaXRlLXZpc3QtYWdlbmN5LWhheW1hbi1ncmVhc3ktZ3JhdmVzL9IBQ2h0dHBzOi8vZ2FtZXJhbnQuY29tL2ZvcnRuaXRlLXZpc3QtYWdlbmN5LWhheW1hbi1ncmVhc3ktZ3JhdmVzL2FtcC8?oc=5", "urlToImage": null, "publishedAt": "2020-04-23T18:26:28Z", "content": null}, {"source": {"id": null, "name": "Notebookcheck.net"}, "author": "Alex Alderson", "title": "AirTags, iMac redesign, MacBook Pro 14, new MacBook Pro 16 and more Apple hardware refreshes due by Q4 2020 - Notebookcheck.net", "description": "From the MacBook Pro 14 to the iPhone 12 and everything in between, Apple is planning a bumper hardware refresh by the end of the year. Expect new iMacs, AirTags, Watch Series 6 and MacBook Pro 16 releases.", "url": "https://www.notebookcheck.net/AirTags-iMac-redesign-MacBook-Pro-14-new-MacBook-Pro-16-and-more-Apple-hardware-refreshes-due-by-Q4-2020.462283.0.html", "urlToImage": null, "publishedAt": "2020-04-23T18:07:02Z", "content": "Apple is planning to release a bevvy of new hardware, according to Mark Gurman. Summarised in the graphic below and by MacRumors, Gurman has given credence to multiple rumours about upcoming Apple hardware that have been floating around for a few months now.\r… [+1738 chars]"}, {"source": {"id": null, "name": "Macrumors.com"}, "author": "Juli Clover", "title": "Apple Releases iOS 13.4.1 for iPhone SE Ahead of Launch - MacRumors", "description": "Apple today released the iOS 13.4.1 update for iPhone SE owners, suggesting iPhone SE models arriving to customers tomorrow will have iOS 13.4...", "url": "https://www.macrumors.com/2020/04/23/apple-releases-ios-13-4-1-for-iphone-se/", "urlToImage": null, "publishedAt": "2020-04-23T17:26:44Z", "content": "Apple today released the iOS 13.4.1 update for iPhone SE owners, suggesting ‌iPhone‌ SE models arriving to customers tomorrow will have iOS 13.4 installed and will need a day-one software update.\r\n‌iPhone‌ SE owners can install the new update over-the-air tom… [+870 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Motorola Edge+ unboxing and first impressions - Neowin", "description": "Unboxing and first impressions of Motorola's reentry into the flagship space with the Edge+. It packs a Snapdragon 865 chipset, 12GB RAM, 256GB of UFS 3.0 st...", "url": "https://www.youtube.com/watch?v=OVxig_gFfbc", "urlToImage": null, "publishedAt": "2020-04-23T17:09:54Z", "content": "Unboxing and first impressions of Motorola's reentry into the flagship space with the Edge+. It packs a Snapdragon 865 chipset, 12GB RAM, 256GB of UFS 3.0 storage with Turbo Write, a 108MP main camera, and a 5,000mAh battery."}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Here’s How To Change Your Display Name In VALORANT | TheGamer - TheGamer", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiOWh0dHBzOi8vd3d3LnRoZWdhbWVyLmNvbS9jaGFuZ2UtZGlzcGxheS1uYW1lLWluLXZhbG9yYW50L9IBPWh0dHBzOi8vd3d3LnRoZWdhbWVyLmNvbS9jaGFuZ2UtZGlzcGxheS1uYW1lLWluLXZhbG9yYW50L2FtcC8?oc=5", "urlToImage": null, "publishedAt": "2020-04-23T16:15:44Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Messenger Kids | Greg's Geek Fix - ABC Action News", "description": "Facebook has developed a kid-friendly messaging with important parental controls.", "url": "https://www.youtube.com/watch?v=LQwyzA_3C5I", "urlToImage": null, "publishedAt": "2020-04-23T16:04:07Z", "content": null}, {"source": {"id": null, "name": "Purexbox.com"}, "author": "Pure Xbox", "title": "Phil Spencer Talks Xbox Series X Reveal Plans, Says He's \"Never Been More Excited\" - Pure Xbox", "description": "\"Next step is not too much of a wait\"", "url": "https://www.purexbox.com/news/2020/04/phil_spencer_talks_xbox_series_x_reveal_plans_says_hes_never_been_more_excited", "urlToImage": null, "publishedAt": "2020-04-23T15:35:00Z", "content": "@ShaiHulud Which is exactly my concern. The 360 was meant to be a HD console, and the games ran at 720p or below (and at 30fps). That would be laughable in this gen for a game to run at those specs (outside of the Switch, and even then, some gamers are turnin… [+670 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Tech Desk", "title": "PUBG Mobile Ranked Arena Mode: What’s new, how to play - The Indian Express", "description": "Apart from this new Ranked Arena Mode, the EvoGround game mode selection tab also consists of multiple other game modes, including 4v4 Team Deathmatch mode, Domination, Arena Training, Arctic Mode, RageGear and PayLoad.", "url": "https://indianexpress.com/article/technology/gaming/pubg-mobile-ranked-arena-mode-is-here-6375425/", "urlToImage": null, "publishedAt": "2020-04-23T15:11:28Z", "content": "By: Tech Desk | New Delhi | \r\nUpdated: April 23, 2020 8:33:47 pm\r\nIn this, players will start off with a Bronze rank and with continuous matches can push their ranks all the way up to Ace.Tencent Games has released a new game mode, called the Ranked Arena Mod… [+2724 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Jon Fingas", "title": "Apple Music is available on Samsung Smart TVs - Yahoo News Australia", "description": "Apple Music is coming to TV devices beyond the Apple TV -- it's now available for Samsung sets.", "url": "https://au.news.yahoo.com/apple-music-samsung-smart-tv-140023561.html", "urlToImage": null, "publishedAt": "2020-04-23T14:00:00Z", "content": "You no longer need an Apple TV box to play Apple Music on the big screen in your living room. As of today, Apple Music is available on 2018 and newer Samsung Smart TVs the first time its been available from a TV maker, or any third-party TV media player for t… [+979 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Ethan Gach", "title": "Stop Killing This Poor Fallout 76 Radstag - Kotaku Australia", "description": "There’s a new mutant in town and it’ll lead you to treasure if you’re not a sociopath....", "url": "https://www.kotaku.com.au/2020/04/stop-killing-this-poor-fallout-76-radstag/", "urlToImage": null, "publishedAt": "2020-04-23T14:00:00Z", "content": "Theres a new mutant in town and itll lead you to treasure if youre not a sociopath.\r\nIf youve been playing Fallout 76 since last weeks Wastelanders update went live you may have run into a new type of irradiated deer called an Observant Radstag. Its friendly … [+1191 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Moving Out - The First 18 Minutes of Gameplay - IGN", "description": "Watch the first three levels from the couch-moving co-op game.", "url": "https://www.youtube.com/watch?v=vTXwJGZtixk", "urlToImage": null, "publishedAt": "2020-04-23T12:00:35Z", "content": null}]}