{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Motor1.com"}, "author": "Chris Okula", "title": "This Cayman GT4 Video Could Easily Be A Porsche Ad - Motor1 ", "description": "These are the ads we want to see.", "url": "https://www.motor1.com/news/414779/porsche-cayman-gt4-drive-commercial/", "urlToImage": null, "publishedAt": "2020-04-25T16:27:10Z", "content": "The Porsche Cayman GT4 was an earth-shattering machine when it first debuted in 2016. Here we have the familiar mid-engined Cayman sports car but with an engine from the 911 Carrera S and a GT badge usually reserved for Porches top of the line 911s. The Cayma… [+1584 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "David Nield", "title": "This iOS text code can crash your iPhone - here’s how you can fix it - TechRadar", "description": "It seems protection is coming from Apple too", "url": "https://www.techradar.com/news/watch-out-for-this-text-code-that-can-crash-your-iphone", "urlToImage": null, "publishedAt": "2020-04-25T14:30:00Z", "content": "There's a text message doing the rounds that can crash iPhones or disable the touchscreen, though Apple already seems to be working on a fix the beta version of iOS 13.4.5 appears to add extra protection against the rogue message.\r\nThe damaging string of text… [+1630 chars]"}, {"source": {"id": null, "name": "9to5google.com"}, "author": null, "title": "This week’s top stories: Huawei caught falsifying photos, Google Store refresh, ‘Hey Google’ sensitivity, more - 9to5Google", "description": "Top Stories: Huawei caught claiming DSLR photos were taken on a smartphone, Google Store sees a refresh highlighting Google's hardware brands, and more.", "url": "https://9to5google.com/2020/04/25/top-stories-huawei-falsifying-photos-google-store-refresh/", "urlToImage": null, "publishedAt": "2020-04-25T14:01:43Z", "content": "In this week’s top stories: Huawei was caught claiming DSLR photos were taken on a smartphone, the Google Store sees a refresh highlighting Google’s hardware brands, adjustable “Hey Google” sensitivity outlined, and more.\r\nFiled under bizarre controversy this… [+3260 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "BARDOWN PLAYS PARTY GAMES: SUPER SMASH BROS. ULTIMATE - TSN", "description": "Prior to quarantine, Marissa, Jesse, Eric and Teddy put up their dukes in Super Smash Bros. Ultimate for the Nintendo Switch. Would Jesse's N64 abilities tra...", "url": "https://www.youtube.com/watch?v=utkNuTUD1Js", "urlToImage": null, "publishedAt": "2020-04-25T13:55:43Z", "content": null}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Tech Desk", "title": "WhatsApp: These are the top new features you should know about - The Indian Express", "description": "Here is a list of all the new WhatsApp features that have been added recently.", "url": "https://indianexpress.com/article/technology/social/whatsapp-new-features-6378983/", "urlToImage": null, "publishedAt": "2020-04-25T13:25:49Z", "content": "By: Tech Desk | New Delhi | \r\nUpdated: April 25, 2020 6:50:22 pm\r\nRecently added WhatsApp features that you should know about.WhatsApp is one of the most popular messaging services on the planet with over 2 billion worldwide users. The Facebook-owned platform… [+2585 chars]"}, {"source": {"id": null, "name": "Businessinsider.com.au"}, "author": "Shona Ghosh", "title": "Apple is locked in a power battle with the UK, France, and Germany about how COVID-19 should be tracked - Business Insider Australia", "description": "The UK, France, and Germany are locked in a power battle with Apple and Google over the way COVID-19 should be tracked via apps.", "url": "https://www.businessinsider.com.au/france-uk-apple-contact-tracing-apps-2020-4", "urlToImage": null, "publishedAt": "2020-04-25T13:22:18Z", "content": "<ul><li>\r\nThere’s a power battle between the UK, Germany, and France on one side and Apple and Google on the other about coronavirus contact-tracing.\r\n</li><li>\r\nLike other countries, the UK, Germany, and France are creating apps that will track people who re… [+9617 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": null, "title": "Facebook targets rivals with new video chat platform - Micky News", "description": "Facebook is expanding its offerings with a new video chat feature called Messenger Rooms that is likely to rile its competitors.", "url": "https://micky.com.au/facebook-targets-rivals-with-new-video-chat-platform/", "urlToImage": null, "publishedAt": "2020-04-25T13:11:25Z", "content": "On Friday, April 24, Facebook announced a raft of new features including a video calling platform for up to 50 people called Messenger Rooms.\r\nSince the COVID-19 induced global lockdown, two platforms already offering the same service have seen their usage nu… [+1251 chars]"}, {"source": {"id": null, "name": "Dexerto.com"}, "author": "Connor Bennett", "title": "All Apex Legends Season 5 easter eggs and teasers so far - Dexerto", "description": "Apex Legends Season 5 is already being teased in World's Edge. Here, we take a look at all the easter eggs and hints about the recently delayed season.", "url": "https://www.dexerto.com/apex-legends/all-apex-legends-season-5-easter-eggs-and-teasers-so-far-1357801", "urlToImage": null, "publishedAt": "2020-04-25T12:56:43Z", "content": "Ahead of Apex Legends season five, fans have been noticing a few teasers springing up around World’s Edge and Kings Canyon for a limited time. We’re going to round them up here and take a look at what else is in store.\r\nWith Apex Legends set to turn from seas… [+2141 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "11 Beginners Tips And Tricks XCOM: Chimera Squad Doesn't Tell You - GamingBolt", "description": "Out of nowhere, with little to no fanfare, we have another XCOM game on our hands, and though it might not quite be XCOM 3, Chimera Squad is still pretty dar...", "url": "https://www.youtube.com/watch?v=UHX-Ueq-YUs", "urlToImage": null, "publishedAt": "2020-04-25T12:45:00Z", "content": "Out of nowhere, with little to no fanfare, we have another XCOM game on our hands, and though it might not quite be XCOM 3, Chimera Squad is still pretty darn good. It also represents a pretty big shift for the series, introducing several interesting major ne… [+535 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Simon Parkin", "title": "Streets of Rage 4 review – the return of the beat 'em up - The Guardian", "description": "This lovingly created sequel offers all the action and fun of a 90s arcade game", "url": "https://www.theguardian.com/games/2020/apr/25/streets-of-rage-4-review-the-return-of-the-beat-em-up", "urlToImage": null, "publishedAt": "2020-04-25T12:04:06Z", "content": "In the Netflix animated series Hi Score Girl, a romantic comedy set in early-90s Japan, Haruo Yaguchi, a low-achieving high-school loner is whiling away his time in the local video game arcades when he meets Akira Ono, a popular wunderkind from a wealthy fami… [+4209 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": null, "title": "How to pair Airpods to the Nintendo Switch - Micky News", "description": "The recent patch on the Nintendo Switch provided a workaround feature that allows wireless headsets to be connected to the console.", "url": "https://micky.com.au/how-to-pair-airpods-to-the-nintendo-switch/", "urlToImage": null, "publishedAt": "2020-04-25T10:59:18Z", "content": "The Nintendo Switch doesnt officially support the use of wireless headphones However, a recent system update on the system made a workaround to the problem.\r\nThe Nintendo Switchs 4.0.0 patch added some notable features such as video capturing in selected game… [+2804 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": null, "title": "Big tech companies play crucial role during COVID-19 pandemic - Micky News", "description": "As the world races against the clock to find the cure against COVID-19, big tech companies are also stepping up to their role.", "url": "https://micky.com.au/big-tech-companies-play-crucial-role-during-covid-19-pandemic/", "urlToImage": null, "publishedAt": "2020-04-25T08:44:17Z", "content": "Before the widespread threat of the COVID-19 virus, big tech companies are among the most vilified industries. They are criticized over allegations of unethical data harvesting and tracking users.\r\nRecently, these very same critics are tapping the massive com… [+2510 chars]"}, {"source": {"id": null, "name": "Channelnews.com.au"}, "author": "David Richards", "title": "Was CES 2020 A Super Spreader For COVID-19 After Tens Of Thousands Of Chinese Poured Into The US Event From Wuhan & Hubei Provence. - ChannelNews", "description": null, "url": "https://www.channelnews.com.au/was-ces-2020-a-super-spreader-for-covid-19-after-tens-of-thousands-of-chinese-poured-into-the-us-event-from-wuhan-provence/", "urlToImage": null, "publishedAt": "2020-04-25T08:20:12Z", "content": "One third of CES the world’s biggest Consumer Electronics Show in Las Vegas is Chinese exhibitors and at the 2020 show. tens of thousands of Chinese visitors poured into the event which is now being investigated as a hot spot that helped propel COVID-19 in th… [+3655 chars]"}, {"source": {"id": null, "name": "Nintendolife.com"}, "author": "Nintendo Life", "title": "Random: Cadence Of Hyrule Guitarist Jokingly Petitions For Time Travel Cheater Stamp In Animal Crossing - Nintendo Life", "description": "Insists he was \"just poking some fun\"", "url": "http://www.nintendolife.com/news/2020/04/random_cadence_of_hyrule_guitarist_jokingly_petitions_for_time_travel_cheater_stamp_in_animal_crossing", "urlToImage": null, "publishedAt": "2020-04-25T08:00:00Z", "content": "With the \"filthy\" \"cheater\" pejoratives removed, the general idea isn't 100% bad. Some online players unfamiliar with TTing might wonder why other people's towns online are so far ahead of their own town. So maybe a little (non-pejorative) icon could be added… [+1965 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Matt Espineli", "title": "FF7 Remake Hell House Boss Guide: How To Burn This House To The Ground - GameSpot", "description": "Here's how to defeat the dreaded Hell House during Chapter 9 of FF7 Remake for PS4.", "url": "https://www.gamespot.com/articles/ff7-remake-hell-house-boss-guide-how-to-burn-this-/1100-6476500/", "urlToImage": null, "publishedAt": "2020-04-25T07:52:52Z", "content": "One of the tougher boss fights you'll encounter in Final Fantasy 7 Remake is the Hell House during Chapter 9. If you're not up coming into this one prepared, you're likely to get wiped quick. Below we detail everything you need to know about how to defeat thi… [+4573 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "Brett Wadelton", "title": "Google removes 103 Android apps from the Play Store with 69 million installs - 7NEWS.com.au", "description": "What actually happens is that most of these apps continue to run in the background and serve the user’s phone with intrusive ads.", "url": "https://7news.com.au/technology/google-removes-103-android-apps-from-the-play-store-with-69-million-installs-c-997272", "urlToImage": null, "publishedAt": "2020-04-25T07:27:42Z", "content": "Google has removed a whopping 103 apps from Androids Play Store after they were found bypass security checks, contain adware and descriptions that were deemed to be misleading.\r\nMore alarmingly is the amount of installs that these apps had accumulated.\r\nThese… [+7517 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Oppo Find X2 Pro camera review - GSMArena Official", "description": "ALL YOU NEED TO KNOW about the Find X2 Pro's camera performance in a dedicated video full of camera samples and the occasional comparison vs. the Galaxy S20 ...", "url": "https://www.youtube.com/watch?v=rbo4mQ874fc", "urlToImage": null, "publishedAt": "2020-04-25T06:18:47Z", "content": "ALL YOU NEED TO KNOW about the Find X2 Pro's camera performance in a dedicated video full of camera samples and the occasional comparison vs. the Galaxy S20 Ultra. \r\nOur full Find X2 Pro video review: https://www.youtube.com/watch?v=LPCqf...\r\nTo learn more, r… [+288 chars]"}, {"source": {"id": null, "name": "Pickr.com.au"}, "author": "Leigh :) Stark", "title": "Hisense looks to size, quality for 4K TVs in 2020 - Pickr", "description": "Democratising TV technology and making tellies affordable for all, Hisense is cleaning the range in 2020 and pulling back to two, with the choice down to size.", "url": "https://www.pickr.com.au/news/2020/hisense-looks-to-size-quality-for-4k-tvs-in-2020/", "urlToImage": null, "publishedAt": "2020-04-25T05:53:35Z", "content": "Democratising TV technology and making tellies affordable for all, Hisense is cleaning the range in 2020 and pulling back to two, with the choice down to size. \r\nIt’s not just Samsung and LG showing off their latest TVs, because it’s TV changeover season, whi… [+4671 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Desire Athow", "title": "This AMD Ryzen notebook deal is probably the best we've ever seen - TechRadar", "description": "Lenovo and AMD provide a glimpse into the future", "url": "https://www.techradar.com/news/this-amd-ryzen-laptop-is-the-probably-the-best-notebook-deal-ever", "urlToImage": null, "publishedAt": "2020-04-25T03:00:00Z", "content": "We reviewers are used to obsessing over incremental technology changes, but every now and then a supernova appears on our radar - something that can single handedly change the status quo.\r\nThe AMD Ryzen 4000 family is one such supernova and promises to bring … [+1829 chars]"}, {"source": {"id": null, "name": "Dexerto.com"}, "author": "Paul Cot", "title": "Pokemon Go Abra Community Day is live - All the details - Dexerto", "description": "Everything you need to know about the Pokemon Go Abra Community day - How strong is Alakazam and what does the special research entail.", "url": "https://www.dexerto.com/pokemon/pokemon-go-abra-community-day-all-details-1339816", "urlToImage": null, "publishedAt": "2020-04-25T02:31:48Z", "content": "After a failed attempt last month, the Pokemon Go March (or is it April) Community Day has been rescheduled for April 25. For the first time, there's a Community Day special research event to look forward to as well.\r\nThe announcement of Abra as the headliner… [+4741 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Oscar Gonzalez", "title": "Travis Scott event in Fortnite: How to watch the encore and find the Giant Astro Heads - CNET", "description": "The rapper dropped new tracks in a jaw-dropping concert. Catch the next show at midnight.", "url": "https://www.cnet.com/news/travis-scott-event-in-fortnite-how-to-watch-the-encore-and-find-the-giant-astro-heads/", "urlToImage": null, "publishedAt": "2020-04-25T01:02:37Z", "content": "Play some Fortnite and listen to a new track from Travis Scott.\r\nEpic Games\r\nFortnite events aren't only for players to check out new content from developer Epic Games. The popular battle royale game has also played host to multiple premieres and collaboratio… [+3718 chars]"}, {"source": {"id": null, "name": "Ubergizmo.com"}, "author": "Tyler Lee", "title": "Samsung’s Smartwatches Get A New Blood Pressure Monitoring App - Ubergizmo", "description": "Our smartwatches are getting better at what they do, where they can monitor more than just our daily activities like our steps taken, calories burnt, and so on. For example, the Apple Watch comes with an ECG monitoring tool that can alert the wearer if there …", "url": "https://www.ubergizmo.com/2020/04/samsung-smartwatch-blood-pressure-monitor/", "urlToImage": null, "publishedAt": "2020-04-25T00:42:49Z", "content": "Our smartwatches are getting better at what they do, where they can monitor more than just our daily activities like our steps taken, calories burnt, and so on. For example, the Apple Watch comes with an ECG monitoring tool that can alert the wearer if there … [+1254 chars]"}, {"source": {"id": null, "name": "Venturebeat.com"}, "author": "Jeff Grubb", "title": "How Xbox Game Pass freed The Coalition to make Gears Tactics for PC - VentureBeat", "description": "Gears Tactics is the next big first-party Microsoft launch for Xbox Game Pass. Developer The Coalition made the game in part because of Game Pass.", "url": "https://venturebeat.com/2020/04/24/gears-tactics-xbox-game-pass/", "urlToImage": null, "publishedAt": "2020-04-24T23:33:30Z", "content": "Gears Tactics is launching April 28 for Windows 10, Xbox Game Pass for PC, and Steam. On How Games Make Money this week, host Jeff Grubb sits down to talk with The Coalition operations director Mike Crump and Xbox marketing general manager Ben Decker about th… [+4308 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": "www.facebook.com/christian.n.puno", "title": "Samsung merges Apple Music with smart TVs - Micky News", "description": "People showed excitement when Itunes arrived in Smart TVs. Samsung started putting their entertainment to a whole new level last year.", "url": "https://micky.com.au/samsung-merges-apple-music-with-smart-tvs/", "urlToImage": null, "publishedAt": "2020-04-24T22:45:00Z", "content": "Samsung announced its partnership with Apple Music. One hundred million countries will enjoy the innovative combination.\r\nApple Music in Samsung TVs\r\nApple Music subscribers can enjoy playing and streaming their music. They can now use these features in their… [+2785 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": "www.facebook.com/christian.n.puno", "title": "Ford Mustang Cobra Jet 1400: Time for electric cars to take the limelight - Micky News", "description": "Time for electric cars to take limelight, Ford mechanics and scientists took this further. The result? 'Ford Mustang Cobra Jet 1400'", "url": "https://micky.com.au/ford-mustang-cobra-jet-1400-time-for-electric-cars-to-take-the-limelight/", "urlToImage": null, "publishedAt": "2020-04-24T22:43:00Z", "content": "The Ford Mustang Cobra Jet 1400 isnt a typical electric car. This cars creation coincided with drag racing in mind. Imagine how much electrical power it needs to go on such high speed. According to its creators, this monster car can reach a fourth of a mile w… [+2234 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Nathan Grayson", "title": "Valorant Twitch Streamers Are Gaming The System With 24/7 Streams That Rack Up Viewers - Kotaku Australia", "description": "If you take a look at many of Twitch’s top Valorant streams right now, you’ll note that they claim to be running “24/7.” This might strike you as odd, given that human beings generally need to eat, sleep, and all that fancy, life-sustaining jazz. Most of thes…", "url": "https://www.kotaku.com.au/2020/04/valorant-twitch-streamers-are-gaming-the-system-with-247-streams-that-rack-up-viewers/", "urlToImage": null, "publishedAt": "2020-04-24T22:10:00Z", "content": "If you take a look at many of Twitchs top Valorant streams right now, youll note that they claim to be running 24/7. This might strike you as odd, given that human beings generally need to eat, sleep, and all that fancy, life-sustaining jazz. Most of these st… [+9348 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Logitech G G203 LIGHTSYNC Promo Video - Techaeris", "description": "This is an overview of the new Logitech G G203 LIGHTSYNC Gaming Mouse. The video was provided by Logitech for resharing. Available in May buy here: https://w...", "url": "https://www.youtube.com/watch?v=i3_Ale_138I", "urlToImage": null, "publishedAt": "2020-04-24T21:57:36Z", "content": null}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "Nintendo Announces 160000 Switch Account Attack - Somag News", "description": "Japan-based video game giant Nintendo has announced that it has been attacked by cyber. The company, which reported that 160,000 Nintendo accounts were affected by the hacking initiative, announced that it has disabled the ability to log into the Nintendo Acc…", "url": "https://www.somagnews.com/nintendo-announces-160000-switch-account-attack/", "urlToImage": null, "publishedAt": "2020-04-24T20:24:00Z", "content": "Japan-based video game giant Nintendo has announced that it has been attacked by cyber. The company, which reported that 160,000 Nintendo accounts were affected by the hacking initiative, announced that it has disabled the ability to log into the Nintendo Acc… [+2096 chars]"}, {"source": {"id": null, "name": "Caradvice.com.au"}, "author": "Justin Narayan", "title": "Ford Mustang crowned the most successful sports car of 2019 - CarAdvice", "description": "America just wasn’t enough for the original pony car. The Ford Mustang has officially gone global. Last year saw the Mustang rise to the top of the sports car world, with recognition from fans from...", "url": "https://www.caradvice.com.au/845186/ford-mustang-crowned-the-most-successful-sports-car-of-2019/", "urlToImage": null, "publishedAt": "2020-04-24T20:05:00Z", "content": "More than 100,000 Mustangs were sold globally last year. Even though sales have waned in Australia, it remains one of Ford's most popular models.\r\nAmerica just wasn’t enough for the original pony car. The Ford Mustang has officially gone global.\r\nLast year sa… [+1907 chars]"}, {"source": {"id": null, "name": "Otakukart.com"}, "author": null, "title": "Arch-Tempered Namielle Release Date and All You Need To Know - OtakuKart", "description": "Monster Hunter Iceborne, which was recently launched on PC, has its latest update dropping soon called Title Update 13.5. The latest update is to be available o", "url": "https://otakukart.com/113224/arch-tempered-namielle-release-date-and-all-you-need-to-know/", "urlToImage": null, "publishedAt": "2020-04-24T20:00:15Z", "content": "Monster Hunter Iceborne, which was recently launched on PC, has its latest update dropping soon called Title Update 13.5. The latest update is to be available on PS4, Xbox One, and PC soon! Two new monster variants are to be introduced in the Title Update 13.… [+3073 chars]"}, {"source": {"id": null, "name": "Lifehacker.com.au"}, "author": "David Murphy", "title": "Are You Charging Your MacBook On The Wrong Side? - Lifehacker Australia", "description": "Yes, you read that headline correctly. There is apparently a “right” way and a “wrong” way to connect devices to a MacBook with Thunderbolt/USB-C ports on both sides. Doing it wrong can affect your computer’s performance....", "url": "https://www.lifehacker.com.au/2020/04/are-you-charging-your-macbook-on-the-wrong-side/", "urlToImage": null, "publishedAt": "2020-04-24T19:30:00Z", "content": "Yes, you read that headline correctly. There is apparently a right way and a wrong way to connect devices to a MacBook with Thunderbolt/USB-C ports on both sides. Doing it wrong can affect your computers performance.\r\nI recently encountered this knowledge on … [+3969 chars]"}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "Microsoft Begins Showing Edge Ads in Outlook.com - Somag News", "description": "US technology giant Microsoft has begun to run ads with download links on the email service Outlook.com for its new Chromium-based Microsoft Edge browser, which it launched earlier this year. Edge recently managed to be the second most popular internet browse…", "url": "https://www.somagnews.com/microsoft-begins-showing-edge-ads-outlook-com/", "urlToImage": null, "publishedAt": "2020-04-24T19:22:00Z", "content": "US technology giant Microsoft has begun to run ads with download links on the email service Outlook.com for its new Chromium-based Microsoft Edge browser, which it launched earlier this year. Edge recently managed to be the second most popular internet browse… [+1516 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Valve Source Code LEAKED - Hot off the Press Start #34 - GameFront", "description": "Support us on Patreon! - https://www.patreon.com/gamefront - James is back once more with the latest gaming news, including more bad news for GeForce Now, ju...", "url": "https://www.youtube.com/watch?v=D37UfGQ1x1o", "urlToImage": null, "publishedAt": "2020-04-24T18:47:41Z", "content": "Support us on Patreon! - https://www.patreon.com/gamefront - James is back once more with the latest gaming news, including more bad news for GeForce Now, justice for Warzone cheaters, and the source code for Team Fortress 2 and CS:GO leaking online.\r\n#GeForc… [+287 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Valentina Palladino", "title": "The best deals we found this week: the iPad, Google Nest WiFi and more - Yahoo Finance Australia", "description": "The best deals from this week include the base, 10.2-inch iPad for $300, a Nest WiFi bundle for $200, and $100 off the Apple Watch Series 5.", "url": "https://au.finance.yahoo.com/news/weekly-deals-ipad-google-nest-wifi-172049113.html", "urlToImage": null, "publishedAt": "2020-04-24T17:20:00Z", "content": "Nows a great time to buy an Apple or a Google product. This week brought a number of deals on wearables, smartphones, smart home products and other devices from the two tech giants. You can still get $30 off the base iPad and $100 off an Apple Watch Series 5.… [+7041 chars]"}, {"source": {"id": null, "name": "Lifehacker.com.au"}, "author": "Brendan Hesse", "title": "Don't Let Microsoft Word Judge You For Using Two Spaces Between Sentences - Lifehacker Australia", "description": "Microsoft has taken an official stance on one of the internet’s most divisive questions, firmly coming down on the side of minimalism in the “one-space versus two-spaces after a sentence” debate. Word’s automatic spelling and grammar checker will now flag any…", "url": "https://www.lifehacker.com.au/2020/04/dont-let-microsoft-word-judge-you-for-using-two-spaces-between-sentences/", "urlToImage": null, "publishedAt": "2020-04-24T17:15:00Z", "content": "Microsoft has taken an official stance on one of the internets most divisive questions, firmly coming down on the side of minimalism in the one-space versus two-spaces after a sentence debate. Words automatic spelling and grammar checker will now flag anythin… [+1903 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": null, "title": "Microsoft’s Windows 10 update causes blue screen of death and missing files - Micky News", "description": "Windows 10's latest update seemed to create more trouble, instead of bringing in solution to the current issues,", "url": "https://micky.com.au/microsofts-windows-10-update-causes-blue-screen-of-death-and-missing-files/", "urlToImage": null, "publishedAt": "2020-04-24T16:29:00Z", "content": "Window’s 10’s recently released cumulative update with security fixes brought Microsoft customers to more serious problems. The ranting users complained about their devices ending up in BSOD after installing the latest update.\r\nOn April 14, Microsoft released… [+3135 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "iPhone SE review, Canon EOS R5 new specs and Surface Pro 8 rumors | Noise Cancelling Podcast 008 - TechRadar", "description": "More tech news and painfully honest reviews from Gareth and Sherri as they’re joined by two new voices: Kimberly Gedeon of Laptop Mag and TechRadar Cameras e...", "url": "https://www.youtube.com/watch?v=bPYeSWVgSXw", "urlToImage": null, "publishedAt": "2020-04-24T15:00:19Z", "content": "More tech news and painfully honest reviews from Gareth and Sherri as theyre joined by two new voices: Kimberly Gedeon of Laptop Mag and TechRadar Cameras editor, Mark Wilson. \r\nTOPIC TIMESTAMPS03:52 - Canon EOS R508:36 - PS5 Robot Friends12:46 - Surface Pro … [+992 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Future Games Show Announcement Trailer - Coming June 2020 - GamesRadar", "description": "See the most exciting console, mobile and streaming games of 2020 in one show with a mixture of exclusives, deep dives and developer interviews. Coming June ...", "url": "https://www.youtube.com/watch?v=DbLFsALqD_0", "urlToImage": null, "publishedAt": "2020-04-24T15:00:12Z", "content": "See the most exciting console, mobile and streaming games of 2020 in one show with a mixture of exclusives, deep dives and developer interviews. Coming June 2020.Subscribe to Gamesradar: http://goo.gl/cnjsn1"}, {"source": {"id": null, "name": "9to5mac.com"}, "author": "Freddie Crowder", "title": "Touchscreen Mac virtue is not demonstrated by Magic Keyboard - Mash Viral", "description": "Apple famously suggests no a thousand instances for each individual time it says certainly, and if there’s a single matter the enterprise has been declaring “no” to more often than anything at all else, it is a touchscreen Mac. But some are suggesting that th…", "url": "https://9to5mac.com/2020/04/24/this-is-not-a-touchscreen-mac/", "urlToImage": null, "publishedAt": "2020-04-24T14:42:48Z", "content": "Apple famously suggests no a thousand instances for each individual time it says certainly, and if theres a single matter the enterprise has been declaring no to more often than anything at all else, it is a touchscreen Mac.\r\nBut some are suggesting that the … [+4034 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Christine Fisher", "title": "Telegram promises secure group video calls sometime this year - Yahoo Finance Australia", "description": "Telegram says it will add secure group video calls in 2020.", "url": "https://au.finance.yahoo.com/news/telegram-secure-group-video-calls-142035892.html", "urlToImage": null, "publishedAt": "2020-04-24T14:20:00Z", "content": "Now that the coronavirus pandemic has made video calls increasingly popular and critical, services like Zoom, Google Meet, WhatsApp and Telegram are vying for attention. Telegram seems to think it can get ahead by focusing on security. Today, the messaging ap… [+1329 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "HERE WeGo maps and navigation is now available on the Huawei AppGallery - XDA Developers", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiWWh0dHBzOi8vd3d3LnhkYS1kZXZlbG9wZXJzLmNvbS9oZXJlLXdlZ28tbWFwcy1hbmQtbmF2aWdhdGlvbi1odWF3ZWktYXBwZ2FsbGVyeS1hdmFpbGFibGUv0gFdaHR0cHM6Ly93d3cueGRhLWRldmVsb3BlcnMuY29tL2hlcmUtd2Vnby1tYXBzLWFuZC1uYXZpZ2F0aW9uLWh1YXdlaS1hcHBnYWxsZXJ5LWF2YWlsYWJsZS9hbXAv?oc=5", "urlToImage": null, "publishedAt": "2020-04-24T12:58:55Z", "content": null}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Darren Allan", "title": "Nvidia’s reportedly ordering 5nm chips for a ‘mystery’ product - TechRadar", "description": "As it ups orders on 7nm, hopefully indicating RTX 3000 GPUs are still on track", "url": "https://www.techradar.com/news/nvidias-reportedly-ordering-5nm-chips-for-a-mystery-product", "urlToImage": null, "publishedAt": "2020-04-24T12:54:00Z", "content": "Nvidia is making something using a 5nm process, according to the rumor mill, although its anyones guess what that hardware could be.\r\nThis comes from a DigiTimes report about how chipmaker TSMC is benefiting from a ramp-up in orders from Nvidia and AMD, and a… [+1260 chars]"}, {"source": {"id": null, "name": "Happygamer.com"}, "author": "Joshua Goodpastor", "title": "Minimal Affect Is A New Parody Action RPG That Pays Homage To Some Of The Greatest Sci-Fi Movies And Games In One Small Package - Happy Gamer", "description": "Toadman Studios has entered the dangerous world of parody and announced its upcoming game Minimal Affect. This is an obvious parody on the title of...", "url": "https://happygamer.com/minimal-affect-is-a-new-parody-action-rpg-that-pays-homage-to-some-of-the-greatest-sci-fi-movies-and-games-in-one-small-package-63649/", "urlToImage": null, "publishedAt": "2020-04-24T10:52:12Z", "content": "Toadman Studios has entered the dangerous world of parody and announced its upcoming game Minimal Affect. This is an obvious parody on the title of the famous Mass Effect series, but quick observation shows that this game spans much more than one franchise.\r\n… [+2256 chars]"}, {"source": {"id": null, "name": "Happygamer.com"}, "author": "Joshua Goodpastor", "title": "SoundSelf: A Technodelic Is A Unique Soundbased VR Experience Now Availiable For Both PC And Mac VR Systems - Happy Gamer", "description": "Andromeda Entertainment has announced a unique video game experience in an immersive VR world. SoundSelf: A Technodelic is a unique and entrancing...", "url": "https://happygamer.com/soundself-a-technodelic-is-a-unique-soundbased-vr-experience-now-availiable-for-both-pc-and-mac-vr-systems-63644/", "urlToImage": null, "publishedAt": "2020-04-24T09:42:12Z", "content": "Andromeda Entertainment has announced a unique video game experience in an immersive VR world. SoundSelf: A Technodelic is a unique and entrancing experience that takes players on a meditative journey. The game is controlled using your own voice as you hum an… [+2237 chars]"}, {"source": {"id": null, "name": "Who.com.au"}, "author": null, "title": "Brendon Fevola slammed for promoting gambling game - Who", "description": "Brendan Fevola and love island star Dom Thomas has been heavily criticised for promoting an online poker machine game.", "url": "https://www.who.com.au/brendon-fevola-slammed-for-promoting-gambling-game", "urlToImage": null, "publishedAt": "2020-04-24T06:17:00Z", "content": "Reforemed gambler Brendan Fevola has been slammed for promoting a slot machine app.\r\n'This awful game being promoted by Dom Thomas and Brendan Fevola is a gateway to gambling addiction and a very real concern with so many of us staying at home during the COVI… [+740 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Leah Williams", "title": "Animal Crossing Adds The Worst Character Ever - Kotaku Australia", "description": "Animal Crossing: New Horizons' recent update reintroduced a familiar face to the Animal Crossing universe. Redd, a fox art dealer is now a special guest character that can appear on your island. He sells intricate art pieces on his rickety boat, but be warned…", "url": "https://www.kotaku.com.au/2020/04/animal-crossing-new-horizons-redd-artworks/", "urlToImage": null, "publishedAt": "2020-04-24T05:33:00Z", "content": "Animal Crossing: New Horizons' recent update reintroduced a familiar face to the Animal Crossing universe. Redd, a fox art dealer is now a special guest character that can appear on your island. He sells intricate art pieces on his rickety boat, but be warned… [+3016 chars]"}, {"source": {"id": null, "name": "Dailymercury.com.au"}, "author": "Grant Edwards", "title": "BMW returns to the original performance flavour - Daily Mercury", "description": "After a diversion from the native recipe, BMW has rediscovered its performance mojo with the 3 Series.", "url": "https://www.dailymercury.com.au/news/bmw-returns-to-the-original-performance-flavour/4002041/", "urlToImage": null, "publishedAt": "2020-04-24T05:28:00Z", "content": "Once BMWs bread and butter, the 3 Series of the new millennium had a tendency to be bland.\r\nGood to drive, yes. Hard to fault, absolutely. But there was little to inspire or excite.\r\nThe compact sedan was lost in a sea of SUVs and swoopy-backed offshoots.\r\nGl… [+4988 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": null, "title": "The Music of Resident Evil 3: A remake of sight and sound - ABC News", "description": "Indulge in a little nostalgia as Game Show features music from new revitalisations of video games from the 90s and early 2000s.", "url": "https://www.abc.net.au/classic/programs/game-show/resident-evil-3/12162076", "urlToImage": null, "publishedAt": "2020-04-24T05:00:00Z", "content": "The 1990s featured many games still beloved and celebrated today for their compelling stories, memorable gameplay, and incredible soundtracks. \r\nSome are remembered for how they pushed against the hardware limitations of the time, while others turned those li… [+1436 chars]"}, {"source": {"id": null, "name": "Gadgetguy.com.au"}, "author": null, "title": "Review: Malwarebytes Privacy – a new paid VPN provider - GadgetGuy", "description": "Malwarebytes Privacy is a new VPN (virtual private network) from the same company that has one of, if not the best malware detection and removal solutions Malwarebytes Privacy", "url": "https://www.gadgetguy.com.au/product/malwarebytes-privacy-a-new-paid-vpn-provider/", "urlToImage": null, "publishedAt": "2020-04-24T03:46:22Z", "content": "Malwarebytes Privacy a new paid VPN provider\r\nMalwarebytes Privacy is a new VPN (virtual private network) from the same company that has one of, if not the best malware detection and removal solutions on the planet.\r\nWhile I trust Norton Lifelock, McAfee and … [+2950 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "", "title": "Isolation item earns Aussie $150k in 7 mins - Noosa News", "description": "While coronavirus has had a catastrophic effect, the sudden change to everyday life has meant Aussies are spending their cash in unexpected places.", "url": "https://www.news.com.au/lifestyle/fitness/aussie-makes-150k-in-seven-minutes-off-new-isolation-musthave/news-story/764ecc100b4c25fb218aff38a227eeeb", "urlToImage": null, "publishedAt": "2020-04-24T01:43:00Z", "content": "While coronavirus has had a catastrophic effect on many businesses, the sudden change to everyday life has meant Aussies are spending their cash in unexpected places.\r\nJust ask Matilda Murray, who co-owns fitness apparel brand Stax with Don Robertson.\r\nShe sa… [+3919 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Red Dead Redemption 2 Joins Game Pass | Save State - GameSpot", "description": "Persia brings you all the biggest gaming stories for your April 23 Save State. Red Dead Redemption 2 is coming to Xbox One's Game Pass on May 7 and is alread...", "url": "https://www.youtube.com/watch?v=AZzzSV-F_B8", "urlToImage": null, "publishedAt": "2020-04-24T01:00:02Z", "content": "Persia brings you all the biggest gaming stories for your April 23 Save State. Red Dead Redemption 2 is coming to Xbox One's Game Pass on May 7 and is already available for pre-download. It will also include Red Dead Online. GTA V will be leaving the service … [+447 chars]"}, {"source": {"id": null, "name": "Press-start.com.au"}, "author": "Shannon Grixti", "title": "The First Three Seasons Of Sailor Moon Have Been Put On YouTube For Free - Press Start Australia", "description": "Crunchyroll has announced that they'll be putting the first three seasons of Sailor Moon onto YouTube starting today. As of now, the first 10 episodes have dropped and a further 10 episodes will drop each Friday until July. These episodes are from Sailor Moon…", "url": "https://press-start.com.au/news/2020/04/24/the-first-three-seasons-of-sailor-moon-have-been-put-on-youtube-for-free/", "urlToImage": null, "publishedAt": "2020-04-24T00:56:27Z", "content": "Crunchyroll has announced that they’ll be putting the first three seasons of Sailor Moon onto YouTube starting today.\r\nAs of now, the first 10 episodes have dropped and a further 10 episodes will drop each Friday until July. These episodes are from Sailor Moo… [+181 chars]"}, {"source": {"id": null, "name": "Gizmodo.com.au"}, "author": "Tegan Jones", "title": "Apple's iPhone SE: Every Phone Plan In Australia - Gizmodo Australia", "description": "Apple mic-dropped the mobile world last week by unveiling a brand new iPhone SE for just $749. Not only that, even the most expensive version of the mid-range phone still comes in at under $1000. The phone is on sale today, and every major Aussie telco is on …", "url": "https://www.gizmodo.com.au/2020/04/iphone-se-australian-phone-plans-telstra-optus-vodafone/", "urlToImage": null, "publishedAt": "2020-04-24T00:05:00Z", "content": "Apple mic-dropped the mobile world last week by unveiling a brand new iPhone SE for just $749. Not only that, even the most expensive version of the mid-range phone still comes in at under $1000. The phone is on sale today, and every major Aussie telco is on … [+4648 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Travis Scott's Astroworld Concert Live on Fortnite with 100 Thieves | HYPEBEAST Exclusive - HYPEBEAST", "description": "JUMP STRAIGHT TO CONCERT AT: 36:34 NEW SONG AT: 44:23 Watch Travis Scott's Astroworld concert live on Fortnite with Ceice from 100 Thieves for a HYPEBEAST ex...", "url": "https://www.youtube.com/watch?v=XgeRLTx_qqc", "urlToImage": null, "publishedAt": "2020-04-24T00:00:53Z", "content": "JUMP STRAIGHT TO CONCERT AT: 36:34NEW SONG AT: 44:23\r\nWatch Travis Scott's Astroworld concert live on Fortnite with Ceice from 100 Thieves for a HYPEBEAST exclusive.\r\nFor up-to-date news and more: http://HYPEBEAST.com\r\nSubscribe to our channel: https://www.yo… [+241 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": "Bloomberg News", "title": "Apple's 2021 MacBook to drop Intel for Apple-designed chip - Executive Traveller", "description": "The new processors will be based on the iPhone and iPad chips, but much more powerful.", "url": "https://www.bloomberg.com/news/articles/2020-04-23/apple-aims-to-sell-macs-with-its-own-chips-starting-in-2021", "urlToImage": null, "publishedAt": "2020-04-23T23:49:46Z", "content": "Apple plans to start selling Mac computers with its own main processors by next year, relying on designs that helped popularize the iPhone and iPad, according to people familiar with the matter.\r\nThe technology giant is working on three of its own Mac process… [+5847 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Leah Williams", "title": "Steam's Weekend Deals Feature Some Must-Have Indies - Kotaku Australia", "description": "Every weekend lately, Steam has been spotlighting sales from indie developers. This weekend, it's Annapurna Interactive's turn — and there's a bunch of fantastic games on sale that come highly recommended....", "url": "https://www.kotaku.com.au/2020/04/steam-weekend-indie-sale/", "urlToImage": null, "publishedAt": "2020-04-23T23:33:00Z", "content": "Every weekend lately, Steam has been spotlighting sales from indie developers. This weekend, it's Annapurna Interactive's turn and there's a bunch of fantastic games on sale that come highly recommended.\r\nEmotional family tale What Remains of Edith Finch lead… [+2320 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Leah Williams", "title": "Horizon Zero Dawn 2 Rumours Spread After Developers Delete A Tweet - Kotaku Australia", "description": "In a now-deleted tweet, Horizon Zero Dawn developers Guerilla Games listed a job posting for a Senior AI Programmer that included the hashtag #ps5. It's kicked off speculation that the team could be working on an exclusive PlayStation 5 sequel for the much-lo…", "url": "https://www.kotaku.com.au/2020/04/horizon-zero-dawn-2-rumours/", "urlToImage": null, "publishedAt": "2020-04-23T23:31:00Z", "content": "In a now-deleted tweet, Horizon Zero Dawn developers Guerilla Games listed a job posting for a Senior AI Programmer that included the hashtag #ps5. It's kicked off speculation that the team could be working on an exclusive PlayStation 5 sequel for the much-lo… [+2268 chars]"}, {"source": {"id": null, "name": "Lifehacker.com.au"}, "author": "David Murphy", "title": "How To Customise Your Background In Skype Video Calls - Lifehacker Australia", "description": "There’s little I enjoy more than a the well-executed use of a silly background in a video chat. While this quirky feature used to be exclusive to Zoom, more apps are integrating the functionality—including, recently, Microsoft Teams, and now, Microsoft’s own …", "url": "https://www.lifehacker.com.au/2020/04/how-to-customize-your-background-in-skype-video-calls/", "urlToImage": null, "publishedAt": "2020-04-23T23:30:00Z", "content": "Theres little I enjoy more than a the well-executed use of a silly background in a video chat. While this quirky feature used to be exclusive to Zoom, more apps are integrating the functionalityincluding, recently, Microsoft Teams, and now, Microsofts own Sky… [+1265 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Nathan Grayson", "title": "You Can Finally Apologise For Being Trash In Overwatch - Kotaku Australia", "description": "Who doesn’t love voice lines in Overwatch? They let you say hello. They can help your teammates stay abreast of your ultimate percentage. If you play DPS, you can use them to spam messages about how you need healing until everybody else’s ears seal closed lik…", "url": "https://www.kotaku.com.au/2020/04/you-can-finally-apologize-for-being-trash-in-overwatch/", "urlToImage": null, "publishedAt": "2020-04-23T23:30:00Z", "content": "Who doesnt love voice lines in Overwatch? They let you say hello. They can help your teammates stay abreast of your ultimate percentage. If you play DPS, you can use them to spam messages about how you need healing until everybody elses ears seal closed like … [+2085 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: 'Our wedding is cancelled but we still have to pay' - BBC News", "description": "Venues are forcing couples to pay big cancellation fees for weddings delayed by the lockdown.", "url": "https://www.bbc.com/news/business-52400441", "urlToImage": null, "publishedAt": "2020-04-23T23:12:17Z", "content": "Media caption'We've saved so hard for so long for it, it's beyond belief almost'\r\nBrides and grooms say they are being charged thousands of pounds in cancellation and postponement fees for weddings that can't go ahead because of the coronavirus lockdown. \r\nWh… [+7995 chars]"}, {"source": {"id": null, "name": "Ausdroid.net"}, "author": null, "title": "Google rolling out Android 11 DP3 to various Pixel phones today - Ausdroid", "description": "This year Google’s developer previews for Android 11 has been not just premonitions for Android 11 but also for Pixel phones this year with some of the new features we are seeing in developer previews making it into stable Android 10 builds on a monthly basis…", "url": "https://ausdroid.net/2020/04/24/google-rolling-out-android-11-dp3-to-various-pixel-phones-today/", "urlToImage": null, "publishedAt": "2020-04-23T22:48:14Z", "content": "This year Google’s developer previews for Android 11 has been not just premonitions for Android 11 but also for Pixel phones this year with some of the new features we are seeing in developer previews making it into stable Android 10 builds on a monthly basis… [+1551 chars]"}, {"source": {"id": null, "name": "Kotaku.com"}, "author": "Ian Walker", "title": "Binding Of Isaac Mod Helps Woman Propose To Her Significant Other - Kotaku", "description": "I’ve never proposed to anybody, but I can imagine it would be pretty anxiety-provoking. I totally understand why some folks prefer to let their favorite video games do the talking. Last week, an Australian woman sat her significant other down to play a modded…", "url": "https://kotaku.com/binding-of-isaac-mod-helps-woman-propose-to-her-signifi-1843029000", "urlToImage": null, "publishedAt": "2020-04-23T21:15:37Z", "content": "Ive never proposed to anybody, but I can imagine it would be pretty anxiety-provoking. I totally understand why some folks prefer to let their favorite video games do the talking. Last week, an Australian woman sat her significant other down to play a modded … [+2707 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Oscar Gonzalez", "title": "Call of Duty Warzone: Cheaters punished, new modes and everything else you need to know - CNET", "description": "Drop in and survive the 150-player battle royale match.", "url": "https://www.cnet.com/news/call-of-duty-warzone-cheaters-punished-new-modes-and-everything-else-you-need-to-know/", "urlToImage": null, "publishedAt": "2020-04-23T20:54:57Z", "content": "Don't expect to build any forts in Warzone.\r\nActivision\r\nCall of Duty: Warzone is the upcoming battle royale mode for the popular military FPS game. Similar to games like Fortnite and Apex Legends, players will compete against other players to survive until t… [+5699 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Here's What You Need to Know About the NEW Sonos Radio Service - GetConnected Media", "description": "https://getconnectedmedia.com - Sonos Radio is arriving in Canada. The FREE ad-supported service is available exclusively to Sonos users and ties together ov...", "url": "https://www.youtube.com/watch?v=-dq1aWvaCtQ", "urlToImage": null, "publishedAt": "2020-04-23T20:52:48Z", "content": "https://getconnectedmedia.com - Sonos Radio is arriving in Canada. The FREE ad-supported service is available exclusively to Sonos users and ties together over 60,000 radio stations from around the world. This dedicated experience offers better categorization… [+1550 chars]"}, {"source": {"id": null, "name": "Gamesradar.com"}, "author": "Connor Sheridan", "title": "Xbox now lets you donate your Rewards points to 3 COVID-19 charities - GamesRadar+ AU", "description": "Microsoft will donate $1 for every 1,000 Rewards points", "url": "https://www.gamesradar.com/xbox-now-lets-you-donate-your-rewards-points-to-3-covid-19-charities/", "urlToImage": null, "publishedAt": "2020-04-23T18:34:15Z", "content": "You can now donate the Rewards points you earn by playing Xbox to your choice of three COVID-19 related charities.\r\nMicrosoft started giving players the option to donate their Microsoft Rewards points to the CDC Foundation earlier this month, and the company … [+1460 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Fortnite: How to Visit the Agency, Hayman, and Greasy Graves in A Single Match - GameRant", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiP2h0dHBzOi8vZ2FtZXJhbnQuY29tL2ZvcnRuaXRlLXZpc3QtYWdlbmN5LWhheW1hbi1ncmVhc3ktZ3JhdmVzL9IBQ2h0dHBzOi8vZ2FtZXJhbnQuY29tL2ZvcnRuaXRlLXZpc3QtYWdlbmN5LWhheW1hbi1ncmVhc3ktZ3JhdmVzL2FtcC8?oc=5", "urlToImage": null, "publishedAt": "2020-04-23T18:26:28Z", "content": null}, {"source": {"id": null, "name": "Macrumors.com"}, "author": "Juli Clover", "title": "Apple Releases iOS 13.4.1 for iPhone SE Ahead of Launch - MacRumors", "description": "Apple today released the iOS 13.4.1 update for iPhone SE owners, suggesting iPhone SE models arriving to customers tomorrow will have iOS 13.4...", "url": "https://www.macrumors.com/2020/04/23/apple-releases-ios-13-4-1-for-iphone-se/", "urlToImage": null, "publishedAt": "2020-04-23T17:26:44Z", "content": "Apple today released the iOS 13.4.1 update for iPhone SE owners, suggesting ‌iPhone‌ SE models arriving to customers tomorrow will have iOS 13.4 installed and will need a day-one software update.\r\n‌iPhone‌ SE owners can install the new update over-the-air tom… [+870 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Motorola Edge+ unboxing and first impressions - Neowin", "description": "Unboxing and first impressions of Motorola's reentry into the flagship space with the Edge+. It packs a Snapdragon 865 chipset, 12GB RAM, 256GB of UFS 3.0 st...", "url": "https://www.youtube.com/watch?v=OVxig_gFfbc", "urlToImage": null, "publishedAt": "2020-04-23T17:09:54Z", "content": "Unboxing and first impressions of Motorola's reentry into the flagship space with the Edge+. It packs a Snapdragon 865 chipset, 12GB RAM, 256GB of UFS 3.0 storage with Turbo Write, a 108MP main camera, and a 5,000mAh battery."}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Here’s How To Change Your Display Name In VALORANT | TheGamer - TheGamer", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiOWh0dHBzOi8vd3d3LnRoZWdhbWVyLmNvbS9jaGFuZ2UtZGlzcGxheS1uYW1lLWluLXZhbG9yYW50L9IBPWh0dHBzOi8vd3d3LnRoZWdhbWVyLmNvbS9jaGFuZ2UtZGlzcGxheS1uYW1lLWluLXZhbG9yYW50L2FtcC8?oc=5", "urlToImage": null, "publishedAt": "2020-04-23T16:15:44Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Messenger Kids | Greg's Geek Fix - ABC Action News", "description": "Facebook has developed a kid-friendly messaging with important parental controls.", "url": "https://www.youtube.com/watch?v=LQwyzA_3C5I", "urlToImage": null, "publishedAt": "2020-04-23T16:04:07Z", "content": null}]}