{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Making a better Animal Crossing house with real interior design - Polygon", "description": "Having a beautiful home in Animal Crossing is the dream, but real interior design tips can help you make your virtual home look snazzier! Here are some tips ...", "url": "https://www.youtube.com/watch?v=1yOC8_dHwuc", "urlToImage": null, "publishedAt": "2020-04-26T16:00:01Z", "content": null}, {"source": {"id": null, "name": "Fool.com"}, "author": "Leo Sun", "title": "Up 300% in 5 Years, How Much Higher Can Microsoft Stock Soar? - Motley Fool", "description": "The tech giant’s “mobile first, cloud first” strategy has turned it into a growth stock again.", "url": "https://www.fool.com/investing/2020/04/26/up-300-how-much-higher-can-microsoft-stock-soar.aspx", "urlToImage": null, "publishedAt": "2020-04-26T15:08:00Z", "content": "Microsoft (NASDAQ:MSFT) was once considered a mature tech stock that was owned for stability and income instead of growth. But over the past five years, Microsoft stock rallied roughly 300% as a visionary CEO turned its business upside down.\r\nSatya Nadella, w… [+4450 chars]"}, {"source": {"id": null, "name": "Insideevs.com"}, "author": "Eric Loveday", "title": "Tesla Model Y Build Quality Questioned: Tons Of Issues On This Y Seem Extreme - InsideEVs ", "description": "Some Model Ys seem to be full of problems, like this one here.", "url": "https://insideevs.com/news/414774/tesla-model-y-problems-issues-lots/", "urlToImage": null, "publishedAt": "2020-04-26T14:28:06Z", "content": "The Tesla Model Y is not immune from defects and this video review reveals exactly that. It seems Tesla build quality is still problematic. Should a new car have all of these issues?\r\nThe answer is no and more often than not, Tesla will fix small issues with … [+2119 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Michael Moore", "title": "A Fold Apart review: turns working through anxiety into puzzle solving - The Verge", "description": "In A Fold Apart, the puzzles and how you solve them act as a metaphor for the two main characters working through their anxieties about their relationship. The game follows who we’ll call Red and Blue, since they don’t have names and their genders are selecta…", "url": "https://www.theverge.com/2020/4/26/21232982/a-fold-apart-review-nintendo-switch-ios-puzzle", "urlToImage": null, "publishedAt": "2020-04-26T14:12:23Z", "content": "Relationships are about communication... and puzzles\r\nIt can be difficult to find time to finish a video game, especially if you only have a few hours a week to play. In our biweekly column Short Play we suggest video games that can be started and finished in… [+3808 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Shara Tibken", "title": "Remember when Apple Watch was a luxury item? We look back at its 5-year evolution - CNET", "description": "On the fifth anniversary of Apple's first smartwatch, we take a trip down memory lane at the device's early days.", "url": "https://www.cnet.com/news/remember-when-apple-watch-was-luxury-item-we-look-back-5-year-evolution/", "urlToImage": null, "publishedAt": "2020-04-26T12:42:46Z", "content": "The Apple Watch has evolved from its first version five years ago.  \r\nAngela Lang/CNET\r\nA $17,000 model. A fitting appointment. A cover spread on Vogue. The Apple Watch was more than a fitness-tracking device when it debuted five years ago. It was a fashion i… [+10204 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Jon Fingas", "title": "You can use some iPhone 8 parts inside an iPhone SE - Yahoo Finance Australia", "description": "The iPhone SE can use some parts from the iPhone 8, but don't expect to borrow a battery.", "url": "https://au.finance.yahoo.com/news/iphone-se-iphone-8-parts-intercangeable-112709142.html", "urlToImage": null, "publishedAt": "2020-04-26T11:27:00Z", "content": "Its cliché to say the new iPhone SE is a recycled iPhone 8, but how many parts do the two share in common, really? Its at once more and less than you think. iFixit has tried swapping parts ahead of its customary teardown report, and its clear that you can use… [+1141 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Is this what the PS5 will look like? | TechRadar Talks - TechRadar", "description": "Sony has now revealed the DualSense PS5 controller, the gamepad we'll be using with the PlayStation 5 when the console releases in late 2020. The PS5 control...", "url": "https://www.youtube.com/watch?v=ToyqSsrBkoo", "urlToImage": null, "publishedAt": "2020-04-26T11:00:21Z", "content": "Sony has now revealed the DualSense PS5 controller, the gamepad we'll be using with the PlayStation 5 when the console releases in late 2020. \r\nThe PS5 controller's look provides a few clues about what we can expect the PS5 design to be like so, based on what… [+1330 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": null, "title": "‘League of Legends’ Mid-Season Invitational cancelled; Riot focuses on Worlds 2020 - Micky News", "description": "The League of Legends Mid-Season Invitation will not be happening this year. Riot Games will instead take the time to focus on Worlds 2020.", "url": "https://micky.com.au/league-of-legends-mid-season-invitational-cancelled-riot-focuses-on-worlds-2020/", "urlToImage": null, "publishedAt": "2020-04-26T09:35:40Z", "content": "The coronavirus pandemic cancels another highly anticipated big event this year. eSports followers were hopeful that the League of Legends 2020 MSI would still push through after being rescheduled in July.\r\nThe Global League of Legends Esports team has weighe… [+2845 chars]"}, {"source": {"id": null, "name": "Macworld.com"}, "author": "", "title": "Apple’s iPad Pro Magic Keyboard: The heavy truth - Macworld", "description": "It weighs as much as a laptop--and works like one. And it’s just one option among many.", "url": "https://www.macworld.com/article/3539648/heavy-truth-ipad-pro-magic-keyboard.html", "urlToImage": null, "publishedAt": "2020-04-26T09:10:32Z", "content": "When Apple announced the new Magic Keyboard for iPad Pro, it decided to play coy about how much it weighed. The result is that, despite some accurate speculation, none of us found out for sure until this week when the first keyboards arrived in the hands of r… [+5065 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": null, "title": "Google, Samsung offering free smartphone repairs for healthcare workers - Micky News", "description": "Google and Samsung are joining forces with uBreakiFix in order to provide free repairs for smartphones owned by healthcare workers.", "url": "https://micky.com.au/google-samsung-offering-free-smartphone-repairs-for-healthcare-workers/", "urlToImage": null, "publishedAt": "2020-04-26T09:00:00Z", "content": "uBreakiFix has confirmed that it is partnering up with Google to help those in the frontlines by promising to fix their Pixel devices for free until June 30 of this year.\r\nAccording to the press release, it is extending the free smartphone repair offer to hea… [+3553 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Carina Stathis For Daily Mail Australia", "title": "Disneyland shares their secret recipe for grilled cheese - Daily Mail", "description": "Disneyland has shared its secret grilled cheese sandwich recipe for others to make in the comfort of their own home, as the magical theme parks remain closed due to coronavirus restrictions.", "url": "https://www.dailymail.co.uk/femail/food/article-8257797/Disneyland-shares-secret-recipe-grilled-cheese.html", "urlToImage": null, "publishedAt": "2020-04-26T08:24:47Z", "content": "Ingredients:\r\nCream Cheese Spread\r\n1/2 cup cream cheese\r\n1/2 cup shredded Double Gloucester or cheddar\r\n2 tablespoons heavy cream\r\n1/4 teaspoon coarse salt\r\nGarlic Spread\r\n1 cup mayonnaise\r\n1 &amp; 1/2 teaspoons minced garlic\r\n1/2 teaspoon coarse salt\r\nGrille… [+965 chars]"}, {"source": {"id": null, "name": "Andoverleader.com"}, "author": null, "title": "Facebook Takes on Zoom in a recent messenger update! - Andover Leader", "description": "Facebook is rolling out the big guns in the recent update. There are at war with the video platform Zoom, which happens to be dominating the market of video conferencing at the moment and as usual Facebook wants a behemoth piece of the large pie here. There a…", "url": "https://andoverleader.com/2020/04/26/facebook-takes-on-zoom-in-a-recent-messenger-update/", "urlToImage": null, "publishedAt": "2020-04-26T08:08:00Z", "content": "Facebook is rolling out the big guns in the recent update. There are at war with the video platform Zoom, which happens to be dominating the market of video conferencing at the moment and as usual Facebook wants a behemoth piece of the large pie here.\r\n There… [+1450 chars]"}, {"source": {"id": null, "name": "9news.com.au"}, "author": "AAP", "title": "Germany flips on app contact tracing - 9News", "description": "Following criticism over privacy concerns Germany has changed tack over which type of smartphone technology it wants to use to trace coronavirus infections.", "url": "https://www.9news.com.au/world/germany-flips-on-app-contact-tracing/8c2bab18-9a5b-43bc-9f27-85cab0de693b", "urlToImage": null, "publishedAt": "2020-04-26T07:56:00Z", "content": "Property News:  How MasterChef's Melissa Leong is coping with social distancing - domain.com.au"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Sirin Kale", "title": "How coronavirus helped TikTok find its voice - The Guardian", "description": "The video-sharing app’s blend of memes, jokes and skits have been a surprise lockdown hit – but teen users are worried it will lose its cool", "url": "https://www.theguardian.com/technology/2020/apr/26/how-coronavirus-helped-tiktok-find-its-voice", "urlToImage": null, "publishedAt": "2020-04-26T07:00:00Z", "content": null}, {"source": {"id": null, "name": "Itnews.com.au"}, "author": null, "title": "NSO ran US-based attack servers: Facebook - iTnews", "description": "Hundreds hacked via QuadraNet and AWS.", "url": "https://www.itnews.com.au/news/nso-ran-us-based-attack-servers-facebook-547219", "urlToImage": null, "publishedAt": "2020-04-26T06:50:00Z", "content": "Facebook has filed legal documents that it says shows that Israeli spyware vendor NSO Group ran command and control servers on American cloud providers, which the social network says were used to hack hundreds of WhatsApp users.\r\nSecurity researcher John Scot… [+2782 chars]"}, {"source": {"id": null, "name": "Whichcar.com.au"}, "author": "Jez Spinks and Daniel Gardner", "title": "BMW – History, Trivia & Fast Facts - WhichCar", "description": "Munich is not just famous for its Bayern football team and the Oktoberfest beer festival, but also for a certain car manufacturer", "url": "https://www.whichcar.com.au/car-advice/bmw-history-trivia-and-fast-facts", "urlToImage": null, "publishedAt": "2020-04-26T06:06:06Z", "content": "In our Fast Facts series, WhichCar delves deep into the history of automotive brands to bring you fascinating facts and intriguing information.\r\nHere we focus on the Bavarian Motor Works BMW a company that has produced some of the worlds great sports sedans, … [+7919 chars]"}, {"source": {"id": null, "name": "Pioneerjury.com"}, "author": null, "title": "Google and Apple to close the contact tracing app once the pandemic overs - Pioneer Jury", "description": "As the app is now in a dilemma over privacy issues, both tech giants are trying to make people believe it is safe. So, now both companies announce a revised guideline for the app where they mentioned the app. As per an Apple representative, the company now re…", "url": "https://pioneerjury.com/2020/04/25/google-and-apple-to-close-the-contact-tracing-app-once-the-pandemic-overs/", "urlToImage": null, "publishedAt": "2020-04-26T05:50:15Z", "content": "As the app is now in a dilemma over privacy issues, both tech giants are trying to make people believe it is safe. So, now both companies announce a revised guideline for the app where they mentioned the app.\r\nAs per an Apple representative, the company now r… [+852 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Jon Fingas", "title": "Amazon asks workers to request leave if they continue staying at home - Yahoo Finance Australia", "description": "Amazon warehouse workers will have to request a leave of absence if they want to stay at home after May 1st.", "url": "https://au.finance.yahoo.com/news/amazon-workers-must-request-leave-034137183.html", "urlToImage": null, "publishedAt": "2020-04-26T03:49:10Z", "content": "Amazon warehouse workers wanting to stay home to avoid COVID-19 will soon have to make a formal request. The online retailer is asking staff staying home to either report to their shifts starting May 1st or else request a leave of absence. A spokesperson told… [+1139 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Desire Athow", "title": "This 4TB PCIe SSD can make your Windows laptop feel more like a MacBook Pro - TechRadar", "description": "Assuming you have a compatible laptop, that is", "url": "https://www.techradar.com/news/this-4tb-pcie-ssd-can-make-your-windows-laptop-feel-more-like-a-macbook-pro", "urlToImage": null, "publishedAt": "2020-04-26T03:00:00Z", "content": "The Apple MacBook Pro 16 still holds bragging rights when it comes to the maximum storage capacity available in a traditional portable laptop. \r\nApple uses a proprietary approach, plugging memory chips directly into the motherboard to reach a whopping 8TB of … [+1489 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "Leo Sun", "title": "Is NVIDIA’s Cloud Gaming Platform Already Dying? - The Motley Fool", "description": "The “Stadia killer” loses over half a dozen major publishers in just two months.", "url": "https://www.fool.com/investing/2020/04/25/is-nvidias-cloud-gaming-platform-already-dying.aspx", "urlToImage": null, "publishedAt": "2020-04-26T02:48:37Z", "content": "When NVIDIA (NASDAQ:NVDA) launched its cloud gaming platform GeForce Now in February, it seemed poised to disrupt the nascent market.\r\nUnlike Alphabet's (NASDAQ:GOOG)(NASDAQ:GOOGL) Google Stadia, which required gamers to repurchase games they already owned, G… [+4458 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "admin", "title": "Android app network removed from Google Play Store - Jimmys Post", "description": "", "url": "https://www.news.com.au/technology/gadgets/mobile-phones/android-app-network-removed-from-google-play-store/news-story/aef721ceea32ed6c6f7ca08ee43375c7/", "urlToImage": null, "publishedAt": "2020-04-26T02:14:02Z", "content": "Google has reportedly removed more than 100 apps with tens of millions of downloads after allegations the apps were part of a co-ordinated group that may have violated store policies.The group allegedly involves at least 27 separate app developers (that could… [+7911 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Shockingly Detailed Minecraft Cities Are Available To Buy Online - Screen Rant", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiRGh0dHBzOi8vc2NyZWVucmFudC5jb20vbWluZWNyYWZ0LWNpdHktYnV5LXNhbGUtdmFydW5hLWJ1aWxkcy1vcmFyaW8v0gFIaHR0cHM6Ly9zY3JlZW5yYW50LmNvbS9taW5lY3JhZnQtY2l0eS1idXktc2FsZS12YXJ1bmEtYnVpbGRzLW9yYXJpby9hbXAv?oc=5", "urlToImage": null, "publishedAt": "2020-04-26T01:40:14Z", "content": null}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Marco Chiappetta", "title": "NVIDIA’s RTX Voice Uses AI And GPUs To Eliminate Noise From Your Video Conferences - Forbes", "description": "Whether it be someone typing away on a clicky keyboard, or someone’s kids, pets, or television constantly droning on in the background, interfering with the speaker, background noise just plain stinks.", "url": "https://www.forbes.com/sites/marcochiappetta/2020/04/25/nvidias-rtx-voice-uses-ai-and-gpus-to-eliminate-noise-from-your-video-conferences/", "urlToImage": null, "publishedAt": "2020-04-26T00:56:14Z", "content": "NVIDIA RTX Voice\r\nNVIDIA\r\nNow that were all working from home and dealing with the unfortunate realities of the COVID-19 pandemic, the total number and frequency of audio/video conferences has skyrocketed. Zoom and WebEx meetings are daily occurrences for man… [+2110 chars]"}, {"source": {"id": null, "name": "Ausdroid.net"}, "author": null, "title": "LG Velvet specs leak: how good is your Korean? - Ausdroid", "description": "LG are looking to return to the top end of the smartphone market this year with the LG Velvet and all leaks and teasers so far point to it being a decent device. The phone is a great looking device housing mid to premium tier specs. Overnight we have seen a c…", "url": "https://ausdroid.net/2020/04/26/lg-velvet-specs-leak-how-good-is-your-korean/", "urlToImage": null, "publishedAt": "2020-04-26T00:28:53Z", "content": "LG are looking to return to the top end of the smartphone market this year with the LG Velvet and all leaks and teasers so far point to it being a decent device. The phone is a great looking device housing mid to premium tier specs.\r\nOvernight we have seen a … [+1552 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": null, "title": "Xbox Series X is an ‘absolute beast’ says former Playstation developer - Micky News", "description": "An industry veteran and former Playstation developer weigh in on Xbox Series X and PS5 comparisons calling the former an “absolute beast.”", "url": "https://micky.com.au/xbox-series-x-is-an-absolute-beast-says-former-playstation-developer/", "urlToImage": null, "publishedAt": "2020-04-26T00:11:00Z", "content": "Sony and Microsoft had long been neck and neck when it comes to developing gaming consoles. For a long time, Sonys Playstation sat on the top of the industry over Microsofts Xbox. However, things are soon about to change as Microsoft brings in what they are c… [+3147 chars]"}, {"source": {"id": null, "name": "Ausdroid.net"}, "author": null, "title": "Huawei P40 Pro — One camera to rule them all - Ausdroid", "description": "There’s a lot of politics surrounding the release of the Huawei P40 Pro and as a result, the first article we published after getting our hands on it had to be about life without Google services. This time around we want to get away from what the phone doesn’…", "url": "https://ausdroid.net/2020/04/26/huawei-p40-pro-one-camera-to-rule-them-all/", "urlToImage": null, "publishedAt": "2020-04-26T00:03:22Z", "content": "Theres a lot of politics surrounding the release of the Huawei P40 Pro and as a result, the first article we published after getting our hands on it had to be about life without Google services. This time around we want to get away from what the phone doesnt … [+7970 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Ewan Spence", "title": "Apple Leak Reveals Radical New MacBook - Forbes", "description": "Apple's first ARM powered MacBook is expected to launch next year, as Tim Cook moves away from Intel's grasp.", "url": "https://www.forbes.com/sites/ewanspence/2020/04/25/apple-macbook-pro-arm-intel-new-leak-rumor-specs-release-date/", "urlToImage": null, "publishedAt": "2020-04-25T23:36:11Z", "content": "Apple may be preparing to update the 13-inch and 16-inch MacBook Pro machines to Intels tenth-generation processors, but its longstanding project to bring ARM power to its MacOS platform gathers pace, with reports today that a release in 2021 is on the cards.… [+6658 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Lloyd Coombes", "title": "Best RPGs 2020: the top role-playing games for console and PC - Techradar Australia", "description": "Grab your broadsword and ready your controller", "url": "https://www.techradar.com/news/best-rpgs", "urlToImage": null, "publishedAt": "2020-04-25T21:07:32Z", "content": "Looking for the best RPGs (or role-playing games) around? Then you've come to the right place.\r\nThese days its more often than not that a game features RPG elements. Whether thats a skill tree, dialogue options, or anything else that was once a staple of the … [+13517 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "admin", "title": "Porsche Cayman GT4 review: New range-topping baby 911 - Jimmys Post", "description": "", "url": "https://www.news.com.au/technology/innovation/motoring/luxury/porsche-cayman-gt4-review-new-rangetopping-baby-911/news-story/a5c402443dbd717c8400ca8bffe46cbf/", "urlToImage": null, "publishedAt": "2020-04-25T20:30:52Z", "content": "There is no sports mode in Porsches 718 Cayman GT4.No buttons on the racecar-spec steering wheel, and no safety assistance such as lane keeping assistance or active cruise control. Forget about self-parking systems, drift modes, fake engine noise or multi-col… [+3718 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Fallout 76: Wastelanders Review - IGN", "description": "Fallout 76: Wastelanders reviewed by David Jagneaux on PlayStation 4 Pro. Also available on PC and Xbox One. \"With the Wastelanders update, Fallout 76 has ta...", "url": "https://www.youtube.com/watch?v=U-uDLErALu0", "urlToImage": null, "publishedAt": "2020-04-25T19:51:32Z", "content": "Fallout 76: Wastelanders reviewed by David Jagneaux on PlayStation 4 Pro. Also available on PC and Xbox One.\r\n\"With the Wastelanders update, Fallout 76 has taken a solid step in the right direction after its dire launch. New human NPCs bring a healthy dose of… [+633 chars]"}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "Riot Games' Closed Beta Game Valorant Comes Competitive Mode - Somag News", "description": "The new FPS game Valorant from Riot Games, which is currently in closed beta, adds competitive mode for players to face opponents at their own level. The new mod will be added with the 0.49 update. The FPS game Valorant, released by Riot Games, the developer …", "url": "https://www.somagnews.com/riot-games-closed-beta-game-valorant-comes-competitive-mode/", "urlToImage": null, "publishedAt": "2020-04-25T19:05:00Z", "content": "The new FPS game Valorant from Riot Games, which is currently in closed beta, adds competitive mode for players to face opponents at their own level. The new mod will be added with the 0.49 update.\r\nThe FPS game Valorant, released by Riot Games, the developer… [+2067 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Zack Zwiezen", "title": "New GTA Online Missions Are All About Preparing For A Recession - Kotaku Australia", "description": "Grand Theft Auto Online received a new update a few days ago that added six new missions. These missions are all about an old-time GTA Online character, Gerald, and his attempts to get ready for an upcoming recession. Five of them are good and one of them is …", "url": "https://www.kotaku.com.au/2020/04/new-gta-online-missions-are-all-about-preparing-for-a-recession/", "urlToImage": null, "publishedAt": "2020-04-25T18:00:00Z", "content": "Grand Theft Auto Online received a new update a few days ago that added six new missions. These missions are all about an old-time GTA Online character, Gerald, and his attempts to get ready for an upcoming recession. Five of them are good and one of them is … [+2803 chars]"}, {"source": {"id": null, "name": "Thetecheducation.com"}, "author": "Tarika Sharma", "title": "Nintendo Switch: Patch Notes 10.0.1 Update For The Popular Console - The Tech Education", "description": "Advertisement Nintendo Switch The Nintendo Switch is developed by Nintendo Platform Technology Development. Foxconn, Hosiden manufactured it. It was released on March 3, 2017 worldwide! So, basically it is a hybrid video game console. Well, it is designed to …", "url": "https://thetecheducation.com/nintendo-switch-patch-notes-10-0-1-update-for-extremely-popular-console-improvements-and-more/", "urlToImage": null, "publishedAt": "2020-04-25T17:36:29Z", "content": "Nintendo Switch\r\nThe Nintendo Switch is developed by Nintendo Platform Technology Development. Foxconn, Hosiden manufactured it. It was released on March 3, 2017 worldwide! So, basically it is a hybrid video game console.\r\nWell, it is designed to fit your lif… [+2087 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Kevin Knezevic", "title": "Animal Crossing: New Horizons Free Goodies Available For Nintendo Switch Online Members - GameSpot", "description": "NSO subscribers can claim a free, exclusive Nook Inc. silk rug for New Horizons from the Nintendo Switch Eshop.", "url": "https://www.gamespot.com/articles/animal-crossing-new-horizons-free-goodies-availabl/1100-6476315/", "urlToImage": null, "publishedAt": "2020-04-25T16:47:00Z", "content": "Nintendo is offering a few special freebies for Animal Crossing: New Horizons. In addition to the Pocket Camp crossover items you can receive through the series' mobile spin-off, Switch Online members can nab an exclusive Nook Inc. silk rug from the Switch Es… [+1592 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Gareth Beavis", "title": "iPhone SE 2020 teardown reveals intriguing facts about battery and camera - TechRadar", "description": "Things are more similar than we anticipated", "url": "https://www.techradar.com/news/iphone-se-2020-teardown-reveals-intriguing-facts-about-battery-and-camera", "urlToImage": null, "publishedAt": "2020-04-25T16:21:00Z", "content": "Weve been waiting to see what parts are in Apples new iPhone - our iPhone SE review left us with a few questions we wanted answering, and iFixits iPhone SE early teardown has begun to provide a few of them.\r\nWhile theres still more to come when the full teard… [+2050 chars]"}, {"source": {"id": null, "name": "Mspoweruser.com"}, "author": "http://www.facebook.com/pages/wmpowerusercom/37708414657", "title": "Xiaomi has a new twist on the bezel-less smartphone - MSPoweruser - MSPoweruser", "description": "Until we have a proper under-display front-facing camera, the race to make a full-screen smartphone which still offers a selfie camera will continue to deliver some creative solutions. Today we have a unique solution from Xiaomi described in an April 24 paten…", "url": "https://mspoweruser.com/xiaomi-has-a-new-twist-on-the-borderless-smartphone/", "urlToImage": null, "publishedAt": "2020-04-25T16:00:30Z", "content": "Until we have a proper under-display front-facing camera, the race to make a full-screen smartphone which still offers a selfie camera will continue to deliver some creative solutions.\r\nToday we have a unique solution from Xiaomi described in an April 24 pate… [+602 chars]"}, {"source": {"id": null, "name": "Animenewsnetwork.com"}, "author": null, "title": "Japan Retro Game Association Will Gift 100 Super NES Consoles to Kids Stuck at Home - Anime News Network", "description": "Non-profit will give console, Donkey Kong Country, Final Fantasy VI games", "url": "https://www.animenewsnetwork.com/interest/2020-04-25/japan-retro-game-association-will-gift-100-super-nes-consoles-to-kids-stuck-at-home/.158962", "urlToImage": null, "publishedAt": "2020-04-25T16:00:00Z", "content": "The Japan Retro Game Association (JARGA) announced it will gift 100 Super Nintendo consoles to kids stuck at home due to COVID-19. JARGA will provide the consoles, adapters, one controller, and two games to each child. The association only asks for participan… [+820 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Zack Zwiezen", "title": "Battlefield V Will Get One Final Update In June - Kotaku Australia", "description": "Battlefield developers Dice announced earlier this week that one final update is coming to Battlefield V in June, though they will continue to combat cheaters even after this last update....", "url": "https://www.kotaku.com.au/2020/04/battlefield-v-will-get-one-final-update-in-june/", "urlToImage": null, "publishedAt": "2020-04-25T14:30:00Z", "content": "Battlefield developers Dice announced earlier this week that one final update is coming to Battlefield V in June, though they will continue to combat cheaters even after this last update.\r\nReleased in November 2018, Battlefield V took the popular series back … [+822 chars]"}, {"source": {"id": null, "name": "Thejakartapost.com"}, "author": "The Jakarta Post", "title": "Pac-Man joins stay-at-home movement with fortnight-long giveaway - The Jakarta Post - Jakarta Post", "description": "Chomp ghosts and flatten the curve as \"Pac-Man: Championship Edition 2\" goes free on PlayStation 4, Xbox One and PC.", "url": "https://www.thejakartapost.com/life/2020/04/25/pac-man-joins-stay-at-home-movement-with-fortnight-long-giveaway.html", "urlToImage": null, "publishedAt": "2020-04-25T14:03:00Z", "content": "Bandai Namco's most famous video game character, Pac-Man, is now part of the home isolation initiative.\r\nThe iconic video game company is giving away \"Pac-Man: Championship Edition 2\" for free for PlayStation 4 on the PlayStation Network Store, Xbox One on th… [+1514 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "BARDOWN PLAYS PARTY GAMES: SUPER SMASH BROS. ULTIMATE - TSN", "description": "Prior to quarantine, Marissa, Jesse, Eric and Teddy put up their dukes in Super Smash Bros. Ultimate for the Nintendo Switch. Would Jesse's N64 abilities tra...", "url": "https://www.youtube.com/watch?v=utkNuTUD1Js", "urlToImage": null, "publishedAt": "2020-04-25T13:55:43Z", "content": null}, {"source": {"id": null, "name": "Powerup-gaming.com"}, "author": "Leo Stevenson", "title": "Fizz confirmed as Bilgewater's first Champion in Legends of Runeterra, new keyword, Attuned, revealed - PowerUp!", "description": "Riot has revealed that Fizz will be one of Bilgewater's Champions when the region joins Legends of Runeterra at launch. Fizz, The Tidal Trickster, is an", "url": "https://powerup-gaming.com/2020/04/26/fizz-confirmed-as-bilgewaters-first-champion-in-legends-of-runeterra-new-keyword-attuned-revealed/", "urlToImage": null, "publishedAt": "2020-04-25T13:00:42Z", "content": "Riot has revealed that Fizz will be one of Bilgewater’s Champions when the region joins Legends of Runeterra at launch. Fizz, The Tidal Trickster, is an amphibious Yordle who lives amongst the reefs around Bilgewater. Known for luring fisherman to areas where… [+2237 chars]"}, {"source": {"id": null, "name": "Businessinsider.com.au"}, "author": "Ben Gilbert", "title": "Nintendo says that at least 160000 Switch users' accounts have been hacked — here's how to make your account more secure with two-factor authentication - Business Insider Australia", "description": "Do you have a Nintendo Switch? Did you also have a Nintendo 3DS or Wii U?", "url": "https://www.businessinsider.com.au/how-to-set-up-nintendo-switch-two-factor-authentication-2020-4", "urlToImage": null, "publishedAt": "2020-04-25T12:50:00Z", "content": "<ul><li>Nintendo’s Switch game console is wildly popular, with over 50 million units sold – and it’s currently out of stock nearly everywhere due to increased demand as millions are forced indoors amid the coronavirus pandemic.</li><li>\r\nAs more people than e… [+2175 chars]"}, {"source": {"id": null, "name": "Betanews.com"}, "author": null, "title": "Microsoft is bombarding Chrome-using Outlook.com visitors with ads for Edge - BetaNews", "description": "Microsoft is no stranger to hitting its customers with ads for its products and services, and it seems that the company is so keen that people make the switch to the new Chromium-based version of Edge that it is now bombarding Outlook.com users with banner ad…", "url": "https://betanews.com/2020/04/25/microsoft-edge-ads-chrome-outlook/", "urlToImage": null, "publishedAt": "2020-04-25T12:07:30Z", "content": "Microsoft is no stranger to hitting its customers with ads for its products and services, and it seems that the company is so keen that people make the switch to the new Chromium-based version of Edge that it is now bombarding Outlook.com users with banner ad… [+1100 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Simon Parkin", "title": "Streets of Rage 4 review – the return of the beat 'em up - The Guardian", "description": "This lovingly created sequel offers all the action and fun of a 90s arcade game", "url": "https://www.theguardian.com/games/2020/apr/25/streets-of-rage-4-review-the-return-of-the-beat-em-up", "urlToImage": null, "publishedAt": "2020-04-25T12:04:06Z", "content": "In the Netflix animated series Hi Score Girl, a romantic comedy set in early-90s Japan, Haruo Yaguchi, a low-achieving high-school loner is whiling away his time in the local video game arcades when he meets Akira Ono, a popular wunderkind from a wealthy fami… [+4209 chars]"}, {"source": {"id": null, "name": "Digitalinformationworld.com"}, "author": "Arooj Ahmed", "title": "Facebook Is Temporarily Shelving Its Plans To Include Ads In Its WhatsApp Messaging Service As Mark Zuckerberg Feared Backlash - Digital Information World", "description": "WhatsApp will not be displaying ads for the time being as Mark Zuckerberg feared backlash from its users.", "url": "https://www.digitalinformationworld.com/2020/04/facebook-temporarily-shelving-ads-launch-in-whatsapp-mark-zuckerberg-feared-backlash.html", "urlToImage": null, "publishedAt": "2020-04-25T11:16:14Z", "content": "<ul><li>WhatsApp was supposed to start displaying ads at the start of the year 2020.</li><li>The company was working on a plan for more than a year to shove ads into the WhatsApp messaging service to generate revenue every year.</li><li>WhatsApp will not be d… [+2877 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Matt Hanson", "title": "Smartphones are a bad deal – let's hope laptops don't go the same way - TechRadar", "description": "Opinion: forced obsolescence is a menace", "url": "https://www.techradar.com/news/smartphones-are-a-bad-deal-lets-hope-laptops-dont-go-the-same-way", "urlToImage": null, "publishedAt": "2020-04-25T10:00:00Z", "content": "Imagine buying a new laptop, only to find that three years later Microsoft/Apple stopped offering software updates for it, effectively forcing you to upgrade in order to ensure you had a machine that was secure and ran smoothly.\r\nAnd imagine that, during thos… [+5094 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": null, "title": "‘Overwatch’ update on PTR adds changes to communications wheel - Micky News", "description": "A new Overwatch update brings a much awaited change to the communications wheel in the game and players are excited.", "url": "https://micky.com.au/overwatch-update-on-ptr-adds-changes-to-communications-wheel/", "urlToImage": null, "publishedAt": "2020-04-25T09:12:00Z", "content": "Last week, Blizzard’s Jeff Kaplan responded to a message on the Overwatch forums, suggesting that they are already working on making some appropriate changes to the communication wheel in the game. True enough, the developer delivered, and the update has fina… [+2621 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": null, "title": "Big tech companies play crucial role during COVID-19 pandemic - Micky News", "description": "As the world races against the clock to find the cure against COVID-19, big tech companies are also stepping up to their role.", "url": "https://micky.com.au/big-tech-companies-play-crucial-role-during-covid-19-pandemic/", "urlToImage": null, "publishedAt": "2020-04-25T08:44:17Z", "content": "Before the widespread threat of the COVID-19 virus, big tech companies are among the most vilified industries. They are criticized over allegations of unethical data harvesting and tracking users.\r\nRecently, these very same critics are tapping the massive com… [+2510 chars]"}, {"source": {"id": null, "name": "Channelnews.com.au"}, "author": "David Richards", "title": "Was CES 2020 A Super Spreader For COVID-19 After Tens Of Thousands Of Chinese Poured Into The US Event From Wuhan & Hubei Provence. - ChannelNews", "description": null, "url": "https://www.channelnews.com.au/was-ces-2020-a-super-spreader-for-covid-19-after-tens-of-thousands-of-chinese-poured-into-the-us-event-from-wuhan-provence/", "urlToImage": null, "publishedAt": "2020-04-25T08:20:12Z", "content": "One third of CES the world’s biggest Consumer Electronics Show in Las Vegas is Chinese exhibitors and at the 2020 show. tens of thousands of Chinese visitors poured into the event which is now being investigated as a hot spot that helped propel COVID-19 in th… [+3655 chars]"}, {"source": {"id": null, "name": "Trueachievements.com"}, "author": "Heidi Nicholas", "title": "Sci-fi adventure Deliver Us The Moon joins Xbox Game Pass and Game Pass for PC today - TrueAchievements", "description": "Deliver Us The Moon is a sci-fi action adventure title which draws inspiration from movies such as Interstellar, and which joins the Xbox Game Pass and Xbox Game Pass for PC services today as a day one addition.", "url": "https://www.trueachievements.com/n41593/deliver-us-the-moon", "urlToImage": null, "publishedAt": "2020-04-25T07:59:53Z", "content": "The Xbox team has been busy lately: just yesterday, they surprise-dropped the announcement that Red Dead Redemption 2 will join Xbox Game Pass in May. Before that, they announced new titles for Xbox Game Pass, along with several new titles for Xbox Game Pass … [+1728 chars]"}, {"source": {"id": null, "name": "Pickr.com.au"}, "author": "Leigh :) Stark", "title": "Hisense looks to size, quality for 4K TVs in 2020 - Pickr", "description": "Democratising TV technology and making tellies affordable for all, Hisense is cleaning the range in 2020 and pulling back to two, with the choice down to size.", "url": "https://www.pickr.com.au/news/2020/hisense-looks-to-size-quality-for-4k-tvs-in-2020/", "urlToImage": null, "publishedAt": "2020-04-25T05:53:35Z", "content": "Democratising TV technology and making tellies affordable for all, Hisense is cleaning the range in 2020 and pulling back to two, with the choice down to size. \r\nIt’s not just Samsung and LG showing off their latest TVs, because it’s TV changeover season, whi… [+4671 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Desire Athow", "title": "This AMD Ryzen notebook deal is probably the best we've ever seen - TechRadar", "description": "Lenovo and AMD provide a glimpse into the future", "url": "https://www.techradar.com/news/this-amd-ryzen-laptop-is-the-probably-the-best-notebook-deal-ever", "urlToImage": null, "publishedAt": "2020-04-25T03:00:00Z", "content": "We reviewers are used to obsessing over incremental technology changes, but every now and then a supernova appears on our radar - something that can single handedly change the status quo.\r\nThe AMD Ryzen 4000 family is one such supernova and promises to bring … [+1829 chars]"}, {"source": {"id": null, "name": "Phonemantra.com"}, "author": "Admin", "title": "Microsoft asks to properly complain about the \"disastrous\" update of Windows 10, Problems are being studied - Phone Mantra", "description": "The recent planned update of the Windows 10 operating system has turned out to users a whole set of serious problems, complaints about which began almost immediately.", "url": "https://phonemantra.com/microsoft-asks-to-properly-complain-about-the-disastrous-update-of-windows-10-problems-are-being-studied/", "urlToImage": null, "publishedAt": "2020-04-25T01:38:00Z", "content": "The Windows 10 update on April 14th under KB4549951 was supposed to patch four very serious security holes in the operating system. The update was highly recommended for all users. \r\nAmong the complaints are the  blue screen of death, a global system crash, d… [+632 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Oscar Gonzalez", "title": "Travis Scott event in Fortnite: How to watch the encore and find the Giant Astro Heads - CNET", "description": "The rapper dropped new tracks in a jaw-dropping concert. Catch the next show at midnight.", "url": "https://www.cnet.com/news/travis-scott-event-in-fortnite-how-to-watch-the-encore-and-find-the-giant-astro-heads/", "urlToImage": null, "publishedAt": "2020-04-25T01:02:37Z", "content": "Play some Fortnite and listen to a new track from Travis Scott.\r\nEpic Games\r\nFortnite events aren't only for players to check out new content from developer Epic Games. The popular battle royale game has also played host to multiple premieres and collaboratio… [+3718 chars]"}, {"source": {"id": null, "name": "Ubergizmo.com"}, "author": "Tyler Lee", "title": "Samsung’s Smartwatches Get A New Blood Pressure Monitoring App - Ubergizmo", "description": "Our smartwatches are getting better at what they do, where they can monitor more than just our daily activities like our steps taken, calories burnt, and so on. For example, the Apple Watch comes with an ECG monitoring tool that can alert the wearer if there …", "url": "https://www.ubergizmo.com/2020/04/samsung-smartwatch-blood-pressure-monitor/", "urlToImage": null, "publishedAt": "2020-04-25T00:42:49Z", "content": "Our smartwatches are getting better at what they do, where they can monitor more than just our daily activities like our steps taken, calories burnt, and so on. For example, the Apple Watch comes with an ECG monitoring tool that can alert the wearer if there … [+1254 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": "www.facebook.com/christian.n.puno", "title": "Ford Mustang Cobra Jet 1400: Time for electric cars to take the limelight - Micky News", "description": "Time for electric cars to take limelight, Ford mechanics and scientists took this further. The result? 'Ford Mustang Cobra Jet 1400'", "url": "https://micky.com.au/ford-mustang-cobra-jet-1400-time-for-electric-cars-to-take-the-limelight/", "urlToImage": null, "publishedAt": "2020-04-24T22:43:00Z", "content": "The Ford Mustang Cobra Jet 1400 isnt a typical electric car. This cars creation coincided with drag racing in mind. Imagine how much electrical power it needs to go on such high speed. According to its creators, this monster car can reach a fourth of a mile w… [+2234 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Logitech G G203 LIGHTSYNC Promo Video - Techaeris", "description": "This is an overview of the new Logitech G G203 LIGHTSYNC Gaming Mouse. The video was provided by Logitech for resharing. Available in May buy here: https://w...", "url": "https://www.youtube.com/watch?v=i3_Ale_138I", "urlToImage": null, "publishedAt": "2020-04-24T21:57:36Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "iPad Pro Magic Keyboard Review: Almost Perfect... - Dom Esposito", "description": "Apple Magic Keyboard Review - Best iPad Keyboard Case? Worth the Money? This iPad Pro Magic Keyboard packs a trackpad, backlit keys, and. costs $300+ but sho...", "url": "https://www.youtube.com/watch?v=_evwRhwt8IQ", "urlToImage": null, "publishedAt": "2020-04-24T21:14:17Z", "content": "Apple Magic Keyboard Review - Best iPad Keyboard Case? Worth the Money? This iPad Pro Magic Keyboard packs a trackpad, backlit keys, and. costs $300+ but should you buy it? Check out my Magic Keyboard for iPad Pro review! Covering design, SideCar use, keyboar… [+238 chars]"}, {"source": {"id": null, "name": "Businessinsider.com.au"}, "author": "Lisa Eadicicco", "title": "There's only one space after a period and anyone who puts 2 is wrong, Microsoft rules - Business Insider Australia", "description": "Microsoft is putting its foot down in the age-old debate about whether it’s correct to put one or two spaces after a period.", "url": "https://www.businessinsider.com.au/microsoft-word-update-2-spaces-after-period-wrong-2020-4", "urlToImage": null, "publishedAt": "2020-04-24T21:04:10Z", "content": "<ul><li>\r\nMicrosoft Word will begin flagging two spaces after a period as an error.\r\n</li><li>\r\nA long-running debate over whether there should be one or two spaces has been met with both excitement and criticism.\r\n</li><li>\r\nThe company recently started test… [+2638 chars]"}, {"source": {"id": null, "name": "Caradvice.com.au"}, "author": "Justin Narayan", "title": "Ford Mustang crowned the most successful sports car of 2019 - CarAdvice", "description": "America just wasn’t enough for the original pony car. The Ford Mustang has officially gone global. Last year saw the Mustang rise to the top of the sports car world, with recognition from fans from...", "url": "https://www.caradvice.com.au/845186/ford-mustang-crowned-the-most-successful-sports-car-of-2019/", "urlToImage": null, "publishedAt": "2020-04-24T20:05:00Z", "content": "More than 100,000 Mustangs were sold globally last year. Even though sales have waned in Australia, it remains one of Ford's most popular models.\r\nAmerica just wasn’t enough for the original pony car. The Ford Mustang has officially gone global.\r\nLast year sa… [+1907 chars]"}, {"source": {"id": null, "name": "Otakukart.com"}, "author": null, "title": "Arch-Tempered Namielle Release Date and All You Need To Know - OtakuKart", "description": "Monster Hunter Iceborne, which was recently launched on PC, has its latest update dropping soon called Title Update 13.5. The latest update is to be available o", "url": "https://otakukart.com/113224/arch-tempered-namielle-release-date-and-all-you-need-to-know/", "urlToImage": null, "publishedAt": "2020-04-24T20:00:15Z", "content": "Monster Hunter Iceborne, which was recently launched on PC, has its latest update dropping soon called Title Update 13.5. The latest update is to be available on PS4, Xbox One, and PC soon! Two new monster variants are to be introduced in the Title Update 13.… [+3073 chars]"}, {"source": {"id": null, "name": "Sahiwal.tv"}, "author": "Jeremy Spirogis", "title": "Call of Duty: Mobile World Championship 2020: the best way to get together? - Sahiwal Tv", "description": "After PUBG Mobile, it seems like Call of Duty: Mobile has an esports match to host. Call of Duty: Mobile World Championship 2020, the match has additionally been requested to…", "url": "https://sahiwal.tv/call-of-duty-mobile-world-championship-2020-how-to-party-2/", "urlToImage": null, "publishedAt": "2020-04-24T19:59:00Z", "content": "After PUBG Mobile, it seems like Call of Duty: Mobile has an esports match to host. Call of Duty: Mobile World Championship 2020, the match has additionally been requested to supply in-game prizes in addition to money prizes. It will begin on 30 April and is … [+2572 chars]"}, {"source": {"id": null, "name": "Lifehacker.com.au"}, "author": "David Murphy", "title": "Are You Charging Your MacBook On The Wrong Side? - Lifehacker Australia", "description": "Yes, you read that headline correctly. There is apparently a “right” way and a “wrong” way to connect devices to a MacBook with Thunderbolt/USB-C ports on both sides. Doing it wrong can affect your computer’s performance....", "url": "https://www.lifehacker.com.au/2020/04/are-you-charging-your-macbook-on-the-wrong-side/", "urlToImage": null, "publishedAt": "2020-04-24T19:30:00Z", "content": "Yes, you read that headline correctly. There is apparently a right way and a wrong way to connect devices to a MacBook with Thunderbolt/USB-C ports on both sides. Doing it wrong can affect your computers performance.\r\nI recently encountered this knowledge on … [+3969 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Valve Source Code LEAKED - Hot off the Press Start #34 - GameFront", "description": "Support us on Patreon! - https://www.patreon.com/gamefront - James is back once more with the latest gaming news, including more bad news for GeForce Now, ju...", "url": "https://www.youtube.com/watch?v=D37UfGQ1x1o", "urlToImage": null, "publishedAt": "2020-04-24T18:47:41Z", "content": "Support us on Patreon! - https://www.patreon.com/gamefront - James is back once more with the latest gaming news, including more bad news for GeForce Now, justice for Warzone cheaters, and the source code for Team Fortress 2 and CS:GO leaking online.\r\n#GeForc… [+287 chars]"}, {"source": {"id": null, "name": "Notebookcheck.net"}, "author": "Anil Satyanarayana", "title": "HERE WeGo maps now available for download on Huawei AppGallery - Notebookcheck.net", "description": "Popular navigation app HERE WeGo is now available for download on Huawei's Play Store alternative AppGallery. The application has been around for a long time offers several useful features such as turn-by-turn navigation, a voice assistant, and offline maps.", "url": "https://www.notebookcheck.net/HERE-WeGo-maps-now-available-for-download-on-Huawei-AppGallery.462702.0.html", "urlToImage": null, "publishedAt": "2020-04-24T18:35:12Z", "content": "Huawei is hard at work, creating an app ecosystem to rival that of the Google Play Store. Convincing users to make the switch to a relatively unknown platform is an arduous task. That is why Huawei is counting on existing developers to host their apps on AppG… [+998 chars]"}, {"source": {"id": null, "name": "Pcmag.com"}, "author": null, "title": "Marshall Uxbridge Voice - Review 2020 - PCMag AU", "description": "The Marshall Uxbridge Voice speaker delivers respectable audio performance and hands-free Alexa voice control in a stylish package.", "url": "https://au.pcmag.com/speakers/66530/marshall-uxbridge-voice", "urlToImage": null, "publishedAt": "2020-04-24T18:06:00Z", "content": "Marshalls latest smart speaker, the $199.99 Uxbridge Voice, is its smallest and least expensive  yet. The audio performance is quite good considering the speaker's size, with rich bass depth balanced by crisp highs. And the sound signature is fairly malleable… [+7189 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Carly Page", "title": "The Dell XPS 15 2020 may have been redesigned to take on the MacBook Pro - TechRadar", "description": "Incoming model will boast smaller bezels and upward-firing speakers", "url": "https://www.techradar.com/news/the-dell-xps-15-2020-may-have-been-redesigned-to-take-on-the-macbook-pro", "urlToImage": null, "publishedAt": "2020-04-24T17:31:00Z", "content": "Dell looks poised to release an all-new version of its XPS 15 laptop that will take a number of design clues from the recently-revamped Dell XPS 13\r\n.\r\nThats according to leaked images posted on the Korea Energy Agency Efficiency Standardization Certification… [+2119 chars]"}, {"source": {"id": null, "name": "Gamesradar.com"}, "author": "Benjamin Abbott", "title": "Sling TV deal lets you watch NFL draft online for FREE tonight without a cable TV package - GamesRadar+ AU", "description": "The live TV streaming service is offering free Sling TV every evening until midnight and that includes streaming the NFL draft.", "url": "https://www.gamesradar.com/you-can-watch-free-sling-tv-every-night-nfl-draft-tonight/", "urlToImage": null, "publishedAt": "2020-04-24T17:07:09Z", "content": "Live TV streaming service Sling has announced that you can get an evening of free Sling TV every day from 5pm ET. With 47 major channels on offer, there's plenty to get your teeth into. Better yet, you can also use this freebie to watch tonight's live NFL Dra… [+2874 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "iPhone SE review, Canon EOS R5 new specs and Surface Pro 8 rumors | Noise Cancelling Podcast 008 - TechRadar", "description": "More tech news and painfully honest reviews from Gareth and Sherri as they’re joined by two new voices: Kimberly Gedeon of Laptop Mag and TechRadar Cameras e...", "url": "https://www.youtube.com/watch?v=bPYeSWVgSXw", "urlToImage": null, "publishedAt": "2020-04-24T15:00:19Z", "content": "More tech news and painfully honest reviews from Gareth and Sherri as theyre joined by two new voices: Kimberly Gedeon of Laptop Mag and TechRadar Cameras editor, Mark Wilson. \r\nTOPIC TIMESTAMPS03:52 - Canon EOS R508:36 - PS5 Robot Friends12:46 - Surface Pro … [+992 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Future Games Show Announcement Trailer - Coming June 2020 - GamesRadar", "description": "See the most exciting console, mobile and streaming games of 2020 in one show with a mixture of exclusives, deep dives and developer interviews. Coming June ...", "url": "https://www.youtube.com/watch?v=DbLFsALqD_0", "urlToImage": null, "publishedAt": "2020-04-24T15:00:12Z", "content": "See the most exciting console, mobile and streaming games of 2020 in one show with a mixture of exclusives, deep dives and developer interviews. Coming June 2020.Subscribe to Gamesradar: http://goo.gl/cnjsn1"}]}