{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Cnet.com"}, "author": "Patrick Holland", "title": "Motorola Edge Plus hands-on: A $1000 5G phone with premium specs - CNET", "description": "It costs the same as the Galaxy S20, is about the same size as Galaxy S20 Plus and has the same battery and main camera as the Galaxy S20 Ultra.", "url": "https://www.cnet.com/reviews/motorola-edge-plus-hands-on-1000-5g-phone-premium-specs-preview/", "urlToImage": null, "publishedAt": "2020-04-26T18:26:42Z", "content": "Motorola, a company best known for its budget and midrange phones, on Wednesday took an enormous step forward into the premium phone market and launched the Motorola Edge and Edge Plus. Both phones join the Motorola Razr as high-end offerings from the Chicago… [+9703 chars]"}, {"source": {"id": null, "name": "Digitalinformationworld.com"}, "author": "Arooj Ahmed", "title": "Facebook Announced Several New Video Features Across Its Family Of Apps - Digital Information World", "description": "Mark Zuckerberg also shared video usage insights in the Facebook Live stream and highlighted the efforts Facebook is making to assist in the coronavirus relief efforts.", "url": "https://www.digitalinformationworld.com/2020/04/facebook-announced-several-new-video-features-across-its-family-of-apps.html", "urlToImage": null, "publishedAt": "2020-04-26T17:01:52Z", "content": "Mark Zuckerberg, CEO Facebook announced various new video features across Facebook’s family of apps. The company is introducing these features to meet the surged demand and evolving use-cases of video tools amid the coronavirus lockdowns. Zuckerberg announced… [+3316 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Making a better Animal Crossing house with real interior design - Polygon", "description": "Having a beautiful home in Animal Crossing is the dream, but real interior design tips can help you make your virtual home look snazzier! Here are some tips ...", "url": "https://www.youtube.com/watch?v=1yOC8_dHwuc", "urlToImage": null, "publishedAt": "2020-04-26T16:00:01Z", "content": null}, {"source": {"id": null, "name": "Fool.com"}, "author": "Leo Sun", "title": "Up 300% in 5 Years, How Much Higher Can Microsoft Stock Soar? - Motley Fool", "description": "The tech giant’s “mobile first, cloud first” strategy has turned it into a growth stock again.", "url": "https://www.fool.com/investing/2020/04/26/up-300-how-much-higher-can-microsoft-stock-soar.aspx", "urlToImage": null, "publishedAt": "2020-04-26T15:08:00Z", "content": "Microsoft (NASDAQ:MSFT) was once considered a mature tech stock that was owned for stability and income instead of growth. But over the past five years, Microsoft stock rallied roughly 300% as a visionary CEO turned its business upside down.\r\nSatya Nadella, w… [+4450 chars]"}, {"source": {"id": null, "name": "Insideevs.com"}, "author": "Eric Loveday", "title": "Tesla Model Y Build Quality Questioned: Tons Of Issues On This Y Seem Extreme - InsideEVs ", "description": "Some Model Ys seem to be full of problems, like this one here.", "url": "https://insideevs.com/news/414774/tesla-model-y-problems-issues-lots/", "urlToImage": null, "publishedAt": "2020-04-26T14:28:06Z", "content": "The Tesla Model Y is not immune from defects and this video review reveals exactly that. It seems Tesla build quality is still problematic. Should a new car have all of these issues?\r\nThe answer is no and more often than not, Tesla will fix small issues with … [+2119 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Michael Moore", "title": "A Fold Apart review: turns working through anxiety into puzzle solving - The Verge", "description": "In A Fold Apart, the puzzles and how you solve them act as a metaphor for the two main characters working through their anxieties about their relationship. The game follows who we’ll call Red and Blue, since they don’t have names and their genders are selecta…", "url": "https://www.theverge.com/2020/4/26/21232982/a-fold-apart-review-nintendo-switch-ios-puzzle", "urlToImage": null, "publishedAt": "2020-04-26T14:12:23Z", "content": "Relationships are about communication... and puzzles\r\nIt can be difficult to find time to finish a video game, especially if you only have a few hours a week to play. In our biweekly column Short Play we suggest video games that can be started and finished in… [+3808 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Lynn La", "title": "iPhone SE vs. iPhone 8 comparison: Which $400 iPhone should you get? - CNET", "description": "Some retailers are still selling the iPhone 8 despite Apple discontinuing the device. But you should just get the new iPhone SE instead.", "url": "https://www.cnet.com/news/iphone-se-vs-iphone-8-spec-comparison-which-400-iphone-should-you-get-buy/", "urlToImage": null, "publishedAt": "2020-04-26T13:45:54Z", "content": "In a bid to lure budget-minded iPhone fans, Apple debuted its new iPhone SE for 2020 on April 15 for $399 (£419, AU$749). It's a sequel to its 2016 iPhone of the same name. The new iPhone SE's specs are similar to the iPhone 8 from three years ago, which is l… [+8211 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "10 Greatest Gaming Gadgets Of All Time - TheGamer", "description": "Must have gaming accessories that every gamer needs to enhance their video game experience. From Nintendo Switch Pro controllers, gaming chairs, ps4 accessor...", "url": "https://www.youtube.com/watch?v=syHU2IH1C2s", "urlToImage": null, "publishedAt": "2020-04-26T13:15:02Z", "content": "Must have gaming accessories that every gamer needs to enhance their video game experience. From Nintendo Switch Pro controllers, gaming chairs, ps4 accessories, and even some fan favorites for Xbox play! \r\nSUBSCRIBE NOW to The Gamer! Click here: https://goo.… [+1385 chars]"}, {"source": {"id": null, "name": "Mspoweruser.com"}, "author": "http://www.facebook.com/pages/wmpowerusercom/37708414657", "title": "Leak: Samsung working on an A-series phone with a pop-up selfie camera - MSPoweruser - MSPoweruser", "description": "OnLeaks has revealed that Samsung is working on a new mid-range smartphone which will feature a full-bleed screen and a pop-up selfie camera. Despite pioneering the punch-hole camera, Samsung released the Samsung Galaxy A80 last year with a very elaborate sli…", "url": "https://mspoweruser.com/samsung-working-on-an-a-series-phone-with-a-pop-up-selfie-camera/", "urlToImage": null, "publishedAt": "2020-04-26T12:13:24Z", "content": "OnLeaks has revealed that Samsung is working on a new mid-range smartphone which will feature a full-bleed screen and a pop-up selfie camera.\r\nDespite pioneering the punch-hole camera, Samsung released the Samsung Galaxy A80 last year with a very elaborate sl… [+790 chars]"}, {"source": {"id": "the-next-web", "name": "The Next Web"}, "author": "TNW Deals", "title": "Apple Airpods Pro are just the accessory for our new work-from-home lifestyle. - The Next Web", "description": "TLDR: With active noise cancellation, epic sound and a host of Apple-centric features, the Airpods Pro are perfect for making the home office really feel like the office.\nTrying to ...", "url": "https://thenextweb.com/offers/2020/04/26/apple-airpods-pro-are-just-the-accessory-for-our-new-work-from-home-lifestyle/", "urlToImage": null, "publishedAt": "2020-04-26T11:39:44Z", "content": "TLDR: With active noise cancellation, epic sound and a host of Apple-centric features, the Airpods Pro are perfect for making the home office really feel like the office.\r\nTrying to get work done in your house is never as simple as it seems. When youre in the… [+2376 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Jon Fingas", "title": "You can use some iPhone 8 parts inside an iPhone SE - Yahoo Finance Australia", "description": "The iPhone SE can use some parts from the iPhone 8, but don't expect to borrow a battery.", "url": "https://au.finance.yahoo.com/news/iphone-se-iphone-8-parts-intercangeable-112709142.html", "urlToImage": null, "publishedAt": "2020-04-26T11:27:00Z", "content": "Its cliché to say the new iPhone SE is a recycled iPhone 8, but how many parts do the two share in common, really? Its at once more and less than you think. iFixit has tried swapping parts ahead of its customary teardown report, and its clear that you can use… [+1141 chars]"}, {"source": {"id": null, "name": "Venturebeat.com"}, "author": "Ian Hamilton, UploadVR", "title": "Supernatural gives you a better workout than Beat Saber … or any other VR fitness app - VentureBeat", "description": "After playing Supernatural this week, my legs are sore to a degree unmatched by Beat Saber, Pistol Whip, BoxVR, OhShape, or any other VR app.", "url": "https://venturebeat.com/2020/04/26/supernatural-gives-you-a-better-workout-than-beat-saber-or-any-other-vr-fitness-app/", "urlToImage": null, "publishedAt": "2020-04-26T10:36:06Z", "content": "After playing Supernatural this week, my legs are sore to a degree unmatched by Beat Saber, Pistol Whip, BoxVR, OhShape, or any other VR app.\r\nIts easy to see the influence of those earlier VR games on the new exercise and fitness software from Within, but Su… [+2143 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": null, "title": "‘League of Legends’ Mid-Season Invitational cancelled; Riot focuses on Worlds 2020 - Micky News", "description": "The League of Legends Mid-Season Invitation will not be happening this year. Riot Games will instead take the time to focus on Worlds 2020.", "url": "https://micky.com.au/league-of-legends-mid-season-invitational-cancelled-riot-focuses-on-worlds-2020/", "urlToImage": null, "publishedAt": "2020-04-26T09:35:40Z", "content": "The coronavirus pandemic cancels another highly anticipated big event this year. eSports followers were hopeful that the League of Legends 2020 MSI would still push through after being rescheduled in July.\r\nThe Global League of Legends Esports team has weighe… [+2845 chars]"}, {"source": {"id": null, "name": "Macworld.com"}, "author": "", "title": "Apple’s iPad Pro Magic Keyboard: The heavy truth - Macworld", "description": "It weighs as much as a laptop--and works like one. And it’s just one option among many.", "url": "https://www.macworld.com/article/3539648/heavy-truth-ipad-pro-magic-keyboard.html", "urlToImage": null, "publishedAt": "2020-04-26T09:10:32Z", "content": "When Apple announced the new Magic Keyboard for iPad Pro, it decided to play coy about how much it weighed. The result is that, despite some accurate speculation, none of us found out for sure until this week when the first keyboards arrived in the hands of r… [+5065 chars]"}, {"source": {"id": null, "name": "Motor1.com"}, "author": "Jacob Oliva", "title": "Watch 2021 BMW M3 G80 Go Flat Out At The Nürburgring In Spy Video - Motor1 ", "description": "Don't forget to put your best headphones on while watching this.", "url": "https://www.motor1.com/news/414807/bmw-m3-g80-nurburgring-spy-video/", "urlToImage": null, "publishedAt": "2020-04-26T09:05:19Z", "content": "The next BMW M3 isn't about to be revealed until next year, or in the metal, at least. Despite that, BMW isn't holding back in testing the G80 generation of its performance sedan. Spied at the Nürburgring in Nürburg, Germany, the M3 was caught pushing its lim… [+1419 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": null, "title": "Google, Samsung offering free smartphone repairs for healthcare workers - Micky News", "description": "Google and Samsung are joining forces with uBreakiFix in order to provide free repairs for smartphones owned by healthcare workers.", "url": "https://micky.com.au/google-samsung-offering-free-smartphone-repairs-for-healthcare-workers/", "urlToImage": null, "publishedAt": "2020-04-26T09:00:00Z", "content": "uBreakiFix has confirmed that it is partnering up with Google to help those in the frontlines by promising to fix their Pixel devices for free until June 30 of this year.\r\nAccording to the press release, it is extending the free smartphone repair offer to hea… [+3553 chars]"}, {"source": {"id": null, "name": "9news.com.au"}, "author": "AAP", "title": "Germany flips on app contact tracing - 9News", "description": "Following criticism over privacy concerns Germany has changed tack over which type of smartphone technology it wants to use to trace coronavirus infections.", "url": "https://www.9news.com.au/world/germany-flips-on-app-contact-tracing/8c2bab18-9a5b-43bc-9f27-85cab0de693b", "urlToImage": null, "publishedAt": "2020-04-26T07:56:00Z", "content": "Property News:  How MasterChef's Melissa Leong is coping with social distancing - domain.com.au"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Sirin Kale", "title": "How coronavirus helped TikTok find its voice - The Guardian", "description": "The video-sharing app’s blend of memes, jokes and skits have been a surprise lockdown hit – but teen users are worried it will lose its cool", "url": "https://www.theguardian.com/technology/2020/apr/26/how-coronavirus-helped-tiktok-find-its-voice", "urlToImage": null, "publishedAt": "2020-04-26T07:00:00Z", "content": null}, {"source": {"id": null, "name": "Itnews.com.au"}, "author": null, "title": "NSO ran US-based attack servers: Facebook - iTnews", "description": "Hundreds hacked via QuadraNet and AWS.", "url": "https://www.itnews.com.au/news/nso-ran-us-based-attack-servers-facebook-547219", "urlToImage": null, "publishedAt": "2020-04-26T06:50:00Z", "content": "Facebook has filed legal documents that it says shows that Israeli spyware vendor NSO Group ran command and control servers on American cloud providers, which the social network says were used to hack hundreds of WhatsApp users.\r\nSecurity researcher John Scot… [+2782 chars]"}, {"source": {"id": null, "name": "Dotesports.com"}, "author": "Danny Forster", "title": "Go Deep with 8 new Legends of Runeterra Bilgewater spells and followers - Dot Esports", "description": "Self-mill just got even more powerful.", "url": "https://dotesports.com/lor/news/go-deep-with-4-new-legends-of-runeterra-bilgewater-spells-and-followers", "urlToImage": null, "publishedAt": "2020-04-26T03:43:22Z", "content": "Riot has taken self-mill strategies in Legends of Runeterra to a whole new level with Deep, a new keyword, along with three followers and a new spell to support Nautilus. \r\nThe hype leading up to the release of Rising Tides continued tonight with the reveal o… [+2058 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Desire Athow", "title": "This 4TB PCIe SSD can make your Windows laptop feel more like a MacBook Pro - TechRadar", "description": "Assuming you have a compatible laptop, that is", "url": "https://www.techradar.com/news/this-4tb-pcie-ssd-can-make-your-windows-laptop-feel-more-like-a-macbook-pro", "urlToImage": null, "publishedAt": "2020-04-26T03:00:00Z", "content": "The Apple MacBook Pro 16 still holds bragging rights when it comes to the maximum storage capacity available in a traditional portable laptop. \r\nApple uses a proprietary approach, plugging memory chips directly into the motherboard to reach a whopping 8TB of … [+1489 chars]"}, {"source": {"id": null, "name": "Fool.com"}, "author": "Leo Sun", "title": "Is NVIDIA’s Cloud Gaming Platform Already Dying? - The Motley Fool", "description": "The “Stadia killer” loses over half a dozen major publishers in just two months.", "url": "https://www.fool.com/investing/2020/04/25/is-nvidias-cloud-gaming-platform-already-dying.aspx", "urlToImage": null, "publishedAt": "2020-04-26T02:48:37Z", "content": "When NVIDIA (NASDAQ:NVDA) launched its cloud gaming platform GeForce Now in February, it seemed poised to disrupt the nascent market.\r\nUnlike Alphabet's (NASDAQ:GOOG)(NASDAQ:GOOGL) Google Stadia, which required gamers to repurchase games they already owned, G… [+4458 chars]"}, {"source": {"id": null, "name": "Zdnet.com"}, "author": "Catalin Cimpanu", "title": "Hackers are exploiting a Sophos firewall zero-day - ZDNet", "description": "Sophos releases emergency patch to fix SQL injection bug exploited in the wild, impacting its XG Firewall product.", "url": "https://www.zdnet.com/article/hackers-are-exploiting-a-sophos-firewall-zero-day/", "urlToImage": null, "publishedAt": "2020-04-26T02:39:00Z", "content": "Cyber-security firm Sophos has published an emergency security update on Saturday to patch a zero-day vulnerability in its XG enterprise firewall product that was being abused in the wild by hackers.\r\nSophos said it first learned of the zero-day on late Wedne… [+2563 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "admin", "title": "Android app network removed from Google Play Store - Jimmys Post", "description": "", "url": "https://www.news.com.au/technology/gadgets/mobile-phones/android-app-network-removed-from-google-play-store/news-story/aef721ceea32ed6c6f7ca08ee43375c7/", "urlToImage": null, "publishedAt": "2020-04-26T02:14:02Z", "content": "Google has reportedly removed more than 100 apps with tens of millions of downloads after allegations the apps were part of a co-ordinated group that may have violated store policies.The group allegedly involves at least 27 separate app developers (that could… [+7911 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Marco Chiappetta", "title": "NVIDIA’s RTX Voice Uses AI And GPUs To Eliminate Noise From Your Video Conferences - Forbes", "description": "Whether it be someone typing away on a clicky keyboard, or someone’s kids, pets, or television constantly droning on in the background, interfering with the speaker, background noise just plain stinks.", "url": "https://www.forbes.com/sites/marcochiappetta/2020/04/25/nvidias-rtx-voice-uses-ai-and-gpus-to-eliminate-noise-from-your-video-conferences/", "urlToImage": null, "publishedAt": "2020-04-26T00:56:14Z", "content": "NVIDIA RTX Voice\r\nNVIDIA\r\nNow that were all working from home and dealing with the unfortunate realities of the COVID-19 pandemic, the total number and frequency of audio/video conferences has skyrocketed. Zoom and WebEx meetings are daily occurrences for man… [+2110 chars]"}, {"source": {"id": null, "name": "Ausdroid.net"}, "author": null, "title": "LG Velvet specs leak: how good is your Korean? - Ausdroid", "description": "LG are looking to return to the top end of the smartphone market this year with the LG Velvet and all leaks and teasers so far point to it being a decent device. The phone is a great looking device housing mid to premium tier specs. Overnight we have seen a c…", "url": "https://ausdroid.net/2020/04/26/lg-velvet-specs-leak-how-good-is-your-korean/", "urlToImage": null, "publishedAt": "2020-04-26T00:28:53Z", "content": "LG are looking to return to the top end of the smartphone market this year with the LG Velvet and all leaks and teasers so far point to it being a decent device. The phone is a great looking device housing mid to premium tier specs.\r\nOvernight we have seen a … [+1552 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": null, "title": "Xbox Series X is an ‘absolute beast’ says former Playstation developer - Micky News", "description": "An industry veteran and former Playstation developer weigh in on Xbox Series X and PS5 comparisons calling the former an “absolute beast.”", "url": "https://micky.com.au/xbox-series-x-is-an-absolute-beast-says-former-playstation-developer/", "urlToImage": null, "publishedAt": "2020-04-26T00:11:00Z", "content": "Sony and Microsoft had long been neck and neck when it comes to developing gaming consoles. For a long time, Sonys Playstation sat on the top of the industry over Microsofts Xbox. However, things are soon about to change as Microsoft brings in what they are c… [+3147 chars]"}, {"source": {"id": null, "name": "Ausdroid.net"}, "author": null, "title": "Huawei P40 Pro — One camera to rule them all - Ausdroid", "description": "There’s a lot of politics surrounding the release of the Huawei P40 Pro and as a result, the first article we published after getting our hands on it had to be about life without Google services. This time around we want to get away from what the phone doesn’…", "url": "https://ausdroid.net/2020/04/26/huawei-p40-pro-one-camera-to-rule-them-all/", "urlToImage": null, "publishedAt": "2020-04-26T00:03:22Z", "content": "Theres a lot of politics surrounding the release of the Huawei P40 Pro and as a result, the first article we published after getting our hands on it had to be about life without Google services. This time around we want to get away from what the phone doesnt … [+7970 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Five firms booming despite the lockdown - BBC News", "description": "Amid all the threats posed by Covid-19 pandemic, some firms are finding ways to forge ahead.", "url": "https://www.bbc.co.uk/news/business-52383193", "urlToImage": null, "publishedAt": "2020-04-25T23:20:25Z", "content": "Image copyrightAFPImage caption\r\n People sharing a drink with friends on video calls have given wine sellers a new opportunity\r\nFor many businesses, coronavirus is the toughest problem they've ever had to face.\r\nWith their customers under lockdown, shops shut… [+6221 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Lloyd Coombes", "title": "Best RPGs 2020: the top role-playing games for console and PC - Techradar Australia", "description": "Grab your broadsword and ready your controller", "url": "https://www.techradar.com/news/best-rpgs", "urlToImage": null, "publishedAt": "2020-04-25T21:07:32Z", "content": "Looking for the best RPGs (or role-playing games) around? Then you've come to the right place.\r\nThese days its more often than not that a game features RPG elements. Whether thats a skill tree, dialogue options, or anything else that was once a staple of the … [+13517 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "admin", "title": "Porsche Cayman GT4 review: New range-topping baby 911 - Jimmys Post", "description": "", "url": "https://www.news.com.au/technology/innovation/motoring/luxury/porsche-cayman-gt4-review-new-rangetopping-baby-911/news-story/a5c402443dbd717c8400ca8bffe46cbf/", "urlToImage": null, "publishedAt": "2020-04-25T20:30:52Z", "content": "There is no sports mode in Porsches 718 Cayman GT4.No buttons on the racecar-spec steering wheel, and no safety assistance such as lane keeping assistance or active cruise control. Forget about self-parking systems, drift modes, fake engine noise or multi-col… [+3718 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Jon Fingas", "title": "iPhone SE can take portrait photos of non-humans using an app - Yahoo Finance Australia", "description": "Halide's updated camera apps let you snap iPhone SE portrait photos of anything, not just people.", "url": "https://au.finance.yahoo.com/news/halide-camera-iphone-se-portaits-of-non-humans-195324723.html", "urlToImage": null, "publishedAt": "2020-04-25T19:53:00Z", "content": "The iPhone SE offers many things for the money, but a powerful portrait mode isnt one of them. Much like the iPhone XR, youre stuck taking portrait photos of people if you use the default camera app a problem at a time when youre supposed to avoid most human … [+747 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Fallout 76: Wastelanders Review - IGN", "description": "Fallout 76: Wastelanders reviewed by David Jagneaux on PlayStation 4 Pro. Also available on PC and Xbox One. \"With the Wastelanders update, Fallout 76 has ta...", "url": "https://www.youtube.com/watch?v=U-uDLErALu0", "urlToImage": null, "publishedAt": "2020-04-25T19:51:32Z", "content": "Fallout 76: Wastelanders reviewed by David Jagneaux on PlayStation 4 Pro. Also available on PC and Xbox One.\r\n\"With the Wastelanders update, Fallout 76 has taken a solid step in the right direction after its dire launch. New human NPCs bring a healthy dose of… [+633 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Stephen Shankland", "title": "Microsoft tells Chrome users to switch to its Edge browser on Outlook - CNET", "description": "Microsoft's web browser and email service are \"better together,\" the company argues.", "url": "https://www.cnet.com/news/microsoft-tells-chrome-users-to-switch-to-its-edge-browser-on-outlook/", "urlToImage": null, "publishedAt": "2020-04-25T19:18:49Z", "content": "Illustration by Stephen Shankland/CNET\r\nFor years, Google has placed prominent pop-up ads on its web properties suggesting people switch to Google's Chrome browser, saying they'll get better performance, features and security. Now Microsoft is trying the same… [+1886 chars]"}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "Riot Games' Closed Beta Game Valorant Comes Competitive Mode - Somag News", "description": "The new FPS game Valorant from Riot Games, which is currently in closed beta, adds competitive mode for players to face opponents at their own level. The new mod will be added with the 0.49 update. The FPS game Valorant, released by Riot Games, the developer …", "url": "https://www.somagnews.com/riot-games-closed-beta-game-valorant-comes-competitive-mode/", "urlToImage": null, "publishedAt": "2020-04-25T19:05:00Z", "content": "The new FPS game Valorant from Riot Games, which is currently in closed beta, adds competitive mode for players to face opponents at their own level. The new mod will be added with the 0.49 update.\r\nThe FPS game Valorant, released by Riot Games, the developer… [+2067 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Zack Zwiezen", "title": "New GTA Online Missions Are All About Preparing For A Recession - Kotaku Australia", "description": "Grand Theft Auto Online received a new update a few days ago that added six new missions. These missions are all about an old-time GTA Online character, Gerald, and his attempts to get ready for an upcoming recession. Five of them are good and one of them is …", "url": "https://www.kotaku.com.au/2020/04/new-gta-online-missions-are-all-about-preparing-for-a-recession/", "urlToImage": null, "publishedAt": "2020-04-25T18:00:00Z", "content": "Grand Theft Auto Online received a new update a few days ago that added six new missions. These missions are all about an old-time GTA Online character, Gerald, and his attempts to get ready for an upcoming recession. Five of them are good and one of them is … [+2803 chars]"}, {"source": {"id": null, "name": "Thetecheducation.com"}, "author": "Tarika Sharma", "title": "Nintendo Switch: Patch Notes 10.0.1 Update For The Popular Console - The Tech Education", "description": "Advertisement Nintendo Switch The Nintendo Switch is developed by Nintendo Platform Technology Development. Foxconn, Hosiden manufactured it. It was released on March 3, 2017 worldwide! So, basically it is a hybrid video game console. Well, it is designed to …", "url": "https://thetecheducation.com/nintendo-switch-patch-notes-10-0-1-update-for-extremely-popular-console-improvements-and-more/", "urlToImage": null, "publishedAt": "2020-04-25T17:36:29Z", "content": "Nintendo Switch\r\nThe Nintendo Switch is developed by Nintendo Platform Technology Development. Foxconn, Hosiden manufactured it. It was released on March 3, 2017 worldwide! So, basically it is a hybrid video game console.\r\nWell, it is designed to fit your lif… [+2087 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Kevin Knezevic", "title": "Animal Crossing: New Horizons Free Goodies Available For Nintendo Switch Online Members - GameSpot", "description": "NSO subscribers can claim a free, exclusive Nook Inc. silk rug for New Horizons from the Nintendo Switch Eshop.", "url": "https://www.gamespot.com/articles/animal-crossing-new-horizons-free-goodies-availabl/1100-6476315/", "urlToImage": null, "publishedAt": "2020-04-25T16:47:00Z", "content": "Nintendo is offering a few special freebies for Animal Crossing: New Horizons. In addition to the Pocket Camp crossover items you can receive through the series' mobile spin-off, Switch Online members can nab an exclusive Nook Inc. silk rug from the Switch Es… [+1592 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Gareth Beavis", "title": "iPhone SE 2020 teardown reveals intriguing facts about battery and camera - TechRadar", "description": "Things are more similar than we anticipated", "url": "https://www.techradar.com/news/iphone-se-2020-teardown-reveals-intriguing-facts-about-battery-and-camera", "urlToImage": null, "publishedAt": "2020-04-25T16:21:00Z", "content": "Weve been waiting to see what parts are in Apples new iPhone - our iPhone SE review left us with a few questions we wanted answering, and iFixits iPhone SE early teardown has begun to provide a few of them.\r\nWhile theres still more to come when the full teard… [+2050 chars]"}, {"source": {"id": null, "name": "Mspoweruser.com"}, "author": "http://www.facebook.com/pages/wmpowerusercom/37708414657", "title": "Xiaomi has a new twist on the bezel-less smartphone - MSPoweruser - MSPoweruser", "description": "Until we have a proper under-display front-facing camera, the race to make a full-screen smartphone which still offers a selfie camera will continue to deliver some creative solutions. Today we have a unique solution from Xiaomi described in an April 24 paten…", "url": "https://mspoweruser.com/xiaomi-has-a-new-twist-on-the-borderless-smartphone/", "urlToImage": null, "publishedAt": "2020-04-25T16:00:30Z", "content": "Until we have a proper under-display front-facing camera, the race to make a full-screen smartphone which still offers a selfie camera will continue to deliver some creative solutions.\r\nToday we have a unique solution from Xiaomi described in an April 24 pate… [+602 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Matthew Forde", "title": "Sony slip-ups: ahead of the PS5, we look back at the PlayStation tech that just didn't work - TechRadar", "description": "They can't all be winners", "url": "https://www.techradar.com/news/sony-slip-ups-ahead-of-the-ps5-we-look-back-at-the-playstation-tech-that-just-didnt-work", "urlToImage": null, "publishedAt": "2020-04-25T16:00:00Z", "content": "As we motor towards the next generation of consoles, Sony currently holds all of the cards and will be looking to build upon the monumental success it found during the current generation. Its sometimes easy to forget just how well the PlayStation 4 has sold, … [+6393 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Apple Watch turns 5: Did you know this is not the first watch Apple has designed? - Hindustan Times", "description": "That and four other cool things you did not know about the Apple Watch", "url": "https://www.hindustantimes.com/tech/apple-watch-turns-5-did-you-know-this-is-not-the-first-watch-apple-has-designed/story-TaLd5mAFahahxirkVPkLaN.html", "urlToImage": null, "publishedAt": "2020-04-25T15:57:39Z", "content": "Apple launched the first Apple Watch five years ago this week. The Apple Watch was Tim Cook’s first high profile product launch after he took over from Steve Jobs. For Jobs, the Apple iPad was the last big product that he launched. \r\nOver the last five years,… [+4241 chars]"}, {"source": {"id": null, "name": "Newslagoon.com"}, "author": "Team NewsLagoon", "title": "Apple: Apple Plans First ARM-Powered Macs In 2021 - News Lagoon", "description": "What’re new features are planning by APPLE this time? Well, we have some a piece of news of new inventions on Macs by Apple. Apple is always at the edge of the seat to kick out the new inventions. And now, the new creation on Macs is soon to air, as of the re…", "url": "https://newslagoon.com/en/entertainment/apple-apple-plans-first-arm-powered-macs-in-2021/40891/", "urlToImage": null, "publishedAt": "2020-04-25T15:47:20Z", "content": "Taking advantage of the lengthy stretch of runway ahead of the Primetime Emmy Awards in September and in response to the COVID-19 pandemic, the Television Academy has opted to revise the upcoming Emmy calendar and tweak its hanging episode rules for series an… [+4011 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Mariella Moon", "title": "Former Apple designer drops Watch trivia on its fifth anniversary - Yahoo Finance Australia", "description": "Imran Chaudhri, Apple’s design lead for hardware from 1995 to 2016, dropped some details about Apple Watch’s history on its fifth anniversary.  While Chaudhri is no longer with the tech giant, he shared a photo of the Watch team on launch day, as well as a re…", "url": "https://au.finance.yahoo.com/news/former-apple-designer-drops-watch-trivia-on-its-fifth-anniversary-144849444.html", "urlToImage": null, "publishedAt": "2020-04-25T14:48:00Z", "content": "Imran Chaudhri, Apples design lead for hardware from 1995 to 2016, dropped some details about Apple Watchs history on its fifth anniversary. While Chaudhri is no longer with the tech giant, he shared a photo of the Watch team on launch day, as well as a repro… [+1881 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Zack Zwiezen", "title": "Battlefield V Will Get One Final Update In June - Kotaku Australia", "description": "Battlefield developers Dice announced earlier this week that one final update is coming to Battlefield V in June, though they will continue to combat cheaters even after this last update....", "url": "https://www.kotaku.com.au/2020/04/battlefield-v-will-get-one-final-update-in-june/", "urlToImage": null, "publishedAt": "2020-04-25T14:30:00Z", "content": "Battlefield developers Dice announced earlier this week that one final update is coming to Battlefield V in June, though they will continue to combat cheaters even after this last update.\r\nReleased in November 2018, Battlefield V took the popular series back … [+822 chars]"}, {"source": {"id": null, "name": "Thejakartapost.com"}, "author": "The Jakarta Post", "title": "Pac-Man joins stay-at-home movement with fortnight-long giveaway - The Jakarta Post - Jakarta Post", "description": "Chomp ghosts and flatten the curve as \"Pac-Man: Championship Edition 2\" goes free on PlayStation 4, Xbox One and PC.", "url": "https://www.thejakartapost.com/life/2020/04/25/pac-man-joins-stay-at-home-movement-with-fortnight-long-giveaway.html", "urlToImage": null, "publishedAt": "2020-04-25T14:03:00Z", "content": "Bandai Namco's most famous video game character, Pac-Man, is now part of the home isolation initiative.\r\nThe iconic video game company is giving away \"Pac-Man: Championship Edition 2\" for free for PlayStation 4 on the PlayStation Network Store, Xbox One on th… [+1514 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "BARDOWN PLAYS PARTY GAMES: SUPER SMASH BROS. ULTIMATE - TSN", "description": "Prior to quarantine, Marissa, Jesse, Eric and Teddy put up their dukes in Super Smash Bros. Ultimate for the Nintendo Switch. Would Jesse's N64 abilities tra...", "url": "https://www.youtube.com/watch?v=utkNuTUD1Js", "urlToImage": null, "publishedAt": "2020-04-25T13:55:43Z", "content": null}, {"source": {"id": null, "name": "Businessinsider.com.au"}, "author": "Ben Gilbert", "title": "Nintendo says that at least 160000 Switch users' accounts have been hacked — here's how to make your account more secure with two-factor authentication - Business Insider Australia", "description": "Do you have a Nintendo Switch? Did you also have a Nintendo 3DS or Wii U?", "url": "https://www.businessinsider.com.au/how-to-set-up-nintendo-switch-two-factor-authentication-2020-4", "urlToImage": null, "publishedAt": "2020-04-25T12:50:00Z", "content": "<ul><li>Nintendo’s Switch game console is wildly popular, with over 50 million units sold – and it’s currently out of stock nearly everywhere due to increased demand as millions are forced indoors amid the coronavirus pandemic.</li><li>\r\nAs more people than e… [+2175 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Simon Parkin", "title": "Streets of Rage 4 review – the return of the beat 'em up - The Guardian", "description": "This lovingly created sequel offers all the action and fun of a 90s arcade game", "url": "https://www.theguardian.com/games/2020/apr/25/streets-of-rage-4-review-the-return-of-the-beat-em-up", "urlToImage": null, "publishedAt": "2020-04-25T12:04:06Z", "content": "In the Netflix animated series Hi Score Girl, a romantic comedy set in early-90s Japan, Haruo Yaguchi, a low-achieving high-school loner is whiling away his time in the local video game arcades when he meets Akira Ono, a popular wunderkind from a wealthy fami… [+4209 chars]"}, {"source": {"id": null, "name": "Digitalinformationworld.com"}, "author": "Arooj Ahmed", "title": "Facebook Is Temporarily Shelving Its Plans To Include Ads In Its WhatsApp Messaging Service As Mark Zuckerberg Feared Backlash - Digital Information World", "description": "WhatsApp will not be displaying ads for the time being as Mark Zuckerberg feared backlash from its users.", "url": "https://www.digitalinformationworld.com/2020/04/facebook-temporarily-shelving-ads-launch-in-whatsapp-mark-zuckerberg-feared-backlash.html", "urlToImage": null, "publishedAt": "2020-04-25T11:16:14Z", "content": "<ul><li>WhatsApp was supposed to start displaying ads at the start of the year 2020.</li><li>The company was working on a plan for more than a year to shove ads into the WhatsApp messaging service to generate revenue every year.</li><li>WhatsApp will not be d… [+2877 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Matt Hanson", "title": "Smartphones are a bad deal – let's hope laptops don't go the same way - TechRadar", "description": "Opinion: forced obsolescence is a menace", "url": "https://www.techradar.com/news/smartphones-are-a-bad-deal-lets-hope-laptops-dont-go-the-same-way", "urlToImage": null, "publishedAt": "2020-04-25T10:00:00Z", "content": "Imagine buying a new laptop, only to find that three years later Microsoft/Apple stopped offering software updates for it, effectively forcing you to upgrade in order to ensure you had a machine that was secure and ran smoothly.\r\nAnd imagine that, during thos… [+5094 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": null, "title": "‘Overwatch’ update on PTR adds changes to communications wheel - Micky News", "description": "A new Overwatch update brings a much awaited change to the communications wheel in the game and players are excited.", "url": "https://micky.com.au/overwatch-update-on-ptr-adds-changes-to-communications-wheel/", "urlToImage": null, "publishedAt": "2020-04-25T09:12:00Z", "content": "Last week, Blizzard’s Jeff Kaplan responded to a message on the Overwatch forums, suggesting that they are already working on making some appropriate changes to the communication wheel in the game. True enough, the developer delivered, and the update has fina… [+2621 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": null, "title": "Big tech companies play crucial role during COVID-19 pandemic - Micky News", "description": "As the world races against the clock to find the cure against COVID-19, big tech companies are also stepping up to their role.", "url": "https://micky.com.au/big-tech-companies-play-crucial-role-during-covid-19-pandemic/", "urlToImage": null, "publishedAt": "2020-04-25T08:44:17Z", "content": "Before the widespread threat of the COVID-19 virus, big tech companies are among the most vilified industries. They are criticized over allegations of unethical data harvesting and tracking users.\r\nRecently, these very same critics are tapping the massive com… [+2510 chars]"}, {"source": {"id": null, "name": "Channelnews.com.au"}, "author": "David Richards", "title": "Was CES 2020 A Super Spreader For COVID-19 After Tens Of Thousands Of Chinese Poured Into The US Event From Wuhan & Hubei Provence. - ChannelNews", "description": null, "url": "https://www.channelnews.com.au/was-ces-2020-a-super-spreader-for-covid-19-after-tens-of-thousands-of-chinese-poured-into-the-us-event-from-wuhan-provence/", "urlToImage": null, "publishedAt": "2020-04-25T08:20:12Z", "content": "One third of CES the world’s biggest Consumer Electronics Show in Las Vegas is Chinese exhibitors and at the 2020 show. tens of thousands of Chinese visitors poured into the event which is now being investigated as a hot spot that helped propel COVID-19 in th… [+3655 chars]"}, {"source": {"id": null, "name": "Notebookcheck.net"}, "author": "Daniel R Deakin", "title": "AMD Ryzen 3 3300X starts cementing its position as a budget CPU champion by beating the Intel Core i3-10300 in Time Spy benchmark - Notebookcheck.net", "description": "An AMD Ryzen 3 3300X and an Intel Core i3-10300 have been spotted in a comparison on 3DMark’s Time Spy benchmark. In another blow for Team Blue, it appears that the new budget Matisse chip from AMD has the edge on the upcoming Comet Lake processor. The Ryzen …", "url": "https://www.notebookcheck.net/AMD-Ryzen-3-3300X-starts-cementing-its-position-as-a-budget-CPU-champion-by-beating-the-Intel-Core-i3-10300-in-Time-Spy-benchmark.462912.0.html", "urlToImage": null, "publishedAt": "2020-04-25T08:03:15Z", "content": "We already had some first benchmark results for both the AMD Ryzen 3 3300X and the Ryzen 3 3100, where both of the recently announced processors managed to thoroughly challenge Intels aging Kaby Lake Core i7-7700K desktop processor. However, it seems the Ryze… [+1184 chars]"}, {"source": {"id": null, "name": "Trueachievements.com"}, "author": "Heidi Nicholas", "title": "Sci-fi adventure Deliver Us The Moon joins Xbox Game Pass and Game Pass for PC today - TrueAchievements", "description": "Deliver Us The Moon is a sci-fi action adventure title which draws inspiration from movies such as Interstellar, and which joins the Xbox Game Pass and Xbox Game Pass for PC services today as a day one addition.", "url": "https://www.trueachievements.com/n41593/deliver-us-the-moon", "urlToImage": null, "publishedAt": "2020-04-25T07:59:53Z", "content": "The Xbox team has been busy lately: just yesterday, they surprise-dropped the announcement that Red Dead Redemption 2 will join Xbox Game Pass in May. Before that, they announced new titles for Xbox Game Pass, along with several new titles for Xbox Game Pass … [+1728 chars]"}, {"source": {"id": null, "name": "Phonemantra.com"}, "author": "Gourav", "title": "Samsung disappointed with the cancellation of an interesting flagship smartphone - Phone Mantra", "description": "Pandemic continues to crush many companies The release of the Samsung Galaxy S20 + 5G Olympic Games Edition smartphone is officially canceled. The Japanese operator NTT Docomo, which received exclusive rights to sell a special version of the Galaxy S20 +, can…", "url": "https://phonemantra.com/samsung-disappointed-with-the-cancellation-of-an-interesting-flagship-smartphone/", "urlToImage": null, "publishedAt": "2020-04-25T07:38:00Z", "content": "Pandemic continues to crush many companies\r\nThe release of the Samsung Galaxy S20 + 5G Olympic Games Edition smartphone is officially canceled. The Japanese operator NTT Docomo, which received exclusive rights to sell a special version of the Galaxy S20 +, ca… [+956 chars]"}, {"source": {"id": null, "name": "Pickr.com.au"}, "author": "Leigh :) Stark", "title": "Hisense looks to size, quality for 4K TVs in 2020 - Pickr", "description": "Democratising TV technology and making tellies affordable for all, Hisense is cleaning the range in 2020 and pulling back to two, with the choice down to size.", "url": "https://www.pickr.com.au/news/2020/hisense-looks-to-size-quality-for-4k-tvs-in-2020/", "urlToImage": null, "publishedAt": "2020-04-25T05:53:35Z", "content": "Democratising TV technology and making tellies affordable for all, Hisense is cleaning the range in 2020 and pulling back to two, with the choice down to size. \r\nIt’s not just Samsung and LG showing off their latest TVs, because it’s TV changeover season, whi… [+4671 chars]"}, {"source": {"id": null, "name": "Phonemantra.com"}, "author": "Admin", "title": "Microsoft asks to properly complain about the \"disastrous\" update of Windows 10, Problems are being studied - Phone Mantra", "description": "The recent planned update of the Windows 10 operating system has turned out to users a whole set of serious problems, complaints about which began almost immediately.", "url": "https://phonemantra.com/microsoft-asks-to-properly-complain-about-the-disastrous-update-of-windows-10-problems-are-being-studied/", "urlToImage": null, "publishedAt": "2020-04-25T01:38:00Z", "content": "The Windows 10 update on April 14th under KB4549951 was supposed to patch four very serious security holes in the operating system. The update was highly recommended for all users. \r\nAmong the complaints are the  blue screen of death, a global system crash, d… [+632 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Oscar Gonzalez", "title": "Travis Scott event in Fortnite: How to watch the encore and find the Giant Astro Heads - CNET", "description": "The rapper dropped new tracks in a jaw-dropping concert. Catch the next show at midnight.", "url": "https://www.cnet.com/news/travis-scott-event-in-fortnite-how-to-watch-the-encore-and-find-the-giant-astro-heads/", "urlToImage": null, "publishedAt": "2020-04-25T01:02:37Z", "content": "Play some Fortnite and listen to a new track from Travis Scott.\r\nEpic Games\r\nFortnite events aren't only for players to check out new content from developer Epic Games. The popular battle royale game has also played host to multiple premieres and collaboratio… [+3718 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": "www.facebook.com/christian.n.puno", "title": "Ford Mustang Cobra Jet 1400: Time for electric cars to take the limelight - Micky News", "description": "Time for electric cars to take limelight, Ford mechanics and scientists took this further. The result? 'Ford Mustang Cobra Jet 1400'", "url": "https://micky.com.au/ford-mustang-cobra-jet-1400-time-for-electric-cars-to-take-the-limelight/", "urlToImage": null, "publishedAt": "2020-04-24T22:43:00Z", "content": "The Ford Mustang Cobra Jet 1400 isnt a typical electric car. This cars creation coincided with drag racing in mind. Imagine how much electrical power it needs to go on such high speed. According to its creators, this monster car can reach a fourth of a mile w… [+2234 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Logitech G G203 LIGHTSYNC Promo Video - Techaeris", "description": "This is an overview of the new Logitech G G203 LIGHTSYNC Gaming Mouse. The video was provided by Logitech for resharing. Available in May buy here: https://w...", "url": "https://www.youtube.com/watch?v=i3_Ale_138I", "urlToImage": null, "publishedAt": "2020-04-24T21:57:36Z", "content": null}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Steve Watts", "title": "Why XCOM: Chimera Squad Makes Big Changes To The Series Formula - GameSpot", "description": "Lead designer Mark Nauta talks about why Firaxis made some dramatic changes to the XCOM formula fans have known for years.", "url": "https://www.gamespot.com/articles/why-xcom-chimera-squad-makes-big-changes-to-the-se/1100-6476362/", "urlToImage": null, "publishedAt": "2020-04-24T21:35:00Z", "content": "XCOM: Chimera Squad is nearly here, just weeks after it was revealed. This experimental, budget-priced XCOM game makes some big changes to the series' standard formula, including a preset team and straying from the usual permadeath element. It's clear that Fi… [+5415 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "iPad Pro Magic Keyboard Review: Almost Perfect... - Dom Esposito", "description": "Apple Magic Keyboard Review - Best iPad Keyboard Case? Worth the Money? This iPad Pro Magic Keyboard packs a trackpad, backlit keys, and. costs $300+ but sho...", "url": "https://www.youtube.com/watch?v=_evwRhwt8IQ", "urlToImage": null, "publishedAt": "2020-04-24T21:14:17Z", "content": "Apple Magic Keyboard Review - Best iPad Keyboard Case? Worth the Money? This iPad Pro Magic Keyboard packs a trackpad, backlit keys, and. costs $300+ but should you buy it? Check out my Magic Keyboard for iPad Pro review! Covering design, SideCar use, keyboar… [+238 chars]"}, {"source": {"id": null, "name": "Caradvice.com.au"}, "author": "Justin Narayan", "title": "Ford Mustang crowned the most successful sports car of 2019 - CarAdvice", "description": "America just wasn’t enough for the original pony car. The Ford Mustang has officially gone global. Last year saw the Mustang rise to the top of the sports car world, with recognition from fans from...", "url": "https://www.caradvice.com.au/845186/ford-mustang-crowned-the-most-successful-sports-car-of-2019/", "urlToImage": null, "publishedAt": "2020-04-24T20:05:00Z", "content": "More than 100,000 Mustangs were sold globally last year. Even though sales have waned in Australia, it remains one of Ford's most popular models.\r\nAmerica just wasn’t enough for the original pony car. The Ford Mustang has officially gone global.\r\nLast year sa… [+1907 chars]"}, {"source": {"id": null, "name": "Sahiwal.tv"}, "author": "Jeremy Spirogis", "title": "Call of Duty: Mobile World Championship 2020: the best way to get together? - Sahiwal Tv", "description": "After PUBG Mobile, it seems like Call of Duty: Mobile has an esports match to host. Call of Duty: Mobile World Championship 2020, the match has additionally been requested to…", "url": "https://sahiwal.tv/call-of-duty-mobile-world-championship-2020-how-to-party-2/", "urlToImage": null, "publishedAt": "2020-04-24T19:59:00Z", "content": "After PUBG Mobile, it seems like Call of Duty: Mobile has an esports match to host. Call of Duty: Mobile World Championship 2020, the match has additionally been requested to supply in-game prizes in addition to money prizes. It will begin on 30 April and is … [+2572 chars]"}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "Microsoft Word Receives An Update For 'Double Space Error' - Somag News", "description": "Software giant Microsoft has put an end to the double space discussion in Word, one of the most used text editors today. With the updated app, users will now receive a double-post error message that they accidentally left. One of the tools that we all use fre…", "url": "https://www.somagnews.com/microsoft-word-receives-update-double-space-error/", "urlToImage": null, "publishedAt": "2020-04-24T19:58:00Z", "content": "Software giant Microsoft has put an end to the double space discussion in Word, one of the most used text editors today. With the updated app, users will now receive a double-post error message that they accidentally left.\r\nOne of the tools that we all use fr… [+1616 chars]"}, {"source": {"id": null, "name": "Pcmag.com"}, "author": null, "title": "iFrogz Airtime Sport - Review 2020 - PCMag AU", "description": "The true wireless iFrogz Airtime Sport earphones suffer from fit and audio performance issues, making their affordable price feel like less of a bargain.", "url": "https://au.pcmag.com/headphones/66533/ifrogz-airtime-sport", "urlToImage": null, "publishedAt": "2020-04-24T19:53:00Z", "content": "We test plenty of true wireless earbuds designed for running and sports, and often the pricing for models that are sweat resistant and can withstand a workout is in the $150-and-up range. So the iFrogz Airtime Sport, while not unique in any way, can help fill… [+5664 chars]"}, {"source": {"id": null, "name": "Lifehacker.com.au"}, "author": "David Murphy", "title": "Are You Charging Your MacBook On The Wrong Side? - Lifehacker Australia", "description": "Yes, you read that headline correctly. There is apparently a “right” way and a “wrong” way to connect devices to a MacBook with Thunderbolt/USB-C ports on both sides. Doing it wrong can affect your computer’s performance....", "url": "https://www.lifehacker.com.au/2020/04/are-you-charging-your-macbook-on-the-wrong-side/", "urlToImage": null, "publishedAt": "2020-04-24T19:30:00Z", "content": "Yes, you read that headline correctly. There is apparently a right way and a wrong way to connect devices to a MacBook with Thunderbolt/USB-C ports on both sides. Doing it wrong can affect your computers performance.\r\nI recently encountered this knowledge on … [+3969 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Valve Source Code LEAKED - Hot off the Press Start #34 - GameFront", "description": "Support us on Patreon! - https://www.patreon.com/gamefront - James is back once more with the latest gaming news, including more bad news for GeForce Now, ju...", "url": "https://www.youtube.com/watch?v=D37UfGQ1x1o", "urlToImage": null, "publishedAt": "2020-04-24T18:47:41Z", "content": "Support us on Patreon! - https://www.patreon.com/gamefront - James is back once more with the latest gaming news, including more bad news for GeForce Now, justice for Warzone cheaters, and the source code for Team Fortress 2 and CS:GO leaking online.\r\n#GeForc… [+287 chars]"}]}