{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Forbes.com"}, "author": "Zak Doffman", "title": "Huawei Surprises Millions Of Users With Stunning Google Alternative - Forbes", "description": "Good news for Huawei users—not good news for Google.", "url": "https://www.forbes.com/sites/zakdoffman/2020/04/26/huawei-surprises-millions-of-users-with-stunning-google-alternative/", "urlToImage": null, "publishedAt": "2020-04-26T06:19:25Z", "content": "Sergei Karpukhin/TASS\r\nThe Google stakes for Huawei have never been higher. The company is clear that 2020 will be its toughest year yet. Its own New Years message described it as a battle for survival, and its first-quarter growth saw growth of just 1.4% com… [+4636 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Tech Desk", "title": "You must check out these interesting new WhatsApp features to chat better - The Indian Express", "description": "At times, it becomes hard to keep a track of all the new features added to WhatsApp so we have listed all features/updates introduced recently.", "url": "https://indianexpress.com/article/technology/social/whatsapp-new-features-6378983/", "urlToImage": null, "publishedAt": "2020-04-26T02:55:24Z", "content": "By: Tech Desk | New Delhi | \r\nUpdated: April 26, 2020 8:24:03 am\r\nRecently added WhatsApp features that you should know about.WhatsApp is one of the most popular messaging services on the planet with over 2 billion worldwide users. The Facebook-owned platform… [+2585 chars]"}, {"source": {"id": null, "name": "Technoinfoplus.com"}, "author": null, "title": "How Apple's iPad is going to be the Device of COVID-19 - Techno Info Plus", "description": "How Apple’s iPad is going to be the Device of COVID-19 Last few days have seen a lot of talk about how the global pandemic has influenced technology trends all over the world. With technology flying off the shelves in this worldwide lockdown, Apple’s iPad has…", "url": "https://technoinfoplus.com/how-apples-ipad-is-going-to-be-the-device-of-covid-19/", "urlToImage": null, "publishedAt": "2020-04-26T01:39:00Z", "content": "Last few days have seen a lot of talk about how the global pandemic has influenced technology trends all over the world. With technology flying off the shelves in this worldwide lockdown, Apples iPad has gained relevance.\r\nWhile the big players ignored the th… [+1595 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": null, "title": "Huawei AppGallery: Can it replace the Google Play Store? - Micky News", "description": "With Huawei's P40 and P40 Pro only sporting Huawei Media Suite, can the Huawei AppGallery replace the Google Play Store?", "url": "https://micky.com.au/huawei-app-gallery-can-it-replace-the-google-play-store/", "urlToImage": null, "publishedAt": "2020-04-26T00:48:34Z", "content": "The departure of the Google Play Store on Huawei devices started when the U.S. imposed a trade ban on the Chinese OEM. This means that Huawei may run the Android software, but the Google Media Suite is not allowed.\r\nGmail, YouTube, Google Photos, and many mor… [+4628 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": null, "title": "160,000 Nintendo Network IDs compromised from suspected breach - Micky News", "description": "Over 160,000 Nintendo Network IDs have been compromised and all users are encouraged to observe safety measures while Nintendo investigates.", "url": "https://micky.com.au/160000-nintendo-network-ids-compromised-from-suspected-breach/", "urlToImage": null, "publishedAt": "2020-04-25T23:46:00Z", "content": "The Japanse video game giants have confirmed the week-long circulating issue about the compromised Nintendo accounts.\r\nAlthough the company defers from calling it a breach, as initial investigation points no evidence towards it, they did confirm that there’s … [+3051 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Kevin Knezevic", "title": "Pokemon Go April Abra Community Day Now Live: Shiny Abra, Bonuses, And Extended Hours - GameSpot", "description": "Pokemon Go's delayed Abra Community Day is now set for Saturday, April 25; here's everything you need to know about the event.", "url": "https://www.gamespot.com/articles/pokemon-go-april-abra-community-day-now-live-shiny/1100-6474599/", "urlToImage": null, "publishedAt": "2020-04-25T22:00:00Z", "content": "Pokemon Go's long-delayed Abra Community Day has finally arrived. The event, which was originally slated to take place on March 15 before developer Niantic postponed it due to the COVID-19 pandemic, will now be held today, April 25, more than a month after it… [+3241 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "admin", "title": "Porsche Cayman GT4 review: New range-topping baby 911 - Jimmys Post", "description": "", "url": "https://www.news.com.au/technology/innovation/motoring/luxury/porsche-cayman-gt4-review-new-rangetopping-baby-911/news-story/a5c402443dbd717c8400ca8bffe46cbf/", "urlToImage": null, "publishedAt": "2020-04-25T20:30:52Z", "content": "There is no sports mode in Porsches 718 Cayman GT4.No buttons on the racecar-spec steering wheel, and no safety assistance such as lane keeping assistance or active cruise control. Forget about self-parking systems, drift modes, fake engine noise or multi-col… [+3718 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Jon Fingas", "title": "iPhone SE can take portrait photos of non-humans using an app - Yahoo Lifestyle", "description": "Halide's updated camera apps let you snap iPhone SE portrait photos of anything, not just people.", "url": "https://au.lifestyle.yahoo.com/halide-camera-iphone-se-portaits-of-non-humans-195324723.html", "urlToImage": null, "publishedAt": "2020-04-25T19:53:00Z", "content": "The iPhone SE offers many things for the money, but a powerful portrait mode isnt one of them. Much like the iPhone XR, youre stuck taking portrait photos of people if you use the default camera app a problem at a time when youre supposed to avoid most human … [+747 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Fallout 76: Wastelanders Review - IGN", "description": "Fallout 76: Wastelanders reviewed by David Jagneaux on PlayStation 4 Pro. Also available on PC and Xbox One. \"With the Wastelanders update, Fallout 76 has ta...", "url": "https://www.youtube.com/watch?v=U-uDLErALu0", "urlToImage": null, "publishedAt": "2020-04-25T19:51:32Z", "content": "Fallout 76: Wastelanders reviewed by David Jagneaux on PlayStation 4 Pro. Also available on PC and Xbox One.\r\n\"With the Wastelanders update, Fallout 76 has taken a solid step in the right direction after its dire launch. New human NPCs bring a healthy dose of… [+633 chars]"}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "Riot Games' Closed Beta Game Valorant Comes Competitive Mode - Somag News", "description": "The new FPS game Valorant from Riot Games, which is currently in closed beta, adds competitive mode for players to face opponents at their own level. The new mod will be added with the 0.49 update. The FPS game Valorant, released by Riot Games, the developer …", "url": "https://www.somagnews.com/riot-games-closed-beta-game-valorant-comes-competitive-mode/", "urlToImage": null, "publishedAt": "2020-04-25T19:05:00Z", "content": "The new FPS game Valorant from Riot Games, which is currently in closed beta, adds competitive mode for players to face opponents at their own level. The new mod will be added with the 0.49 update.\r\nThe FPS game Valorant, released by Riot Games, the developer… [+2067 chars]"}, {"source": {"id": null, "name": "Notebookcheck.net"}, "author": "Deirdre O Donnell", "title": "A new leak hints at the launch of a 2020 Samsung Galaxy Watch - Notebookcheck.net", "description": "Samsung has reportedly had a new product certified with the MIIT regulator in China. Based on its model number, it is likely to be a full-screened wearable. Therefore, a successor for the Galaxy Watch Active 2 may be in the offing.", "url": "https://www.notebookcheck.net/A-new-leak-hints-at-the-launch-of-a-2020-Samsung-Galaxy-Watch.462930.0.html", "urlToImage": null, "publishedAt": "2020-04-25T18:13:26Z", "content": "Samsung has allegedly certified a novel device with the MIIT. In fact, there are 2 model numbers in evidence in the documentation in question (SM-R840 and R850). However, they are so similar that it is likely they are 2 variants of the same product, perhaps w… [+780 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Zack Zwiezen", "title": "New GTA Online Missions Are All About Preparing For A Recession - Kotaku Australia", "description": "Grand Theft Auto Online received a new update a few days ago that added six new missions. These missions are all about an old-time GTA Online character, Gerald, and his attempts to get ready for an upcoming recession. Five of them are good and one of them is …", "url": "https://www.kotaku.com.au/2020/04/new-gta-online-missions-are-all-about-preparing-for-a-recession/", "urlToImage": null, "publishedAt": "2020-04-25T18:00:00Z", "content": "Grand Theft Auto Online received a new update a few days ago that added six new missions. These missions are all about an old-time GTA Online character, Gerald, and his attempts to get ready for an upcoming recession. Five of them are good and one of them is … [+2803 chars]"}, {"source": {"id": null, "name": "Mspoweruser.com"}, "author": "http://www.facebook.com/pages/wmpowerusercom/37708414657", "title": "Xiaomi has a new twist on the bezel-less smartphone - MSPoweruser - MSPoweruser", "description": "Until we have a proper under-display front-facing camera, the race to make a full-screen smartphone which still offers a selfie camera will continue to deliver some creative solutions. Today we have a unique solution from Xiaomi described in an April 24 paten…", "url": "https://mspoweruser.com/xiaomi-has-a-new-twist-on-the-borderless-smartphone/", "urlToImage": null, "publishedAt": "2020-04-25T16:00:30Z", "content": "Until we have a proper under-display front-facing camera, the race to make a full-screen smartphone which still offers a selfie camera will continue to deliver some creative solutions.\r\nToday we have a unique solution from Xiaomi described in an April 24 pate… [+602 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Matthew Forde", "title": "Sony slip-ups: ahead of the PS5, we look back at the PlayStation tech that just didn't work - TechRadar", "description": "They can't all be winners", "url": "https://www.techradar.com/news/sony-slip-ups-ahead-of-the-ps5-we-look-back-at-the-playstation-tech-that-just-didnt-work", "urlToImage": null, "publishedAt": "2020-04-25T16:00:00Z", "content": "As we motor towards the next generation of consoles, Sony currently holds all of the cards and will be looking to build upon the monumental success it found during the current generation. Its sometimes easy to forget just how well the PlayStation 4 has sold, … [+6393 chars]"}, {"source": {"id": null, "name": "Animenewsnetwork.com"}, "author": null, "title": "Japan Retro Game Association Will Gift 100 Super NES Consoles to Kids Stuck at Home - Anime News Network", "description": "Non-profit will give console, Donkey Kong Country, Final Fantasy VI games", "url": "https://www.animenewsnetwork.com/interest/2020-04-25/japan-retro-game-association-will-gift-100-super-nes-consoles-to-kids-stuck-at-home/.158962", "urlToImage": null, "publishedAt": "2020-04-25T16:00:00Z", "content": "The Japan Retro Game Association (JARGA) announced it will gift 100 Super Nintendo consoles to kids stuck at home due to COVID-19. JARGA will provide the consoles, adapters, one controller, and two games to each child. The association only asks for participan… [+820 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Jon Fingas", "title": "WhatsApp claims spyware firm launched attacks with US servers - Yahoo Finance Australia", "description": "WhatsApp has accused NSO Group of launching its surveillance attacks from US servers despite claims to the contrary.", "url": "https://au.finance.yahoo.com/news/whatsapp-says-nso-group-launched-attacks-from-us-155827515.html", "urlToImage": null, "publishedAt": "2020-04-25T15:58:00Z", "content": "Facebook just escalated its lawsuit over surveillance firm NSO Groups WhatsApp call exploit attacks. The WhatsApp team has filed accusations that NSO relied on US-based servers to stage its spyware attacks using Pegasus software. NSO reportedly used the Los A… [+1227 chars]"}, {"source": {"id": null, "name": "Techspot.com"}, "author": "Steven Walton", "title": "MSI X570 Tomahawk Motherboard Review - TechSpot", "description": "MSI's new Tomahawk is the most impressive X570 motherboard we've tested at the $200 price point and it deserves serious consideration if you're upgrading or building a new Ryzen machine. For this and other deserving mainstream X570 motherboard alternatives, r…", "url": "https://www.techspot.com/review/2020-msi-x570-tomahawk/", "urlToImage": null, "publishedAt": "2020-04-25T15:11:00Z", "content": "Today were getting taking a look at MSIs new X570 Tomahawk motherboard. Weve been keen to test this thing out for months now as this is a very important board for MSI. Not only does it mark the next stop in their X570 \"redemption\" tour, but at $200, its a mai… [+10087 chars]"}, {"source": {"id": null, "name": "Purexbox.com"}, "author": "Pure Xbox", "title": "Microsoft's Jason Ronald Provides New Xbox Series X Hints - Pure Xbox", "description": "\"Great end to an exciting week\"", "url": "https://www.purexbox.com/news/2020/04/microsofts_jason_ronald_provides_new_xbox_series_x_hints", "urlToImage": null, "publishedAt": "2020-04-25T15:00:00Z", "content": "Microsoft's Jason Ronald is Director of Project Management on Xbox Series X, and is also known for being the guy with that massive beard. He doesn't tweet all that often, but last night, he provided some more insight into Team Xbox and how plans are progressi… [+813 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Mariella Moon", "title": "Former Apple designer drops Watch trivia on its fifth anniversary - Yahoo Finance Australia", "description": "Imran Chaudhri, Apple’s design lead for hardware from 1995 to 2016, dropped some details about Apple Watch’s history on its fifth anniversary.  While Chaudhri is no longer with the tech giant, he shared a photo of the Watch team on launch day, as well as a re…", "url": "https://au.finance.yahoo.com/news/former-apple-designer-drops-watch-trivia-on-its-fifth-anniversary-144849444.html", "urlToImage": null, "publishedAt": "2020-04-25T14:48:00Z", "content": "Imran Chaudhri, Apples design lead for hardware from 1995 to 2016, dropped some details about Apple Watchs history on its fifth anniversary. While Chaudhri is no longer with the tech giant, he shared a photo of the Watch team on launch day, as well as a repro… [+1881 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Zack Zwiezen", "title": "Battlefield V Will Get One Final Update In June - Kotaku Australia", "description": "Battlefield developers Dice announced earlier this week that one final update is coming to Battlefield V in June, though they will continue to combat cheaters even after this last update....", "url": "https://www.kotaku.com.au/2020/04/battlefield-v-will-get-one-final-update-in-june/", "urlToImage": null, "publishedAt": "2020-04-25T14:30:00Z", "content": "Battlefield developers Dice announced earlier this week that one final update is coming to Battlefield V in June, though they will continue to combat cheaters even after this last update.\r\nReleased in November 2018, Battlefield V took the popular series back … [+822 chars]"}, {"source": {"id": null, "name": "Thejakartapost.com"}, "author": "The Jakarta Post", "title": "Pac-Man joins stay-at-home movement with fortnight-long giveaway - The Jakarta Post - Jakarta Post", "description": "Chomp ghosts and flatten the curve as \"Pac-Man: Championship Edition 2\" goes free on PlayStation 4, Xbox One and PC.", "url": "https://www.thejakartapost.com/life/2020/04/25/pac-man-joins-stay-at-home-movement-with-fortnight-long-giveaway.html", "urlToImage": null, "publishedAt": "2020-04-25T14:03:00Z", "content": "Bandai Namco's most famous video game character, Pac-Man, is now part of the home isolation initiative.\r\nThe iconic video game company is giving away \"Pac-Man: Championship Edition 2\" for free for PlayStation 4 on the PlayStation Network Store, Xbox One on th… [+1514 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "BARDOWN PLAYS PARTY GAMES: SUPER SMASH BROS. ULTIMATE - TSN", "description": "Prior to quarantine, Marissa, Jesse, Eric and Teddy put up their dukes in Super Smash Bros. Ultimate for the Nintendo Switch. Would Jesse's N64 abilities tra...", "url": "https://www.youtube.com/watch?v=utkNuTUD1Js", "urlToImage": null, "publishedAt": "2020-04-25T13:55:43Z", "content": null}, {"source": {"id": null, "name": "Micky.com.au"}, "author": null, "title": "How to pair Airpods to the Nintendo Switch - Micky News", "description": "The recent patch on the Nintendo Switch provided a workaround feature that allows wireless headsets to be connected to the console.", "url": "https://micky.com.au/how-to-pair-airpods-to-the-nintendo-switch/", "urlToImage": null, "publishedAt": "2020-04-25T12:46:00Z", "content": "The Nintendo Switch doesnt officially support the use of wireless headphones However, a recent system update on the system made a workaround to the problem.\r\nThe Nintendo Switchs 4.0.0 patch added some notable features such as video capturing in selected game… [+2804 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Dave Thier", "title": "‘Pokémon GO’: Here’s A Promo Code For Some Free PokéBalls And Berries. - Forbes", "description": "It's community day, and you need Pokéballs. Here's a 'Pokémon GO' promo code for some free great balls and razzberries.", "url": "https://www.forbes.com/sites/davidthier/2020/04/25/pokmon-go-heres-a-promo-code-for-some-free-pokballs-and-berries/", "urlToImage": null, "publishedAt": "2020-04-25T12:36:06Z", "content": "pokemon GO\r\nCredit: Niantic\r\nIts a weird one, today. Pokémon GO is running an extra-long Community Day with some crucial additions today, trying to re-orient an event all about getting outside and hanging out with people to one thats all about staying inside … [+1807 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Simon Parkin", "title": "Streets of Rage 4 review – the return of the beat 'em up - The Guardian", "description": "This lovingly created sequel offers all the action and fun of a 90s arcade game", "url": "https://www.theguardian.com/games/2020/apr/25/streets-of-rage-4-review-the-return-of-the-beat-em-up", "urlToImage": null, "publishedAt": "2020-04-25T12:04:06Z", "content": "In the Netflix animated series Hi Score Girl, a romantic comedy set in early-90s Japan, Haruo Yaguchi, a low-achieving high-school loner is whiling away his time in the local video game arcades when he meets Akira Ono, a popular wunderkind from a wealthy fami… [+4209 chars]"}, {"source": {"id": null, "name": "Gamesradar.com"}, "author": "Sam Loveridge", "title": "Animal Crossing: New Horizons art guide: How to find Redd, get art and build out the museum gallery - GamesRadar+ UK", "description": "Plus, how to spot an Animal Crossing: New Horizons art forgery", "url": "https://www.gamesradar.com/animal-crossing-new-horizons-art-museum-redd/", "urlToImage": null, "publishedAt": "2020-04-25T12:03:16Z", "content": "As part of the big end of April update, Animal Crossing: New Horizons art is inbound, which means a museum upgrade, and the return of our old friend / foe Redd. Currently the museum only display fossils, bugs and fish, but now there will be a new art gallery … [+4691 chars]"}, {"source": {"id": null, "name": "Newsdio.com"}, "author": null, "title": "Comparison between iPhone SE and iPhone 8: Which $ 400 iPhone should I buy? - NewsDio", "description": "In an attempt to appeal to iPhone fans on a budget, Apple unveiled its new iPhone SE for 2020 on April 15 for $ 399 (£ 419, AU $ 749). It is a sequel to your iPhone 2016 of the same name. The new specifications of the iPhone SE are similar to those iPhone 8 …", "url": "https://newsdio.com/comparison-between-iphone-se-and-iphone-8-which-400-iphone-should-i-buy/99655/", "urlToImage": null, "publishedAt": "2020-04-25T11:37:00Z", "content": "In an attempt to appeal to iPhone fans on a budget, Apple unveiled its new iPhone SE for 2020 on April 15 for $ 399 (£ 419, AU $ 749). It is a sequel to your iPhone 2016 of the same name. The new specifications of the iPhone SE are similar to those iPhone 8 f… [+8521 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Lynn La", "title": "iPhone SE vs. iPhone 8 comparison: Which $400 iPhone should you get? - CNET", "description": "Some retailers are still selling the iPhone 8 despite Apple discontinuing the device. But you should just get the new iPhone SE instead.", "url": "https://www.cnet.com/news/iphone-se-vs-iphone-8-spec-comparison-which-400-iphone-should-you-get/", "urlToImage": null, "publishedAt": "2020-04-25T11:28:26Z", "content": "In a bid to lure budget-minded iPhone fans, Apple debuted its new iPhone SE for 2020 on April 15 for $399 (£419, AU$749). It's a sequel to its 2016 iPhone of the same name. The new iPhone SE's specs are similar to the iPhone 8 from three years ago, which is l… [+8211 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Davey Winder", "title": "New Windows 10 Update Fail: Users Warn Of BSOD And Deleted Files - Forbes", "description": "As users complain of blue screens of death, deleted files and reboot loops, here's what you really need to know about this Windows 10 update.", "url": "https://www.forbes.com/sites/daveywinder/2020/04/25/new-windows-10-update-fail-users-warn-of-bsod-and-deleted-files/", "urlToImage": null, "publishedAt": "2020-04-25T10:03:45Z", "content": "The latest Patch Tuesday update has caused alarming problems for some Windows 10 users\r\nSOPA Images/LightRocket via Getty Images\r\nAs users complain of blue screens of death, deleted files and reboot loops, here's what you need to know about this Windows 10 up… [+4453 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Matt Hanson", "title": "Smartphones are a bad deal – let's hope laptops don't go the same way - TechRadar", "description": "Opinion: forced obsolescence is a menace", "url": "https://www.techradar.com/news/smartphones-are-a-bad-deal-lets-hope-laptops-dont-go-the-same-way", "urlToImage": null, "publishedAt": "2020-04-25T10:00:00Z", "content": "Imagine buying a new laptop, only to find that three years later Microsoft/Apple stopped offering software updates for it, effectively forcing you to upgrade in order to ensure you had a machine that was secure and ran smoothly.\r\nAnd imagine that, during thos… [+5094 chars]"}, {"source": {"id": null, "name": "Gamerturn.com"}, "author": "Jack Jaff", "title": "‘Overwatch’ update on PTR adds changes to communications wheel - Gamer Turn", "description": "Although it’s already a couple of years old, Blizzard’s hit multiplayer shooter can still use some upgrades from time to time. As promised, the next Overwatch update will revamp the communication wheel – which has been requested by fans for a long time. Last …", "url": "https://www.gamerturn.com/overwatch-update-on-ptr-adds-changes-to-communications-wheel/", "urlToImage": null, "publishedAt": "2020-04-25T09:38:24Z", "content": "Although its already a couple of years old, Blizzards hit multiplayer shooter can still use some upgrades from time to time. As promised, the next Overwatch update will revamp the communication wheel which has been requested by fans for a long time.Last week,… [+2205 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": null, "title": "Big tech companies play crucial role during COVID-19 pandemic - Micky News", "description": "As the world races against the clock to find the cure against COVID-19, big tech companies are also stepping up to their role.", "url": "https://micky.com.au/big-tech-companies-play-crucial-role-during-covid-19-pandemic/", "urlToImage": null, "publishedAt": "2020-04-25T08:44:17Z", "content": "Before the widespread threat of the COVID-19 virus, big tech companies are among the most vilified industries. They are criticized over allegations of unethical data harvesting and tracking users.\r\nRecently, these very same critics are tapping the massive com… [+2510 chars]"}, {"source": {"id": null, "name": "Channelnews.com.au"}, "author": "David Richards", "title": "Was CES 2020 A Super Spreader For COVID-19 After Tens Of Thousands Of Chinese Poured Into The US Event From Wuhan & Hubei Provence. - ChannelNews", "description": null, "url": "https://www.channelnews.com.au/was-ces-2020-a-super-spreader-for-covid-19-after-tens-of-thousands-of-chinese-poured-into-the-us-event-from-wuhan-provence/", "urlToImage": null, "publishedAt": "2020-04-25T08:20:12Z", "content": "One third of CES the world’s biggest Consumer Electronics Show in Las Vegas is Chinese exhibitors and at the 2020 show. tens of thousands of Chinese visitors poured into the event which is now being investigated as a hot spot that helped propel COVID-19 in th… [+3655 chars]"}, {"source": {"id": null, "name": "Notebookcheck.net"}, "author": "Daniel R Deakin", "title": "AMD Ryzen 3 3300X starts cementing its position as a budget CPU champion by beating the Intel Core i3-10300 in Time Spy benchmark - Notebookcheck.net", "description": "An AMD Ryzen 3 3300X and an Intel Core i3-10300 have been spotted in a comparison on 3DMark’s Time Spy benchmark. In another blow for Team Blue, it appears that the new budget Matisse chip from AMD has the edge on the upcoming Comet Lake processor. The Ryzen …", "url": "https://www.notebookcheck.net/AMD-Ryzen-3-3300X-starts-cementing-its-position-as-a-budget-CPU-champion-by-beating-the-Intel-Core-i3-10300-in-Time-Spy-benchmark.462912.0.html", "urlToImage": null, "publishedAt": "2020-04-25T08:03:15Z", "content": "We already had some first benchmark results for both the AMD Ryzen 3 3300X and the Ryzen 3 3100, where both of the recently announced processors managed to thoroughly challenge Intels aging Kaby Lake Core i7-7700K desktop processor. However, it seems the Ryze… [+1184 chars]"}, {"source": {"id": null, "name": "Digitalinformationworld.com"}, "author": "Arooj Ahmed", "title": "A Researcher Created A Website Highlighting What A Smartphone sees While Using Bluetooth And Discovered One Of The Biggest Challenges COVID-19 Tracking Technology Will Face - Digital Information World", "description": "One of the hurdles in the creation of this technology is that Bluetooth also detects devices through walls or other bodies that may not transmit the virus.", "url": "https://www.digitalinformationworld.com/2020/04/website-delenates-what-a-smartphone-sees-while-using-bluetooth-and-challenges-covid-19-tracking-technology-will-face.html", "urlToImage": null, "publishedAt": "2020-04-25T06:06:04Z", "content": "<ul><li>Claudio Guarnieri, an artist and security researcher created a website visualizing what a smartphone sees while the Bluetooth is turned on.</li><li>Apple and Google are creating a contact tracing technology to trace COVID-19 spread using Bluetooth ins… [+2045 chars]"}, {"source": {"id": null, "name": "Pickr.com.au"}, "author": "Leigh :) Stark", "title": "Hisense looks to size, quality for 4K TVs in 2020 - Pickr", "description": "Democratising TV technology and making tellies affordable for all, Hisense is cleaning the range in 2020 and pulling back to two, with the choice down to size.", "url": "https://www.pickr.com.au/news/2020/hisense-looks-to-size-quality-for-4k-tvs-in-2020/", "urlToImage": null, "publishedAt": "2020-04-25T05:53:35Z", "content": "Democratising TV technology and making tellies affordable for all, Hisense is cleaning the range in 2020 and pulling back to two, with the choice down to size. \r\nIt’s not just Samsung and LG showing off their latest TVs, because it’s TV changeover season, whi… [+4671 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Oscar Gonzalez", "title": "Travis Scott event in Fortnite: How to watch the encore and find the Giant Astro Heads - CNET", "description": "The rapper dropped new tracks in a jaw-dropping concert. Catch the next show at midnight.", "url": "https://www.cnet.com/news/travis-scott-event-in-fortnite-how-to-watch-the-encore-and-find-the-giant-astro-heads/", "urlToImage": null, "publishedAt": "2020-04-25T01:02:37Z", "content": "Play some Fortnite and listen to a new track from Travis Scott.\r\nEpic Games\r\nFortnite events aren't only for players to check out new content from developer Epic Games. The popular battle royale game has also played host to multiple premieres and collaboratio… [+3718 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": null, "title": "‘Final Fantasy XII: The Zodiac Age’ gets update 1.0.4.0, includes job reset - Micky News", "description": "Users now enjoy Final Fantasy XII: The Zodiac Age in its latest version, 1.0.4.0, including the option to reset jobs and an expanded Gambit.", "url": "https://micky.com.au/final-fantasy-xii-the-zodiac-age-gets-update-1-0-4-0-including-job-reset-and-more/", "urlToImage": null, "publishedAt": "2020-04-25T00:06:00Z", "content": "Following a job system that gives each character unique abilities and skills, the job reset gives players the option for reconfiguration.\r\nWhile waiting to arrive to both the Switch and the Xbox One, Steam and PS4 users now enjoy Final Fantasy XII: The Zodiac… [+2690 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": "www.facebook.com/christian.n.puno", "title": "Apple will release a new Mac laptop away from Intel - Micky News", "description": "Apple will release a new Mac laptop next year with its processors away from intel, giving users better performance.", "url": "https://micky.com.au/apple-will-release-a-new-mac-laptop-away-from-intel/", "urlToImage": null, "publishedAt": "2020-04-24T23:47:00Z", "content": "It is no doubt that Apple products usually cost high, but users often report it has excellent performance. Apple will release its new Mac laptop next year, according to Bloomberg. It is also said to have more improvements included.\r\nWhat is With the New Mac L… [+3233 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": null, "title": "Motorola Edge and Edge+ are now official - Micky News", "description": "Motorola’s newest stabs in the flagship and upper mid-range segments redefine its attempt to infiltrate the global smartphone scene.", "url": "https://micky.com.au/motorola-edge-and-edge-are-now-official/", "urlToImage": null, "publishedAt": "2020-04-24T23:42:00Z", "content": "Motorola has never been a showoff in terms of its smartphone entries as of late. Unlike the Xiaomi and Realme phones, Lenovos handsets are mostly ones that only cater to Android purists, whether its the design or the hardware performance.\r\nToday, with the rel… [+2940 chars]"}, {"source": {"id": null, "name": "Ausdroid.net"}, "author": null, "title": "Google bringing “Live Captions” to phone calls - Ausdroid", "description": "When new features are added to Android they aren’t just added all at once. The developers usually add the code bit by bit and luckily for us we have some extremely clever folks over at XDA Developers who trawl through the code of newly released files to find …", "url": "https://ausdroid.net/2020/04/25/google-bringing-live-captions-to-phone-calls/", "urlToImage": null, "publishedAt": "2020-04-24T23:35:05Z", "content": "When new features are added to Android they aren’t just added all at once. The developers usually add the code bit by bit and luckily for us we have some extremely clever folks over at XDA Developers who trawl through the code of newly released files to find … [+2603 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": null, "title": "‘Monster Hunter World: Iceborne’ gets update 13.5, including two new monsters - Micky News", "description": "The version 13.5 update just arrived for Monster Hunter World: Iceborne brings in improvements, added crafts, and introduces two new monsters", "url": "https://micky.com.au/monster-hunter-world-iceborne-gets-update-13-5-including-two-new-monsters/", "urlToImage": null, "publishedAt": "2020-04-24T22:57:00Z", "content": "The rolled out update is available to both the PC and console versions of the game.\r\nThe version 13.5 update just arrived for Monster Hunter World: Iceborne that brings in improvements, added crafts, and introduces two new monsters for players to slay. The ro… [+3165 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Logitech G G203 LIGHTSYNC Promo Video - Techaeris", "description": "This is an overview of the new Logitech G G203 LIGHTSYNC Gaming Mouse. The video was provided by Logitech for resharing. Available in May buy here: https://w...", "url": "https://www.youtube.com/watch?v=i3_Ale_138I", "urlToImage": null, "publishedAt": "2020-04-24T21:57:36Z", "content": null}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "James O'Connor", "title": "Animal Crossing Update 1.2.0 Patch Notes: Look For Redd And Leif In Latest Update - GameSpot", "description": "The new Animal Crossing update adds new vendors, and makes a few other tweaks in the Nintendo Switch game.", "url": "https://www.gamespot.com/articles/animal-crossing-update-120-patch-notes-redd-and-le/1100-6476401/", "urlToImage": null, "publishedAt": "2020-04-24T20:11:00Z", "content": "The new Animal Crossing: New Horizons update, which brings the game up to version 1.2.0, is live now. It's a big one--it expands the museum and brings new vendors to your island. If 1.2.0 does not automatically download, you can search for a software update f… [+1903 chars]"}, {"source": {"id": null, "name": "Caradvice.com.au"}, "author": "Justin Narayan", "title": "Ford Mustang crowned the most successful sports car of 2019 - CarAdvice", "description": "America just wasn’t enough for the original pony car. The Ford Mustang has officially gone global. Last year saw the Mustang rise to the top of the sports car world, with recognition from fans from...", "url": "https://www.caradvice.com.au/845186/ford-mustang-crowned-the-most-successful-sports-car-of-2019/", "urlToImage": null, "publishedAt": "2020-04-24T20:05:00Z", "content": "More than 100,000 Mustangs were sold globally last year. Even though sales have waned in Australia, it remains one of Ford's most popular models.\r\nAmerica just wasn’t enough for the original pony car. The Ford Mustang has officially gone global.\r\nLast year sa… [+1907 chars]"}, {"source": {"id": null, "name": "Businessinsider.com.au"}, "author": "Mary Meisenzahl", "title": "Facebook's new video chat Zoom competitor is coming soon — here's how the new feature works - Business Insider Australia", "description": "Facebook CEO Mark Zuckerberg announced on Friday the company is introducing 50-person video chatrooms.", "url": "https://www.businessinsider.com.au/facebook-messenger-rooms-video-chat-zoom-walkthrough-like-zoom-2020-4", "urlToImage": null, "publishedAt": "2020-04-24T19:44:33Z", "content": "<ul><li>Facebook just announced 50-person video chatrooms called Messenger Rooms.</li><li>\r\nThe new Messenger Rooms have some features in common with other video calling apps, like Zoom and Houseparty.\r\n</li><li>\r\nThe company says Messenger Rooms will be comi… [+3605 chars]"}, {"source": {"id": null, "name": "Lifehacker.com.au"}, "author": "David Murphy", "title": "Are You Charging Your MacBook On The Wrong Side? - Lifehacker Australia", "description": "Yes, you read that headline correctly. There is apparently a “right” way and a “wrong” way to connect devices to a MacBook with Thunderbolt/USB-C ports on both sides. Doing it wrong can affect your computer’s performance....", "url": "https://www.lifehacker.com.au/2020/04/are-you-charging-your-macbook-on-the-wrong-side/", "urlToImage": null, "publishedAt": "2020-04-24T19:30:00Z", "content": "Yes, you read that headline correctly. There is apparently a right way and a wrong way to connect devices to a MacBook with Thunderbolt/USB-C ports on both sides. Doing it wrong can affect your computers performance.\r\nI recently encountered this knowledge on … [+3969 chars]"}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "Microsoft Begins Showing Edge Ads in Outlook.com - Somag News", "description": "US technology giant Microsoft has begun to run ads with download links on the email service Outlook.com for its new Chromium-based Microsoft Edge browser, which it launched earlier this year. Edge recently managed to be the second most popular internet browse…", "url": "https://www.somagnews.com/microsoft-begins-showing-edge-ads-outlook-com/", "urlToImage": null, "publishedAt": "2020-04-24T19:22:00Z", "content": "US technology giant Microsoft has begun to run ads with download links on the email service Outlook.com for its new Chromium-based Microsoft Edge browser, which it launched earlier this year. Edge recently managed to be the second most popular internet browse… [+1516 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Clifford Colby", "title": "Telegram says group video calls are coming later this year - CNET", "description": "The messaging app also says it now has 400 million monthly users.", "url": "https://www.cnet.com/news/telegram-says-group-video-calls-are-coming-later-this-year/", "urlToImage": null, "publishedAt": "2020-04-24T19:21:04Z", "content": "Telegram will add group video calling this year.\r\nCésar Salza/CNET\r\nTo help its users stay in touch during the coronavirus pandemic and after, Telegram will add group video calls this year to its popular messaging app, the company said Friday. Telegram also n… [+1222 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Ian Walker", "title": "Final Fantasy VII Remake Made Me Climb 59 Flights Of Stairs And I Loved It - Kotaku Australia", "description": "I recently arrived at Shinra headquarters in my playthrough of Final Fantasy VII Remake. After Cloud and his squad fight their way through the parking garage, they enter the spacious reception area to find the place deserted. Our heroes have two ways to reach…", "url": "https://www.kotaku.com.au/2020/04/final-fantasy-vii-remake-made-me-climb-59-flights-of-stairs-and-i-loved-it/", "urlToImage": null, "publishedAt": "2020-04-24T19:00:00Z", "content": "I recently arrived at Shinra headquarters in my playthrough of Final Fantasy VII Remake. After Cloud and his squad fight their way through the parking garage, they enter the spacious reception area to find the place deserted. Our heroes have two ways to reach… [+3078 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Valve Source Code LEAKED - Hot off the Press Start #34 - GameFront", "description": "Support us on Patreon! - https://www.patreon.com/gamefront - James is back once more with the latest gaming news, including more bad news for GeForce Now, ju...", "url": "https://www.youtube.com/watch?v=D37UfGQ1x1o", "urlToImage": null, "publishedAt": "2020-04-24T18:47:41Z", "content": "Support us on Patreon! - https://www.patreon.com/gamefront - James is back once more with the latest gaming news, including more bad news for GeForce Now, justice for Warzone cheaters, and the source code for Team Fortress 2 and CS:GO leaking online.\r\n#GeForc… [+287 chars]"}, {"source": {"id": null, "name": "Pcmag.com"}, "author": null, "title": "Marshall Uxbridge Voice - Review 2020 - PCMag AU", "description": "The Marshall Uxbridge Voice speaker delivers respectable audio performance and hands-free Alexa voice control in a stylish package.", "url": "https://au.pcmag.com/speakers/66530/marshall-uxbridge-voice", "urlToImage": null, "publishedAt": "2020-04-24T18:06:00Z", "content": "Marshalls latest smart speaker, the $199.99 Uxbridge Voice, is its smallest and least expensive  yet. The audio performance is quite good considering the speaker's size, with rich bass depth balanced by crisp highs. And the sound signature is fairly malleable… [+7189 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Carly Page", "title": "The Dell XPS 15 2020 may have been redesigned to take on the MacBook Pro - TechRadar", "description": "Incoming model will boast smaller bezels and upward-firing speakers", "url": "https://www.techradar.com/news/the-dell-xps-15-2020-may-have-been-redesigned-to-take-on-the-macbook-pro", "urlToImage": null, "publishedAt": "2020-04-24T17:31:00Z", "content": "Dell looks poised to release an all-new version of its XPS 15 laptop that will take a number of design clues from the recently-revamped Dell XPS 13\r\n.\r\nThats according to leaked images posted on the Korea Energy Agency Efficiency Standardization Certification… [+2119 chars]"}, {"source": {"id": null, "name": "Trueachievements.com"}, "author": "Heidi Nicholas", "title": "Sci-fi adventure Deliver Us The Moon joins Xbox Game Pass and Game Pass for PC today - TrueAchievements", "description": "Deliver Us The Moon is a sci-fi action adventure title which draws inspiration from movies such as Interstellar, and which joins the Xbox Game Pass and Xbox Game Pass for PC services today as a day one addition.", "url": "https://www.trueachievements.com/n41593/deliver-us-the-moon", "urlToImage": null, "publishedAt": "2020-04-24T17:19:36Z", "content": "The Xbox team has been busy lately: just yesterday, they surprise-dropped the announcement that Red Dead Redemption 2 will join Xbox Game Pass in May. Before that, they announced new titles for Xbox Game Pass, along with several new titles for Xbox Game Pass … [+1728 chars]"}, {"source": {"id": null, "name": "Lifehacker.com.au"}, "author": "Brendan Hesse", "title": "Don't Let Microsoft Word Judge You For Using Two Spaces Between Sentences - Lifehacker Australia", "description": "Microsoft has taken an official stance on one of the internet’s most divisive questions, firmly coming down on the side of minimalism in the “one-space versus two-spaces after a sentence” debate. Word’s automatic spelling and grammar checker will now flag any…", "url": "https://www.lifehacker.com.au/2020/04/dont-let-microsoft-word-judge-you-for-using-two-spaces-between-sentences/", "urlToImage": null, "publishedAt": "2020-04-24T17:15:00Z", "content": "Microsoft has taken an official stance on one of the internets most divisive questions, firmly coming down on the side of minimalism in the one-space versus two-spaces after a sentence debate. Words automatic spelling and grammar checker will now flag anythin… [+1903 chars]"}, {"source": {"id": null, "name": "Gamesradar.com"}, "author": "Benjamin Abbott", "title": "Sling TV deal lets you watch NFL draft online for FREE tonight without a cable TV package - GamesRadar+ AU", "description": "The live TV streaming service is offering free Sling TV every evening until midnight and that includes streaming the NFL draft.", "url": "https://www.gamesradar.com/you-can-watch-free-sling-tv-every-night-nfl-draft-tonight/", "urlToImage": null, "publishedAt": "2020-04-24T17:07:09Z", "content": "Live TV streaming service Sling has announced that you can get an evening of free Sling TV every day from 5pm ET. With 47 major channels on offer, there's plenty to get your teeth into. Better yet, you can also use this freebie to watch tonight's live NFL Dra… [+2874 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Leah Williams", "title": "The Good, The Bad, And The Annoying Of Borderlands 3's \"Revenge Of The Cartels\" Event - Kotaku Australia", "description": "It’s been less than a month since Borderlands 3’s latest big expansion landed with a bang, but vault hunters already have access to another brand-new playground in which they can fire 87 bazillion guns. It’s called Villa Ultraviolet. It’s drenched in neon and…", "url": "https://www.kotaku.com.au/2020/04/the-good-the-bad-and-the-annoying-of-borderlands-3s-revenge-of-the-cartels-event/", "urlToImage": null, "publishedAt": "2020-04-24T17:00:00Z", "content": "Its been less than a month since Borderlands 3s latest big expansion landed with a bang, but vault hunters already have access to another brand-new playground in which they can fire 87 bazillion guns. Its called Villa Ultraviolet. Its drenched in neon and gau… [+4795 chars]"}, {"source": {"id": null, "name": "Notebookcheck.net"}, "author": "Arjun Krishna Lal", "title": "Redmi Note 9 killer? Render outed for Huawei's purported midrange Y8S smartphone - Notebookcheck.net", "description": "Tipster @evleaks outed what appears to be an official render for Huawei's purported Y8S smartphone. The midrange device takes a lot of cues from the Huawei Y9, with a similar design and camera setup. The device looks likely to take the fight to Xiaomi's Redmi…", "url": "https://www.notebookcheck.net/Redmi-Note-9-killer-Render-outed-for-Huawei-s-purported-midrange-Y8S-smartphone.462673.0.html", "urlToImage": null, "publishedAt": "2020-04-24T15:40:36Z", "content": "Tipster Evan Blass recently outed renders for the Huawei Y8S, what appears to be an upcoming addition to the Chinese manufacturer's midrange smartphone lineup. The renders appear to be straight from Huawei, which means that we might get an official announceme… [+1115 chars]"}, {"source": {"id": null, "name": "Motorsport.com"}, "author": "Josh Suttill", "title": "MotoGP 20 review: Early release gamble pays off - Motorsport.com, Edition: Australia", "description": "MotoGP 20 marks Milestone’s most ambitious instalment in the franchise so far, with an April release date, a revamped career mode and the reintroduction of historic bikes.", "url": "https://au.motorsport.com/gaming/news/game-review-motogp-20/4784174/", "urlToImage": null, "publishedAt": "2020-04-24T15:21:34Z", "content": "This unprecedented early release date just days after the fourth round of the real-life MotoGP season was supposed to take place prior to its cancellation immediately raised concerns over the quality of the title.\r\nFortunately for fans, Milestones boldness ha… [+4420 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "iPhone SE review, Canon EOS R5 new specs and Surface Pro 8 rumors | Noise Cancelling Podcast 008 - TechRadar", "description": "More tech news and painfully honest reviews from Gareth and Sherri as they’re joined by two new voices: Kimberly Gedeon of Laptop Mag and TechRadar Cameras e...", "url": "https://www.youtube.com/watch?v=bPYeSWVgSXw", "urlToImage": null, "publishedAt": "2020-04-24T15:00:19Z", "content": "More tech news and painfully honest reviews from Gareth and Sherri as theyre joined by two new voices: Kimberly Gedeon of Laptop Mag and TechRadar Cameras editor, Mark Wilson. \r\nTOPIC TIMESTAMPS03:52 - Canon EOS R508:36 - PS5 Robot Friends12:46 - Surface Pro … [+992 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Future Games Show Announcement Trailer - Coming June 2020 - GamesRadar", "description": "See the most exciting console, mobile and streaming games of 2020 in one show with a mixture of exclusives, deep dives and developer interviews. Coming June ...", "url": "https://www.youtube.com/watch?v=DbLFsALqD_0", "urlToImage": null, "publishedAt": "2020-04-24T15:00:12Z", "content": "See the most exciting console, mobile and streaming games of 2020 in one show with a mixture of exclusives, deep dives and developer interviews. Coming June 2020.Subscribe to Gamesradar: http://goo.gl/cnjsn1"}, {"source": {"id": null, "name": "Press-start.com.au"}, "author": "Shannon Grixti", "title": "Horizon Zero Dawn 2 Will Apparently Feature A Larger World And Co-Op - Press Start Australia", "description": "VideoGameChronicles is reporting that Horizon Zero Dawn is set to be a trilogy. According to the report, Horizon Zero Dawn 2 started development soon after the first game's release, with the game initiallybeing planned for a PlayStation 4 release, before shif…", "url": "https://press-start.com.au/news/playstation/2020/04/24/horizon-zero-dawn-2-will-apparently-feature-a-larger-world-and-co-op/", "urlToImage": null, "publishedAt": "2020-04-24T14:10:03Z", "content": "VideoGameChronicles is reporting that Horizon Zero Dawn is set to be a trilogy.\r\nAccording to the report, Horizon Zero Dawn 2 started development soon after the first game’s release, with the game initiallybeing planned for a PlayStation 4 release, before shi… [+776 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "India TV Tech Desk", "title": "Huawei MatePad with Kirin 810 launched: Price, specifications and more - India TV News", "description": "The all-new Huawei MatePad is basically a toned-down version of the MatePad Pro 5G, whcih was launched back in November 2019.", "url": "https://www.indiatvnews.com/technology/news-huawei-matepad-launched-price-specifications-610927", "urlToImage": null, "publishedAt": "2020-04-24T13:03:37Z", "content": "Huawei MediaPad comes with a massive 7,250mAh battery.\r\nHuawei has announced the launch of yet another Android-based tablet in China. The all-new Huawei MatePad is basically a toned-down version of the MatePad Pro 5G, whcih was launched back in November 2019.… [+1552 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Darren Allan", "title": "Nvidia’s reportedly ordering 5nm chips for a ‘mystery’ product - TechRadar", "description": "As it ups orders on 7nm, hopefully indicating RTX 3000 GPUs are still on track", "url": "https://www.techradar.com/news/nvidias-reportedly-ordering-5nm-chips-for-a-mystery-product", "urlToImage": null, "publishedAt": "2020-04-24T12:54:00Z", "content": "Nvidia is making something using a 5nm process, according to the rumor mill, although its anyones guess what that hardware could be.\r\nThis comes from a DigiTimes report about how chipmaker TSMC is benefiting from a ramp-up in orders from Nvidia and AMD, and a… [+1260 chars]"}, {"source": {"id": null, "name": "Techspot.com"}, "author": "Rob Thubron", "title": "Malwarebytes steps into the VPN space with WireGuard-based service - TechSpot", "description": "Available now for Windows 7 and higher—Mac, Android, iOS, and Chrome OS are coming soon—Malwarebytes Privacy costs $59.99 per year. You can also get it bundled with a 1-year license of Malwarebytes Premium for $89.99, saving buyers $49.99. Both options&hellip;", "url": "https://www.techspot.com/news/84974-malwarebytes-steps-vpn-space-wireguard-based-service.html", "urlToImage": null, "publishedAt": "2020-04-24T12:37:00Z", "content": "In brief: Malwarebytes is joining the list of antivirus companies that also offer a VPN. Called Malwarebytes Privacy, the service uses a newer and faster protocol: WireGuard. \r\nAvailable now for Windows 7 and higherMac, Android, iOS, and Chrome OS are coming … [+1527 chars]"}, {"source": {"id": null, "name": "Ourbitcoinnews.com"}, "author": null, "title": "Facebook offers new offer for children … - OBN", "description": "Social networking site Facebook has launched video messaging and messaging app Facebook Messenger Kids app for children in 75 countries including India. Now parents will…", "url": "https://ourbitcoinnews.com/facebook-offers-new-offer-for-children/", "urlToImage": null, "publishedAt": "2020-04-24T12:04:46Z", "content": "Social networking site Facebook has launched video messaging and messaging app Facebook Messenger Kids app for children in 75 countries including India. Now parents will be able to control more on the children's account. The specialty of this app is that afte… [+1921 chars]"}, {"source": {"id": null, "name": "Insideevs.com"}, "author": "Gustavo Henrique Ruffo", "title": "UPDATE: Ford Mustang Mach-E Production And Deliveries Are Delayed - InsideEVs ", "description": "We saw that coming due to COVID-19, but it seems Ford is already confirming the delay to clients.", "url": "https://insideevs.com/news/414583/ford-mustang-mach-e-production-deliveries-postponed/", "urlToImage": null, "publishedAt": "2020-04-24T11:47:55Z", "content": "John Lennon said: \"Life is what happens to you while you're busy making other plans.\" Ironically, the COVID-19 pandemic shows \"Beautiful boy\" is very accurate for reasons we'd prefer never proven right. Plans have to change, and Ford's for the Mustang Mach-E … [+2264 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "XCOM: Chimera Squad Gameplay - WccftechTV", "description": "Review: https://wccftech.com/review/xcom-chimera-squad-successful-experiment/ XCOM: Chimera Squad is out now on PC via Steam. ►www.facebook.com/wccftech ►www...", "url": "https://www.youtube.com/watch?v=9YUdyq4yGoE", "urlToImage": null, "publishedAt": "2020-04-24T11:10:55Z", "content": null}, {"source": {"id": null, "name": "Daywebchronicle.com"}, "author": null, "title": "Google Meet Introduces New Features For Its Video-Conferencing After Duo - Day Web Chronicle", "description": "Four more requested features have been launched in Google Meet, days following Google Duo had...", "url": "https://daywebchronicle.com/2020/04/24/google-meet-introduces-new-features-for-its-video-conferencing-after-duo/", "urlToImage": null, "publishedAt": "2020-04-24T10:04:50Z", "content": "Four more requested features have been launched in Google Meet, days following Google Duo had rolled out its new features, said Google in a blog post. Smita Hashim, Product Management Director, mentioned in the blog post that these new features are utilizing … [+1351 chars]"}, {"source": {"id": null, "name": "Happygamer.com"}, "author": "Joshua Goodpastor", "title": "SoundSelf: A Technodelic Is A Unique Soundbased VR Experience Now Availiable For Both PC And Mac VR Systems - Happy Gamer", "description": "Andromeda Entertainment has announced a unique video game experience in an immersive VR world. SoundSelf: A Technodelic is a unique and entrancing...", "url": "https://happygamer.com/soundself-a-technodelic-is-a-unique-soundbased-vr-experience-now-availiable-for-both-pc-and-mac-vr-systems-63644/", "urlToImage": null, "publishedAt": "2020-04-24T09:42:12Z", "content": "Andromeda Entertainment has announced a unique video game experience in an immersive VR world. SoundSelf: A Technodelic is a unique and entrancing experience that takes players on a meditative journey. The game is controlled using your own voice as you hum an… [+2237 chars]"}]}