{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Cnet.com"}, "author": "Oscar Gonzalez", "title": "Travis Scott event in Fortnite: How to watch the encore and find the Giant Astro Heads - CNET", "description": "The rapper dropped new tracks in a jaw-dropping concert. Catch the next show at midnight.", "url": "https://www.cnet.com/news/travis-scott-event-in-fortnite-how-to-watch-the-encore-and-find-the-giant-astro-heads/", "urlToImage": null, "publishedAt": "2020-04-25T01:02:37Z", "content": "Play some Fortnite and listen to a new track from Travis Scott.\r\nEpic Games\r\nFortnite events aren't only for players to check out new content from developer Epic Games. The popular battle royale game has also played host to multiple premieres and collaboratio… [+3718 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "", "title": "Android's upcoming call recording feature could be region restricted - Engadget", "description": "Android's upcoming call recording feature could be coming soon.", "url": "https://www.engadget.com/android-call-recording-003653130.html", "urlToImage": null, "publishedAt": "2020-04-25T00:52:32Z", "content": "The document went on to say that when you record a call for the first time, you’ll be advised that you’re responsible for complying with local laws (many regions require consent by all parties prior to call recording). It states: “When you start recording, th… [+866 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "GameCentral", "title": "Reason and irrationality in the choice of console purchases - Metro.co.uk", "description": "A reader is surprised to find people choosing between PS5 and Xbox Series X already, and examines the psychology of their decisions.", "url": "https://metro.co.uk/2020/04/25/undivided-loyalties-reason-irrationality-choice-console-purchases-readers-feature-12607795/", "urlToImage": null, "publishedAt": "2020-04-25T00:36:33Z", "content": "How do you choose yours? (pic: Sony)\r\nA reader is surprised to find people choosing between PS5 and Xbox Series X already, and examines the psychology of their decisions.\r\nMy favourite games are made by Nintendo, the flagship Mario and Zelda titles in particu… [+4815 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jay Peters", "title": "An Apple Watch designer shares behind-the-scenes history to celebrate the device’s fifth birthday - The Verge", "description": "The original Apple Watch was released on April 24th, 2015. To mark the device’s fifth birthday, Imran Chaudhri, a designer who worked on the team for the first Apple Watch, shared some fascinating behind-the-scenes info about the product’s development in a tw…", "url": "https://www.theverge.com/tldr/2020/4/24/21235090/apple-watch-designer-imran-chaudhri-development-tweetstorm", "urlToImage": null, "publishedAt": "2020-04-24T22:26:02Z", "content": "Filed under:\r\nHappy fifth birthday, Apple Watch\r\nImage: Imran Chaudhri\r\nThe original Apple Watch was released five years ago today April 24th, 2015 and Imran Chaudhri, a designer who worked on the team for the first Apple Watch, shared some fascinating behind… [+2130 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Logitech G G203 LIGHTSYNC Promo Video - Techaeris", "description": "This is an overview of the new Logitech G G203 LIGHTSYNC Gaming Mouse. The video was provided by Logitech for resharing. Available in May buy here: https://w...", "url": "https://www.youtube.com/watch?v=i3_Ale_138I", "urlToImage": null, "publishedAt": "2020-04-24T21:57:36Z", "content": null}, {"source": {"id": null, "name": "Otakukart.com"}, "author": null, "title": "Arch-Tempered Namielle Release Date and All You Need To Know - OtakuKart", "description": "Monster Hunter Iceborne, which was recently launched on PC, has its latest update dropping soon called Title Update 13.5. The latest update is to be available o", "url": "https://otakukart.com/113224/arch-tempered-namielle-release-date-and-all-you-need-to-know/", "urlToImage": null, "publishedAt": "2020-04-24T20:00:15Z", "content": "Monster Hunter Iceborne, which was recently launched on PC, has its latest update dropping soon called Title Update 13.5. The latest update is to be available on PS4, Xbox One, and PC soon! Two new monster variants are to be introduced in the Title Update 13.… [+3073 chars]"}, {"source": {"id": null, "name": "Businessinsider.com.au"}, "author": "Mary Meisenzahl", "title": "Facebook's new video chat Zoom competitor is coming soon — here's how the new feature works - Business Insider Australia", "description": "Facebook CEO Mark Zuckerberg announced on Friday the company is introducing 50-person video chatrooms.", "url": "https://www.businessinsider.com.au/facebook-messenger-rooms-video-chat-zoom-walkthrough-like-zoom-2020-4", "urlToImage": null, "publishedAt": "2020-04-24T19:44:33Z", "content": "<ul><li>Facebook just announced 50-person video chatrooms called Messenger Rooms.</li><li>\r\nThe new Messenger Rooms have some features in common with other video calling apps, like Zoom and Houseparty.\r\n</li><li>\r\nThe company says Messenger Rooms will be comi… [+3605 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "", "title": "Telegram promises secure group video calls sometime this year - Engadget", "description": "Telegram says it will add secure group video calls in 2020.", "url": "https://www.engadget.com/telegram-secure-group-video-calls-142035892.html", "urlToImage": null, "publishedAt": "2020-04-24T19:41:19Z", "content": "While Telegram didn’t release many details about the feature, it appears to be taking a dig at Zoom, which is facing pressure to fix several privacy issues. In response, Zoom has created a security council and promised upgrades, but that won’t stop competitor… [+831 chars]"}, {"source": {"id": null, "name": "Lifehacker.com.au"}, "author": "David Murphy", "title": "Are You Charging Your MacBook On The Wrong Side? - Lifehacker Australia", "description": "Yes, you read that headline correctly. There is apparently a “right” way and a “wrong” way to connect devices to a MacBook with Thunderbolt/USB-C ports on both sides. Doing it wrong can affect your computer’s performance....", "url": "https://www.lifehacker.com.au/2020/04/are-you-charging-your-macbook-on-the-wrong-side/", "urlToImage": null, "publishedAt": "2020-04-24T19:30:00Z", "content": "Yes, you read that headline correctly. There is apparently a right way and a wrong way to connect devices to a MacBook with Thunderbolt/USB-C ports on both sides. Doing it wrong can affect your computers performance.\r\nI recently encountered this knowledge on … [+3969 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Valve Source Code LEAKED - Hot off the Press Start #34 - GameFront", "description": "Support us on Patreon! - https://www.patreon.com/gamefront - James is back once more with the latest gaming news, including more bad news for GeForce Now, ju...", "url": "https://www.youtube.com/watch?v=D37UfGQ1x1o", "urlToImage": null, "publishedAt": "2020-04-24T18:47:41Z", "content": "Support us on Patreon! - https://www.patreon.com/gamefront - James is back once more with the latest gaming news, including more bad news for GeForce Now, justice for Warzone cheaters, and the source code for Team Fortress 2 and CS:GO leaking online.\r\n#GeForc… [+287 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "", "title": "Sony's excellent WH-1000XM3 headphones are only $238 at Newegg - Engadget", "description": "Sony's excellent WH-1000XM3 headphones are once again on sale. This time around, you can get them for $238.", "url": "https://www.engadget.com/sony-wh1000xm3-sale-newegg-135558070.html", "urlToImage": null, "publishedAt": "2020-04-24T18:19:07Z", "content": "Engadget's Devindra Hardawar gave the WH-1000XM3 a score of 94 when he reviewed them in 2018. They're comfortable, well-made and feature excellent noise cancelling capabilities. Bluetooth Codec support is similarly excellent with ACC, aptX HD and LDAC all pre… [+801 chars]"}, {"source": {"id": null, "name": "Lifehacker.com.au"}, "author": "Brendan Hesse", "title": "Don't Let Microsoft Word Judge You For Using Two Spaces Between Sentences - Lifehacker Australia", "description": "Microsoft has taken an official stance on one of the internet’s most divisive questions, firmly coming down on the side of minimalism in the “one-space versus two-spaces after a sentence” debate. Word’s automatic spelling and grammar checker will now flag any…", "url": "https://www.lifehacker.com.au/2020/04/dont-let-microsoft-word-judge-you-for-using-two-spaces-between-sentences/", "urlToImage": null, "publishedAt": "2020-04-24T17:15:00Z", "content": "Microsoft has taken an official stance on one of the internets most divisive questions, firmly coming down on the side of minimalism in the one-space versus two-spaces after a sentence debate. Words automatic spelling and grammar checker will now flag anythin… [+1903 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": null, "title": "Motorola Edge Plus device set to compete with Samsung’s Galaxy S20 - Micky News", "description": "Packed with the latest specs, the Edge Plus is said to rival Samsung’s newest release, Galaxy S20., but fulll details are not yet revealed.", "url": "https://micky.com.au/motorola-edge-plus-device-set-to-compete-with-samsungs-galaxy-s20/", "urlToImage": null, "publishedAt": "2020-04-24T16:08:00Z", "content": "Dormant for several years, Motorola is making its way back to the android world to introduce its newly released flagship phone, Edge Plus. \r\nMotorola Edge Plus is yet to be the most powerful phone created by Lenovo in years since the release of the first-gene… [+3574 chars]"}, {"source": {"id": null, "name": "Motorsport.com"}, "author": "Josh Suttill", "title": "MotoGP 20 review: Early release gamble pays off - Motorsport.com, Edition: Australia", "description": "MotoGP 20 marks Milestone’s most ambitious instalment in the franchise so far, with an April release date, a revamped career mode and the reintroduction of historic bikes.", "url": "https://au.motorsport.com/gaming/news/game-review-motogp-20/4784174/", "urlToImage": null, "publishedAt": "2020-04-24T15:21:34Z", "content": "This unprecedented early release date just days after the fourth round of the real-life MotoGP season was supposed to take place prior to its cancellation immediately raised concerns over the quality of the title.\r\nFortunately for fans, Milestones boldness ha… [+4420 chars]"}, {"source": {"id": null, "name": "Whathifi.com"}, "author": "Becky Scarrott", "title": "Save £170 on award-winning Astell & Kern SR15 hi-res music player - What Hi-Fi?", "description": "The excellent Astell & Kern A&norma SR15 is now on sale", "url": "https://www.whathifi.com/news/award-winning-astell-and-kern-hi-res-music-player-slashed-in-price-at-amazon", "urlToImage": null, "publishedAt": "2020-04-24T15:09:00Z", "content": "It's a familiar story: a shiny new kid appears on the block and the old guard receives a heavy discount. However, while a successor to the Astell &amp; Kern A&amp;norma SR15 has been announced, in the form of the A&amp;norma SR25, that revered old guard, the … [+1483 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "iPhone SE review, Canon EOS R5 new specs and Surface Pro 8 rumors | Noise Cancelling Podcast 008 - TechRadar", "description": "More tech news and painfully honest reviews from Gareth and Sherri as they’re joined by two new voices: Kimberly Gedeon of Laptop Mag and TechRadar Cameras e...", "url": "https://www.youtube.com/watch?v=bPYeSWVgSXw", "urlToImage": null, "publishedAt": "2020-04-24T15:00:19Z", "content": "More tech news and painfully honest reviews from Gareth and Sherri as theyre joined by two new voices: Kimberly Gedeon of Laptop Mag and TechRadar Cameras editor, Mark Wilson. \r\nTOPIC TIMESTAMPS03:52 - Canon EOS R508:36 - PS5 Robot Friends12:46 - Surface Pro … [+992 chars]"}, {"source": {"id": null, "name": "Dailyesports.gg"}, "author": "Naim Rosinski", "title": "Valorant competitive matchmaking detailed, arrives \"soon after patch 0.49\" - Daily Esports", "description": "Riot Games' developers behind Valorant have finally released some details and information about the upcoming competitive ranked play.", "url": "https://www.dailyesports.gg/valorant-competitive-matchmaking-detailed-arrives-soon-after-patch-0-49/", "urlToImage": null, "publishedAt": "2020-04-24T14:41:00Z", "content": "Valorant developers from Riot Games have finally given us some indication on when to expect the highly sought after competitive mode. In the newest blog entry, the developers discuss the ranks and how exactly players can rank up or down. The mode will arrive … [+2251 chars]"}, {"source": {"id": null, "name": "Gamesradar.com"}, "author": "Benjamin Abbott", "title": "Get a cheap Xbox Game Pass deal and save up to 50% - GamesRadar+ AU", "description": "Stuck at home? This bargain of a cheap Xbox Game Pass deal gets you the service at a huge discount", "url": "https://www.gamesradar.com/cheap-xbox-game-pass-deal-save-up-to-fifty-percent-now/", "urlToImage": null, "publishedAt": "2020-04-24T14:31:57Z", "content": "If you're stuck indoors without much to do, this cheap Xbox Game Pass deal will be exactly what you need. As well as being discounted on CDKeys, it's also received a big cut on Amazon UK - you can get 6 months of Xbox Game Pass Ultimate for 50% less.\r\nNo matt… [+3021 chars]"}, {"source": {"id": null, "name": "Zdnet.com"}, "author": "Daphne Leprince-Ringuet", "title": "Coronavirus contact-tracing app: Here’s how we’ll protect your privacy, says NHS - ZDNet", "description": "NHS insists the public's data is safe in the hands of the health services. Privacy campaigners want more detail.", "url": "https://www.zdnet.com/article/coronavirus-contact-tracing-app-heres-how-well-protect-your-privacy-says-nhs/", "urlToImage": null, "publishedAt": "2020-04-24T14:18:00Z", "content": "To earn the trust of the public, privacy will be fundamental to the building the coronavirus contact-tracing app that the UK government is working on, NHSX boss Matthew Gould has said in a new post detailing the organization's commitment to confidentiality - … [+6376 chars]"}, {"source": {"id": null, "name": "Onmsft.com"}, "author": "Rabia Noureen", "title": "Microsoft has started promoting its new Edge browser on Outlook.com - OnMSFT", "description": "Non-Edge users are now seeing messages promoting Microsoft’s new web browser on Outlook.com.", "url": "https://www.onmsft.com/news/microsoft-has-started-promoting-its-new-edge-browser-on-outlook-com", "urlToImage": null, "publishedAt": "2020-04-24T13:55:29Z", "content": "While Microsoft has already praised the capabilities of its new Microsoft Edge on various occasions, the company has now started promoting the new web browser on Outlook.com (via Windows Latest). Interestingly, non-Edge users who access their inbox on Outlook… [+1415 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": "www.facebook.com/christian.n.puno", "title": "Apple will release a new Mac laptop away from Intel - Micky News", "description": "Apple will release a new Mac laptop next year with its processors away from intel, giving users better performance.", "url": "https://micky.com.au/apple-will-release-a-new-mac-laptop-away-from-intel/", "urlToImage": null, "publishedAt": "2020-04-24T13:52:47Z", "content": "It is no doubt that Apple products usually cost high, but users often report it has excellent performance. Apple will release its new Mac laptop next year, according to Bloomberg. It is also said to have more improvements included.\r\nWhat is With the New Mac L… [+3233 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Christopher Groux", "title": "'Call of Duty: Modern Warfare' Free Multiplayer This Weekend, When It Starts and How to Download - Newsweek", "description": "Just like last time, players can download all they need for the 'Modern Warfare' weekend by installing the 'Call of Duty: Warzone' standalone application for free.", "url": "https://www.newsweek.com/call-modern-warfare-free-multiplayer-weekend-april-24-time-download-1500016", "urlToImage": null, "publishedAt": "2020-04-24T13:42:18Z", "content": "Call of Duty: Modern Warfare is hosting another free multiplayer weekend that starts this Friday and lasts through Monday. In this brief rundown of the key details, we outline the times, maps and download instructions you need to know.\r\nCall of Duty: Modern W… [+2527 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "HERE WeGo maps and navigation is now available on the Huawei AppGallery - XDA Developers", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiWWh0dHBzOi8vd3d3LnhkYS1kZXZlbG9wZXJzLmNvbS9oZXJlLXdlZ28tbWFwcy1hbmQtbmF2aWdhdGlvbi1odWF3ZWktYXBwZ2FsbGVyeS1hdmFpbGFibGUv0gFdaHR0cHM6Ly93d3cueGRhLWRldmVsb3BlcnMuY29tL2hlcmUtd2Vnby1tYXBzLWFuZC1uYXZpZ2F0aW9uLWh1YXdlaS1hcHBnYWxsZXJ5LWF2YWlsYWJsZS9hbXAv?oc=5", "urlToImage": null, "publishedAt": "2020-04-24T12:58:55Z", "content": null}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Joan E. Solsman", "title": "This Oculus Quest fitness app worked me so hard I forgot to breathe - CNET", "description": "Supernatural is a new spin on virtual reality fitness, and it may save me from backsliding into a lazy slug during lockdown.", "url": "https://www.cnet.com/news/supernatural-vr-fitness-mashup-of-pelaton-and-beat-saber-oculus-quest/", "urlToImage": null, "publishedAt": "2020-04-24T12:57:15Z", "content": "Supernatural sets game-ified, choreographed workouts to popular music in virtual reality. \r\nWithin\r\nSupernatural, a new virtual realityfitness game you can play in your home, isn't playing around. I sweat so hard I have to guzzle five glasses of water for eve… [+9525 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Rachel England", "title": "Nintendo blocks legacy logins after 160,000 accounts were compromised (update) - Yahoo Finance Australia", "description": "Some 160,000 Switch users have been the subject of a data breach.", "url": "https://au.finance.yahoo.com/news/nintendo-blocks-legacy-logins-data-breach-account-120610588.html", "urlToImage": null, "publishedAt": "2020-04-24T12:06:00Z", "content": "Nintendo has shut down NNID logins and is encouraging Switch owners to lock down their accounts after a wave of fraudulent attacks. Nintendo itself has confirmed that the platform has fallen foul of hackers, who are accessing accounts and using linked PayPal … [+3633 chars]"}, {"source": {"id": null, "name": "9news.com.au"}, "author": null, "title": "Ford unveils an all-electric Mustang dragster with 1,400 horsepower - 9News", "description": "Ford has unveiled a fully-electric Mustang dragster that has the same horsepower as 7 Toyota Camrys.", "url": "https://www.9news.com.au/national/ford-mustang-cobra-jet-1400-fully-electric-dragster-quarter-mile-in-eight-seconds/ae76ddf4-1097-4098-a516-086a8efa663b", "urlToImage": null, "publishedAt": "2020-04-24T10:12:36Z", "content": "Ford has unveiled a fully-electric Mustang dragster that has the same horsepower as 7 Toyota Camrys."}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Tom Bedford", "title": "The new iPhone SE is on sale today: here's how you can get one - TechRadar", "description": "No premium prices here", "url": "https://www.techradar.com/news/the-new-iphone-se-is-out-today-and-heres-how-you-can-get-one", "urlToImage": null, "publishedAt": "2020-04-24T10:09:00Z", "content": "Apple's new iPhone SE is available to buy now around the world. If you've been waiting to pick up a new iPhone that doesn't cost as much as a member of the iPhone 11 range, now is the time to do it.\r\nThe new iPhone SE has a 4.7-inch screen, the modern A13 Bio… [+987 chars]"}, {"source": {"id": null, "name": "Phonearena.com"}, "author": "Iskra Petrova", "title": "WhatsApp may display personalized ads using your Facebook data - PhoneArena", "description": "Since last year, Facebook has been looking for ways to display ads in WhatsApp. We have reported on the possibility of that happening in 2020, but then, earlier in the year, Facebook reportedly ...", "url": "https://www.phonearena.com/news/WhatsApp-may-display-personalized-ads-using-Facebook-data_id124119", "urlToImage": null, "publishedAt": "2020-04-24T09:56:00Z", "content": "Since last year, Facebook has been looking for ways to display ads in WhatsApp. We have reported on the possibility of that happening in 2020, but then, earlier in the year, Facebook reportedly abandoned those plans and decided not to monetize the app for now… [+1203 chars]"}, {"source": {"id": null, "name": "Happygamer.com"}, "author": "Joshua Goodpastor", "title": "SoundSelf: A Technodelic Is A Unique Soundbased VR Experience Now Availiable For Both PC And Mac VR Systems - Happy Gamer", "description": "Andromeda Entertainment has announced a unique video game experience in an immersive VR world. SoundSelf: A Technodelic is a unique and entrancing...", "url": "https://happygamer.com/soundself-a-technodelic-is-a-unique-soundbased-vr-experience-now-availiable-for-both-pc-and-mac-vr-systems-63644/", "urlToImage": null, "publishedAt": "2020-04-24T09:42:12Z", "content": "Andromeda Entertainment has announced a unique video game experience in an immersive VR world. SoundSelf: A Technodelic is a unique and entrancing experience that takes players on a meditative journey. The game is controlled using your own voice as you hum an… [+2237 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "AAP", "title": "Apple says ‘no evidence’ a flaw in iPhone email app is security risk for customers - 7NEWS.com.au", "description": "A flaw in an iPhone email app has been exposed but Apple says there is no security risk to its more than half a billion users.", "url": "https://7news.com.au/technology/apple-says-no-evidence-a-flaw-in-iphone-email-app-is-security-risk-for-customers-c-997338", "urlToImage": null, "publishedAt": "2020-04-24T07:01:00Z", "content": "Apple Inc says it has found no evidence a flaw in its email app for iPhones and iPads has been used against customers.\r\nAnd it believes the flaw does not pose an immediate risk to our users.\r\nWatch the video above\r\nSan Francisco-based security firm ZecOps on … [+1400 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Leah Williams", "title": "Animal Crossing Adds The Worst Character Ever - Kotaku Australia", "description": "Animal Crossing: New Horizons' recent update reintroduced a familiar face to the Animal Crossing universe. Redd, a fox art dealer is now a special guest character that can appear on your island. He sells intricate art pieces on his rickety boat, but be warned…", "url": "https://www.kotaku.com.au/2020/04/animal-crossing-new-horizons-redd-artworks/", "urlToImage": null, "publishedAt": "2020-04-24T05:33:00Z", "content": "Animal Crossing: New Horizons' recent update reintroduced a familiar face to the Animal Crossing universe. Redd, a fox art dealer is now a special guest character that can appear on your island. He sells intricate art pieces on his rickety boat, but be warned… [+3016 chars]"}, {"source": {"id": null, "name": "Dailymercury.com.au"}, "author": "Grant Edwards", "title": "BMW returns to the original performance flavour - Daily Mercury", "description": "After a diversion from the native recipe, BMW has rediscovered its performance mojo with the 3 Series.", "url": "https://www.dailymercury.com.au/news/bmw-returns-to-the-original-performance-flavour/4002041/", "urlToImage": null, "publishedAt": "2020-04-24T05:28:00Z", "content": "Once BMWs bread and butter, the 3 Series of the new millennium had a tendency to be bland.\r\nGood to drive, yes. Hard to fault, absolutely. But there was little to inspire or excite.\r\nThe compact sedan was lost in a sea of SUVs and swoopy-backed offshoots.\r\nGl… [+4988 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": null, "title": "The Music of Resident Evil 3: A remake of sight and sound - ABC News", "description": "Indulge in a little nostalgia as Game Show features music from new revitalisations of video games from the 90s and early 2000s.", "url": "https://www.abc.net.au/classic/programs/game-show/resident-evil-3/12162076", "urlToImage": null, "publishedAt": "2020-04-24T05:00:00Z", "content": "The 1990s featured many games still beloved and celebrated today for their compelling stories, memorable gameplay, and incredible soundtracks. \r\nSome are remembered for how they pushed against the hardware limitations of the time, while others turned those li… [+1436 chars]"}, {"source": {"id": null, "name": "Mumbrella.com.au"}, "author": null, "title": "97.3 FM's Robin Bailey and Monique Dews launch new podcast - mUmBRELLA*", "description": "Australian Radio Network’s (ARN) Robin Bailey and Monique Dews have launched a new podcast – Keeping Up With Corona.The announcement:Brisbane 97.3 FM’S Robin Bailey and Monique Dews launch new podcast ‘Keeping Up With Corona’ on the iHeartPodcast NetworkARN’s…", "url": "https://mumbrella.com.au/97-3-fms-robin-bailey-and-monique-dews-launch-new-podcast-625688", "urlToImage": null, "publishedAt": "2020-04-24T03:47:09Z", "content": "Australian Radio Networks (ARN) Robin Bailey and Monique Dews have launched a new podcast Keeping Up With Corona.\r\nThe announcement:\r\nBrisbane 97.3 FMS Robin Bailey and Monique Dews launch new podcast Keeping Up With Corona on the iHeartPodcast Network\r\nARNs … [+2153 chars]"}, {"source": {"id": null, "name": "Gadgetguy.com.au"}, "author": null, "title": "Review: Malwarebytes Privacy – a new paid VPN provider - GadgetGuy", "description": "Malwarebytes Privacy is a new VPN (virtual private network) from the same company that has one of, if not the best malware detection and removal solutions Malwarebytes Privacy", "url": "https://www.gadgetguy.com.au/product/malwarebytes-privacy-a-new-paid-vpn-provider/", "urlToImage": null, "publishedAt": "2020-04-24T03:46:22Z", "content": "Malwarebytes Privacy a new paid VPN provider\r\nMalwarebytes Privacy is a new VPN (virtual private network) from the same company that has one of, if not the best malware detection and removal solutions on the planet.\r\nWhile I trust Norton Lifelock, McAfee and … [+2950 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Jordan Ramée", "title": "CS:GO And Team Fortress Source Code Leaked, But Valve Isn't Worried - GameSpot", "description": "Though it's now become a problem in 2020, the leak of the source code for Team Fortress 2 and Counter-Strike:Global Offensive actually traces back to 2018.", "url": "https://www.gamespot.com/articles/csgo-and-team-fortress-source-code-leaked-but-valv/1100-6476395/", "urlToImage": null, "publishedAt": "2020-04-24T02:00:00Z", "content": "Valve seemingly has a bit of a leak problem right now, as the source code for both Team Fortress 2 and Counter-Strike: Global Offensive has recently made its way into the public eye. Or at least, that's how it appears. The source code has actually been public… [+4707 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": null, "title": "PlayStation 5 update: Sony keeping more secrets, former principal software engineer said - Micky News", "description": "News about the PlayStation 5 is still scarce even though it’s been more than a year after system architect Mark Cerny broke Sony’s silence.", "url": "https://micky.com.au/playstation-5-update-sony-keeping-more-secrets-former-principal-software-engineer-said/", "urlToImage": null, "publishedAt": "2020-04-24T01:47:00Z", "content": "The only solid reveal that Sony has done so far is its Dual Sense controller. And while this information has been a welcome one amidst the silence, its not enough to sate the curiosity of the gaming community.\r\nNow, this anticipation has doubled after PlaySta… [+2831 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "", "title": "Isolation item earns Aussie $150k in 7 mins - Chronicle", "description": "While coronavirus has had a catastrophic effect, the sudden change to everyday life has meant Aussies are spending their cash in unexpected places.", "url": "https://www.news.com.au/lifestyle/fitness/aussie-makes-150k-in-seven-minutes-off-new-isolation-musthave/news-story/764ecc100b4c25fb218aff38a227eeeb", "urlToImage": null, "publishedAt": "2020-04-24T01:43:00Z", "content": "While coronavirus has had a catastrophic effect on many businesses, the sudden change to everyday life has meant Aussies are spending their cash in unexpected places.\r\nJust ask Matilda Murray, who co-owns fitness apparel brand Stax with Don Robertson.\r\nShe sa… [+3919 chars]"}, {"source": {"id": null, "name": "Press-start.com.au"}, "author": "Shannon Grixti", "title": "The First Three Seasons Of Sailor Moon Have Been Put On YouTube For Free - Press Start Australia", "description": "Crunchyroll has announced that they'll be putting the first three seasons of Sailor Moon onto YouTube starting today. As of now, the first 10 episodes have dropped and a further 10 episodes will drop each Friday until July. These episodes are from Sailor Moon…", "url": "https://press-start.com.au/news/2020/04/24/the-first-three-seasons-of-sailor-moon-have-been-put-on-youtube-for-free/", "urlToImage": null, "publishedAt": "2020-04-24T00:56:27Z", "content": "Crunchyroll has announced that they’ll be putting the first three seasons of Sailor Moon onto YouTube starting today.\r\nAs of now, the first 10 episodes have dropped and a further 10 episodes will drop each Friday until July. These episodes are from Sailor Moo… [+181 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "‘He should know better’: Fevola criticised over ‘irresponsible’ ad - 7NEWS.com.au", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiZWh0dHBzOi8vN25ld3MuY29tLmF1L3Nwb3J0L2FmbC9oZS1zaG91bGQta25vdy1iZXR0ZXItZmV2b2xhLWNyaXRpY2lzZWQtb3Zlci1pcnJlc3BvbnNpYmxlLWFkLWMtOTk2NjQy0gFpaHR0cHM6Ly83bmV3cy5jb20uYXUvc3BvcnQvYWZsL2hlLXNob3VsZC1rbm93LWJldHRlci1mZXZvbGEtY3JpdGljaXNlZC1vdmVyLWlycmVzcG9uc2libGUtYWQtYy05OTY2NDIuYW1w?oc=5", "urlToImage": null, "publishedAt": "2020-04-24T00:45:41Z", "content": null}, {"source": {"id": null, "name": "Lifehacker.com.au"}, "author": "David Murphy", "title": "Unlock Nvidia's New App To Kill Annoying Background Noise - Lifehacker Australia", "description": "Gaming is great and all—especially during a pandemic, and especially now that you can play a souped-up version of Minecraft with real-time ray tracing—but you can now use your Nvidia graphics card to create real-life magic. Just look at this noise-cancelling …", "url": "https://www.lifehacker.com.au/2020/04/unlock-nvidias-new-app-to-kill-annoying-background-noise/", "urlToImage": null, "publishedAt": "2020-04-24T00:15:00Z", "content": "Gaming is great and allespecially during a pandemic, and especially now that you can play a souped-up version of Minecraft with real-time ray tracingbut you can now use your Nvidia graphics card to create real-life magic. Just look at this noise-cancelling de… [+2494 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Leah Williams", "title": "Steam's Weekend Deals Feature Some Must-Have Indies - Kotaku Australia", "description": "Every weekend lately, Steam has been spotlighting sales from indie developers. This weekend, it's Annapurna Interactive's turn — and there's a bunch of fantastic games on sale that come highly recommended....", "url": "https://www.kotaku.com.au/2020/04/steam-weekend-indie-sale/", "urlToImage": null, "publishedAt": "2020-04-23T23:33:00Z", "content": "Every weekend lately, Steam has been spotlighting sales from indie developers. This weekend, it's Annapurna Interactive's turn and there's a bunch of fantastic games on sale that come highly recommended.\r\nEmotional family tale What Remains of Edith Finch lead… [+2320 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Leah Williams", "title": "Horizon Zero Dawn 2 Rumours Spread After Developers Delete A Tweet - Kotaku Australia", "description": "In a now-deleted tweet, Horizon Zero Dawn developers Guerilla Games listed a job posting for a Senior AI Programmer that included the hashtag #ps5. It's kicked off speculation that the team could be working on an exclusive PlayStation 5 sequel for the much-lo…", "url": "https://www.kotaku.com.au/2020/04/horizon-zero-dawn-2-rumours/", "urlToImage": null, "publishedAt": "2020-04-23T23:31:00Z", "content": "In a now-deleted tweet, Horizon Zero Dawn developers Guerilla Games listed a job posting for a Senior AI Programmer that included the hashtag #ps5. It's kicked off speculation that the team could be working on an exclusive PlayStation 5 sequel for the much-lo… [+2268 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Nathan Grayson", "title": "You Can Finally Apologise For Being Trash In Overwatch - Kotaku Australia", "description": "Who doesn’t love voice lines in Overwatch? They let you say hello. They can help your teammates stay abreast of your ultimate percentage. If you play DPS, you can use them to spam messages about how you need healing until everybody else’s ears seal closed lik…", "url": "https://www.kotaku.com.au/2020/04/you-can-finally-apologize-for-being-trash-in-overwatch/", "urlToImage": null, "publishedAt": "2020-04-23T23:30:00Z", "content": "Who doesnt love voice lines in Overwatch? They let you say hello. They can help your teammates stay abreast of your ultimate percentage. If you play DPS, you can use them to spam messages about how you need healing until everybody elses ears seal closed like … [+2085 chars]"}, {"source": {"id": null, "name": "Lifehacker.com.au"}, "author": "David Murphy", "title": "How To Customise Your Background In Skype Video Calls - Lifehacker Australia", "description": "There’s little I enjoy more than a the well-executed use of a silly background in a video chat. While this quirky feature used to be exclusive to Zoom, more apps are integrating the functionality—including, recently, Microsoft Teams, and now, Microsoft’s own …", "url": "https://www.lifehacker.com.au/2020/04/how-to-customize-your-background-in-skype-video-calls/", "urlToImage": null, "publishedAt": "2020-04-23T23:30:00Z", "content": "Theres little I enjoy more than a the well-executed use of a silly background in a video chat. While this quirky feature used to be exclusive to Zoom, more apps are integrating the functionalityincluding, recently, Microsoft Teams, and now, Microsofts own Sky… [+1265 chars]"}, {"source": {"id": null, "name": "Ausdroid.net"}, "author": null, "title": "Google rolling out Android 11 DP3 to various Pixel phones today - Ausdroid", "description": "This year Google’s developer previews for Android 11 has been not just premonitions for Android 11 but also for Pixel phones this year with some of the new features we are seeing in developer previews making it into stable Android 10 builds on a monthly basis…", "url": "https://ausdroid.net/2020/04/24/google-rolling-out-android-11-dp3-to-various-pixel-phones-today/", "urlToImage": null, "publishedAt": "2020-04-23T22:48:14Z", "content": "This year Google’s developer previews for Android 11 has been not just premonitions for Android 11 but also for Pixel phones this year with some of the new features we are seeing in developer previews making it into stable Android 10 builds on a monthly basis… [+1551 chars]"}, {"source": {"id": null, "name": "Gizmodo.com.au"}, "author": "Tegan Jones", "title": "Every Telstra Plan For The New iPhone SE - Gizmodo Australia", "description": "Happy New iPhone Day! Apple is re-entering the mid-range market with the second generation of its beloved iPhone SE. it surprised all of us by starting at a cool $749. This means that when it comes to plans, you're going to get a far more palatable monthly bi…", "url": "https://www.gizmodo.com.au/2020/04/iphone-se-plans-telstra-australia/", "urlToImage": null, "publishedAt": "2020-04-23T22:44:00Z", "content": "Happy New iPhone Day! Apple is re-entering the mid-range market with the second generation of its beloved iPhone SE. it surprised all of us by starting at a cool $749. This means that when it comes to plans, you're going to get a far more palatable monthly bi… [+3859 chars]"}, {"source": {"id": null, "name": "Techrepublic.com"}, "author": "Brandon Vigliarolo", "title": "Google Meet: 4 new features in this Zoom alternative - TechRepublic", "description": "Google's enterprise video chat app, Google Meet, now has tiled layouts, higher-quality video sharing, and other user-requested features.", "url": "https://www.techrepublic.com/article/google-meet-4-new-features-in-this-zoom-alternative/", "urlToImage": null, "publishedAt": "2020-04-23T21:37:00Z", "content": "Google's enterprise video chat app, Google Meet, now has tiled layouts, higher-quality video sharing, and other user-requested features.\r\n Google has announced the rollout of four highly requested features to its Meet enterprise video conferencing service. \"R… [+3460 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Here's What You Need to Know About the NEW Sonos Radio Service - GetConnected Media", "description": "https://getconnectedmedia.com - Sonos Radio is arriving in Canada. The FREE ad-supported service is available exclusively to Sonos users and ties together ov...", "url": "https://www.youtube.com/watch?v=-dq1aWvaCtQ", "urlToImage": null, "publishedAt": "2020-04-23T20:52:48Z", "content": "https://getconnectedmedia.com - Sonos Radio is arriving in Canada. The FREE ad-supported service is available exclusively to Sonos users and ties together over 60,000 radio stations from around the world. This dedicated experience offers better categorization… [+1550 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": null, "title": "Microsoft rolls out Windows 10 update amid COVID-19 lockdown - Micky News", "description": "Microsoft is rolling out an update to fix productivity issues aimed for those working remotely because of the lockdown.", "url": "https://micky.com.au/microsoft-rolls-out-windows-10-update-amid-covid-19-lockdown/", "urlToImage": null, "publishedAt": "2020-04-23T20:30:00Z", "content": "Microsoft said that the updates are only optional and are not security patches. The update contains 30 fixes for various bugs and will be rolled out for Windows 10 versions 1909 and 1903.\r\nThese updates were released to remedy issues that might come up and af… [+2824 chars]"}, {"source": {"id": null, "name": "Businessinsider.com.au"}, "author": "Chrissy Montelli", "title": "How to enable voice typing on your Gboard app and make the virtual keyboard type for you - Business Insider Australia", "description": "Speech-to-text is a useful accessibility feature for those who are less inclined toward typing on a phone or other mobile device’s small screen.", "url": "https://www.businessinsider.com.au/how-do-i-enable-voice-typing-on-gboard-2020-4", "urlToImage": null, "publishedAt": "2020-04-23T19:52:00Z", "content": "<ul><li>\r\nYou can easily enable voice typing on Gboard as long as you have the typing app set as your primary keyboard.\r\n</li><li>\r\nGboard, Google’s virtual keyboard app, offers voice typing capability, a feature that’s compatible with almost all messaging ap… [+1642 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "James O'Connor", "title": "When Does Travis Scott Come To Fortnite Today?: Concert Start Time - GameSpot", "description": "Rapper Travis Scott will be doing a virtual global tour of Fortnite in the form of the Astronomical concert tonight, performing a new track in the massive battle royale game. Here are all the show times.", "url": "https://www.gamespot.com/articles/travis-scott-fortnite-concert-when-can-i-catch-the/1100-6476241/", "urlToImage": null, "publishedAt": "2020-04-23T19:06:00Z", "content": "Fortnite: Battle Royale will host Travis Scott concert tonight that will be used to launch a new song from the rapper. The concert, called Astronomical, will involve Travis Scott dropping a new track as part of what's being called \"an other-worldly experience… [+2264 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Here’s How To Change Your Display Name In VALORANT | TheGamer - TheGamer", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiOWh0dHBzOi8vd3d3LnRoZWdhbWVyLmNvbS9jaGFuZ2UtZGlzcGxheS1uYW1lLWluLXZhbG9yYW50L9IBPWh0dHBzOi8vd3d3LnRoZWdhbWVyLmNvbS9jaGFuZ2UtZGlzcGxheS1uYW1lLWluLXZhbG9yYW50L2FtcC8?oc=5", "urlToImage": null, "publishedAt": "2020-04-23T16:15:44Z", "content": null}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "https://www.facebook.com/LordDStark7", "title": "“I’m the best sniper in the fuc*** world”- DrDisrespect with Bold Statements in Call Of Duty Warzone - Essentially Sports", "description": "DrDisrespect the king of self-proclaimed claims, came out with a video bragging about being the best sniper in Call Of Duty Warzone.", "url": "https://www.essentiallysports.com/im-the-best-sniper-in-the-fuc-world-drdisrespect-with-bold-statements-in-call-of-duty-warzone-esports-news-2020/", "urlToImage": null, "publishedAt": "2020-04-23T14:14:56Z", "content": "Guy “DrDisrespect” Beahm, one of the best streamers out there known for his hilarious gimmicks and sniping skills. We love him simply because the self-proclaimed best in the world, is ruthless when it comes to gameplay. We all know about his humble beginnings… [+1926 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Ethan Gach", "title": "Stop Killing This Poor Fallout 76 Radstag - Kotaku Australia", "description": "There’s a new mutant in town and it’ll lead you to treasure if you’re not a sociopath....", "url": "https://www.kotaku.com.au/2020/04/stop-killing-this-poor-fallout-76-radstag/", "urlToImage": null, "publishedAt": "2020-04-23T14:00:00Z", "content": "Theres a new mutant in town and itll lead you to treasure if youre not a sociopath.\r\nIf youve been playing Fallout 76 since last weeks Wastelanders update went live you may have run into a new type of irradiated deer called an Observant Radstag. Its friendly … [+1191 chars]"}, {"source": {"id": null, "name": "Notebookcheck.net"}, "author": "Alex Alderson", "title": "Claiming that Apple has underclocked the A13 Bionic in the iPhone SE is ridiculous, and here's why - Notebookcheck.net", "description": "Apple is underclocking the A13 Bionic in the iPhone SE, so the story goes. Citing AnTuTu scores, the new iPhone SE cannot match the performance set by the iPhone 11 Pro or iPhone 11 Pro Max, its A13 Bionic-powered siblings. However, there is little use in ded…", "url": "https://www.notebookcheck.net/Claiming-that-Apple-has-underclocked-the-A13-Bionic-in-the-iPhone-SE-is-ridiculous-and-here-s-why.462248.0.html", "urlToImage": null, "publishedAt": "2020-04-23T13:56:28Z", "content": "AnTuTu has published initial benchmark data for the new iPhone SE, and it is causing a stir. Brought to our attention by MySmartPrice and GSMArena, AnTuTu claims the 256 GB version of the iPhone SE scored 492,166 points. Before we compare this score to any ac… [+1866 chars]"}, {"source": {"id": null, "name": "Thenewdaily.com.au"}, "author": null, "title": "Facebook Messenger for children lands in Australia - The New Daily", "description": "Facebook's Messenger app for children has officially launched in Australia, allowing kids the chance to chat and video call their friends.", "url": "https://thenewdaily.com.au/life/tech/2020/04/23/facebook-messenger-kids-safe/", "urlToImage": null, "publishedAt": "2020-04-23T12:28:08Z", "content": "Facebook’s Messenger app for children has officially launched in Australia this week, allowing kids the opportunity to chat and video call their friends through the platform.\r\nNot dissimilar to the ‘full-grown’ version, the app has been gradually rolled out t… [+3936 chars]"}, {"source": {"id": null, "name": "Mrpublicist.com"}, "author": null, "title": "Xiaomi now working on its flip smartphone with pop-up camera - MR Publicist", "description": "As the smartphone segment is now seeing a  complete change, companies are now trying to bring a new style on the phone.  For the very first time, Samsung has introduced a flip screen smartphone, and at the same time, Xiaomi is working on its very first flip s…", "url": "https://mrpublicist.com/2020/04/23/xiaomi-now-working-on-its-flip-smartphone-with-pop-up-camera/", "urlToImage": null, "publishedAt": "2020-04-23T12:06:43Z", "content": "As the smartphone segment is now seeing a  complete change, companies are now trying to bring a new style on the phone.  For the very first time, Samsung has introduced a flip screen smartphone, and at the same time, Xiaomi is working on its very first flip s… [+837 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Fortnite Midas' Mission: Visit The Agency, Hayman, and Greasy Graves in a Single Match - Cultured Vultures", "description": "The regular season of Fortnite is drawing to a close, but at least we have one more week of Midas' Mission challenges to dust off, along with the much-antici...", "url": "https://www.youtube.com/watch?v=W_RYcIwB81U", "urlToImage": null, "publishedAt": "2020-04-23T11:41:49Z", "content": null}, {"source": {"id": null, "name": "Pcmag.com"}, "author": "Matthew Humphries", "title": "Crucial Launches Its Fastest Ever M.2 SSD - PCMag", "description": "The P5 is a PCIe 3.0 x4 M.2 SSD capable of reaching 3,400MB/s read speeds and 3,000MB/s writes.", "url": "https://www.pcmag.com/news/crucial-launches-its-fastest-ever-m2-ssd", "urlToImage": null, "publishedAt": "2020-04-23T11:01:10Z", "content": "We're fast approaching the end of the road for PCIe 3.0 as PCIe 4.0 adoption begins by storage and motherboard manufacturers, but Crucial is offering us one more, \"extra fast\" 3.0 drive called the P5.\r\nThe Crucial P5 SSD is a PCIe x4 NVMe M.2 drive using Micr… [+1679 chars]"}, {"source": {"id": null, "name": "Notebookcheck.net"}, "author": "Sanjiv Sathiah", "title": "Here are the recommended PC specs for MS Flight Simulator - Notebookcheck.net", "description": "Microsoft has revealed the specifications required to power its all-new Flight Simulator on PC. In a pleasant surprise, a PC with mid-range specs from 2013 will be able to play it, but a higher end rig from 2019 will be best placed to demonstrate everything t…", "url": "https://www.notebookcheck.net/Here-are-the-recommended-PC-specs-for-MS-Flight-Simulator.462290.0.html", "urlToImage": null, "publishedAt": "2020-04-23T10:41:20Z", "content": "Microsofts all-new Flight Simulator has got the flight sim enthusiast community excited and rightly so as it features some spectacular visuals. If you dont have an Xbox One S or Xbox One X, you will need a PC with Windows 10 to run it and until now it has not… [+1266 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "2020 Mercedes-AMG A45 S review | First Australian drive of the thermonuclear hatchback! | Caradvice - CarAdvice.com", "description": "MORE: https://www.caradvice.com.au/844598/2020-mercedes-amg-a45-s-review/?utm_source=YouTube&utm_medium=text&utm_campaign=YT_DESC | SUBSCRIBE: http://cad.vc/...", "url": "https://www.youtube.com/watch?v=fktudM4UiYQ", "urlToImage": null, "publishedAt": "2020-04-23T10:27:18Z", "content": null}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Mark Wilson", "title": "DJI Mavic Air 2 fully revealed in huge photo leak – along with its price tag - TechRadar", "description": "Leaked photos give us a good look at the mid-range drone", "url": "https://www.techradar.com/news/dji-mavic-air-2-fully-revealed-in-huge-photo-leak-along-with-its-price-tag", "urlToImage": null, "publishedAt": "2020-04-23T09:46:00Z", "content": "The DJI Mavic Air 2's official launch may be lined up for April 27, but that hasn't stopped photos of the incoming drone leaking left, right and center with the latest ones giving us a good look at the mid-range drone's design from virtually every angle.\r\nSev… [+3123 chars]"}, {"source": {"id": null, "name": "Hitc.com"}, "author": "Callum Smith", "title": "Is Trials Of Mana multiplayer and two-player? Here’s how long the remake is to beat! - HITC - Football, Gaming, Movies, TV, Music", "description": "Everything you must know about whether Trials Of Mana features two-player multiplayer and how long it reportedly takes to beat this remake.", "url": "https://www.hitc.com/en-gb/2020/04/23/is-trials-of-mana-multiplayer-two-player-how-long-to-beat/", "urlToImage": null, "publishedAt": "2020-04-23T07:28:05Z", "content": "Everything you must know about whether Trials Of Mana features two-player multiplayer and how long it reportedly takes to beat this remake.\r\nSquare Enix are releasing another remake quickly on the heels of Final Fantasy VII which is said to be the fastest sel… [+2238 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "India TV Tech Desk", "title": "Fortnite for Android now available on Google Play Store: Here's how you can download - India TV News", "description": "After almost 18 months, Epic Games has finally released Fortnite on the Google Play Store for all Android users. Here's what you need to know.", "url": "https://www.indiatvnews.com/technology/news-fortnite-for-android-finally-comes-to-google-play-store-610130", "urlToImage": null, "publishedAt": "2020-04-23T07:15:00Z", "content": "Fortnite requires an additional download of 7.4GB\r\nFortnite is one of the most popular battle royale games. The game is available on multiple platforms including Android, iOS PS4, PC, Xbox and Nintendo Switch. For smartphones, the game was first introduced in… [+1432 chars]"}, {"source": {"id": null, "name": "Sahiwal.tv"}, "author": "Jeremy Spirogis", "title": "Curtain lifted from Motorola Edge, how is it totally different from larger variants? - Sahiwal Tv", "description": "Motorola has additionally launched Motorola Edge with its Edge + flagship cellphone, which is an inexpensive cellphone. Both the telephones had been to be launched within the Mobile World Congress…", "url": "https://sahiwal.tv/curtain-lifted-from-motorola-edge-how-is-it-different-from-bigger-variants/", "urlToImage": null, "publishedAt": "2020-04-23T06:17:00Z", "content": "Motorola has additionally launched Motorola Edge with its Edge + flagship cellphone, which is an inexpensive cellphone. Both the telephones had been to be launched within the Mobile World Congress (MWC) 2020 however as a consequence of Coronavirus, many main … [+1216 chars]"}, {"source": {"id": null, "name": "Thechronicle.com.au"}, "author": "Mark Furler", "title": "Canon EOS M6 Mark II: Small, but fully loaded - Chronicle", "description": "SUPER compact, easy to use, 14 frames per second shooting, 4K video and an optional electronic viewfinder – there’s lots to love about this Canon shooter.", "url": "https://www.thechronicle.com.au/news/canon-eos-m6-mark-ii-small-fully-loaded/4001092/", "urlToImage": null, "publishedAt": "2020-04-23T03:59:35Z", "content": "SUPER compact, easy to use, 14 frames per second continuous shooting, 4K video and an optional electronic viewfinder - there's lots to love about one of Canon's best new shooters.\r\nThe EOS M6 Mark II captures beautiful, vivid images with its 32.5MP Dual Pixel… [+2843 chars]"}, {"source": {"id": null, "name": "Wccftech.com"}, "author": "Hassan Mujtaba", "title": "AMD Ryzen 4000 Renoir Desktop 35W & 65W Desktop CPUs Spotted In The Wild – Quad Core Variants With 7nm Enhanced Vega GPU - Wccftech", "description": "AMD's Ryzen 4000 'Renoir' Desktop CPUs have been spotted once again in online listings. The latest details come from within 3DMark and UserBenchmark listings which were spotted by Momomo_US and Rogame. AMD Ryzen 4000 'Renoir' 7nm Desktop CPUs With Zen 2 Cores…", "url": "https://wccftech.com/amd-ryzen-4000-renoir-65w-35w-desktop-am4-cpus-spotted-zen-2-7nm-vega/", "urlToImage": null, "publishedAt": "2020-04-23T03:46:45Z", "content": "AMD's Ryzen 4000 'Renoir' Desktop CPUs have been spotted once again in online listings. The latest details come from within 3DMark and UserBenchmark listings which were spotted by Momomo_US and Rogame.\r\nAMD's Ryzen 4000 'Renoir' Desktop CPUs are highly antici… [+3325 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Final Fantasy VII Remake Review Playthrough #3 - PlayStation Universe", "description": "Final Fantasy VII Remake has finally arrived! Well... the first game anyway. We're so excited about this release that we came up with the idea of starting a ...", "url": "https://www.youtube.com/watch?v=Z3uvdntfuxY", "urlToImage": null, "publishedAt": "2020-04-23T03:21:34Z", "content": null}, {"source": {"id": null, "name": "Dexerto.com"}, "author": "Isaac McIntyre", "title": "DisguisedToast explains why he's back on Twitch despite Facebook deal - Dexerto", "description": "Streaming star DisguisedToast went live on Twitch on April 22, despite having penned an exclusive deal with Facebook Gaming.", "url": "https://www.dexerto.com/entertainment/disguisedtoast-explains-back-on-twitch-despite-facebook-deal-1356898", "urlToImage": null, "publishedAt": "2020-04-23T03:03:10Z", "content": "Streaming superstar Jeremy ‘DisguisedToast’ Wang has cleared the air on why he returned to Twitch for a Just Chatting broadcast on April 22, despite having inked an exclusive deal with Facebook Gaming just six months ago.\r\nApril 22 seemed like a regular day f… [+2612 chars]"}]}