{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Caradvice.com.au"}, "author": "Liam Murphy", "title": "2021 BMW 5 Series revealed early as official images leaked online - CarAdvice", "description": "The updated 2021 BMW 5 Series sedan has been laid bare in leaked official photos ahead of its debut globally later this year. The facelifted BMW 5 Series is expected to go on sale in Australia in l...", "url": "https://www.caradvice.com.au/846457/2021-bmw-5-series-leaked/", "urlToImage": "https://media.caradvice.com.au/image/private/c_fill,q_auto,f_auto,w_960,h_500/cgothrjhmsqwo1lwhxbw.jpg", "publishedAt": "2020-04-28T23:28:00Z", "content": "The updated 2021 BMW5 Series sedan has been laid bare in leaked official photos ahead of its debut globally later this year.\r\nThe facelifted BMW 5 Series is expected to go on sale in Australia in late 2020 or early 2021. CarAdvice has reached out to BMW Austr… [+1142 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Alex Walker", "title": "What's The Best Australian Sports Game? - Kotaku Australia", "description": "With the lack of sport going on, ABC's Grandstand recently ran a little poll to determine the best sports game. Football Manager 2020 won out, which I can understand, but it's still a bit of a travesty. So let's run a slightly different poll....", "url": "https://www.kotaku.com.au/2020/04/best-australian-sports-game/", "urlToImage": "https://edge.alluremedia.com.au/m/k/2020/04/jonah-lomu-rugby.jpg", "publishedAt": "2020-04-28T23:18:00Z", "content": "With the lack of sport going on, ABC's Grandstand recently ran a little poll to determine the best sports game.Football Manager 2020 won out, which I can understand, but it's still a bit of a travesty. So let's run a slightly different poll. \r\nI've led with a… [+5249 chars]"}, {"source": {"id": null, "name": "Slashgear.com"}, "author": "Chris Burns", "title": "Moving Out released to Nintendo Switch, PS4, launch day 1 on Xbox Game Pass - SlashGear", "description": "The Xbox One Game Pass and Xbox Game Pass for PC crews have a day 1 release in store for the month of April, as of today. The game Moving Out was released for multiple platforms, including Xbox, Pl…", "url": "https://www.slashgear.com/moving-out-released-to-nintendo-switch-ps4-launch-day-1-on-xbox-game-pass-28618629/", "urlToImage": "https://scdn.slashgear.com/wp-content/uploads/2020/04/movingawegwa.jpg", "publishedAt": "2020-04-28T22:03:13Z", "content": "The Xbox One Game Pass and Xbox Game Pass for PC crews have a day 1 release in store for the month of April, as of today. The game Moving Out was released for multiple platforms, including Xbox, PlayStation 4, PC, and Nintendo Switch, and it’s ready to roll i… [+1489 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "", "title": "Joué Play is a cheap, simple and customizable MIDI controller - Engadget", "description": "The Joué Play lowers the price -- $289 with four overlays -- and adds a companion app that allows you to quickly and easily start making music with built in sounds.  In fact, if you ask the company, it think the Play will appeal to even those who can’t play a…", "url": "https://www.engadget.com/joue-play-customizable-mpe-midi-controller-cheap-simple-kickstarter-160143343.html", "urlToImage": "https://o.aolcdn.com/images/dims?resize=1200%2C630&crop=1200%2C630%2C0%2C0&quality=80&image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-uploaded-images%2F2020-04%2F46a5ee50-8950-11ea-bfaf-909927c7ad9b&client=amp-blogside-v2&signature=986c647d4e25ab872b50bce66cfc688192fb9784", "publishedAt": "2020-04-28T21:58:45Z", "content": "The heart and soul of the Joué Play is the same as the original board -- a pressure sensitive pad with wooden sides with interchangeable silicone pads that have an RFID chip in them. Drop down the pad controller module the app will automatically switch to the… [+1277 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Heather Alexandra", "title": "Knife Child Terrorises Local Sector - Kotaku Australia", "description": "It’s important to analyse games with rigorous consideration. Games are art and we need to hold them accountable for everything they contain. So please understand how serious I am when I say that Tonberries are the funniest fucking thing on the planet....", "url": "https://www.kotaku.com.au/2020/04/knife-child-terrorizes-local-sector/", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/htdjsqzvgeqgcecitht5.jpg", "publishedAt": "2020-04-28T21:39:00Z", "content": "Its important to analyse games with rigorous consideration. Games are art and we need to hold them accountable for everything they contain. So please understand how serious I am when I say that Tonberries are the funniest fucking thing on the planet.\r\nThe Ton… [+2365 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": null, "title": "‘The Last of Us 2’ and ‘Ghost of Tsushima’ gets official release dates - Micky News", "description": "After the long wait, The Last of Us 2 and Ghost of Tsushima have gotten their release dates and fans couldn't be more excited.", "url": "https://micky.com.au/the-last-of-us-2-and-ghost-of-tsushima-gets-official-release-dates/", "urlToImage": "https://micky.com.au/wp-content/uploads/2020/04/The-Last-of-Us-2-1.jpg", "publishedAt": "2020-04-28T21:03:31Z", "content": "A recent post by Sony reveals the official release dates for The Last of Us 2 and Ghost of Tsushima. While fans are still worried about possible delays because of the Covid-19 pandemic, many are still hopeful that these releases will pull through as promised.… [+2502 chars]"}, {"source": {"id": null, "name": "Yankodesign.com"}, "author": "Sarang Sheth", "title": "This armored vehicle is for people who think the Tesla Cybertruck isn't intense enough - Yanko Design", "description": null, "url": "https://www.yankodesign.com/2020/04/28/this-armored-vehicle-is-for-people-who-think-the-tesla-cybertruck-isnt-intense-enough/", "urlToImage": null, "publishedAt": "2020-04-28T21:03:02Z", "content": "It’s really difficult to imagine what definite post-apocalyptic scenario the ARMORTRUCK concept was designed for because truth be told, it looks like the kind of vehicle that could survive any sort of problem you throw at it. Designed by concept artist Milen … [+1302 chars]"}, {"source": {"id": null, "name": "Venturebeat.com"}, "author": "Dean Takahashi", "title": "Scopely's Javier Ferreira on breaking into the top ranks of mobile gaming - VentureBeat", "description": "Javier Ferreira wants people to know that Scopely has broken out of the pack of mobile game makers to be one of the biggest in the industry.", "url": "https://venturebeat.com/2020/04/28/scopelys-javier-ferreira-on-breaking-into-the-top-ranks-of-mobile-gaming/", "urlToImage": "https://venturebeat.com/wp-content/uploads/2020/04/scopely-2.jpg?w=1200&strip=all", "publishedAt": "2020-04-28T20:39:32Z", "content": "Javier Ferreira wants people to know that Scopely has broken out of the pack of mobile game makers to be one of the biggest in the industry, with hit games that are generating more than $100 million a year.\r\nSpeaking at our GamesBeat Summit 2020 event with Dr… [+1233 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Nathan Grayson", "title": "I'm Playing Animal Crossing Wrong, And It's Good, Actually - Kotaku Australia", "description": "Three weeks ago, I added a campsite to my Animal Crossing: New Horizons island. Three weeks ago, Leopold, a walking testament to unearned confidence, showed up. Three weeks ago, I stopped unlocking new features in Animal Crossing....", "url": "https://www.kotaku.com.au/2020/04/im-playing-animal-crossing-wrong-and-its-good-actually/", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/hwzrvsdbky8uket9ffv0.jpg", "publishedAt": "2020-04-28T20:30:00Z", "content": "Three weeks ago, I added a campsite to my Animal Crossing: New Horizons island. Three weeks ago, Leopold, a walking testament to unearned confidence, showed up. Three weeks ago, I stopped unlocking new features in Animal Crossing.\r\nThis is Leopold:\r\nLeopold s… [+4916 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Darrell Etherington", "title": "Apple adds COVID-19 testing sites to Maps across the U.S., and shares more mobility data - Yahoo Lifestyle", "description": "Apple  has now added COVID-19 testing sites to its Apple Maps app across the U.S., covering all 50 states and Puerto Rico.  The update provides testing locations including hospitals, clinics, urgent care facilities, general practitioners, pharmacies and more,…", "url": "https://au.lifestyle.yahoo.com/apple-adds-covid-19-testing-195334046.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/Y8dqHbMWV2NEbfn95szjEg--~B/aD0xMTEwO3c9MTgzNjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/techcrunch_350/e28c513aef588dbbd0056b41617a70b0", "publishedAt": "2020-04-28T19:53:00Z", "content": "Apple has now added COVID-19 testing sites to its Apple Maps app across the U.S., covering all 50 states and Puerto Rico. The update provides testing locations including hospitals, clinics, urgent care facilities, general practitioners, pharmacies and more, a… [+1786 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "PS5: The Dev's Think It's Better - TheGamer", "description": "Sony's PS5 has a lot of gamers excited, especially the video game developers! Find out why they're more excited for the Playstation platform than Microsoft's...", "url": "https://www.youtube.com/watch?v=nOcWcKGCxVU", "urlToImage": "https://i.ytimg.com/vi/nOcWcKGCxVU/maxresdefault.jpg", "publishedAt": "2020-04-28T19:45:01Z", "content": "Sony's PS5 has a lot of gamers excited, especially the video game developers! Find out why they're more excited for the Playstation platform than Microsoft's Xbox \r\nSUBSCRIBE NOW to The Gamer! Click here: https://goo.gl/9cpWgf\r\nNo matter how good a console is… [+842 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Lynn La", "title": "iPhone SE vs. iPhone 11 comparison: Which new iPhone should you buy? - CNET", "description": "Apple's iPhone SE for 2020 is $300 cheaper than the baseline iPhone 11. Here's what you get (and don't get) for that price.", "url": "https://www.cnet.com/news/iphone-se-vs-iphone-11-comparison-which-apple-phone-to-buy-get-in-2020/", "urlToImage": "https://cnet2.cbsistatic.com/img/SAwHLMSHvlNTBiUd-8PXcYhffdo=/2020/04/22/e1c7c87a-2520-4172-912e-99b3a1d50c0c/iphone-se-2020-15.jpg", "publishedAt": "2020-04-28T19:13:05Z", "content": "As the sequel to Apple's 2016 sleeper-hit iPhone of the same name, the new iPhone SE starts at $399, £419 or AU$749. With that price tag, the phone aims to court budget-minded users who may not be able to splurge on $1,000 handsets like the iPhone 11 Pro or G… [+7608 chars]"}, {"source": {"id": null, "name": "Gamerturn.com"}, "author": "Jack Jaff", "title": "'Days Gone 2' maybe even in the works for PlayStation 5 - FrontLine Gaming - Gamer Turn", "description": "Days Gone wasn’t a big success but it was still an exclusive enjoyable PlayStation 4. Fans may have learned that Days Gone 2 is officially in the works for the PS5 thanks to job listings by the zombie games developers. If Days Gone 2 is actually confirmed it …", "url": "https://www.gamerturn.com/days-gone-2-maybe-even-in-the-works-for-playstation-5/", "urlToImage": "https://www.gamerturn.com/wp-content/uploads/2020/04/Untitled-653.jpg", "publishedAt": "2020-04-28T19:11:47Z", "content": "Days Gone wasn’t a big success but it was still an exclusive enjoyable PlayStation 4. Fans may have learned that Days Gone 2 is officially in the works for the PS5 thanks to job listings by the zombie games developers.If Days Gone 2 is actually confirmed it w… [+2090 chars]"}, {"source": {"id": null, "name": "Gamesradar.com"}, "author": "Austin Wood", "title": "Google Stadia gets PUBG and Octopath Traveler - GamesRadar+ AU", "description": "Both games are now available", "url": "https://www.gamesradar.com/google-stadia-gets-pubg-and-octopath-traveler/", "urlToImage": "https://cdn.mos.cms.futurecdn.net/qtFSXNGNcRuL7ohGTDNWz9-1200-80.jpg", "publishedAt": "2020-04-28T19:09:00Z", "content": "An unlikely pair of games were released on Google Stadia\r\n today: PUBG and Octopath Traveler.\r\nGoogle revealed the two additions during its latest Stadia Connect stream, which also revealed a big Stadia push from EA that will bring five of the publisher's big… [+1572 chars]"}, {"source": {"id": null, "name": "9to5google.com"}, "author": null, "title": "OnePlus 8 Pro review: Finally, a fully formed flagship OnePlus [Video] - 9to5Google", "description": "The OnePlus 8 Pro might be the most expensive device from OnePlus to date, but it finally has no compromies to make it out-and-out flagship competitor.", "url": "https://9to5google.com/2020/04/28/oneplus-8-pro-review/", "urlToImage": "https://9to5google.com/wp-content/uploads/sites/4/2020/04/OnePlus-7-Pro-vs-OnePlus-8-Pro.jpg?quality=82&strip=all", "publishedAt": "2020-04-28T19:06:30Z", "content": "The OnePlus 8 Pro is the culmination of years of hardware and software decisions that might not have come to fruition if the BBK-owned firm simply disregarded the input of its ravenous fanbase.\r\nSince the launch of the 7 Pro, OnePlus has firmly set its sights… [+16226 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Igor Bonifacic", "title": "Anchor converts your video calls into podcasts - Yahoo Finance Australia", "description": "Spotify's Anchor is adding yet another way for people to more easily produce their own podcasts.", "url": "https://au.finance.yahoo.com/news/anchor-video-chat-podcast-feature-190534726.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/wVdxuEjiSxGczjXHn8rnaQ--~B/aD0xMDAwO3c9MTYwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2020-04/1f508aa0-8981-11ea-b2b3-939047e74d51", "publishedAt": "2020-04-28T19:05:00Z", "content": "Spotify's Anchor app is adding yet more functionality to help make producing podcasts more accessible. Starting today, you can use the platform to convert your Zoom, Google Meet, Skype, FaceTime, Twitch and Instagram Live video calls into podcast material.\r\nT… [+1117 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Championing the Video Game Industry and Culture - VentureBeat", "description": "The video game industry is having its own struggles with the coronavirus, but it's been examining a number of things about how it makes, markets, and sells g...", "url": "https://www.youtube.com/watch?v=bF5IP_yt5lI", "urlToImage": "https://i.ytimg.com/vi/bF5IP_yt5lI/maxresdefault.jpg", "publishedAt": "2020-04-28T18:45:00Z", "content": "The video game industry is having its own struggles with the coronavirus, but it's been examining a number of things about how it makes, markets, and sells games -- crunch development, a bigger role for women and minorities, and making games more accessible. … [+163 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "DJI Mavic Air 2: Unboxing, first look and brief setup walkthrough - Pocket-lint", "description": "DJI's latest drone is here, and we have one to test. Cam unboxes the Mavic Air 2, goes over some of the hardware and specs, and shows some of the set up proc...", "url": "https://www.youtube.com/watch?v=VnOaHHjLOgg", "urlToImage": "https://i.ytimg.com/vi/VnOaHHjLOgg/maxresdefault.jpg", "publishedAt": "2020-04-28T18:44:01Z", "content": "DJI's latest drone is here, and we have one to test. Cam unboxes the Mavic Air 2, goes over some of the hardware and specs, and shows some of the set up process. \r\nMavic Air 2 vs. Mavic Air: https://bit.ly/3eWZRJjMavic Air 2 initial review: https://bit.ly/2VI… [+257 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": null, "title": "Samsung could drop Time-of-Flight sensor from the Galaxy Note 20 - Micky News", "description": "Removing this feature could seriously hurt the Samsung Galaxy Note 20 and give its rival, the Apple iPhone 12 a significant advantage.", "url": "https://micky.com.au/samsung-could-drop-time-of-flight-sensor-from-the-galaxy-note-20/", "urlToImage": "https://micky.com.au/wp-content/uploads/2020/04/uns-samsung-galaxy-note1.jpg", "publishedAt": "2020-04-28T18:15:50Z", "content": "Removing this feature could seriously hurt the Samsung Galaxy Note 20 and give its rival, the Apple iPhone 12 a significant advantage.\r\nTime-of-Flight (ToF) sensors dont take pictures, but these cameras function in a big way. The quality of photo effects can … [+2693 chars]"}, {"source": {"id": null, "name": "Venturebeat.com"}, "author": "Dean Takahashi", "title": "Nexon’s Owen Mahoney: How the gaming world has changed - VentureBeat", "description": "Nexon CEO Owen Mahoney gave us a picture of how the gaming world has changed during the pandemic. And so far, the world is tilting more to online games.", "url": "https://venturebeat.com/2020/04/28/nexons-owen-mahoney-how-the-gaming-world-has-changed/", "urlToImage": "https://venturebeat.com/wp-content/uploads/2015/09/owen-mahoney-black.jpg?w=1200&strip=all", "publishedAt": "2020-04-28T18:14:22Z", "content": "Nexon CEO Owen Mahoney gave us a picture of how the gaming world has changed during the pandemic. And so far, the world is tilting more to online games.\r\nMahoney spoke in a fireside chat at GamesBeat Summit 2020 with Michael Pachter, a longtime research analy… [+1068 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Xiaomi Mi 10 Pro camera review - GSMArena Official", "description": "Following our Xiaomi Mi 10 Pro review, here's an in-depth look at the CAMERA PERFORMANCE and IMAGE QUALITY of the phone's solid camera setup. We've also thro...", "url": "https://www.youtube.com/watch?v=0uQWQ4qQQDw", "urlToImage": "https://i.ytimg.com/vi/0uQWQ4qQQDw/maxresdefault.jpg", "publishedAt": "2020-04-28T18:09:17Z", "content": "Following our Xiaomi Mi 10 Pro review, here's an in-depth look at the CAMERA PERFORMANCE and IMAGE QUALITY of the phone's solid camera setup. We've also thrown in some direct comparisons to the Galaxy S20 Ultra and the P40 Pro to see whether Xiaomi's top-tier… [+448 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": null, "title": "Samsung Galaxy Fold 2 targets iPad Pro with this rumored feature - Micky News", "description": "The Samsung Galaxy Fold 2 may have finally found a purpose with this rumored new feature as the device is set to rival the iPad Pro.", "url": "https://micky.com.au/samsung-galaxy-fold-2-targets-ipad-pro-with-this-rumored-feature/", "urlToImage": "https://micky.com.au/wp-content/uploads/2020/04/uns-samsung-galaxy-fold-1.jpg", "publishedAt": "2020-04-28T18:08:23Z", "content": "The Samsung Galaxy Fold 2 hasnt even been announced yet, but incessant leaks continue to build up the hype for the device. Now, it seems that the foldable device would come with its own S-pen stylus.\r\nFinding a purpose for the Galaxy Fold\r\nThe Samsung Galaxy … [+2606 chars]"}, {"source": {"id": null, "name": "Androidcentral.com"}, "author": "Samuel Tolbert", "title": "Star Wars Battlefront II: The Battle on Scarif update detailed, coming on April 29 - Android Central", "description": "The Battle on Scarif update now has a new release date! Players can expect to storm or defend the beaches of this Imperial garrison on April 29. The update is also bringing new appearances for several heroes.", "url": "https://www.androidcentral.com/star-wars-battlefront-ii-battle-scarif-update-detailed", "urlToImage": "https://www.androidcentral.com/sites/androidcentral.com/files/styles/large/public/field/image/2020/04/battlefront-2-scarif-2gk6.jpg?itok=4VV4wqNo", "publishedAt": "2020-04-28T18:04:56Z", "content": "Star Wars Battlefront II fans, rejoice. While The Battle on Scarif update was previously pushed back, there's now a solid release date. The Battle on Scarif is scheduled to arrive in Star Wars Battlefront II on April 29!\r\nIn addition to the return of Scarif, … [+861 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Amanda Kooser", "title": "Wild VR gadget makes virtual objects feel solid at the touch of your hand - CNET", "description": "Wireality makes virtual reality a lot more physical. Can we build a Star Trek holodeck now, please?", "url": "https://www.cnet.com/news/wild-vr-gadget-makes-virtual-objects-feel-solid-at-the-touch-of-your-hand/", "urlToImage": "https://cnet2.cbsistatic.com/img/F1Xan2fqp2E0ba1sfLHKXywKL6E=/2020/04/28/407dadc8-6a6e-40c4-85ca-39867b15bf82/wirealityillustration.jpg", "publishedAt": "2020-04-28T17:53:18Z", "content": "This image shows how Wireality works.\r\nCarnegie Mellon University\r\nResearchers at Carnegie Mellon University want to make virtual reality a little less virtual and a lot more physical with a device that puts the feel of solid objects at your fingertips.\r\nWire… [+1920 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": null, "title": "‘Pokemon Go’ remote raid feature now available for certain players - Micky News", "description": "A new update has been released on Pokemon Go where players can perform Raid Battles at the comfort of their own couch.", "url": "https://micky.com.au/pokemon-go-remote-raid-feature-now-available-for-certain-players/", "urlToImage": "https://micky.com.au/wp-content/uploads/2020/04/maxresdefault-1-2.jpg", "publishedAt": "2020-04-28T17:43:14Z", "content": "Niantic, Pokemon Gos developers, promised to modify the game so people can still play while being locked on quarantine. The promise has been fulfilled today.\r\nStarting April 28, 2020, players who have an item called Remote Raid pass can attend a Raid Battle t… [+3044 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Predator: Hunting Grounds Review - IGN", "description": "Predator: Hunting Grounds offers brief moments of blockbuster action, but ultimately underwhelms more often than it excites.", "url": "https://www.youtube.com/watch?v=zP292VzyWLw", "urlToImage": "https://i.ytimg.com/vi/zP292VzyWLw/hqdefault.jpg", "publishedAt": "2020-04-28T17:21:34Z", "content": "Predator: Hunting Grounds offers brief moments of blockbuster action, but ultimately underwhelms more often than it excites."}, {"source": {"id": null, "name": "Tomsguide.com"}, "author": "Henry T. Casey", "title": "You might be charging your MacBook wrong: What you need to know - Tom's Guide", "description": "Charging your MacBook Pro the wrong way could lead to poor performance", "url": "https://www.tomsguide.com/news/macbook-pro-charging-bug-kernel_task", "urlToImage": "https://cdn.mos.cms.futurecdn.net/kUZpyDSzyErUya9cLtd3qU-1200-80.jpg", "publishedAt": "2020-04-28T16:59:04Z", "content": "Charging a modern MacBook seems easy: you just plug a USB-C cable into one of its Thunderbolt 3 ports, and then go about your business. But a new claim spreading online says it's not that simple.\r\nOver at the tech forum StackExchange, users are reporting an i… [+1925 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Darrell Etherington", "title": "Elon Musk provides more details about SpaceX’s plan to reduce Starlink satellite visibility - TechCrunch", "description": "During a virtual conference briefing this week, SpaceX founder and CEO Elon Musk provided more details about a new plan that his company has to mitigate the impact of their Starlink satellite constellation on night sky observation. Musk first revealed on Twit…", "url": "http://techcrunch.com/2020/04/28/elon-musk-provides-more-details-about-spacexs-plan-to-reduce-starlink-satellite-visibility/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2020/04/spacex-visorsat-slide.jpg?w=725", "publishedAt": "2020-04-28T16:51:15Z", "content": "During a virtual conference briefing this week, SpaceX founder and CEO Elon Musk provided more details about a new plan that his company has to mitigate the impact of their Starlink satellite constellation on night sky observation. Musk first revealed on Twit… [+2368 chars]"}, {"source": {"id": null, "name": "Happygamer.com"}, "author": "Jeremy Green", "title": "Lego: The Lord Of The Rings Is Back On Steam After A Mysterious Year Of Absence - Happy Gamer", "description": "The Lego series is loved by so many in the gaming community today. They feature family-friendly content and humorous moments. And surprisingly, the...", "url": "https://happygamer.com/lego-the-lord-of-the-rings-is-back-on-steam-after-a-mysterious-year-of-absence-64055/", "urlToImage": "https://happygamer.com/wp-content/uploads/2020/04/d345d696179c4353cbe5c7d5c2c53ff4.jpg", "publishedAt": "2020-04-28T16:27:12Z", "content": "The Lego series is loved by so many in the gaming community today. They feature family-friendly content and humorous moments. And surprisingly, the gameplay is quite addicting. One of the better offerings in the Lego genre is Lego: The Lord of the Rings. If y… [+2043 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": "Jermaine D. Delos Santos", "title": "The ‘Nintendo Switch Lite’ made a ‘comeback,’ but only in select stores - Micky News", "description": "Due to rising demand for ‘at home entertainment’ driven by the crisis, the Nintendo Switch Lite is making a comeback, but only in some stores", "url": "https://micky.com.au/the-nintendo-switch-lite-made-a-comeback-but-only-in-select-stores/", "urlToImage": "https://micky.com.au/wp-content/uploads/2020/04/Nintendo-Switch-Lite-Yellow.jpg", "publishedAt": "2020-04-28T16:27:08Z", "content": "As more people are seeing themselves mandatorily cooped up at homes, many consumers have been willingly spending some cash for the Switch Lite. While some of these buyers are merely hoarders who turn a profit through reselling, others are buying especially fo… [+2686 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Jason Murdock", "title": "Google's AI Health Screening Tool Claimed 90 Percent Accuracy, but Failed to Deliver in Real World Tests - Newsweek", "description": "Google said its AI showed a \"specialist-level accuracy\" of more than 90 percent for the detection of referable cases of diabetic retinopathy (DR). In reality, it quickly faced unforeseen challenges.", "url": "https://www.newsweek.com/google-artificial-intelligence-deep-learning-health-research-thailand-clinics-diabetic-retinopathy-1500692", "urlToImage": "https://d.newsweek.com/en/full/1585333/google.jpg", "publishedAt": "2020-04-28T15:55:06Z", "content": "A team of Google researchers is going back to the drawing board after an artificial intelligence-based health care project fell short of expectations.\r\nIn an academic paper published this week, the team detailed how a deep learning tool that showed great prom… [+4880 chars]"}, {"source": {"id": null, "name": "Ladbible.com"}, "author": "Ewan Moore", "title": "'Cyberpunk 2077' Stunning 8K Gameplay Footage Is Worth Burning My PC For - LADbible", "description": "Spoiler: It's very pretty.", "url": "https://www.ladbible.com/technology/gaming-cyberpunk-2077-stunning-8k-gameplay-footage-20200428", "urlToImage": "https://images.ladbible.com/thumbnail?type=jpeg&url=http://beta.ems.ladbiblegroup.com/s3/content/7e78e0225ea8a663aa56a29a35a0d55e.png&quality=70&width=808", "publishedAt": "2020-04-28T15:33:11Z", "content": "We all know that Cyberpunk 2077 is a desperately pretty game. It's also no secret that that the upcoming sci-fi RPG will push the current-gen consoles to the max, and will be re-released for next-gen hardware a little later down the line (at no cost to early … [+2122 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Stephen Shankland", "title": "iPhone SE: With its A13 chip, this small, $399 phone outperforms all Androids - CNET", "description": "Performance on a budget arrives just in time for buyers spooked by the pandemic.", "url": "https://www.cnet.com/news/iphone-se-a13-chip-small-399-phone-outperforms-all-androids/", "urlToImage": "https://cnet2.cbsistatic.com/img/JqkN4Gbap_1EBtAqYlZ3_CX32zA=/756x567/2020/04/22/3790e6a3-6018-4bf4-9fc3-97ffba189d73/iphone-se-2020-18.jpg", "publishedAt": "2020-04-28T14:40:45Z", "content": "John Kim/CNET\r\nBy packing the big A13 chip into its small iPhone SE, Apple has made its budget smartphone a more compelling product at just the right time for a coronavirus-spooked world. Where most budget phones cut costs by using lower-end processors, the n… [+3579 chars]"}, {"source": {"id": null, "name": "Gamerturn.com"}, "author": "Jack Jaff", "title": "The return of Ninja to 'Fortnite' goes terribly wrong - FrontLine Gaming - Gamer Turn", "description": "In a while, Ninja hasn’t been too pleased with Fortnite, and after enjoying a Travis Scott concert at the in-game, his return goes horribly wrong. If there is one name more related to Fortnite than Fortnite itself, Tyler Blevins or more popularly known as Nin…", "url": "https://www.gamerturn.com/the-return-of-ninja-to-fortnite-goes-terribly-wrong/", "urlToImage": "https://www.gamerturn.com/wp-content/uploads/2020/04/Untitled-637.jpg", "publishedAt": "2020-04-28T13:45:55Z", "content": "In a while, Ninja hasn’t been too pleased with Fortnite, and after enjoying a Travis Scott concert at the in-game, his return goes horribly wrong.If there is one name more related to Fortnite than Fortnite itself, Tyler Blevins or more popularly known as Ninj… [+3003 chars]"}, {"source": {"id": null, "name": "Vooks.net"}, "author": "http://www.facebook.com/vooksdotnet", "title": "Deadly Premonition 2: A Blessing in Disguise arrives on July 10th - Vooks", "description": "50% off Deadly Premonition Origins to celebrate.", "url": "https://www.vooks.net/deadly-premonition-2-a-blessing-in-disguise-arrives-july-10th/", "urlToImage": "https://www.vooks.net/img/2020/04/deadly-premonition2.jpg", "publishedAt": "2020-04-28T13:36:16Z", "content": "Well, this is a nice surprise. Deadly Premonition 2: A Blessing in Disguise had its release date announced, it’ll be arriving on July 10th. It’s coming to the Nintendo eShop and physically to stores. Pricing is set at $50.00USD, or roughly $77AUD. If you’re y… [+1131 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "First Look: 2021 Toyota GR Supra RZ Horizon Blue Edition - Carscoops", "description": "For 2021 model year, Toyota has updated its GR Supra sports car with a series of upgrades, which in Japan, includes the launch of a new special limited editi...", "url": "https://www.youtube.com/watch?v=sAJkp5gvMwA", "urlToImage": "https://i.ytimg.com/vi/sAJkp5gvMwA/maxresdefault.jpg", "publishedAt": "2020-04-28T13:06:38Z", "content": "For 2021 model year, Toyota has updated its GR Supra sports car with a series of upgrades, which in Japan, includes the launch of a new special limited edition named Horizon Blue. Limited to 100 units, the Supra RZ Horizon Blue Edition features a special blue… [+671 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Billy Steele", "title": "Sonarworks brings its SoundID audio customization to Mac and Windows - Yahoo Lifestyle", "description": "With a mobile app, you create a personalized sound profile that fits your preferences based on a selection of audio clips.  Once you’ve made your picks, SoundID creates a custom profile that’s unique to you — right down the pattern of icons inside the app.  T…", "url": "https://au.lifestyle.yahoo.com/sonarworks-soundid-listen-personalized-audio-app-mac-pc-130040080.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/Ozy_x_wl2lGl0g2gZR_IGg--~B/aD05OTQ7dz0xNjAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2020-04/418e4380-88fc-11ea-af0f-11a675514f29", "publishedAt": "2020-04-28T13:00:00Z", "content": "Sonarworks first announced its SoundID software at CES. With a mobile app, you create a personalized sound profile that fits your preferences based on a selection of audio clips. Its an A/B test with multiple rounds using the same sample with different tuning… [+4972 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Jon Fingas", "title": "Hulu is choking for many iOS and Apple TV users - Yahoo Finance Australia", "description": "Hulu users, primarily on Apple devices, are experiencing frequent app crashes and streaming problems.", "url": "https://au.finance.yahoo.com/news/hulu-apple-device-outage-123805076.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/6gm70M2w7V0pPhl2LcLr9w--~B/aD00NDgwO3c9NjcyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2020-04/78ae5e60-894a-11ea-b6f7-da4f05f776e8", "publishedAt": "2020-04-28T12:38:00Z", "content": "It might not be a great moment to be a Hulu fan depending on the platform you use, at least. Users on Down Detector, Reddit and elsewhere are reporting problems with the service, many of them on Apple devices like iPhones, iPads and Apple TV. Many report the … [+779 chars]"}, {"source": {"id": null, "name": "Gamesradar.com"}, "author": "Benjamin Abbott", "title": "This cheap Xbox Game Pass deal saves you up to 50% - get Gears Tactics on PC for less - GamesRadar+ AU", "description": "Stuck at home? This bargain of a cheap Xbox Game Pass deal gets you the service at a huge discount", "url": "https://www.gamesradar.com/cheap-xbox-game-pass-deal-save-up-to-fifty-percent-and-get-gears-tactics/", "urlToImage": "https://cdn.mos.cms.futurecdn.net/kiMwMpiryYuECZ7RN5Fwu4-1200-80.jpg", "publishedAt": "2020-04-28T11:23:04Z", "content": "If you've not tried the service yet, there's a cheap Xbox Game Pass deal going at the moment you may want to consider. It's perfect if you're stuck indoors; this gaming equivalent of Netflix gives you access to approximately 200+ games to play, many of which … [+3414 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Srivatsa Ramesh", "title": "LG's Velvet smartphone was just unveiled a whole week before we expected it - TechRadar", "description": "Just couldn’t hold it in", "url": "https://www.techradar.com/news/lgs-velvet-smartphone-just-got-unveiled-a-whole-week-before-we-expected-it", "urlToImage": "https://cdn.mos.cms.futurecdn.net/jaTDar7ZEhmiojH7JhRZQo-1200-80.jpg", "publishedAt": "2020-04-28T10:52:00Z", "content": "The upcoming LG Velvet will be the companys next mid-range smartphone and is set to replace the flagship G series. The launch is just a week away, but LG has gone ahead early and revealed all the specs and a few pictures of the device.\r\nThe LG Velvet will be … [+2437 chars]"}, {"source": {"id": null, "name": "Notebookcheck.net"}, "author": "Ricci Rox", "title": "Huawei Mate 40 Pro touted to feature a \"freeform\" lens for improved ultra-wide-angle camera performance - Notebookcheck.net", "description": "Huawei uses a massive 1/1.54\" sensor on its ultra-wide-angle shooters, but has been unable to pair it with a lens that can provide an industry-competitive field of view. Things are expected to change with the upcoming Mate 40 Pro, however, as a new leak claim…", "url": "https://www.notebookcheck.net/Huawei-Mate-40-Pro-touted-to-feature-a-freeform-lens-for-improved-ultra-wide-angle-camera-performance.463052.0.html", "urlToImage": "https://www.notebookcheck.net/fileadmin/Notebooks/News/_nc3/mate_40_pro_uwa.jpg", "publishedAt": "2020-04-28T08:52:23Z", "content": "Huawei's mobile business has been stunted by the company's inability to use Google Services, but the company isn't looking to quit anytime soon. The Huawei P40 series was launched earlier this month, and a new leak has now given us our first look at Huawei's … [+1729 chars]"}, {"source": {"id": null, "name": "Hitc.com"}, "author": "Callum Smith", "title": "Is SnowRunner multiplayer with cross-platform play? What you must know! - HITC - Football, Gaming, Movies, TV, Music", "description": "Some gamers are wondering if there is multiplayer in the newly released SnowRunner with cross-platform play.", "url": "https://www.hitc.com/en-gb/2020/04/28/is-snowrunner-multiplayer-cross-platform-play/", "urlToImage": "https://cdn.hitc-s.com/i/1815/is_snowrunner_multiplayer_with_cross_platform_play_what_you_must_1544358.jpg", "publishedAt": "2020-04-28T08:10:56Z", "content": "Some gamers are wondering if there is multiplayer in the newly released SnowRunner with cross-platform play.\r\nSnowRunner has just launched on PlayStation 4, Xbox One, and the Epic Games store with some reviews describing it as an essential purchase. However, … [+2193 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "IANS", "title": "Microsoft Word considers two spaces in sentences as error - India TV News", "description": "Microsoft has started rolling out a change for Word that doesn't want you to add two spaces after a sentence.", "url": "https://www.indiatvnews.com/technology/news-microsoft-word-two-spaces-in-sentences-error-know-what-is-it-612048", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2020/04/microsoft-word-1588054834.jpg", "publishedAt": "2020-04-28T07:17:16Z", "content": "The change has started rolling out\r\n Some users may have already noticed that Microsoft Word has started flagging two spaces after a full stop as an error, settling the great space debate once and for all. First spotted by University of Denver law professor A… [+1261 chars]"}, {"source": {"id": null, "name": "Theaustralian.com.au"}, "author": null, "title": "Telstra’s double data offer may be hard to resist - The Australian", "description": "Subscribe to The Australian to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.theaustralian.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-04-28T04:48:00Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Africa goes hungry due to COVID-19 | Health crisis leading to food crisis | Coronavirus pandemic - WION", "description": "Africa is dealing with a health crisis to a food crisis now after the coronavirus has hit the country hard. Watch report. #Africa #CoronavirusAfrica #FoodCri...", "url": "https://www.youtube.com/watch?v=mZJhc3_A0hc", "urlToImage": "https://i.ytimg.com/vi/mZJhc3_A0hc/maxresdefault.jpg", "publishedAt": "2020-04-28T03:06:09Z", "content": null}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Luke Plunkett", "title": "Valorant Making Anti-Cheat Changes After Player Outcry - Kotaku Australia", "description": "Riot’s new shooter Valorant pissed a lot of people off recently with what was perceived as a heavy-handed approach to cheat protection. A new update to the game will make some of that easier for players to manage....", "url": "https://www.kotaku.com.au/2020/04/valorant-making-anti-cheat-changes-after-player-outcry/", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/ojj6uyrmuygs8dpofmkm.jpg", "publishedAt": "2020-04-28T03:00:00Z", "content": "Riots new shooter Valorant pissed a lot of people off recently with what was perceived as a heavy-handed approach to cheat protection. A new update to the game will make some of that easier for players to manage.\r\nIn a Reddit post that leads with While we nor… [+1491 chars]"}, {"source": {"id": null, "name": "Press-start.com.au"}, "author": "Shannon Grixti", "title": "WWE 2K Battlegrounds Is An Insane Arcade Wrestling Game Coming This Year - Press Start Australia", "description": "In lieu of no simulation WWE 2K game releasing this year, 2K has announced WWE 2K Battlegrounds which is a more action based wrestling game. The game features over-the-top superstar designs, crazy environments and much faster paced gameplay. It's developed by…", "url": "https://press-start.com.au/news/playstation/2020/04/28/wwe-2k-battlegrounds-is-an-insane-arcade-wrestling-game-coming-this-year/", "urlToImage": "https://cdn.pressstart.com.au/wp-content/uploads/2020/04/WWE-2K-Battlegrounds.jpg", "publishedAt": "2020-04-28T02:59:25Z", "content": "In lieu of no simulation WWE 2K game releasing this year, 2K has announced WWE 2K Battlegrounds which is a more action based wrestling game.\r\nThe game features over-the-top superstar designs, crazy environments and much faster paced gameplay. It’s developed b… [+1755 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Eddie Makuch", "title": "Xbox Series X: Phil Spencer Talks About Why He's So Excited For The Next-Gen Console - GameSpot", "description": "Microsoft's next-generation console is going to usher in a new era for gaming, Phil Spencer says.", "url": "https://www.gamespot.com/articles/xbox-series-x-phil-spencer-talks-about-why-hes-so-/1100-6476562/", "urlToImage": "https://gamespot1.cbsistatic.com/uploads/screen_kubrick/1179/11799911/3662958-screen%20shot%202020-04-28%20at%2012.15.05%20pm.png", "publishedAt": "2020-04-28T02:58:00Z", "content": "Microsoft's next-generation console, the Xbox Series X, is releasing later this year, and Xbox boss Phil Spencer believes it could offer significant change for gaming. He recently said on social media that the Xbox Series X could usher in a change to the way … [+2860 chars]"}, {"source": {"id": null, "name": "Macrumors.com"}, "author": "Juli Clover", "title": "Apple Expecting to Reopen 'Many More' Stores in May - MacRumors", "description": "Deidre O'Brien, Apple's vice president of retail and people, today told Apple employees that \"many more\" Apple Stores are set to...", "url": "https://www.macrumors.com/2020/04/27/apple-reopening-many-more-stores-in-may/", "urlToImage": "https://images.macrumors.com/article-new/2020/03/applestorepaloalto.jpg", "publishedAt": "2020-04-28T02:03:27Z", "content": "Deidre O'Brien, Apple's vice president of retail and people, today told Apple employees that \"many more\" Apple Stores are set to start reopening in May.\r\nO'Brien made the comments during a weekly video update shared with staff, according to Bloomberg. \"We are… [+1519 chars]"}, {"source": {"id": null, "name": "Kotaku.com"}, "author": "Luke Plunkett", "title": "Wildfire, a game I first wrote about back in 2015, is finally almost done, and is looking very, very - Kotaku", "description": "Wildfire, a game I first wrote about back in 2015, is finally almost done, and is looking very, very cool, combining 2D action with stealth and some interesting environmental controls. It’s out on PC next month.", "url": "https://kotaku.com/wildfire-a-game-i-first-wrote-about-back-in-2015-is-f-1843118570", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/yl5el1z5pa3o8tw2wyt0.jpg", "publishedAt": "2020-04-28T01:43:49Z", "content": "Wildfire, a game I first wrote about back in 2015, is finally almost done, and is looking very, very cool, combining 2D action with stealth and some interesting environmental controls. Its out on PC next month."}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Alex Walker", "title": "A Cyberpunk 2077 Gameplay Briefing Has Leaked - Kotaku Australia", "description": "Only a day after some of the biggest Last of Us 2 story beats leaked online, CD Projekt Red's tentpole adventure has a leak of its own....", "url": "https://www.kotaku.com.au/2020/04/a-cyberpunk-2077-gameplay-briefing-has-leaked/", "urlToImage": "https://edge.alluremedia.com.au/m/k/2020/02/cyberpunk-2077-grimes-1.jpg", "publishedAt": "2020-04-27T23:25:00Z", "content": "Only a day after some of the biggest Last of Us 2 story beats leaked online, CD Projekt Red's tentpole adventure has a leak of its own.\r\nAround 25 minutes of poorly framed footage is available online across three videos on YouTube and social media. The videos… [+1931 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Heather Alexandra", "title": "Majora's Mask Still Hits Hard 20 Years Later - Kotaku Australia", "description": "The Legend of the Zelda: Majora’s Mask is 20 years old. It’s been the dawn of the final day for two decades, and looking back after all this time reveals one of the most interesting games of its time. It’s creative use of limited assets led to an experience d…", "url": "https://www.kotaku.com.au/2020/04/majoras-mask-still-hits-hard-20-years-later/", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/aeor9hbrc27rw59wtuxx.jpg", "publishedAt": "2020-04-27T23:00:00Z", "content": "The Legend of the Zelda: Majoras Mask is 20 years old. Its been the dawn of the final day for two decades, and looking back after all this time reveals one of the most interesting games of its time. Its creative use of limited assets led to an experience dren… [+6863 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Darren Allan", "title": "Surface Neo and Duo brain scan experiments suggest two screens really are better than one - Techradar Australia", "description": "More areas of the brain are active, according to Microsoft, and productivity is boosted", "url": "https://www.techradar.com/news/surface-neo-and-duo-brain-scan-experiments-suggest-two-screens-really-are-better-than-one", "urlToImage": "https://cdn.mos.cms.futurecdn.net/dPPcKLBbSRFPYdykwgjfrK-1200-80.jpg", "publishedAt": "2020-04-27T21:56:19Z", "content": "Microsoft has been conducting some in-depth testing on its Surface Neo and Duo dual-screen devices, showing that these pieces of hardware should help users be more productive which has always been the aim of including a second screen, of course.\r\nAs MSPowerus… [+2592 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Chloi Rad", "title": "Animal Crossing PSA: You Should Be Catching Tarantulas This Week - GameSpot", "description": "This week is your last chance to catch tarantulas before they go out of season in May, so act fast!", "url": "https://www.gamespot.com/articles/animal-crossing-psa-you-should-be-catching-tarantu/1100-6476537/", "urlToImage": "https://gamespot1.cbsistatic.com/uploads/screen_kubrick/1594/15949828/3662302-tarantulas.jpg", "publishedAt": "2020-04-27T20:50:00Z", "content": "If you have a Northern Hemisphere island in Animal Crossing: New Horizons, this week is your last chance to catch tarantulas before they go out of season in May. The last day to catch tarantulas will be Thursday, April 30.\r\nFor many players, the eight-legged … [+2661 chars]"}, {"source": {"id": null, "name": "Lifehacker.com.au"}, "author": "Brendan Hesse", "title": "If You Have Google's New Pixel Buds 2, You'll Want This App - Lifehacker Australia", "description": "The second-generation Pixel Buds are finally here. While most will still have to wait for their order to show up from Google’s online store—since, y’know, most physical stores are currently shut down—you can prepare for them by downloading the just-launched P…", "url": "https://www.lifehacker.com.au/2020/04/if-you-have-googles-new-pixel-buds-2-youll-want-this-app/", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/byz2uldndyrvl27qqxs3.jpg", "publishedAt": "2020-04-27T20:45:00Z", "content": "The second-generation Pixel Buds are finally here. While most will still have to wait for their order to show up from Googles online storesince, yknow, most physical stores are currently shut downyou can prepare for them by downloading the just-launched Pixel… [+1382 chars]"}, {"source": {"id": null, "name": "Techspot.com"}, "author": "Cohen Coberly", "title": "You can grab Total War: Shogun 2 for free until May 1 - TechSpot", "description": "That's right: if you download the game on Steam between today (April 27) and May 1, it'll be yours forever -- or, at least until the day Steam shuts down, which is hopefully a long way off. Total War: Shogun&hellip;", "url": "https://www.techspot.com/news/85004-you-can-grab-total-war-shogun-2-free.html", "urlToImage": "https://static.techspot.com/images2/news/bigimage/2020/04/2020-04-27-image-16.jpg", "publishedAt": "2020-04-27T20:31:00Z", "content": "Freebies: Everyone loves free stuff, and that's something Sega understands quite well, if the company's latest promotional stunt is anything to go by. Starting today, the fantastic feudal Japan-themed strategy title Total War: Shogun 2 will be completely free… [+1389 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Christine Fisher", "title": "UK’s NHS won’t use Apple-Google approach to COVID-19 tracking - Yahoo Finance Australia", "description": "The NHS is opting for a \"centralized\" approach to contact tracing, opposed to the \"decentralized\" Apple-Google model.", "url": "https://au.finance.yahoo.com/news/uk-nhs-contact-tracing-coronavirus-centralized-201253811.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/_qomCwLlgHLelSaznmW5cg--~B/aD00MDAwO3c9NzI1MjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2020-04/ec76ae40-7da8-11ea-b7e3-d048045a9753", "publishedAt": "2020-04-27T20:12:00Z", "content": "Apple and Google are expected to release their contact tracing technology to developers tomorrow. But the UKs National Health Service (NHS) says it wont use the Apple-Google model, BBC reports. While the two tech companies are working on a decentralized appro… [+1390 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Zedd Unleashes Stunning Concert On Twitch, Streams VALORANT Afterwards - TheGamer", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiQ2h0dHBzOi8vd3d3LnRoZWdhbWVyLmNvbS96ZWRkLXR3aXRjaC1jb25jZXJ0LWZpcnN0LXN0cmVhbS12YWxvcmFudC_SAUdodHRwczovL3d3dy50aGVnYW1lci5jb20vemVkZC10d2l0Y2gtY29uY2VydC1maXJzdC1zdHJlYW0tdmFsb3JhbnQvYW1wLw?oc=5", "urlToImage": null, "publishedAt": "2020-04-27T18:43:05Z", "content": null}, {"source": {"id": null, "name": "Pcmag.com"}, "author": "Michael Kan", "title": "Microsoft Teams Patches Flaw to Stop GIF-Based Attacks - PCMag AU", "description": "Researchers at CyberArk used an internet meme to steal user data from people using Microsoft Teams, including messages sent over the platform. Redmond has since patched the bug.", "url": "https://au.pcmag.com/encryption/66556/microsoft-teams-patches-flaw-to-stop-gif-based-attacks", "urlToImage": "https://sm.pcmag.com/t/pcmag_au/news/m/microsoft-/microsoft-teams-patches-flaw-to-stop-gif-based-attacks_sgfg.1200.jpg", "publishedAt": "2020-04-27T18:33:00Z", "content": "Security researchers have uncovered a flaw in Microsoft Teams that enabled them to steal messages from user accounts by sending a malicious GIF image. \r\nSecurity firm CyberArk demonstrated the attack in a video released Monday. Its researchers used the intern… [+2441 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "", "title": "Overwatch League tries to galvanize interest with a May Madness tournament - Engadget", "description": "Teams will battle in two regional tournaments for prize money and bonus wins towards their season records.", "url": "https://www.engadget.com/overwatch-league-tournament-format-151645121.html", "urlToImage": "https://o.aolcdn.com/images/dims?resize=1200%2C630&crop=1200%2C630%2C0%2C0&quality=80&image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-images%2F2020-04%2F1538e910-8894-11ea-b9ff-f592ebb5a088&client=amp-blogside-v2&signature=d043e7c8a8d2b9bfe6fcff18d48d4564a16ea329", "publishedAt": "2020-04-27T16:29:42Z", "content": "So far in 2020, teams have been playing for their season records. Games over the first three weekends of May will still count towards overall win-loss records. Actual tournament matches won’t, but the top four squads in each region will earn bonus wins toward… [+1569 chars]"}, {"source": {"id": null, "name": "Ladbible.com"}, "author": "Sarah James", "title": "New 'Minecraft' Map Teaches Players The Importance Of Social Distancing - LADbible", "description": "It's a free download for the Java Edition.", "url": "https://www.ladbible.com/technology/gaming-minecraft-map-teaches-players-the-importance-of-social-distancing-20200427", "urlToImage": "https://images.ladbible.com/thumbnail?type=jpeg&url=http://beta.ems.ladbiblegroup.com/s3/content/21f0b1d35ea629830c7faf1a150e1780.png&quality=70&width=808", "publishedAt": "2020-04-27T16:12:26Z", "content": "Social distancing is a concept that I'm sure most of us never imagined we'd have to employ. And as each of us attempts to deal with the restrictions placed on our daily lives, if you're not directly affected by the consequences of COVID-19 it can be difficult… [+2538 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Was Doom 2016 Better Than Doom Eternal? | Slightly Civil War - The Escapist", "description": "Watch next week's episode of Slightly Civil War, \"Should The Epic Games Store Exclusives Be Boycotted?\" early at the link - https://www.escapistmagazine.com/...", "url": "https://www.youtube.com/watch?v=837MzCtMXNY", "urlToImage": "https://i.ytimg.com/vi/837MzCtMXNY/maxresdefault.jpg", "publishedAt": "2020-04-27T16:00:07Z", "content": "Watch next week's episode of Slightly Civil War, \"Should The Epic Games Store Exclusives Be Boycotted?\" early at the link - https://www.escapistmagazine.com/v2/b...\r\nThis week on Slightly Civil War, Yahtzee and Jack debate whether or not Doom 2016 was a bette… [+636 chars]"}, {"source": {"id": null, "name": "Chromeunboxed.com"}, "author": "Gabriel Brangers", "title": "As Facebook takes aim, Zoom bolsters security and adds a killer feature - Chrome Unboxed", "description": "Necessity is the mother of invention. Well, maybe not an invention in this case but the battle for best video conferencing platform is heating up and companies like Google and Facebook are doing their best to put some pressure on the now-giant that is Zoom. G…", "url": "https://chromeunboxed.com/as-facebook-takes-aim-zoom-bolsters-security-and-adds-a-killer-feature/", "urlToImage": "https://chromeunboxed.com/wp-content/uploads/2020/04/fbmessengerrooms.jpg", "publishedAt": "2020-04-27T15:49:12Z", "content": "Necessity is the mother of invention. Well, maybe not an invention in this case but the battle for best video conferencing platform is heating up and companies like Google and Facebook are doing their best to put some pressure on the now-giant that is Zoom. G… [+8592 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Moving Out | REVIEW - GamesRadar", "description": "Written by- Ellen Causey Voice Over- Ellen Causey Moving Out is a fun and frenetic new co op game from SMG Studios. Here's what we thought when we became the...", "url": "https://www.youtube.com/watch?v=TzsQe_giU3w", "urlToImage": "https://i.ytimg.com/vi/TzsQe_giU3w/maxresdefault.jpg", "publishedAt": "2020-04-27T13:10:42Z", "content": "Written by- Ellen CauseyVoice Over- Ellen Causey\r\nMoving Out is a fun and frenetic new co op game from SMG Studios. Here's what we thought when we became the newest members of the Smooth Moves moving company!"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "How 'Contact Tracing' Tracks COVID-19 - VOA News", "description": "After weeks and months of shutting businesses and schools, communities in the United States and around the world are talking about what it will take to open ...", "url": "https://www.youtube.com/watch?v=cnsMz7vIU2s", "urlToImage": "https://i.ytimg.com/vi/cnsMz7vIU2s/maxresdefault.jpg", "publishedAt": "2020-04-27T12:16:28Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The Apple Watch saved my life... - CNET", "description": "Kacie was trapped in her car after a near fatal wreck, Toralv fell and hit his head in the middle of the night, Jason was dangerously close to having a heart...", "url": "https://www.youtube.com/watch?v=jvmqqh1xIs4", "urlToImage": "https://i.ytimg.com/vi/jvmqqh1xIs4/maxresdefault.jpg", "publishedAt": "2020-04-27T12:00:23Z", "content": null}, {"source": {"id": null, "name": "Nine.com.au"}, "author": "Peter Conte", "title": "High profile Aussies share messages of support as term two kicks off for students in NSW - 9Honey", "description": "", "url": "https://honey.nine.com.au/latest/aussie-celebs-support-messages-teacherrock-twitter/3496980d-6cf1-4dfe-abb5-f620ae33edf3", "urlToImage": "https://imageresizer.static9.net.au/v97SH-9ijf5_g4ca1YFv19LOaCY=/1200x628/smart/https%3A%2F%2Fprod.static9.net.au%2Ffs%2F07924ed7-8c65-436e-8504-b19fc16d7cd6", "publishedAt": "2020-04-27T06:54:12Z", "content": "Australian celebrities have taken to social media to share messages of support for teachers, with #TeachersRock trending on Twitter as Term 2 kicks off in NSW.\r\nThe wave of appreciation comes as teachers face the difficult task of educating thousands of stude… [+1187 chars]"}, {"source": {"id": null, "name": "Techguide.com.au"}, "author": "Stephen Fenech", "title": "Stan's partnership with TV brand Hisense is right on the button - Tech Guide", "description": "Australian streaming service Stan has extended its partnership with popular TV brand  Hisense to create a dedicated button on the remote controls for the latest Hisense 2020 screens.The agreement will see the Stan app pre-loaded on the Hisense TVs an", "url": "https://www.techguide.com.au/news/televisions-news/stans-partnership-tv-brand-hisense-right-button/", "urlToImage": "https://www.techguide.com.au/wp-content/uploads/2020/04/HisenseStan1.jpeg", "publishedAt": "2020-04-27T05:54:51Z", "content": "Australian streaming service Stan has extended its partnership with popular TV brand  Hisense to create a dedicated button on the remote controls for the latest Hisense 2020 screens.\r\nThe agreement will see the Stan app pre-loaded on the Hisense TVs and give … [+1786 chars]"}, {"source": {"id": null, "name": "9to5google.com"}, "author": null, "title": "Google Play Store bug prompting repeat Android app updates - 9to5Google", "description": "A bug this evening sees the Google Play Store prompt users to repeat Android app updates they already have installed on their devices...", "url": "https://9to5google.com/2020/04/26/google-play-repeat-updates/", "urlToImage": "https://9to5google.com/wp-content/uploads/sites/4/2020/03/google-play-store.jpg?quality=82&strip=all", "publishedAt": "2020-04-27T05:42:43Z", "content": "An odd bug this evening sees the Google Play Store prompt users to re-download Android app updates that they already have installed on their devices.\r\nThose visiting the “My apps &amp; games” section of the Play Store on Sunday evening/early Monday morning mi… [+1496 chars]"}, {"source": {"id": null, "name": "9news.com.au"}, "author": "Mark Saunokonoko", "title": "What airport travel in a post-pandemic world will be like - 9News", "description": "<p>Your travel history and health records are set to dictate how quickly – or slowly - you&#x27;ll be processed at airports when international borders re-open.</p>", "url": "https://www.9news.com.au/national/what-airport-travel-security-will-be-like-after-coronavirus-pandemic-ends-international-borders-open/42e22c6d-1bb8-4045-9884-73b7d69be864", "urlToImage": "https://imageresizer.static9.net.au/6vlo4d9cI39fNSytNW9ZdrC3uY8=/1200x628/smart/https%3A%2F%2Fprod.static9.net.au%2Ffs%2F67358e3d-eb3e-4494-8f5d-f393581310b6", "publishedAt": "2020-04-27T02:57:38Z", "content": "Property News:  How MasterChef's Melissa Leong is coping with social distancing - domain.com.au"}]}