{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Smh.com.au"}, "author": "Trent Zimmerman and Mike Freelander", "title": "How to save lives through the app store: a bipartisan plea to citizens - Brisbane Times", "description": "A Liberal and Labor MP join forces to ask Australians to download the coronavirus tracing app launched on Sunday.", "url": "https://www.smh.com.au/national/how-to-save-lives-through-the-app-store-a-bipartisan-plea-to-citizens-20200424-p54mu9.html", "urlToImage": null, "publishedAt": "2020-04-26T02:08:00Z", "content": "It must be stressed that the app will not track the location of users at all. It will record who you have come into contact with for periods of longer than 15 minutes, but not where.\r\nWithout the assistance of technology, contact tracing relies on people bein… [+2682 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": null, "title": "Huawei AppGallery: Can it replace the Google Play Store? - Micky News", "description": "With Huawei's P40 and P40 Pro only sporting Huawei Media Suite, can the Huawei AppGallery replace the Google Play Store?", "url": "https://micky.com.au/huawei-app-gallery-can-it-replace-the-google-play-store/", "urlToImage": null, "publishedAt": "2020-04-26T00:48:34Z", "content": "The departure of the Google Play Store on Huawei devices started when the U.S. imposed a trade ban on the Chinese OEM. This means that Huawei may run the Android software, but the Google Media Suite is not allowed.\r\nGmail, YouTube, Google Photos, and many mor… [+4628 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "James Weir", "title": "James Weir: Celebrity fails we can learn from during coronavirus isolation - NEWS.com.au", "description": "James Weir: Celebrity fails we can learn from during coronavirus isolation", "url": "https://www.news.com.au/entertainment/celebrity-life/celebrity-selfies/james-weir-celebrity-fails-we-can-learn-from-during-coronavirus-isolation/news-story/0209bb77e78d95eb48dbb3d3ac51b58b", "urlToImage": null, "publishedAt": "2020-04-25T20:31:17Z", "content": "What kind of a world do we live in where we can’t even trust our favourite rappers to deliver accurate, up-to-the-second analysis of a global health pandemic?\r\nIt’s so hard to know who to trust these days.\r\nA new study has found celebrities like rapper Wiz Kh… [+3598 chars]"}, {"source": {"id": null, "name": "Gsmarena.com"}, "author": "George", "title": "iPhone SE works with iPhone 8's camera swapped in, new teardown shows - GSMArena.com news - GSMArena.com", "description": "Good news if you happen to break your SE's cam on the bathroom counter and conveniently have an 8 lying around?", "url": "https://www.gsmarena.com/iphone_se_works_with_iphone_8s_camera_swapped_in_new_teardown_shows-news-42874.php", "urlToImage": null, "publishedAt": "2020-04-25T19:50:01Z", "content": "The iPhone SE of 2020 is a resurrected iPhone 8, that's self-evident. But what are the implications of that fact in terms of reusing the old model for spare parts? We had one teardown of the SE from yesterday, but a new one we have here is helpful in a differ… [+1557 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Stephen Shankland", "title": "iPhone SE outclasses all Android phones thanks to Apple's A13 chip - CNET", "description": "Performance on a budget arrives just in time for buyers spooked by the pandemic.", "url": "https://www.cnet.com/news/iphone-se-outclasses-all-android-phones-thanks-to-apples-a13-chip-processor/", "urlToImage": null, "publishedAt": "2020-04-25T19:18:55Z", "content": "John Kim/CNET\r\nBy packing the big A13 chip into its small iPhone SE, Apple has made its budget smartphone a more compelling product at just the right time for a coronavirus-spooked world. Where most budget phones cut costs by using lower-end processors, the n… [+3579 chars]"}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "Riot Games' Closed Beta Game Valorant Comes Competitive Mode - Somag News", "description": "The new FPS game Valorant from Riot Games, which is currently in closed beta, adds competitive mode for players to face opponents at their own level. The new mod will be added with the 0.49 update. The FPS game Valorant, released by Riot Games, the developer …", "url": "https://www.somagnews.com/riot-games-closed-beta-game-valorant-comes-competitive-mode/", "urlToImage": null, "publishedAt": "2020-04-25T19:05:00Z", "content": "The new FPS game Valorant from Riot Games, which is currently in closed beta, adds competitive mode for players to face opponents at their own level. The new mod will be added with the 0.49 update.\r\nThe FPS game Valorant, released by Riot Games, the developer… [+2067 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Zack Zwiezen", "title": "New GTA Online Missions Are All About Preparing For A Recession - Kotaku Australia", "description": "Grand Theft Auto Online received a new update a few days ago that added six new missions. These missions are all about an old-time GTA Online character, Gerald, and his attempts to get ready for an upcoming recession. Five of them are good and one of them is …", "url": "https://www.kotaku.com.au/2020/04/new-gta-online-missions-are-all-about-preparing-for-a-recession/", "urlToImage": null, "publishedAt": "2020-04-25T18:00:00Z", "content": "Grand Theft Auto Online received a new update a few days ago that added six new missions. These missions are all about an old-time GTA Online character, Gerald, and his attempts to get ready for an upcoming recession. Five of them are good and one of them is … [+2803 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Alessandro Barbosa", "title": "No Man's Sky Will Get Even More Ambitious In 2020 - GameSpot", "description": "With large additions over the last five months, Hello Games is teasing even more content for No Man's Sky this year.", "url": "https://www.gamespot.com/articles/no-mans-sky-will-get-even-more-ambitious-in-2020/1100-6476421/", "urlToImage": null, "publishedAt": "2020-04-25T17:02:00Z", "content": "No Man's Sky has been receiving numerous free content updates over the past few months, adding features like living ships, colossal exo mechs, and even a full audio creation suite to the space-explorer.\r\nDeveloper Hello Games is continuing to tinker with its … [+1395 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Kevin Knezevic", "title": "Smash Bros. Ultimate's Latest Event Is A Trials Of Mana Crossover - GameSpot", "description": "Three new Spirits from Square Enix's Trials of Mana remake are making their debut in the Switch fighting game.", "url": "https://www.gamespot.com/articles/smash-bros-ultimates-latest-event-is-a-trials-of-m/1100-6476364/", "urlToImage": null, "publishedAt": "2020-04-25T16:43:00Z", "content": "Nintendo has kicked off another five-day Spirit Board event in Super Smash Bros. Ultimate. The Spirits of Mana event is now live and introduces a handful of new Spirits from another third-party title: Square Enix's new Trials of Mana remake.\r\nThroughout the e… [+1472 chars]"}, {"source": {"id": null, "name": "Motor1.com"}, "author": "Chris Okula", "title": "This Cayman GT4 Video Could Easily Be A Porsche Ad - Motor1 ", "description": "These are the ads we want to see.", "url": "https://www.motor1.com/news/414779/porsche-cayman-gt4-drive-commercial/", "urlToImage": null, "publishedAt": "2020-04-25T16:27:10Z", "content": "The Porsche Cayman GT4 was an earth-shattering machine when it first debuted in 2016. Here we have the familiar mid-engined Cayman sports car but with an engine from the 911 Carrera S and a GT badge usually reserved for Porches top of the line 911s. The Cayma… [+1584 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Matthew Forde", "title": "Sony slip-ups: ahead of the PS5, we look back at the PlayStation tech that just didn't work - TechRadar India", "description": "They can't all be winners", "url": "https://www.techradar.com/news/sony-slip-ups-ahead-of-the-ps5-we-look-back-at-the-playstation-tech-that-just-didnt-work", "urlToImage": null, "publishedAt": "2020-04-25T16:00:00Z", "content": "As we motor towards the next generation of consoles, Sony currently holds all of the cards and will be looking to build upon the monumental success it found during the current generation. Its sometimes easy to forget just how well the PlayStation 4 has sold, … [+6393 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Jon Fingas", "title": "WhatsApp claims spyware firm launched attacks with US servers - Yahoo Finance Australia", "description": "WhatsApp has accused NSO Group of launching its surveillance attacks from US servers despite claims to the contrary.", "url": "https://au.finance.yahoo.com/news/whatsapp-says-nso-group-launched-attacks-from-us-155827515.html", "urlToImage": null, "publishedAt": "2020-04-25T15:58:00Z", "content": "Facebook just escalated its lawsuit over surveillance firm NSO Groups WhatsApp call exploit attacks. The WhatsApp team has filed accusations that NSO relied on US-based servers to stage its spyware attacks using Pegasus software. NSO reportedly used the Los A… [+1227 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Mariella Moon", "title": "Former Apple designer drops Watch trivia on its fifth anniversary - Yahoo Finance Australia", "description": "Imran Chaudhri, Apple’s design lead for hardware from 1995 to 2016, dropped some details about Apple Watch’s history on its fifth anniversary.  While Chaudhri is no longer with the tech giant, he shared a photo of the Watch team on launch day, as well as a re…", "url": "https://au.finance.yahoo.com/news/former-apple-designer-drops-watch-trivia-on-its-fifth-anniversary-144849444.html", "urlToImage": null, "publishedAt": "2020-04-25T14:48:00Z", "content": "Imran Chaudhri, Apples design lead for hardware from 1995 to 2016, dropped some details about Apple Watchs history on its fifth anniversary. While Chaudhri is no longer with the tech giant, he shared a photo of the Watch team on launch day, as well as a repro… [+1881 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "David Nield", "title": "This iOS text code can crash your iPhone - here’s how you can fix it - TechRadar", "description": "It seems protection is coming from Apple too", "url": "https://www.techradar.com/news/watch-out-for-this-text-code-that-can-crash-your-iphone", "urlToImage": null, "publishedAt": "2020-04-25T14:30:00Z", "content": "There's a text message doing the rounds that can crash iPhones or disable the touchscreen, though Apple already seems to be working on a fix the beta version of iOS 13.4.5 appears to add extra protection against the rogue message.\r\nThe damaging string of text… [+1630 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "BARDOWN PLAYS PARTY GAMES: SUPER SMASH BROS. ULTIMATE - TSN", "description": "Prior to quarantine, Marissa, Jesse, Eric and Teddy put up their dukes in Super Smash Bros. Ultimate for the Nintendo Switch. Would Jesse's N64 abilities tra...", "url": "https://www.youtube.com/watch?v=utkNuTUD1Js", "urlToImage": null, "publishedAt": "2020-04-25T13:55:43Z", "content": null}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Dave Thier", "title": "‘Pokémon GO’: Here’s A Promo Code For Some Free PokéBalls And Berries. - Forbes", "description": "It's community day, and you need Pokéballs. Here's a 'Pokémon GO' promo code for some free great balls and razzberries.", "url": "https://www.forbes.com/sites/davidthier/2020/04/25/pokmon-go-heres-a-promo-code-for-some-free-pokballs-and-berries/", "urlToImage": null, "publishedAt": "2020-04-25T12:36:06Z", "content": "pokemon GO\r\nCredit: Niantic\r\nIts a weird one, today. Pokémon GO is running an extra-long Community Day with some crucial additions today, trying to re-orient an event all about getting outside and hanging out with people to one thats all about staying inside … [+1807 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Simon Parkin", "title": "Streets of Rage 4 review – the return of the beat 'em up - The Guardian", "description": "This lovingly created sequel offers all the action and fun of a 90s arcade game", "url": "https://www.theguardian.com/games/2020/apr/25/streets-of-rage-4-review-the-return-of-the-beat-em-up", "urlToImage": null, "publishedAt": "2020-04-25T12:04:06Z", "content": "In the Netflix animated series Hi Score Girl, a romantic comedy set in early-90s Japan, Haruo Yaguchi, a low-achieving high-school loner is whiling away his time in the local video game arcades when he meets Akira Ono, a popular wunderkind from a wealthy fami… [+4209 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Lynn La", "title": "iPhone SE vs. iPhone 8 comparison: Which $400 iPhone should you get? - CNET", "description": "Some retailers are still selling the iPhone 8 despite Apple discontinuing the device. But you should just get the new iPhone SE instead.", "url": "https://www.cnet.com/news/iphone-se-vs-iphone-8-spec-comparison-which-400-iphone-should-you-get/", "urlToImage": null, "publishedAt": "2020-04-25T11:28:26Z", "content": "In a bid to lure budget-minded iPhone fans, Apple debuted its new iPhone SE for 2020 on April 15 for $399 (£419, AU$749). It's a sequel to its 2016 iPhone of the same name. The new iPhone SE's specs are similar to the iPhone 8 from three years ago, which is l… [+8211 chars]"}, {"source": {"id": null, "name": "Digitalinformationworld.com"}, "author": "Arooj Ahmed", "title": "Facebook Is Temporarily Shelving Its Plans To Include Ads In Its WhatsApp Messaging Service As Mark Zuckerberg Feared Backlash - Digital Information World", "description": "WhatsApp will not be displaying ads for the time being as Mark Zuckerberg feared backlash from its users.", "url": "https://www.digitalinformationworld.com/2020/04/facebook-temporarily-shelving-ads-launch-in-whatsapp-mark-zuckerberg-feared-backlash.html", "urlToImage": null, "publishedAt": "2020-04-25T11:16:14Z", "content": "<ul><li>WhatsApp was supposed to start displaying ads at the start of the year 2020.</li><li>The company was working on a plan for more than a year to shove ads into the WhatsApp messaging service to generate revenue every year.</li><li>WhatsApp will not be d… [+2877 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": null, "title": "Xbox Series X News: Spencer hints next-gen games launching in May - Micky News", "description": "Phil Spencer may have hinted at an upcoming next-gen games launching event for the Xbox Series X on Twitter", "url": "https://micky.com.au/xbox-series-x-news-next-gen-games-launch-coming-in-may/", "urlToImage": null, "publishedAt": "2020-04-25T10:32:00Z", "content": "Microsoft has not kept Xbox fans in the dark when it comes to the upcoming next-generation console, Xbox Series X. In fact, almost everything is known about the console except for its appearance, price, and launch date. \r\nEver since Microsoft had revealed its… [+2817 chars]"}, {"source": {"id": null, "name": "Slashgear.com"}, "author": "Vincent Nguyen", "title": "5 things I already want from Apple’s Magic Keyboard 2 for iPad Pro - SlashGear", "description": "It’s been several days and a whole lot of typing since Apple’s Magic Keyboard for iPad Pro landed on my doorstep, and I’m already thinking about version 2. How can Apple make a great keyboard…", "url": "https://www.slashgear.com/5-things-i-already-want-from-apples-magic-keyboard-2-for-ipad-pro-25618196/", "urlToImage": null, "publishedAt": "2020-04-25T09:53:06Z", "content": "Its been several days and a whole lot of typing since Apple’s Magic Keyboard for iPad Pro landed on my doorstep, and Im already thinking about version 2. How can Apple make a great keyboard and trackpad even greater? Well, short of buying Brydge and building … [+7866 chars]"}, {"source": {"id": null, "name": "Optocrypto.com"}, "author": "David", "title": "PowerColor prepared a compact video card Radeon RX 5600 XT ITX - Optocrypto", "description": "PowerColor has prepared a new version of the Radeon RX 5600 XT graphics card, which is primarily designed for compact gaming systems. The novelty is called simple - the Radeon RX 5600 XT ITX, and is distinguished by small dimensions that allow it to be instal…", "url": "https://optocrypto.com/powercolor-prepared-a-compact-video-card-radeon-rx-5600-xt-itx/", "urlToImage": null, "publishedAt": "2020-04-25T09:52:00Z", "content": "PowerColor has prepared a new version of the Radeon RX 5600 XT graphics card, which is primarily designed for compact gaming systems. The novelty is called simple – the Radeon RX 5600 XT ITX, and is distinguished by small dimensions that allow it to be instal… [+1348 chars]"}, {"source": {"id": null, "name": "Gamerturn.com"}, "author": "Jack Jaff", "title": "‘Overwatch’ update on PTR adds changes to communications wheel - Gamer Turn", "description": "Although it’s already a couple of years old, Blizzard’s hit multiplayer shooter can still use some upgrades from time to time. As promised, the next Overwatch update will revamp the communication wheel – which has been requested by fans for a long time. Last …", "url": "https://www.gamerturn.com/overwatch-update-on-ptr-adds-changes-to-communications-wheel/", "urlToImage": null, "publishedAt": "2020-04-25T09:38:24Z", "content": "Although its already a couple of years old, Blizzards hit multiplayer shooter can still use some upgrades from time to time. As promised, the next Overwatch update will revamp the communication wheel which has been requested by fans for a long time.Last week,… [+2205 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": null, "title": "Big tech companies play crucial role during COVID-19 pandemic - Micky News", "description": "As the world races against the clock to find the cure against COVID-19, big tech companies are also stepping up to their role.", "url": "https://micky.com.au/big-tech-companies-play-crucial-role-during-covid-19-pandemic/", "urlToImage": null, "publishedAt": "2020-04-25T08:44:17Z", "content": "Before the widespread threat of the COVID-19 virus, big tech companies are among the most vilified industries. They are criticized over allegations of unethical data harvesting and tracking users.\r\nRecently, these very same critics are tapping the massive com… [+2510 chars]"}, {"source": {"id": null, "name": "Channelnews.com.au"}, "author": "David Richards", "title": "Was CES 2020 A Super Spreader For COVID-19 After Tens Of Thousands Of Chinese Poured Into The US Event From Wuhan & Hubei Provence. - ChannelNews", "description": null, "url": "https://www.channelnews.com.au/was-ces-2020-a-super-spreader-for-covid-19-after-tens-of-thousands-of-chinese-poured-into-the-us-event-from-wuhan-provence/", "urlToImage": null, "publishedAt": "2020-04-25T08:20:12Z", "content": "One third of CES the world’s biggest Consumer Electronics Show in Las Vegas is Chinese exhibitors and at the 2020 show. tens of thousands of Chinese visitors poured into the event which is now being investigated as a hot spot that helped propel COVID-19 in th… [+3655 chars]"}, {"source": {"id": null, "name": "Notebookcheck.net"}, "author": "Daniel R Deakin", "title": "AMD Ryzen 3 3300X starts cementing its position as a budget CPU champion by beating the Intel Core i3-10300 in Time Spy benchmark - Notebookcheck.net", "description": "An AMD Ryzen 3 3300X and an Intel Core i3-10300 have been spotted in a comparison on 3DMark’s Time Spy benchmark. In another blow for Team Blue, it appears that the new budget Matisse chip from AMD has the edge on the upcoming Comet Lake processor. The Ryzen …", "url": "https://www.notebookcheck.net/AMD-Ryzen-3-3300X-starts-cementing-its-position-as-a-budget-CPU-champion-by-beating-the-Intel-Core-i3-10300-in-Time-Spy-benchmark.462912.0.html", "urlToImage": null, "publishedAt": "2020-04-25T08:03:15Z", "content": "We already had some first benchmark results for both the AMD Ryzen 3 3300X and the Ryzen 3 3100, where both of the recently announced processors managed to thoroughly challenge Intels aging Kaby Lake Core i7-7700K desktop processor. However, it seems the Ryze… [+1184 chars]"}, {"source": {"id": null, "name": "Stevivor.com"}, "author": "http://www.facebook.com/SWrightAU", "title": "Nintendo Network IDs hacked, logins suspended - Stevivor", "description": "Reports that Nintendo Network IDs have been hacked have popped up this weekend, leading Nintendo to disable login via the system.", "url": "https://stevivor.com/news/nintendo-network-ids-hacked-logins-suspended/", "urlToImage": null, "publishedAt": "2020-04-25T06:19:17Z", "content": "Reports that Nintendo Network IDs have been hacked have popped up this weekend, leading Nintendo to disable login via the system.\r\n“We are aware of reports of unauthorized access to some Nintendo Accounts and we are investigating the situation,” a Nintendo re… [+639 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Dion Dassanayake", "title": "Windows 10 update could DELETE your files and bricks PCs in fresh blow to Microsoft users - Express", "description": "WINDOWS 10 users have been dealt yet another download blow, with a new Microsoft update capable of deleting user files and bricking your PC.", "url": "https://www.express.co.uk/life-style/science-technology/1273596/Windows-10-update-deletes-files-bricks-PCs-Microsoft", "urlToImage": null, "publishedAt": "2020-04-25T06:06:53Z", "content": "And another posted: \"My system automatically updated on the 19th of April. I lost some important word files of my university. And a folder.\r\n\"I have looked on the temporary folders and I have tried to uninstall the update but they do not appear\".\r\nWindows Lat… [+612 chars]"}, {"source": {"id": null, "name": "Pickr.com.au"}, "author": "Leigh :) Stark", "title": "Hisense looks to size, quality for 4K TVs in 2020 - Pickr", "description": "Democratising TV technology and making tellies affordable for all, Hisense is cleaning the range in 2020 and pulling back to two, with the choice down to size.", "url": "https://www.pickr.com.au/news/2020/hisense-looks-to-size-quality-for-4k-tvs-in-2020/", "urlToImage": null, "publishedAt": "2020-04-25T05:53:35Z", "content": "Democratising TV technology and making tellies affordable for all, Hisense is cleaning the range in 2020 and pulling back to two, with the choice down to size. \r\nIt’s not just Samsung and LG showing off their latest TVs, because it’s TV changeover season, whi… [+4671 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Oscar Gonzalez", "title": "Travis Scott event in Fortnite: How to watch the encore and find the Giant Astro Heads - CNET", "description": "The rapper dropped new tracks in a jaw-dropping concert. Catch the next show at midnight.", "url": "https://www.cnet.com/news/travis-scott-event-in-fortnite-how-to-watch-the-encore-and-find-the-giant-astro-heads/", "urlToImage": null, "publishedAt": "2020-04-25T01:02:37Z", "content": "Play some Fortnite and listen to a new track from Travis Scott.\r\nEpic Games\r\nFortnite events aren't only for players to check out new content from developer Epic Games. The popular battle royale game has also played host to multiple premieres and collaboratio… [+3718 chars]"}, {"source": {"id": null, "name": "Ubergizmo.com"}, "author": "Tyler Lee", "title": "Samsung’s Smartwatches Get A New Blood Pressure Monitoring App - Ubergizmo", "description": "Our smartwatches are getting better at what they do, where they can monitor more than just our daily activities like our steps taken, calories burnt, and so on. For example, the Apple Watch comes with an ECG monitoring tool that can alert the wearer if there …", "url": "https://www.ubergizmo.com/2020/04/samsung-smartwatch-blood-pressure-monitor/", "urlToImage": null, "publishedAt": "2020-04-25T00:42:49Z", "content": "Our smartwatches are getting better at what they do, where they can monitor more than just our daily activities like our steps taken, calories burnt, and so on. For example, the Apple Watch comes with an ECG monitoring tool that can alert the wearer if there … [+1254 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Alinity Accidentally Flashes Twitch But Can't Delete The Evidence (NSFW) - TheGamer", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiP2h0dHBzOi8vd3d3LnRoZWdhbWVyLmNvbS9hbGluaXR5LXR3aXRjaC1mbGFzaC1jbGlwLWJyZWFzdC1uc2Z3L9IBQ2h0dHBzOi8vd3d3LnRoZWdhbWVyLmNvbS9hbGluaXR5LXR3aXRjaC1mbGFzaC1jbGlwLWJyZWFzdC1uc2Z3L2FtcC8?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T00:37:21Z", "content": null}, {"source": {"id": null, "name": "Micky.com.au"}, "author": "www.facebook.com/christian.n.puno", "title": "Apple will release a new Mac laptop away from Intel - Micky News", "description": "Apple will release a new Mac laptop next year with its processors away from intel, giving users better performance.", "url": "https://micky.com.au/apple-will-release-a-new-mac-laptop-away-from-intel/", "urlToImage": null, "publishedAt": "2020-04-24T23:47:00Z", "content": "It is no doubt that Apple products usually cost high, but users often report it has excellent performance. Apple will release its new Mac laptop next year, according to Bloomberg. It is also said to have more improvements included.\r\nWhat is With the New Mac L… [+3233 chars]"}, {"source": {"id": null, "name": "Ausdroid.net"}, "author": null, "title": "Google bringing “Live Captions” to phone calls - Ausdroid", "description": "When new features are added to Android they aren’t just added all at once. The developers usually add the code bit by bit and luckily for us we have some extremely clever folks over at XDA Developers who trawl through the code of newly released files to find …", "url": "https://ausdroid.net/2020/04/25/google-bringing-live-captions-to-phone-calls/", "urlToImage": null, "publishedAt": "2020-04-24T23:35:05Z", "content": "When new features are added to Android they aren’t just added all at once. The developers usually add the code bit by bit and luckily for us we have some extremely clever folks over at XDA Developers who trawl through the code of newly released files to find … [+2603 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": null, "title": "‘Monster Hunter World: Iceborne’ gets update 13.5, including two new monsters - Micky News", "description": "The version 13.5 update just arrived for Monster Hunter World: Iceborne brings in improvements, added crafts, and introduces two new monsters", "url": "https://micky.com.au/monster-hunter-world-iceborne-gets-update-13-5-including-two-new-monsters/", "urlToImage": null, "publishedAt": "2020-04-24T22:57:00Z", "content": "The rolled out update is available to both the PC and console versions of the game.\r\nThe version 13.5 update just arrived for Monster Hunter World: Iceborne that brings in improvements, added crafts, and introduces two new monsters for players to slay. The ro… [+3165 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": "www.facebook.com/christian.n.puno", "title": "Ford Mustang Cobra Jet 1400: Time for electric cars to take the limelight - Micky News", "description": "Time for electric cars to take limelight, Ford mechanics and scientists took this further. The result? 'Ford Mustang Cobra Jet 1400'", "url": "https://micky.com.au/ford-mustang-cobra-jet-1400-time-for-electric-cars-to-take-the-limelight/", "urlToImage": null, "publishedAt": "2020-04-24T22:43:00Z", "content": "The Ford Mustang Cobra Jet 1400 isnt a typical electric car. This cars creation coincided with drag racing in mind. Imagine how much electrical power it needs to go on such high speed. According to its creators, this monster car can reach a fourth of a mile w… [+2234 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Logitech G G203 LIGHTSYNC Promo Video - Techaeris", "description": "This is an overview of the new Logitech G G203 LIGHTSYNC Gaming Mouse. The video was provided by Logitech for resharing. Available in May buy here: https://w...", "url": "https://www.youtube.com/watch?v=i3_Ale_138I", "urlToImage": null, "publishedAt": "2020-04-24T21:57:36Z", "content": null}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "James O'Connor", "title": "Animal Crossing Update 1.2.0 Patch Notes: Look For Redd And Leif In Latest Update - GameSpot", "description": "The new Animal Crossing update adds new vendors, and makes a few other tweaks in the Nintendo Switch game.", "url": "https://www.gamespot.com/articles/animal-crossing-update-120-patch-notes-redd-and-le/1100-6476401/", "urlToImage": null, "publishedAt": "2020-04-24T20:11:00Z", "content": "The new Animal Crossing: New Horizons update, which brings the game up to version 1.2.0, is live now. It's a big one--it expands the museum and brings new vendors to your island. If 1.2.0 does not automatically download, you can search for a software update f… [+1903 chars]"}, {"source": {"id": null, "name": "Caradvice.com.au"}, "author": "Justin Narayan", "title": "Ford Mustang crowned the most successful sports car of 2019 - CarAdvice", "description": "America just wasn’t enough for the original pony car. The Ford Mustang has officially gone global. Last year saw the Mustang rise to the top of the sports car world, with recognition from fans from...", "url": "https://www.caradvice.com.au/845186/ford-mustang-crowned-the-most-successful-sports-car-of-2019/", "urlToImage": null, "publishedAt": "2020-04-24T20:05:00Z", "content": "More than 100,000 Mustangs were sold globally last year. Even though sales have waned in Australia, it remains one of Ford's most popular models.\r\nAmerica just wasn’t enough for the original pony car. The Ford Mustang has officially gone global.\r\nLast year sa… [+1907 chars]"}, {"source": {"id": null, "name": "Businessinsider.com.au"}, "author": "Mary Meisenzahl", "title": "Facebook's new video chat Zoom competitor is coming soon — here's how the new feature works - Business Insider Australia", "description": "Facebook CEO Mark Zuckerberg announced on Friday the company is introducing 50-person video chatrooms.", "url": "https://www.businessinsider.com.au/facebook-messenger-rooms-video-chat-zoom-walkthrough-like-zoom-2020-4", "urlToImage": null, "publishedAt": "2020-04-24T19:44:33Z", "content": "<ul><li>Facebook just announced 50-person video chatrooms called Messenger Rooms.</li><li>\r\nThe new Messenger Rooms have some features in common with other video calling apps, like Zoom and Houseparty.\r\n</li><li>\r\nThe company says Messenger Rooms will be comi… [+3605 chars]"}, {"source": {"id": null, "name": "Lifehacker.com.au"}, "author": "David Murphy", "title": "Are You Charging Your MacBook On The Wrong Side? - Lifehacker Australia", "description": "Yes, you read that headline correctly. There is apparently a “right” way and a “wrong” way to connect devices to a MacBook with Thunderbolt/USB-C ports on both sides. Doing it wrong can affect your computer’s performance....", "url": "https://www.lifehacker.com.au/2020/04/are-you-charging-your-macbook-on-the-wrong-side/", "urlToImage": null, "publishedAt": "2020-04-24T19:30:00Z", "content": "Yes, you read that headline correctly. There is apparently a right way and a wrong way to connect devices to a MacBook with Thunderbolt/USB-C ports on both sides. Doing it wrong can affect your computers performance.\r\nI recently encountered this knowledge on … [+3969 chars]"}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "Microsoft Begins Showing Edge Ads in Outlook.com - Somag News", "description": "US technology giant Microsoft has begun to run ads with download links on the email service Outlook.com for its new Chromium-based Microsoft Edge browser, which it launched earlier this year. Edge recently managed to be the second most popular internet browse…", "url": "https://www.somagnews.com/microsoft-begins-showing-edge-ads-outlook-com/", "urlToImage": null, "publishedAt": "2020-04-24T19:22:00Z", "content": "US technology giant Microsoft has begun to run ads with download links on the email service Outlook.com for its new Chromium-based Microsoft Edge browser, which it launched earlier this year. Edge recently managed to be the second most popular internet browse… [+1516 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Ian Walker", "title": "Final Fantasy VII Remake Made Me Climb 59 Flights Of Stairs And I Loved It - Kotaku Australia", "description": "I recently arrived at Shinra headquarters in my playthrough of Final Fantasy VII Remake. After Cloud and his squad fight their way through the parking garage, they enter the spacious reception area to find the place deserted. Our heroes have two ways to reach…", "url": "https://www.kotaku.com.au/2020/04/final-fantasy-vii-remake-made-me-climb-59-flights-of-stairs-and-i-loved-it/", "urlToImage": null, "publishedAt": "2020-04-24T19:00:00Z", "content": "I recently arrived at Shinra headquarters in my playthrough of Final Fantasy VII Remake. After Cloud and his squad fight their way through the parking garage, they enter the spacious reception area to find the place deserted. Our heroes have two ways to reach… [+3078 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Valve Source Code LEAKED - Hot off the Press Start #34 - GameFront", "description": "Support us on Patreon! - https://www.patreon.com/gamefront - James is back once more with the latest gaming news, including more bad news for GeForce Now, ju...", "url": "https://www.youtube.com/watch?v=D37UfGQ1x1o", "urlToImage": null, "publishedAt": "2020-04-24T18:47:41Z", "content": "Support us on Patreon! - https://www.patreon.com/gamefront - James is back once more with the latest gaming news, including more bad news for GeForce Now, justice for Warzone cheaters, and the source code for Team Fortress 2 and CS:GO leaking online.\r\n#GeForc… [+287 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Megan Rose Dickey", "title": "Instacart has a problem with third-party apps letting shoppers pay for early access to orders - Yahoo Lifestyle", "description": "Kara Carmichael has been an Instacart  shopper for years in Orlando, Fla. It's how she's been able to support her family, she told TechCrunch.  Despite the high demand for Instacart  amid the COVID-19 pandemic, shoppers like Carmichael are facing difficulties…", "url": "https://au.lifestyle.yahoo.com/instacart-problem-third-party-apps-183935608.html", "urlToImage": null, "publishedAt": "2020-04-24T18:39:00Z", "content": "Kara Carmichael has been an Instacart shopper for years in Orlando, Fla. It's how she's been able to support her family, she told TechCrunch. But she says she has noticed an increase in third-party bot activity that has made shopping \"nearly impossible.\"\r\nDes… [+5149 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Virtual party of 50! Check out Facebook's new interactive video chat - Good Morning America", "description": "Facebook announced its launch of \"Messenger Rooms\" to help people stay connected.", "url": "https://www.youtube.com/watch?v=mUInzJ3k-G0", "urlToImage": null, "publishedAt": "2020-04-24T18:22:35Z", "content": null}, {"source": {"id": null, "name": "Pcmag.com"}, "author": null, "title": "Marshall Uxbridge Voice - Review 2020 - PCMag AU", "description": "The Marshall Uxbridge Voice speaker delivers respectable audio performance and hands-free Alexa voice control in a stylish package.", "url": "https://au.pcmag.com/speakers/66530/marshall-uxbridge-voice", "urlToImage": null, "publishedAt": "2020-04-24T18:06:00Z", "content": "Marshalls latest smart speaker, the $199.99 Uxbridge Voice, is its smallest and least expensive  yet. The audio performance is quite good considering the speaker's size, with rich bass depth balanced by crisp highs. And the sound signature is fairly malleable… [+7189 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Carly Page", "title": "The Dell XPS 15 2020 may have been redesigned to take on the MacBook Pro - TechRadar", "description": "Incoming model will boast smaller bezels and upward-firing speakers", "url": "https://www.techradar.com/news/the-dell-xps-15-2020-may-have-been-redesigned-to-take-on-the-macbook-pro", "urlToImage": null, "publishedAt": "2020-04-24T17:31:00Z", "content": "Dell looks poised to release an all-new version of its XPS 15 laptop that will take a number of design clues from the recently-revamped Dell XPS 13\r\n.\r\nThats according to leaked images posted on the Korea Energy Agency Efficiency Standardization Certification… [+2119 chars]"}, {"source": {"id": null, "name": "Trueachievements.com"}, "author": "Heidi Nicholas", "title": "Sci-fi adventure Deliver Us The Moon joins Xbox Game Pass and Game Pass for PC today - TrueAchievements", "description": "Deliver Us The Moon is a sci-fi action adventure title which draws inspiration from movies such as Interstellar, and which joins the Xbox Game Pass and Xbox Game Pass for PC services today as a day one addition.", "url": "https://www.trueachievements.com/n41593/deliver-us-the-moon", "urlToImage": null, "publishedAt": "2020-04-24T17:19:36Z", "content": "The Xbox team has been busy lately: just yesterday, they surprise-dropped the announcement that Red Dead Redemption 2 will join Xbox Game Pass in May. Before that, they announced new titles for Xbox Game Pass, along with several new titles for Xbox Game Pass … [+1728 chars]"}, {"source": {"id": null, "name": "Lifehacker.com.au"}, "author": "Brendan Hesse", "title": "Don't Let Microsoft Word Judge You For Using Two Spaces Between Sentences - Lifehacker Australia", "description": "Microsoft has taken an official stance on one of the internet’s most divisive questions, firmly coming down on the side of minimalism in the “one-space versus two-spaces after a sentence” debate. Word’s automatic spelling and grammar checker will now flag any…", "url": "https://www.lifehacker.com.au/2020/04/dont-let-microsoft-word-judge-you-for-using-two-spaces-between-sentences/", "urlToImage": null, "publishedAt": "2020-04-24T17:15:00Z", "content": "Microsoft has taken an official stance on one of the internets most divisive questions, firmly coming down on the side of minimalism in the one-space versus two-spaces after a sentence debate. Words automatic spelling and grammar checker will now flag anythin… [+1903 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Leah Williams", "title": "The Good, The Bad, And The Annoying Of Borderlands 3's \"Revenge Of The Cartels\" Event - Kotaku Australia", "description": "It’s been less than a month since Borderlands 3’s latest big expansion landed with a bang, but vault hunters already have access to another brand-new playground in which they can fire 87 bazillion guns. It’s called Villa Ultraviolet. It’s drenched in neon and…", "url": "https://www.kotaku.com.au/2020/04/the-good-the-bad-and-the-annoying-of-borderlands-3s-revenge-of-the-cartels-event/", "urlToImage": null, "publishedAt": "2020-04-24T17:00:00Z", "content": "Its been less than a month since Borderlands 3s latest big expansion landed with a bang, but vault hunters already have access to another brand-new playground in which they can fire 87 bazillion guns. Its called Villa Ultraviolet. Its drenched in neon and gau… [+4795 chars]"}, {"source": {"id": null, "name": "Notebookcheck.net"}, "author": "Alex Alderson", "title": "Huawei FreeBuds 3i: Apple AirPods Pro clones that come with 24 dB(A) ANC and Quick Pairing - Notebookcheck.net", "description": "Huawei has ditched the design of the FreeBuds 3, according to leaked renders of new TWS earbuds published by WinFuture. Featuring a white design, silicone tips, ANC and a compact charging case, the FreeBuds 3i will likely be pitched as AirPods Pro competitors.", "url": "https://www.notebookcheck.net/Huawei-FreeBuds-3i-Apple-AirPods-Pro-clones-that-come-with-24-dB-A-ANC-and-Quick-Pairing.462687.0.html", "urlToImage": null, "publishedAt": "2020-04-24T16:45:46Z", "content": "Huawei has developed a new set of TWS earbuds, the FreeBuds 3i. Brought to our attention by WinFuture via Caschys Blog, the new set of TWS earbuds resemble a cross between the FreeBuds 3 and the original FreeBuds. The FreeBuds 3i look somewhat like the Apple … [+792 chars]"}, {"source": {"id": null, "name": "Motorsport.com"}, "author": "Josh Suttill", "title": "MotoGP 20 review: Early release gamble pays off - Motorsport.com, Edition: Australia", "description": "MotoGP 20 marks Milestone’s most ambitious instalment in the franchise so far, with an April release date, a revamped career mode and the reintroduction of historic bikes.", "url": "https://au.motorsport.com/gaming/news/game-review-motogp-20/4784174/", "urlToImage": null, "publishedAt": "2020-04-24T15:21:34Z", "content": "This unprecedented early release date just days after the fourth round of the real-life MotoGP season was supposed to take place prior to its cancellation immediately raised concerns over the quality of the title.\r\nFortunately for fans, Milestones boldness ha… [+4420 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "iPhone SE review, Canon EOS R5 new specs and Surface Pro 8 rumors | Noise Cancelling Podcast 008 - TechRadar", "description": "More tech news and painfully honest reviews from Gareth and Sherri as they’re joined by two new voices: Kimberly Gedeon of Laptop Mag and TechRadar Cameras e...", "url": "https://www.youtube.com/watch?v=bPYeSWVgSXw", "urlToImage": null, "publishedAt": "2020-04-24T15:00:19Z", "content": "More tech news and painfully honest reviews from Gareth and Sherri as theyre joined by two new voices: Kimberly Gedeon of Laptop Mag and TechRadar Cameras editor, Mark Wilson. \r\nTOPIC TIMESTAMPS03:52 - Canon EOS R508:36 - PS5 Robot Friends12:46 - Surface Pro … [+992 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Future Games Show Announcement Trailer - Coming June 2020 - GamesRadar", "description": "See the most exciting console, mobile and streaming games of 2020 in one show with a mixture of exclusives, deep dives and developer interviews. Coming June ...", "url": "https://www.youtube.com/watch?v=DbLFsALqD_0", "urlToImage": null, "publishedAt": "2020-04-24T15:00:12Z", "content": "See the most exciting console, mobile and streaming games of 2020 in one show with a mixture of exclusives, deep dives and developer interviews. Coming June 2020.Subscribe to Gamesradar: http://goo.gl/cnjsn1"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Christine Fisher", "title": "Telegram promises secure group video calls sometime this year - Yahoo Finance Australia", "description": "Telegram says it will add secure group video calls in 2020.", "url": "https://au.finance.yahoo.com/news/telegram-secure-group-video-calls-142035892.html", "urlToImage": null, "publishedAt": "2020-04-24T14:20:00Z", "content": "Now that the coronavirus pandemic has made video calls increasingly popular and critical, services like Zoom, Google Meet, WhatsApp and Telegram are vying for attention. Telegram seems to think it can get ahead by focusing on security. Today, the messaging ap… [+1329 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Ethan Gach", "title": "Fallout 76 Devs Want To Add Pets To The Game - Kotaku Australia", "description": "The dream of having a pet Deathclaw to cuddle with only cold Appalachia nights could soon be a reaility....", "url": "https://www.kotaku.com.au/2020/04/fallout-76-devs-want-to-add-pets-to-the-game/", "urlToImage": null, "publishedAt": "2020-04-24T14:00:00Z", "content": "The dream of having a pet Deathclaw to cuddle with only cold Appalachia nights could soon be a reaility.\r\nFallout 76's developers did an AMA on Reddit yesterday addressing all sorts of questions about the game and its future. While some things like expanded c… [+882 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "India TV Tech Desk", "title": "Huawei MatePad with Kirin 810 launched: Price, specifications and more - India TV News", "description": "The all-new Huawei MatePad is basically a toned-down version of the MatePad Pro 5G, whcih was launched back in November 2019.", "url": "https://www.indiatvnews.com/technology/news-huawei-matepad-launched-price-specifications-610927", "urlToImage": null, "publishedAt": "2020-04-24T13:03:37Z", "content": "Huawei MediaPad comes with a massive 7,250mAh battery.\r\nHuawei has announced the launch of yet another Android-based tablet in China. The all-new Huawei MatePad is basically a toned-down version of the MatePad Pro 5G, whcih was launched back in November 2019.… [+1552 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Darren Allan", "title": "Nvidia’s reportedly ordering 5nm chips for a ‘mystery’ product - TechRadar", "description": "As it ups orders on 7nm, hopefully indicating RTX 3000 GPUs are still on track", "url": "https://www.techradar.com/news/nvidias-reportedly-ordering-5nm-chips-for-a-mystery-product", "urlToImage": null, "publishedAt": "2020-04-24T12:54:00Z", "content": "Nvidia is making something using a 5nm process, according to the rumor mill, although its anyones guess what that hardware could be.\r\nThis comes from a DigiTimes report about how chipmaker TSMC is benefiting from a ramp-up in orders from Nvidia and AMD, and a… [+1260 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "XCOM: Chimera Squad Gameplay - WccftechTV", "description": "Review: https://wccftech.com/review/xcom-chimera-squad-successful-experiment/ XCOM: Chimera Squad is out now on PC via Steam. ►www.facebook.com/wccftech ►www...", "url": "https://www.youtube.com/watch?v=9YUdyq4yGoE", "urlToImage": null, "publishedAt": "2020-04-24T11:10:55Z", "content": null}, {"source": {"id": null, "name": "Daywebchronicle.com"}, "author": null, "title": "Google Meet Introduces New Features For Its Video-Conferencing After Duo - Day Web Chronicle", "description": "Four more requested features have been launched in Google Meet, days following Google Duo had...", "url": "https://daywebchronicle.com/2020/04/24/google-meet-introduces-new-features-for-its-video-conferencing-after-duo/", "urlToImage": null, "publishedAt": "2020-04-24T10:04:50Z", "content": "Four more requested features have been launched in Google Meet, days following Google Duo had rolled out its new features, said Google in a blog post. Smita Hashim, Product Management Director, mentioned in the blog post that these new features are utilizing … [+1351 chars]"}, {"source": {"id": null, "name": "Happygamer.com"}, "author": "Joshua Goodpastor", "title": "SoundSelf: A Technodelic Is A Unique Soundbased VR Experience Now Availiable For Both PC And Mac VR Systems - Happy Gamer", "description": "Andromeda Entertainment has announced a unique video game experience in an immersive VR world. SoundSelf: A Technodelic is a unique and entrancing...", "url": "https://happygamer.com/soundself-a-technodelic-is-a-unique-soundbased-vr-experience-now-availiable-for-both-pc-and-mac-vr-systems-63644/", "urlToImage": null, "publishedAt": "2020-04-24T09:42:12Z", "content": "Andromeda Entertainment has announced a unique video game experience in an immersive VR world. SoundSelf: A Technodelic is a unique and entrancing experience that takes players on a meditative journey. The game is controlled using your own voice as you hum an… [+2237 chars]"}, {"source": {"id": null, "name": "Who.com.au"}, "author": null, "title": "Brendon Fevola slammed for promoting gambling game - Who", "description": "Brendan Fevola and love island star Dom Thomas has been heavily criticised for promoting an online poker machine game.", "url": "https://www.who.com.au/brendon-fevola-slammed-for-promoting-gambling-game", "urlToImage": null, "publishedAt": "2020-04-24T06:17:00Z", "content": "Reforemed gambler Brendan Fevola has been slammed for promoting a slot machine app.\r\n'This awful game being promoted by Dom Thomas and Brendan Fevola is a gateway to gambling addiction and a very real concern with so many of us staying at home during the COVI… [+740 chars]"}, {"source": {"id": null, "name": "Thebrag.com"}, "author": "Adam Guetti", "title": "Staying home? Here’s 10 new games perfect for iso life - The Brag", "description": "Food, Pop Culture, Art and Gaming", "url": "https://thebrag.com/ten-new-video-games-perfect-for-iso-life/", "urlToImage": null, "publishedAt": "2020-04-24T06:01:17Z", "content": "We get it, theres only so much Tiger King you can watch while working from home. So why not try games instead? Here are ten of the most recent releases thatll have you happy to be home, including Animal Crossing, DOOM and more.\r\n1. Animal Crossing: New Horizo… [+7557 chars]"}, {"source": {"id": null, "name": "Dailymercury.com.au"}, "author": "Grant Edwards", "title": "BMW returns to the original performance flavour - Daily Mercury", "description": "After a diversion from the native recipe, BMW has rediscovered its performance mojo with the 3 Series.", "url": "https://www.dailymercury.com.au/news/bmw-returns-to-the-original-performance-flavour/4002041/", "urlToImage": null, "publishedAt": "2020-04-24T05:28:00Z", "content": "Once BMWs bread and butter, the 3 Series of the new millennium had a tendency to be bland.\r\nGood to drive, yes. Hard to fault, absolutely. But there was little to inspire or excite.\r\nThe compact sedan was lost in a sea of SUVs and swoopy-backed offshoots.\r\nGl… [+4988 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": null, "title": "The Music of Resident Evil 3: A remake of sight and sound - ABC News", "description": "Indulge in a little nostalgia as Game Show features music from new revitalisations of video games from the 90s and early 2000s.", "url": "https://www.abc.net.au/classic/programs/game-show/resident-evil-3/12162076", "urlToImage": null, "publishedAt": "2020-04-24T05:00:00Z", "content": "The 1990s featured many games still beloved and celebrated today for their compelling stories, memorable gameplay, and incredible soundtracks. \r\nSome are remembered for how they pushed against the hardware limitations of the time, while others turned those li… [+1436 chars]"}, {"source": {"id": null, "name": "Thedriven.io"}, "author": "Bridie Schmidt", "title": "Musk delivers on promise to cut Premium Connectivity pricing in Australia - The Driven", "description": "Musk comes good on promise to fix pricing for Premium Connectivity subscriptions in Australia, dropping it 41% down to $10 a month.", "url": "https://thedriven.io/2020/04/24/musk-delivers-on-promise-to-cut-premium-connectivity-pricing-in-australia/", "urlToImage": null, "publishedAt": "2020-04-24T03:54:42Z", "content": "Tesla CEO and co-founder Elon Musk has kept his promise to cut the pricing for Premium Connectivity subscriptions in Australia, dropping it 41% to $10 a month.\r\nAs The Driven reported on Monday, Australian Tesla owners expressed gripes over the Tesla’s Premiu… [+3816 chars]"}, {"source": {"id": null, "name": "Gadgetguy.com.au"}, "author": null, "title": "Review: Malwarebytes Privacy – a new paid VPN provider - GadgetGuy", "description": "Malwarebytes Privacy is a new VPN (virtual private network) from the same company that has one of, if not the best malware detection and removal solutions Malwarebytes Privacy", "url": "https://www.gadgetguy.com.au/product/malwarebytes-privacy-a-new-paid-vpn-provider/", "urlToImage": null, "publishedAt": "2020-04-24T03:46:22Z", "content": "Malwarebytes Privacy a new paid VPN provider\r\nMalwarebytes Privacy is a new VPN (virtual private network) from the same company that has one of, if not the best malware detection and removal solutions on the planet.\r\nWhile I trust Norton Lifelock, McAfee and … [+2950 chars]"}, {"source": {"id": null, "name": "Happygamer.com"}, "author": "Jeremy Green", "title": "Call Of Duty: Modern Warfare’s Multiplayer Will Be Completely Free This Weekend In Warzone - Happy Gamer", "description": "Call of Duty: Modern Warfare has been a massive achievement for Infinity Ward. It furthered the long-running series in a positive direction that --...", "url": "https://happygamer.com/call-of-duty-modern-warfares-multiplayer-will-be-completely-free-this-weekend-in-warzone-63592/", "urlToImage": null, "publishedAt": "2020-04-24T02:29:12Z", "content": "Call of Duty: Modern Warfare has been a massive achievement for Infinity Ward. It furthered the long-running series in a positive direction that — for the most part — many FPS fans have loved. There are many aspects to rave about in this first-person shooter,… [+2145 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Rebekah Scanlan", "title": "Activewear: Australian sportswear sales booming during coronavirus pandemic - NEWS.com.au", "description": "Australian activewear sales boom during coronavirus lockdown", "url": "https://www.news.com.au/lifestyle/fitness/aussie-makes-150k-in-seven-minutes-off-new-isolation-musthave/news-story/764ecc100b4c25fb218aff38a227eeeb", "urlToImage": null, "publishedAt": "2020-04-24T01:14:07Z", "content": "While coronavirus has had a catastrophic effect on many businesses, the sudden change to everyday life has meant Aussies are spending their cash in unexpected places. Just ask Matilda Murray, who co-owns fitness apparel brand STAX with Don Robertson.\r\nShe sai… [+3914 chars]"}]}