{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "9to5google.com"}, "author": null, "title": "This week’s top stories: Huawei caught falsifying photos, Google Store refresh, ‘Hey Google’ sensitivity, more - 9to5Google", "description": "Top Stories: Huawei caught claiming DSLR photos were taken on a smartphone, Google Store sees a refresh highlighting Google's hardware brands, and more.", "url": "https://9to5google.com/2020/04/25/top-stories-huawei-falsifying-photos-google-store-refresh/", "urlToImage": null, "publishedAt": "2020-04-25T14:01:43Z", "content": "In this week’s top stories: Huawei was caught claiming DSLR photos were taken on a smartphone, the Google Store sees a refresh highlighting Google’s hardware brands, adjustable “Hey Google” sensitivity outlined, and more.\r\nFiled under bizarre controversy this… [+3260 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Is OnePlus 8 Worth Rs. 7000 More Than OnePlus 7T? - Gadgets 360", "description": "OnePlus 8 vs OnePlus 7T specs reveal an interesting story. While the OnePlus 8 is a lot more expensive than the OnePlus 7T, the improvements don't appear to ...", "url": "https://www.youtube.com/watch?v=otmS9y10glA", "urlToImage": null, "publishedAt": "2020-04-25T13:31:28Z", "content": null}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Tech Desk", "title": "WhatsApp: These are the top new features you should know about - The Indian Express", "description": "Here is a list of all the new WhatsApp features that have been added recently.", "url": "https://indianexpress.com/article/technology/social/whatsapp-new-features-6378983/", "urlToImage": null, "publishedAt": "2020-04-25T13:25:49Z", "content": "By: Tech Desk | New Delhi | \r\nUpdated: April 25, 2020 6:50:22 pm\r\nRecently added WhatsApp features that you should know about.WhatsApp is one of the most popular messaging services on the planet with over 2 billion worldwide users. The Facebook-owned platform… [+2585 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Vanessa Hand Orellana", "title": "2 Apple Watch features that earned the smartwatch a permanent spot on my wrist - CNET", "description": "I started out a skeptic, but the Apple Watch eventually won me over. Here's what it took for me to take it seriously as a fitness tracker and smartwatch.", "url": "https://www.cnet.com/news/apple-watch-features-that-earned-smartwatch-permanent-spot-on-my-wrist/", "urlToImage": null, "publishedAt": "2020-04-25T12:52:25Z", "content": "Angela Lang/CNET\r\nI haven't always been a fan of the Apple Watch. I bought one as soon as it went on sale in 2015 hoping it would blow me away, but it ended up spending more time in my drawer than on my wrist. It took three more years and the addition of two … [+8182 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "11 Beginners Tips And Tricks XCOM: Chimera Squad Doesn't Tell You - GamingBolt", "description": "Out of nowhere, with little to no fanfare, we have another XCOM game on our hands, and though it might not quite be XCOM 3, Chimera Squad is still pretty dar...", "url": "https://www.youtube.com/watch?v=UHX-Ueq-YUs", "urlToImage": null, "publishedAt": "2020-04-25T12:45:00Z", "content": "Out of nowhere, with little to no fanfare, we have another XCOM game on our hands, and though it might not quite be XCOM 3, Chimera Squad is still pretty darn good. It also represents a pretty big shift for the series, introducing several interesting major ne… [+535 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": null, "title": "Apple iPhone 12 might support 5G, official release pushed to December - Micky News", "description": "Rumors around the tech community claim that the Apple iPhone 12 might support 5G, and that its release date was delayed until December.", "url": "https://micky.com.au/apple-iphone-12-might-support-5g-official-release-pushed-to-december/", "urlToImage": null, "publishedAt": "2020-04-25T12:10:25Z", "content": "Apple has released a new version of its flagship device every year. Despite the spread of the COVID-19 virus, it would appear that Apple will push through with its original schedule.\r\nThe Apple iPhone is usually released every September of the year. However, … [+2513 chars]"}, {"source": {"id": null, "name": "Betanews.com"}, "author": null, "title": "Microsoft is bombarding Chrome-using Outlook.com visitors with ads for Edge - BetaNews", "description": "Microsoft is no stranger to hitting its customers with ads for its products and services, and it seems that the company is so keen that people make the switch to the new Chromium-based version of Edge that it is now bombarding Outlook.com users with banner ad…", "url": "https://betanews.com/2020/04/25/microsoft-edge-ads-chrome-outlook/", "urlToImage": null, "publishedAt": "2020-04-25T12:07:30Z", "content": "Microsoft is no stranger to hitting its customers with ads for its products and services, and it seems that the company is so keen that people make the switch to the new Chromium-based version of Edge that it is now bombarding Outlook.com users with banner ad… [+1100 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Christopher Groux", "title": "'Apex Legends' Battle Armor Event & Season 5 Start Date Revealed - Newsweek", "description": "\"Apex Legends\" Battle Armor event starts next week, and it leads right up to the release of Season 5.", "url": "https://www.newsweek.com/apex-legends-battle-armor-event-season-5-start-date-reveal-1500203", "urlToImage": null, "publishedAt": "2020-04-25T12:02:03Z", "content": "Apex Legends will host one more event before the start of Season 5. The Battle Armor event was revealed by Respawn Friday afternoon via an official blog post, and it focuses on a new mode with dedicated armor drops.\r\nPiggybacking off the popularity of the Evo… [+1984 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Davey Winder", "title": "New Windows 10 Update Fail: Users Warn Of BSOD And Deleted Files - Forbes", "description": "As users complain of blue screens of death, deleted files and reboot loops, here's what you really need to know about this Windows 10 update.", "url": "https://www.forbes.com/sites/daveywinder/2020/04/25/new-windows-10-update-fail-users-warn-of-bsod-and-deleted-files/", "urlToImage": null, "publishedAt": "2020-04-25T10:03:45Z", "content": "The latest Patch Tuesday update has caused alarming problems for some Windows 10 users\r\nSOPA Images/LightRocket via Getty Images\r\nAs users complain of blue screens of death, deleted files and reboot loops, here's what you need to know about this Windows 10 up… [+4453 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": null, "title": "Big tech companies play crucial role during COVID-19 pandemic - Micky News", "description": "As the world races against the clock to find the cure against COVID-19, big tech companies are also stepping up to their role.", "url": "https://micky.com.au/big-tech-companies-play-crucial-role-during-covid-19-pandemic/", "urlToImage": null, "publishedAt": "2020-04-25T08:44:17Z", "content": "Before the widespread threat of the COVID-19 virus, big tech companies are among the most vilified industries. They are criticized over allegations of unethical data harvesting and tracking users.\r\nRecently, these very same critics are tapping the massive com… [+2510 chars]"}, {"source": {"id": null, "name": "Channelnews.com.au"}, "author": "David Richards", "title": "Was CES 2020 A Super Spreader For COVID-19 After Tens Of Thousands Of Chinese Poured Into The US Event From Wuhan & Hubei Provence. - ChannelNews", "description": null, "url": "https://www.channelnews.com.au/was-ces-2020-a-super-spreader-for-covid-19-after-tens-of-thousands-of-chinese-poured-into-the-us-event-from-wuhan-provence/", "urlToImage": null, "publishedAt": "2020-04-25T08:20:12Z", "content": "One third of CES the world’s biggest Consumer Electronics Show in Las Vegas is Chinese exhibitors and at the 2020 show. tens of thousands of Chinese visitors poured into the event which is now being investigated as a hot spot that helped propel COVID-19 in th… [+3655 chars]"}, {"source": {"id": null, "name": "Nintendolife.com"}, "author": "Nintendo Life", "title": "Random: Cadence Of Hyrule Guitarist Jokingly Petitions For Time Travel Cheater Stamp In Animal Crossing - Nintendo Life", "description": "Insists he was \"just poking some fun\"", "url": "http://www.nintendolife.com/news/2020/04/random_cadence_of_hyrule_guitarist_jokingly_petitions_for_time_travel_cheater_stamp_in_animal_crossing", "urlToImage": null, "publishedAt": "2020-04-25T08:00:00Z", "content": "Update: Jules insists this was a joke specifically targeting a friend of his and further explained how he thinks time travel is still a valid way to play and enjoy Animal Crossing: New Horizons:\r\nOriginal article: One heated topic that keeps resurfacing on a … [+1425 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "Brett Wadelton", "title": "Google removes 103 Android apps from the Play Store with 69 million installs - 7NEWS.com.au", "description": "What actually happens is that most of these apps continue to run in the background and serve the user’s phone with intrusive ads.", "url": "https://7news.com.au/technology/google-removes-103-android-apps-from-the-play-store-with-69-million-installs-c-997272", "urlToImage": null, "publishedAt": "2020-04-25T07:27:42Z", "content": "Google has removed a whopping 103 apps from Androids Play Store after they were found bypass security checks, contain adware and descriptions that were deemed to be misleading.\r\nMore alarmingly is the amount of installs that these apps had accumulated.\r\nThese… [+7517 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Oppo Find X2 Pro camera review - GSMArena Official", "description": "ALL YOU NEED TO KNOW about the Find X2 Pro's camera performance in a dedicated video full of camera samples and the occasional comparison vs. the Galaxy S20 ...", "url": "https://www.youtube.com/watch?v=rbo4mQ874fc", "urlToImage": null, "publishedAt": "2020-04-25T06:18:47Z", "content": "ALL YOU NEED TO KNOW about the Find X2 Pro's camera performance in a dedicated video full of camera samples and the occasional comparison vs. the Galaxy S20 Ultra. \r\nOur full Find X2 Pro video review: https://www.youtube.com/watch?v=LPCqf...\r\nTo learn more, r… [+288 chars]"}, {"source": {"id": null, "name": "Digitalinformationworld.com"}, "author": "Arooj Ahmed", "title": "A Researcher Created A Website Highlighting What A Smartphone sees While Using Bluetooth And Discovered One Of The Biggest Challenges COVID-19 Tracking Technology Will Face - Digital Information World", "description": "One of the hurdles in the creation of this technology is that Bluetooth also detects devices through walls or other bodies that may not transmit the virus.", "url": "https://www.digitalinformationworld.com/2020/04/website-delenates-what-a-smartphone-sees-while-using-bluetooth-and-challenges-covid-19-tracking-technology-will-face.html", "urlToImage": null, "publishedAt": "2020-04-25T06:06:04Z", "content": "<ul><li>Claudio Guarnieri, an artist and security researcher created a website visualizing what a smartphone sees while the Bluetooth is turned on.</li><li>Apple and Google are creating a contact tracing technology to trace COVID-19 spread using Bluetooth ins… [+2045 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Desire Athow", "title": "This AMD Ryzen notebook deal is probably the best we've ever seen - TechRadar", "description": "Lenovo and AMD provide a glimpse into the future", "url": "https://www.techradar.com/news/this-amd-ryzen-laptop-is-the-probably-the-best-notebook-deal-ever", "urlToImage": null, "publishedAt": "2020-04-25T03:00:00Z", "content": "We reviewers are used to obsessing over incremental technology changes, but every now and then a supernova appears on our radar - something that can single handedly change the status quo.\r\nThe AMD Ryzen 4000 family is one such supernova and promises to bring … [+1829 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Oscar Gonzalez", "title": "Travis Scott event in Fortnite: How to watch the encore and find the Giant Astro Heads - CNET", "description": "The rapper dropped new tracks in a jaw-dropping concert. Catch the next show at midnight.", "url": "https://www.cnet.com/news/travis-scott-event-in-fortnite-how-to-watch-the-encore-and-find-the-giant-astro-heads/", "urlToImage": null, "publishedAt": "2020-04-25T01:02:37Z", "content": "Play some Fortnite and listen to a new track from Travis Scott.\r\nEpic Games\r\nFortnite events aren't only for players to check out new content from developer Epic Games. The popular battle royale game has also played host to multiple premieres and collaboratio… [+3718 chars]"}, {"source": {"id": null, "name": "Ubergizmo.com"}, "author": "Tyler Lee", "title": "Samsung’s Smartwatches Get A New Blood Pressure Monitoring App - Ubergizmo", "description": "Our smartwatches are getting better at what they do, where they can monitor more than just our daily activities like our steps taken, calories burnt, and so on. For example, the Apple Watch comes with an ECG monitoring tool that can alert the wearer if there …", "url": "https://www.ubergizmo.com/2020/04/samsung-smartwatch-blood-pressure-monitor/", "urlToImage": null, "publishedAt": "2020-04-25T00:42:49Z", "content": "Our smartwatches are getting better at what they do, where they can monitor more than just our daily activities like our steps taken, calories burnt, and so on. For example, the Apple Watch comes with an ECG monitoring tool that can alert the wearer if there … [+1254 chars]"}, {"source": {"id": null, "name": "Venturebeat.com"}, "author": "Jeff Grubb", "title": "How Xbox Game Pass freed The Coalition to make Gears Tactics for PC - VentureBeat", "description": "Gears Tactics is the next big first-party Microsoft launch for Xbox Game Pass. Developer The Coalition made the game in part because of Game Pass.", "url": "https://venturebeat.com/2020/04/24/gears-tactics-xbox-game-pass/", "urlToImage": null, "publishedAt": "2020-04-24T23:33:30Z", "content": "Gears Tactics is launching April 28 for Windows 10, Xbox Game Pass for PC, and Steam. On How Games Make Money this week, host Jeff Grubb sits down to talk with The Coalition operations director Mike Crump and Xbox marketing general manager Ben Decker about th… [+4308 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": "www.facebook.com/christian.n.puno", "title": "Samsung merges Apple Music with smart TVs - Micky News", "description": "People showed excitement when Itunes arrived in Smart TVs. Samsung started putting their entertainment to a whole new level last year.", "url": "https://micky.com.au/samsung-merges-apple-music-with-smart-tvs/", "urlToImage": null, "publishedAt": "2020-04-24T22:45:00Z", "content": "Samsung announced its partnership with Apple Music. One hundred million countries will enjoy the innovative combination.\r\nApple Music in Samsung TVs\r\nApple Music subscribers can enjoy playing and streaming their music. They can now use these features in their… [+2785 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": "www.facebook.com/christian.n.puno", "title": "Ford Mustang Cobra Jet 1400: Time for electric cars to take the limelight - Micky News", "description": "Time for electric cars to take limelight, Ford mechanics and scientists took this further. The result? 'Ford Mustang Cobra Jet 1400'", "url": "https://micky.com.au/ford-mustang-cobra-jet-1400-time-for-electric-cars-to-take-the-limelight/", "urlToImage": null, "publishedAt": "2020-04-24T22:43:00Z", "content": "The Ford Mustang Cobra Jet 1400 isnt a typical electric car. This cars creation coincided with drag racing in mind. Imagine how much electrical power it needs to go on such high speed. According to its creators, this monster car can reach a fourth of a mile w… [+2234 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Nathan Grayson", "title": "Valorant Twitch Streamers Are Gaming The System With 24/7 Streams That Rack Up Viewers - Kotaku Australia", "description": "If you take a look at many of Twitch’s top Valorant streams right now, you’ll note that they claim to be running “24/7.” This might strike you as odd, given that human beings generally need to eat, sleep, and all that fancy, life-sustaining jazz. Most of thes…", "url": "https://www.kotaku.com.au/2020/04/valorant-twitch-streamers-are-gaming-the-system-with-247-streams-that-rack-up-viewers/", "urlToImage": null, "publishedAt": "2020-04-24T22:10:00Z", "content": "If you take a look at many of Twitchs top Valorant streams right now, youll note that they claim to be running 24/7. This might strike you as odd, given that human beings generally need to eat, sleep, and all that fancy, life-sustaining jazz. Most of these st… [+9348 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Logitech G G203 LIGHTSYNC Promo Video - Techaeris", "description": "This is an overview of the new Logitech G G203 LIGHTSYNC Gaming Mouse. The video was provided by Logitech for resharing. Available in May buy here: https://w...", "url": "https://www.youtube.com/watch?v=i3_Ale_138I", "urlToImage": null, "publishedAt": "2020-04-24T21:57:36Z", "content": null}, {"source": {"id": null, "name": "Caradvice.com.au"}, "author": "Justin Narayan", "title": "Ford Mustang crowned the most successful sports car of 2019 - CarAdvice", "description": "America just wasn’t enough for the original pony car. The Ford Mustang has officially gone global. Last year saw the Mustang rise to the top of the sports car world, with recognition from fans from...", "url": "https://www.caradvice.com.au/845186/ford-mustang-crowned-the-most-successful-sports-car-of-2019/", "urlToImage": null, "publishedAt": "2020-04-24T20:05:00Z", "content": "More than 100,000 Mustangs were sold globally last year. Even though sales have waned in Australia, it remains one of Ford's most popular models.\r\nAmerica just wasn’t enough for the original pony car. The Ford Mustang has officially gone global.\r\nLast year sa… [+1907 chars]"}, {"source": {"id": null, "name": "Otakukart.com"}, "author": null, "title": "Arch-Tempered Namielle Release Date and All You Need To Know - OtakuKart", "description": "Monster Hunter Iceborne, which was recently launched on PC, has its latest update dropping soon called Title Update 13.5. The latest update is to be available o", "url": "https://otakukart.com/113224/arch-tempered-namielle-release-date-and-all-you-need-to-know/", "urlToImage": null, "publishedAt": "2020-04-24T20:00:15Z", "content": "Monster Hunter Iceborne, which was recently launched on PC, has its latest update dropping soon called Title Update 13.5. The latest update is to be available on PS4, Xbox One, and PC soon! Two new monster variants are to be introduced in the Title Update 13.… [+3073 chars]"}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "Apple Starts iPhone SE 2020 Sales in 40 Countries - Somag News", "description": "Apple, which introduced a surprisingly new generation iPhone SE model in the past days, has now started the first sales of the device in 40 countries. In the first wave, supply is expected to be limited, but most customers who pre-ordered on April 17 are said…", "url": "https://www.somagnews.com/apple-starts-iphone-se-2020-sales-40-countries/", "urlToImage": null, "publishedAt": "2020-04-24T19:51:00Z", "content": "Apple, which introduced a surprisingly new generation iPhone SE model in the past days, has now started the first sales of the device in 40 countries. In the first wave, supply is expected to be limited, but most customers who pre-ordered on April 17 are said… [+1666 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The Best Free Alternatives to Zoom - Lifehacker", "description": "While the popularity of the video conferencing service Zoom has skyrocketed since the outbreak of the coronavirus, recent news of its many security and priva...", "url": "https://www.youtube.com/watch?v=g7SIqs8dos4", "urlToImage": null, "publishedAt": "2020-04-24T19:48:38Z", "content": "While the popularity of the video conferencing service Zoom has skyrocketed since the outbreak of the coronavirus, recent news of its many security and privacy issues might have you feeling nervous about using it. In the video above, I share three free altern… [+1048 chars]"}, {"source": {"id": null, "name": "Businessinsider.com.au"}, "author": "Mary Meisenzahl", "title": "Facebook's new video chat Zoom competitor is coming soon — here's how the new feature works - Business Insider Australia", "description": "Facebook CEO Mark Zuckerberg announced on Friday the company is introducing 50-person video chatrooms.", "url": "https://www.businessinsider.com.au/facebook-messenger-rooms-video-chat-zoom-walkthrough-like-zoom-2020-4", "urlToImage": null, "publishedAt": "2020-04-24T19:44:33Z", "content": "<ul><li>Facebook just announced 50-person video chatrooms called Messenger Rooms.</li><li>\r\nThe new Messenger Rooms have some features in common with other video calling apps, like Zoom and Houseparty.\r\n</li><li>\r\nThe company says Messenger Rooms will be comi… [+3605 chars]"}, {"source": {"id": null, "name": "Lifehacker.com.au"}, "author": "David Murphy", "title": "Are You Charging Your MacBook On The Wrong Side? - Lifehacker Australia", "description": "Yes, you read that headline correctly. There is apparently a “right” way and a “wrong” way to connect devices to a MacBook with Thunderbolt/USB-C ports on both sides. Doing it wrong can affect your computer’s performance....", "url": "https://www.lifehacker.com.au/2020/04/are-you-charging-your-macbook-on-the-wrong-side/", "urlToImage": null, "publishedAt": "2020-04-24T19:30:00Z", "content": "Yes, you read that headline correctly. There is apparently a right way and a wrong way to connect devices to a MacBook with Thunderbolt/USB-C ports on both sides. Doing it wrong can affect your computers performance.\r\nI recently encountered this knowledge on … [+3969 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Ian Walker", "title": "Final Fantasy VII Remake Made Me Climb 59 Flights Of Stairs And I Loved It - Kotaku Australia", "description": "I recently arrived at Shinra headquarters in my playthrough of Final Fantasy VII Remake. After Cloud and his squad fight their way through the parking garage, they enter the spacious reception area to find the place deserted. Our heroes have two ways to reach…", "url": "https://www.kotaku.com.au/2020/04/final-fantasy-vii-remake-made-me-climb-59-flights-of-stairs-and-i-loved-it/", "urlToImage": null, "publishedAt": "2020-04-24T19:00:00Z", "content": "I recently arrived at Shinra headquarters in my playthrough of Final Fantasy VII Remake. After Cloud and his squad fight their way through the parking garage, they enter the spacious reception area to find the place deserted. Our heroes have two ways to reach… [+3078 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Magic Keyboard for iPad Pro - Top Features! Is it worth it? - 9to5Mac", "description": "In this video I go hands-on with the Magic Keyboard for iPad Pro. I'm using the $299 11-inch version, which is $50 cheaper than the 12.9-inch version. The Ma...", "url": "https://www.youtube.com/watch?v=a1DEwgdEF8c", "urlToImage": null, "publishedAt": "2020-04-24T18:56:41Z", "content": null}, {"source": {"id": null, "name": "Slashgear.com"}, "author": "Chris Burns", "title": "PAC-MAN game now free for quarantine gamers - SlashGear", "description": "Today the folks at Bandai Namco US delivered a message of thanks to the public with their “goodwill ambassador” PAC-MAN. Their announcement was that they’ll be “asking fans …", "url": "https://www.slashgear.com/pac-man-game-now-free-for-quarantine-gamers-24618193/", "urlToImage": null, "publishedAt": "2020-04-24T18:49:21Z", "content": "Today the folks at Bandai Namco US delivered a message of thanks to the public with their “goodwill ambassador” PAC-MAN. Their announcement was that they’ll be “asking fans to do their part and have More Fun For Everyone at home” – the “more fun for everyone”… [+2504 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Valve Source Code LEAKED - Hot off the Press Start #34 - GameFront", "description": "Support us on Patreon! - https://www.patreon.com/gamefront - James is back once more with the latest gaming news, including more bad news for GeForce Now, ju...", "url": "https://www.youtube.com/watch?v=D37UfGQ1x1o", "urlToImage": null, "publishedAt": "2020-04-24T18:47:41Z", "content": "Support us on Patreon! - https://www.patreon.com/gamefront - James is back once more with the latest gaming news, including more bad news for GeForce Now, justice for Warzone cheaters, and the source code for Team Fortress 2 and CS:GO leaking online.\r\n#GeForc… [+287 chars]"}, {"source": {"id": null, "name": "Macrumors.com"}, "author": "Juli Clover", "title": "'Defending Jacob' and 'Beastie Boys Story' Now Available on Apple TV+ - MacRumors", "description": "The first three episodes of Apple TV+'s latest series, \"Defending Jacob,\" are available as of today in the Apple TV app on iPhone, iPad,...", "url": "https://www.macrumors.com/2020/04/24/apple-tv-plus-beastie-boys-defending-jacob/", "urlToImage": null, "publishedAt": "2020-04-24T17:32:03Z", "content": "The first three episodes of Apple TV+'s latest series, \"Defending Jacob,\" are available as of today in the ‌Apple TV‌ app on iPhone, iPad, Mac, ‌Apple TV‌, and select smart TVs.\r\nThe show, which is based on the William Landay novel of the same name, follows a… [+1760 chars]"}, {"source": {"id": null, "name": "Lifehacker.com.au"}, "author": "Brendan Hesse", "title": "Don't Let Microsoft Word Judge You For Using Two Spaces Between Sentences - Lifehacker Australia", "description": "Microsoft has taken an official stance on one of the internet’s most divisive questions, firmly coming down on the side of minimalism in the “one-space versus two-spaces after a sentence” debate. Word’s automatic spelling and grammar checker will now flag any…", "url": "https://www.lifehacker.com.au/2020/04/dont-let-microsoft-word-judge-you-for-using-two-spaces-between-sentences/", "urlToImage": null, "publishedAt": "2020-04-24T17:15:00Z", "content": "Microsoft has taken an official stance on one of the internets most divisive questions, firmly coming down on the side of minimalism in the one-space versus two-spaces after a sentence debate. Words automatic spelling and grammar checker will now flag anythin… [+1903 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Heather Alexandra", "title": "The Good, The Bad, And The Annoying Of Borderlands 3's \"Revenge Of The Cartels\" Event - Kotaku Australia", "description": "It’s been less than a month since Borderlands 3’s latest big expansion landed with a bang, but vault hunters already have access to another brand-new playground in which they can fire 87 bazillion guns. It’s called Villa Ultraviolet. It’s drenched in neon and…", "url": "https://www.kotaku.com.au/2020/04/the-good-the-bad-and-the-annoying-of-borderlands-3s-revenge-of-the-cartels-event/", "urlToImage": null, "publishedAt": "2020-04-24T17:00:00Z", "content": "Its been less than a month since Borderlands 3s latest big expansion landed with a bang, but vault hunters already have access to another brand-new playground in which they can fire 87 bazillion guns. Its called Villa Ultraviolet. Its drenched in neon and gau… [+4795 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "iPhone SE review, Canon EOS R5 new specs and Surface Pro 8 rumors | Noise Cancelling Podcast 008 - TechRadar", "description": "More tech news and painfully honest reviews from Gareth and Sherri as they’re joined by two new voices: Kimberly Gedeon of Laptop Mag and TechRadar Cameras e...", "url": "https://www.youtube.com/watch?v=bPYeSWVgSXw", "urlToImage": null, "publishedAt": "2020-04-24T15:00:19Z", "content": "More tech news and painfully honest reviews from Gareth and Sherri as theyre joined by two new voices: Kimberly Gedeon of Laptop Mag and TechRadar Cameras editor, Mark Wilson. \r\nTOPIC TIMESTAMPS03:52 - Canon EOS R508:36 - PS5 Robot Friends12:46 - Surface Pro … [+992 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Future Games Show Announcement Trailer - Coming June 2020 - GamesRadar", "description": "See the most exciting console, mobile and streaming games of 2020 in one show with a mixture of exclusives, deep dives and developer interviews. Coming June ...", "url": "https://www.youtube.com/watch?v=DbLFsALqD_0", "urlToImage": null, "publishedAt": "2020-04-24T15:00:12Z", "content": "See the most exciting console, mobile and streaming games of 2020 in one show with a mixture of exclusives, deep dives and developer interviews. Coming June 2020.Subscribe to Gamesradar: http://goo.gl/cnjsn1"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Christine Fisher", "title": "Telegram promises secure group video calls sometime this year - Yahoo Finance Australia", "description": "Telegram says it will add secure group video calls in 2020.", "url": "https://au.finance.yahoo.com/news/telegram-secure-group-video-calls-142035892.html", "urlToImage": null, "publishedAt": "2020-04-24T14:20:00Z", "content": "Now that the coronavirus pandemic has made video calls increasingly popular and critical, services like Zoom, Google Meet, WhatsApp and Telegram are vying for attention. Telegram seems to think it can get ahead by focusing on security. Today, the messaging ap… [+1329 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Igor Bonifacic", "title": "Sony's excellent WH-1000XM3 headphones are only $238 at Newegg - Yahoo News Australia", "description": "Sony's excellent WH-1000XM3 headphones are once again on sale. This time around, you can get them for $238.", "url": "https://au.news.yahoo.com/sony-wh1000xm3-sale-newegg-135558070.html", "urlToImage": null, "publishedAt": "2020-04-24T13:55:00Z", "content": "If you missed the chance to pick up Sony's beloved WH-1000XM3 noise-cancelling headphones when Newegg discounted them to $250 early last month, you have another opportunity to buy them at a compelling price. For today only, the online retailer is selling both… [+1295 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": "www.facebook.com/christian.n.puno", "title": "Apple will release a new Mac laptop away from Intel - Micky News", "description": "Apple will release a new Mac laptop next year with its processors away from intel, giving users better performance.", "url": "https://micky.com.au/apple-will-release-a-new-mac-laptop-away-from-intel/", "urlToImage": null, "publishedAt": "2020-04-24T13:52:47Z", "content": "It is no doubt that Apple products usually cost high, but users often report it has excellent performance. Apple will release its new Mac laptop next year, according to Bloomberg. It is also said to have more improvements included.\r\nWhat is With the New Mac L… [+3233 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "HERE WeGo maps and navigation is now available on the Huawei AppGallery - XDA Developers", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiWWh0dHBzOi8vd3d3LnhkYS1kZXZlbG9wZXJzLmNvbS9oZXJlLXdlZ28tbWFwcy1hbmQtbmF2aWdhdGlvbi1odWF3ZWktYXBwZ2FsbGVyeS1hdmFpbGFibGUv0gFdaHR0cHM6Ly93d3cueGRhLWRldmVsb3BlcnMuY29tL2hlcmUtd2Vnby1tYXBzLWFuZC1uYXZpZ2F0aW9uLWh1YXdlaS1hcHBnYWxsZXJ5LWF2YWlsYWJsZS9hbXAv?oc=5", "urlToImage": null, "publishedAt": "2020-04-24T12:58:55Z", "content": null}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Joan E. Solsman", "title": "This Oculus Quest fitness app worked me so hard I forgot to breathe - CNET", "description": "Supernatural is a new spin on virtual reality fitness, and it may save me from backsliding into a lazy slug during lockdown.", "url": "https://www.cnet.com/news/supernatural-vr-fitness-mashup-of-pelaton-and-beat-saber-oculus-quest/", "urlToImage": null, "publishedAt": "2020-04-24T12:57:15Z", "content": "Supernatural sets game-ified, choreographed workouts to popular music in virtual reality. \r\nWithin\r\nSupernatural, a new virtual realityfitness game you can play in your home, isn't playing around. I sweat so hard I have to guzzle five glasses of water for eve… [+9525 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Darren Allan", "title": "Nvidia’s reportedly ordering 5nm chips for a ‘mystery’ product - TechRadar", "description": "As it ups orders on 7nm, hopefully indicating RTX 3000 GPUs are still on track", "url": "https://www.techradar.com/news/nvidias-reportedly-ordering-5nm-chips-for-a-mystery-product", "urlToImage": null, "publishedAt": "2020-04-24T12:54:00Z", "content": "Nvidia is making something using a 5nm process, according to the rumor mill, although its anyones guess what that hardware could be.\r\nThis comes from a DigiTimes report about how chipmaker TSMC is benefiting from a ramp-up in orders from Nvidia and AMD, and a… [+1260 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Rachel England", "title": "Nintendo blocks legacy logins after 160,000 accounts were compromised (update) - Yahoo Finance Australia", "description": "Some 160,000 Switch users have been the subject of a data breach.", "url": "https://au.finance.yahoo.com/news/nintendo-blocks-legacy-logins-data-breach-account-120610588.html", "urlToImage": null, "publishedAt": "2020-04-24T12:06:00Z", "content": "Nintendo has shut down NNID logins and is encouraging Switch owners to lock down their accounts after a wave of fraudulent attacks. Nintendo itself has confirmed that the platform has fallen foul of hackers, who are accessing accounts and using linked PayPal … [+3677 chars]"}, {"source": {"id": null, "name": "Happygamer.com"}, "author": "Joshua Goodpastor", "title": "Minimal Affect Is A New Parody Action RPG That Pays Homage To Some Of The Greatest Sci-Fi Movies And Games In One Small Package - Happy Gamer", "description": "Toadman Studios has entered the dangerous world of parody and announced its upcoming game Minimal Affect. This is an obvious parody on the title of...", "url": "https://happygamer.com/minimal-affect-is-a-new-parody-action-rpg-that-pays-homage-to-some-of-the-greatest-sci-fi-movies-and-games-in-one-small-package-63649/", "urlToImage": null, "publishedAt": "2020-04-24T10:52:12Z", "content": "Toadman Studios has entered the dangerous world of parody and announced its upcoming game Minimal Affect. This is an obvious parody on the title of the famous Mass Effect series, but quick observation shows that this game spans much more than one franchise.\r\n… [+2256 chars]"}, {"source": {"id": null, "name": "Happygamer.com"}, "author": "Joshua Goodpastor", "title": "SoundSelf: A Technodelic Is A Unique Soundbased VR Experience Now Availiable For Both PC And Mac VR Systems - Happy Gamer", "description": "Andromeda Entertainment has announced a unique video game experience in an immersive VR world. SoundSelf: A Technodelic is a unique and entrancing...", "url": "https://happygamer.com/soundself-a-technodelic-is-a-unique-soundbased-vr-experience-now-availiable-for-both-pc-and-mac-vr-systems-63644/", "urlToImage": null, "publishedAt": "2020-04-24T09:42:12Z", "content": "Andromeda Entertainment has announced a unique video game experience in an immersive VR world. SoundSelf: A Technodelic is a unique and entrancing experience that takes players on a meditative journey. The game is controlled using your own voice as you hum an… [+2237 chars]"}, {"source": {"id": null, "name": "Dailymercury.com.au"}, "author": "Grant Edwards", "title": "BMW returns to the original performance flavour - Daily Mercury", "description": "After a diversion from the native recipe, BMW has rediscovered its performance mojo with the 3 Series.", "url": "https://www.dailymercury.com.au/news/bmw-returns-to-the-original-performance-flavour/4002041/", "urlToImage": null, "publishedAt": "2020-04-24T05:28:00Z", "content": "Once BMWs bread and butter, the 3 Series of the new millennium had a tendency to be bland.\r\nGood to drive, yes. Hard to fault, absolutely. But there was little to inspire or excite.\r\nThe compact sedan was lost in a sea of SUVs and swoopy-backed offshoots.\r\nGl… [+4988 chars]"}, {"source": {"id": null, "name": "Gameconsole.co.nz"}, "author": "Lama Farhat", "title": "Game review: One month with Animal Crossing New Horizons - FutureFive Australia", "description": "If you own a Switch and don’t own a copy of Animal Crossing, then you should probably go get one.", "url": "https://gameconsole.co.nz/story/game-review-one-month-with-animal-crossing-new-horizons", "urlToImage": null, "publishedAt": "2020-04-24T04:16:04Z", "content": "Animal Crossing New Horizons is one of those games that makes Nintendo Stand out from the crowd. It is the type of console exclusive that will make Xbox and PlayStation owners rush to the store to buy a Nintendo Switch. The Franchise has been a fan favourite … [+5296 chars]"}, {"source": {"id": null, "name": "Gadgetguy.com.au"}, "author": null, "title": "Review: Malwarebytes Privacy – a new paid VPN provider - GadgetGuy", "description": "Malwarebytes Privacy is a new VPN (virtual private network) from the same company that has one of, if not the best malware detection and removal solutions Malwarebytes Privacy", "url": "https://www.gadgetguy.com.au/product/malwarebytes-privacy-a-new-paid-vpn-provider/", "urlToImage": null, "publishedAt": "2020-04-24T03:46:22Z", "content": "Malwarebytes Privacy a new paid VPN provider\r\nMalwarebytes Privacy is a new VPN (virtual private network) from the same company that has one of, if not the best malware detection and removal solutions on the planet.\r\nWhile I trust Norton Lifelock, McAfee and … [+2950 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "", "title": "Isolation item earns Aussie $150k in 7 mins - Observer", "description": "While coronavirus has had a catastrophic effect, the sudden change to everyday life has meant Aussies are spending their cash in unexpected places.", "url": "https://www.news.com.au/lifestyle/fitness/aussie-makes-150k-in-seven-minutes-off-new-isolation-musthave/news-story/764ecc100b4c25fb218aff38a227eeeb", "urlToImage": null, "publishedAt": "2020-04-24T01:43:00Z", "content": "While coronavirus has had a catastrophic effect on many businesses, the sudden change to everyday life has meant Aussies are spending their cash in unexpected places.\r\nJust ask Matilda Murray, who co-owns fitness apparel brand Stax with Don Robertson.\r\nShe sa… [+3919 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Red Dead Redemption 2 Joins Game Pass | Save State - GameSpot", "description": "Persia brings you all the biggest gaming stories for your April 23 Save State. Red Dead Redemption 2 is coming to Xbox One's Game Pass on May 7 and is alread...", "url": "https://www.youtube.com/watch?v=AZzzSV-F_B8", "urlToImage": null, "publishedAt": "2020-04-24T01:00:02Z", "content": "Persia brings you all the biggest gaming stories for your April 23 Save State. Red Dead Redemption 2 is coming to Xbox One's Game Pass on May 7 and is already available for pre-download. It will also include Red Dead Online. GTA V will be leaving the service … [+447 chars]"}, {"source": {"id": null, "name": "Press-start.com.au"}, "author": "Shannon Grixti", "title": "The First Three Seasons Of Sailor Moon Have Been Put On YouTube For Free - Press Start Australia", "description": "Crunchyroll has announced that they'll be putting the first three seasons of Sailor Moon onto YouTube starting today. As of now, the first 10 episodes have dropped and a further 10 episodes will drop each Friday until July. These episodes are from Sailor Moon…", "url": "https://press-start.com.au/news/2020/04/24/the-first-three-seasons-of-sailor-moon-have-been-put-on-youtube-for-free/", "urlToImage": null, "publishedAt": "2020-04-24T00:56:27Z", "content": "Crunchyroll has announced that they’ll be putting the first three seasons of Sailor Moon onto YouTube starting today.\r\nAs of now, the first 10 episodes have dropped and a further 10 episodes will drop each Friday until July. These episodes are from Sailor Moo… [+181 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "Digital Staff", "title": "‘He should know better’: Fevola criticised over ‘irresponsible’ ad - 7NEWS.com.au", "description": "Brendan Fevola is promoting an online app that experts are calling a “gateway to gambling addiction”.", "url": "https://7news.com.au/sport/afl/he-should-know-better-fevola-criticised-over-irresponsible-ad-c-996642", "urlToImage": null, "publishedAt": "2020-04-24T00:45:41Z", "content": "AFL great Brendan Fevola has been criticised for promoting an online poker machine app despite his own problems with gambling.\r\nThe 39-year-old took to Instagram this week to share what appeared to be a sponsored post for poker machine app Slotomania.\r\nFevola… [+3393 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Leah Williams", "title": "Steam's Weekend Deals Feature Some Must-Have Indies - Kotaku Australia", "description": "Every weekend lately, Steam has been spotlighting sales from indie developers. This weekend, it's Annapurna Interactive's turn — and there's a bunch of fantastic games on sale that come highly recommended....", "url": "https://www.kotaku.com.au/2020/04/steam-weekend-indie-sale/", "urlToImage": null, "publishedAt": "2020-04-23T23:33:00Z", "content": "Every weekend lately, Steam has been spotlighting sales from indie developers. This weekend, it's Annapurna Interactive's turn and there's a bunch of fantastic games on sale that come highly recommended.\r\nEmotional family tale What Remains of Edith Finch lead… [+2320 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Leah Williams", "title": "Horizon Zero Dawn 2 Rumours Spread After Developers Delete A Tweet - Kotaku Australia", "description": "In a now-deleted tweet, Horizon Zero Dawn developers Guerilla Games listed a job posting for a Senior AI Programmer that included the hashtag #ps5. It's kicked off speculation that the team could be working on an exclusive PlayStation 5 sequel for the much-lo…", "url": "https://www.kotaku.com.au/2020/04/horizon-zero-dawn-2-rumours/", "urlToImage": null, "publishedAt": "2020-04-23T23:31:00Z", "content": "In a now-deleted tweet, Horizon Zero Dawn developers Guerilla Games listed a job posting for a Senior AI Programmer that included the hashtag #ps5. It's kicked off speculation that the team could be working on an exclusive PlayStation 5 sequel for the much-lo… [+2268 chars]"}, {"source": {"id": null, "name": "Lifehacker.com.au"}, "author": "David Murphy", "title": "How To Customise Your Background In Skype Video Calls - Lifehacker Australia", "description": "There’s little I enjoy more than a the well-executed use of a silly background in a video chat. While this quirky feature used to be exclusive to Zoom, more apps are integrating the functionality—including, recently, Microsoft Teams, and now, Microsoft’s own …", "url": "https://www.lifehacker.com.au/2020/04/how-to-customize-your-background-in-skype-video-calls/", "urlToImage": null, "publishedAt": "2020-04-23T23:30:00Z", "content": "Theres little I enjoy more than a the well-executed use of a silly background in a video chat. While this quirky feature used to be exclusive to Zoom, more apps are integrating the functionalityincluding, recently, Microsoft Teams, and now, Microsofts own Sky… [+1265 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Nathan Grayson", "title": "You Can Finally Apologise For Being Trash In Overwatch - Kotaku Australia", "description": "Who doesn’t love voice lines in Overwatch? They let you say hello. They can help your teammates stay abreast of your ultimate percentage. If you play DPS, you can use them to spam messages about how you need healing until everybody else’s ears seal closed lik…", "url": "https://www.kotaku.com.au/2020/04/you-can-finally-apologize-for-being-trash-in-overwatch/", "urlToImage": null, "publishedAt": "2020-04-23T23:30:00Z", "content": "Who doesnt love voice lines in Overwatch? They let you say hello. They can help your teammates stay abreast of your ultimate percentage. If you play DPS, you can use them to spam messages about how you need healing until everybody elses ears seal closed like … [+2085 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: 'Our wedding is cancelled but we still have to pay' - BBC News", "description": "Venues are forcing couples to pay big cancellation fees for weddings delayed by the lockdown.", "url": "https://www.bbc.com/news/business-52400441", "urlToImage": null, "publishedAt": "2020-04-23T23:12:17Z", "content": "Media caption'We've saved so hard for so long for it, it's beyond belief almost'\r\nBrides and grooms say they are being charged thousands of pounds in cancellation and postponement fees for weddings that can't go ahead because of the coronavirus lockdown. \r\nWh… [+7995 chars]"}, {"source": {"id": null, "name": "Ausdroid.net"}, "author": null, "title": "Google rolling out Android 11 DP3 to various Pixel phones today - Ausdroid", "description": "This year Google’s developer previews for Android 11 has been not just premonitions for Android 11 but also for Pixel phones this year with some of the new features we are seeing in developer previews making it into stable Android 10 builds on a monthly basis…", "url": "https://ausdroid.net/2020/04/24/google-rolling-out-android-11-dp3-to-various-pixel-phones-today/", "urlToImage": null, "publishedAt": "2020-04-23T22:48:14Z", "content": "This year Google’s developer previews for Android 11 has been not just premonitions for Android 11 but also for Pixel phones this year with some of the new features we are seeing in developer previews making it into stable Android 10 builds on a monthly basis… [+1551 chars]"}, {"source": {"id": null, "name": "Gizmodo.com.au"}, "author": "Tegan Jones", "title": "Every Telstra Plan For The New iPhone SE - Gizmodo Australia", "description": "Happy New iPhone Day! Apple is re-entering the mid-range market with the second generation of its beloved iPhone SE. it surprised all of us by starting at a cool $749. This means that when it comes to plans, you're going to get a far more palatable monthly bi…", "url": "https://www.gizmodo.com.au/2020/04/iphone-se-plans-telstra-australia/", "urlToImage": null, "publishedAt": "2020-04-23T22:44:00Z", "content": "Happy New iPhone Day! Apple is re-entering the mid-range market with the second generation of its beloved iPhone SE. it surprised all of us by starting at a cool $749. This means that when it comes to plans, you're going to get a far more palatable monthly bi… [+3859 chars]"}, {"source": {"id": null, "name": "Kotaku.com"}, "author": "Ian Walker", "title": "Binding Of Isaac Mod Helps Woman Propose To Her Significant Other - Kotaku", "description": "I’ve never proposed to anybody, but I can imagine it would be pretty anxiety-provoking. I totally understand why some folks prefer to let their favorite video games do the talking. Last week, an Australian woman sat her significant other down to play a modded…", "url": "https://kotaku.com/binding-of-isaac-mod-helps-woman-propose-to-her-signifi-1843029000", "urlToImage": null, "publishedAt": "2020-04-23T21:15:37Z", "content": "Ive never proposed to anybody, but I can imagine it would be pretty anxiety-provoking. I totally understand why some folks prefer to let their favorite video games do the talking. Last week, an Australian woman sat her significant other down to play a modded … [+2707 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Oscar Gonzalez", "title": "Call of Duty Warzone: Cheaters punished, new modes and everything else you need to know - CNET", "description": "Drop in and survive the 150-player battle royale match.", "url": "https://www.cnet.com/news/call-of-duty-warzone-cheaters-punished-new-modes-and-everything-else-you-need-to-know/", "urlToImage": null, "publishedAt": "2020-04-23T20:54:57Z", "content": "Don't expect to build any forts in Warzone.\r\nActivision\r\nCall of Duty: Warzone is the upcoming battle royale mode for the popular military FPS game. Similar to games like Fortnite and Apex Legends, players will compete against other players to survive until t… [+5699 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Here's What You Need to Know About the NEW Sonos Radio Service - GetConnected Media", "description": "https://getconnectedmedia.com - Sonos Radio is arriving in Canada. The FREE ad-supported service is available exclusively to Sonos users and ties together ov...", "url": "https://www.youtube.com/watch?v=-dq1aWvaCtQ", "urlToImage": null, "publishedAt": "2020-04-23T20:52:48Z", "content": "https://getconnectedmedia.com - Sonos Radio is arriving in Canada. The FREE ad-supported service is available exclusively to Sonos users and ties together over 60,000 radio stations from around the world. This dedicated experience offers better categorization… [+1550 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Fortnite: How to Visit the Agency, Hayman, and Greasy Graves in A Single Match - GameRant", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiP2h0dHBzOi8vZ2FtZXJhbnQuY29tL2ZvcnRuaXRlLXZpc3QtYWdlbmN5LWhheW1hbi1ncmVhc3ktZ3JhdmVzL9IBQ2h0dHBzOi8vZ2FtZXJhbnQuY29tL2ZvcnRuaXRlLXZpc3QtYWdlbmN5LWhheW1hbi1ncmVhc3ktZ3JhdmVzL2FtcC8?oc=5", "urlToImage": null, "publishedAt": "2020-04-23T18:26:28Z", "content": null}, {"source": {"id": null, "name": "Macrumors.com"}, "author": "Juli Clover", "title": "Apple Releases iOS 13.4.1 for iPhone SE Ahead of Launch - MacRumors", "description": "Apple today released the iOS 13.4.1 update for iPhone SE owners, suggesting iPhone SE models arriving to customers tomorrow will have iOS 13.4...", "url": "https://www.macrumors.com/2020/04/23/apple-releases-ios-13-4-1-for-iphone-se/", "urlToImage": null, "publishedAt": "2020-04-23T17:26:44Z", "content": "Apple today released the iOS 13.4.1 update for iPhone SE owners, suggesting ‌iPhone‌ SE models arriving to customers tomorrow will have iOS 13.4 installed and will need a day-one software update.\r\n‌iPhone‌ SE owners can install the new update over-the-air tom… [+870 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Motorola Edge+ unboxing and first impressions - Neowin", "description": "Unboxing and first impressions of Motorola's reentry into the flagship space with the Edge+. It packs a Snapdragon 865 chipset, 12GB RAM, 256GB of UFS 3.0 st...", "url": "https://www.youtube.com/watch?v=OVxig_gFfbc", "urlToImage": null, "publishedAt": "2020-04-23T17:09:54Z", "content": "Unboxing and first impressions of Motorola's reentry into the flagship space with the Edge+. It packs a Snapdragon 865 chipset, 12GB RAM, 256GB of UFS 3.0 storage with Turbo Write, a 108MP main camera, and a 5,000mAh battery."}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Here’s How To Change Your Display Name In VALORANT | TheGamer - TheGamer", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiOWh0dHBzOi8vd3d3LnRoZWdhbWVyLmNvbS9jaGFuZ2UtZGlzcGxheS1uYW1lLWluLXZhbG9yYW50L9IBPWh0dHBzOi8vd3d3LnRoZWdhbWVyLmNvbS9jaGFuZ2UtZGlzcGxheS1uYW1lLWluLXZhbG9yYW50L2FtcC8?oc=5", "urlToImage": null, "publishedAt": "2020-04-23T16:15:44Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Messenger Kids | Greg's Geek Fix - ABC Action News", "description": "Facebook has developed a kid-friendly messaging with important parental controls.", "url": "https://www.youtube.com/watch?v=LQwyzA_3C5I", "urlToImage": null, "publishedAt": "2020-04-23T16:04:07Z", "content": null}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Tech Desk", "title": "PUBG Mobile Ranked Arena Mode: What’s new, how to play - The Indian Express", "description": "Apart from this new Ranked Arena Mode, the EvoGround game mode selection tab also consists of multiple other game modes, including 4v4 Team Deathmatch mode, Domination, Arena Training, Arctic Mode, RageGear and PayLoad.", "url": "https://indianexpress.com/article/technology/gaming/pubg-mobile-ranked-arena-mode-is-here-6375425/", "urlToImage": null, "publishedAt": "2020-04-23T15:11:28Z", "content": "By: Tech Desk | New Delhi | \r\nUpdated: April 23, 2020 8:33:47 pm\r\nIn this, players will start off with a Bronze rank and with continuous matches can push their ranks all the way up to Ace.Tencent Games has released a new game mode, called the Ranked Arena Mod… [+2724 chars]"}]}