{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Micky.com.au"}, "author": null, "title": "Big tech companies play crucial role during COVID-19 pandemic - Micky News", "description": "As the world races against the clock to find the cure against COVID-19, big tech companies are also stepping up to their role.", "url": "https://micky.com.au/big-tech-companies-play-crucial-role-during-covid-19-pandemic/", "urlToImage": null, "publishedAt": "2020-04-25T02:45:55Z", "content": "Before the widespread threat of the COVID-19 virus, big tech companies are among the most vilified industries. They are criticized over allegations of unethical data harvesting and tracking users.\r\nRecently, these very same critics are tapping the massive com… [+2510 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Oscar Gonzalez", "title": "Travis Scott event in Fortnite: How to watch the encore and find the Giant Astro Heads - CNET", "description": "The rapper dropped new tracks in a jaw-dropping concert. Catch the next show at midnight.", "url": "https://www.cnet.com/news/travis-scott-event-in-fortnite-how-to-watch-the-encore-and-find-the-giant-astro-heads/", "urlToImage": null, "publishedAt": "2020-04-25T01:02:37Z", "content": "Play some Fortnite and listen to a new track from Travis Scott.\r\nEpic Games\r\nFortnite events aren't only for players to check out new content from developer Epic Games. The popular battle royale game has also played host to multiple premieres and collaboratio… [+3718 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "GameCentral", "title": "Reason and irrationality in the choice of console purchases - Metro.co.uk", "description": "A reader is surprised to find people choosing between PS5 and Xbox Series X already, and examines the psychology of their decisions.", "url": "https://metro.co.uk/2020/04/25/undivided-loyalties-reason-irrationality-choice-console-purchases-readers-feature-12607795/", "urlToImage": null, "publishedAt": "2020-04-25T00:36:33Z", "content": "How do you choose yours? (pic: Sony)\r\nA reader is surprised to find people choosing between PS5 and Xbox Series X already, and examines the psychology of their decisions.\r\nMy favourite games are made by Nintendo, the flagship Mario and Zelda titles in particu… [+4815 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": "www.facebook.com/christian.n.puno", "title": "Ford Mustang Cobra Jet 1400: Time for electric cars to take the limelight - Micky News", "description": "Time for electric cars to take limelight, Ford mechanics and scientists took this further. The result? 'Ford Mustang Cobra Jet 1400'", "url": "https://micky.com.au/ford-mustang-cobra-jet-1400-time-for-electric-cars-to-take-the-limelight/", "urlToImage": null, "publishedAt": "2020-04-24T22:43:00Z", "content": "The Ford Mustang Cobra Jet 1400 isnt a typical electric car. This cars creation coincided with drag racing in mind. Imagine how much electrical power it needs to go on such high speed. According to its creators, this monster car can reach a fourth of a mile w… [+2234 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Logitech G G203 LIGHTSYNC Promo Video - Techaeris", "description": "This is an overview of the new Logitech G G203 LIGHTSYNC Gaming Mouse. The video was provided by Logitech for resharing. Available in May buy here: https://w...", "url": "https://www.youtube.com/watch?v=i3_Ale_138I", "urlToImage": null, "publishedAt": "2020-04-24T21:57:36Z", "content": null}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Austen Goslin", "title": "Here are all of Valorant’s competitive ranks - Polygon", "description": "Riot has revealed Valorant’s competitive ranks, when the Ranked mode will go live, how many friends you can team up with, and ranked progression.", "url": "https://www.polygon.com/2020/4/24/21234911/valorant-rated-mode-release-date-ranks-competitive-matchmaking-teams", "urlToImage": null, "publishedAt": "2020-04-24T21:27:16Z", "content": "Riot has finally revealed the first details about Valorants upcoming ranked mode. Since Valorants closed beta started a few weeks ago, there has only been one mode: Unrated. But in the games next patch, Rated mode will be added, allowing players to earn ranks… [+2775 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": null, "title": "Android apps infect 69 million smartphones with malware - Micky News", "description": "A recent audit of the Android Play Store revealed that more than 100 apps are infected with malware.The apps were installed to more than 69 million smartphones.", "url": "https://micky.com.au/android-apps-infect-69-million-smartphones-with-malware/", "urlToImage": null, "publishedAt": "2020-04-24T20:50:00Z", "content": "The scariest part of the audit is that these apps were installed in more than 69 million smartphones. This is not the first time that infected apps were able to gain permission to access the Play Store.\r\nGoogle has been busy tracking these malicious apps and … [+2499 chars]"}, {"source": {"id": null, "name": "Caradvice.com.au"}, "author": "Justin Narayan", "title": "Ford Mustang crowned the most successful sports car of 2019 - CarAdvice", "description": "America just wasn’t enough for the original pony car. The Ford Mustang has officially gone global. Last year saw the Mustang rise to the top of the sports car world, with recognition from fans from...", "url": "https://www.caradvice.com.au/845186/ford-mustang-crowned-the-most-successful-sports-car-of-2019/", "urlToImage": null, "publishedAt": "2020-04-24T20:05:00Z", "content": "More than 100,000 Mustangs were sold globally last year. Even though sales have waned in Australia, it remains one of Ford's most popular models.\r\nAmerica just wasn’t enough for the original pony car. The Ford Mustang has officially gone global.\r\nLast year sa… [+1907 chars]"}, {"source": {"id": null, "name": "Otakukart.com"}, "author": null, "title": "Arch-Tempered Namielle Release Date and All You Need To Know - OtakuKart", "description": "Monster Hunter Iceborne, which was recently launched on PC, has its latest update dropping soon called Title Update 13.5. The latest update is to be available o", "url": "https://otakukart.com/113224/arch-tempered-namielle-release-date-and-all-you-need-to-know/", "urlToImage": null, "publishedAt": "2020-04-24T20:00:15Z", "content": "Monster Hunter Iceborne, which was recently launched on PC, has its latest update dropping soon called Title Update 13.5. The latest update is to be available on PS4, Xbox One, and PC soon! Two new monster variants are to be introduced in the Title Update 13.… [+3073 chars]"}, {"source": {"id": null, "name": "Businessinsider.com.au"}, "author": "Mary Meisenzahl", "title": "Facebook's new video chat Zoom competitor is coming soon — here's how the new feature works - Business Insider Australia", "description": "Facebook CEO Mark Zuckerberg announced on Friday the company is introducing 50-person video chatrooms.", "url": "https://www.businessinsider.com.au/facebook-messenger-rooms-video-chat-zoom-walkthrough-like-zoom-2020-4", "urlToImage": null, "publishedAt": "2020-04-24T19:44:33Z", "content": "<ul><li>Facebook just announced 50-person video chatrooms called Messenger Rooms.</li><li>\r\nThe new Messenger Rooms have some features in common with other video calling apps, like Zoom and Houseparty.\r\n</li><li>\r\nThe company says Messenger Rooms will be comi… [+3605 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "", "title": "Telegram promises secure group video calls sometime this year - Engadget", "description": "Telegram says it will add secure group video calls in 2020.", "url": "https://www.engadget.com/telegram-secure-group-video-calls-142035892.html", "urlToImage": null, "publishedAt": "2020-04-24T19:41:19Z", "content": "While Telegram didn’t release many details about the feature, it appears to be taking a dig at Zoom, which is facing pressure to fix several privacy issues. In response, Zoom has created a security council and promised upgrades, but that won’t stop competitor… [+831 chars]"}, {"source": {"id": null, "name": "Lifehacker.com.au"}, "author": "David Murphy", "title": "Are You Charging Your MacBook On The Wrong Side? - Lifehacker Australia", "description": "Yes, you read that headline correctly. There is apparently a “right” way and a “wrong” way to connect devices to a MacBook with Thunderbolt/USB-C ports on both sides. Doing it wrong can affect your computer’s performance....", "url": "https://www.lifehacker.com.au/2020/04/are-you-charging-your-macbook-on-the-wrong-side/", "urlToImage": null, "publishedAt": "2020-04-24T19:30:00Z", "content": "Yes, you read that headline correctly. There is apparently a right way and a wrong way to connect devices to a MacBook with Thunderbolt/USB-C ports on both sides. Doing it wrong can affect your computers performance.\r\nI recently encountered this knowledge on … [+3969 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Valve Source Code LEAKED - Hot off the Press Start #34 - GameFront", "description": "Support us on Patreon! - https://www.patreon.com/gamefront - James is back once more with the latest gaming news, including more bad news for GeForce Now, ju...", "url": "https://www.youtube.com/watch?v=D37UfGQ1x1o", "urlToImage": null, "publishedAt": "2020-04-24T18:47:41Z", "content": "Support us on Patreon! - https://www.patreon.com/gamefront - James is back once more with the latest gaming news, including more bad news for GeForce Now, justice for Warzone cheaters, and the source code for Team Fortress 2 and CS:GO leaking online.\r\n#GeForc… [+287 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "", "title": "Sony's excellent WH-1000XM3 headphones are only $238 at Newegg - Engadget", "description": "Sony's excellent WH-1000XM3 headphones are once again on sale. This time around, you can get them for $238.", "url": "https://www.engadget.com/sony-wh1000xm3-sale-newegg-135558070.html", "urlToImage": null, "publishedAt": "2020-04-24T18:19:07Z", "content": "Engadget's Devindra Hardawar gave the WH-1000XM3 a score of 94 when he reviewed them in 2018. They're comfortable, well-made and feature excellent noise cancelling capabilities. Bluetooth Codec support is similarly excellent with ACC, aptX HD and LDAC all pre… [+801 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "India TV Tech Desk", "title": "WhatsApp to soon start showing ads, rollout delayed by Facebook: Here’s what happened - India TV News", "description": "WhatsApp has become one of the most popular cross-platform instant messaging apps around the globe and it is now gearing up to serve advertisements to its users.", "url": "https://www.indiatvnews.com/technology/news-whatsapp-to-soon-start-showing-ads-rollout-delayed-by-facebook-610976", "urlToImage": null, "publishedAt": "2020-04-24T15:20:34Z", "content": "WhatsApp to soon introduce ads.\r\nWhatsApp has become one of the most popular cross-platform instant messaging apps around the globe. The Facebook-owned giant is now gearing up to serve advertisements to its users. The application has been free for a long time… [+1422 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Igor Bonifacic", "title": "Apple Watch Series 5 cellular models are $100 off - Yahoo Lifestyle", "description": "When it comes to fitness wearables, it's hard to do better than the Apple Watch Series 5, especially when both the 40mm and 40mm models are $100 off.", "url": "https://au.lifestyle.yahoo.com/apple-watch-series-5-sale-151420032.html", "urlToImage": null, "publishedAt": "2020-04-24T15:14:00Z", "content": "The Apple Watch Series 5, one of the best smartwatches you can buy, is currently on sale. Amazon has discounted the 40mm and 44mm GPS and cellular models by $100, making them $400 and $430, respectively. According to price tracker Camelcamelcamel, both are al… [+1587 chars]"}, {"source": {"id": null, "name": "Whathifi.com"}, "author": "Becky Scarrott", "title": "Save £170 on award-winning Astell & Kern SR15 hi-res music player - What Hi-Fi?", "description": "The excellent Astell & Kern A&norma SR15 is now on sale", "url": "https://www.whathifi.com/news/award-winning-astell-and-kern-hi-res-music-player-slashed-in-price-at-amazon", "urlToImage": null, "publishedAt": "2020-04-24T15:09:00Z", "content": "It's a familiar story: a shiny new kid appears on the block and the old guard receives a heavy discount. However, while a successor to the Astell &amp; Kern A&amp;norma SR15 has been announced, in the form of the A&amp;norma SR25, that revered old guard, the … [+1483 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "iPhone SE review, Canon EOS R5 new specs and Surface Pro 8 rumors | Noise Cancelling Podcast 008 - TechRadar", "description": "More tech news and painfully honest reviews from Gareth and Sherri as they’re joined by two new voices: Kimberly Gedeon of Laptop Mag and TechRadar Cameras e...", "url": "https://www.youtube.com/watch?v=bPYeSWVgSXw", "urlToImage": null, "publishedAt": "2020-04-24T15:00:19Z", "content": "More tech news and painfully honest reviews from Gareth and Sherri as theyre joined by two new voices: Kimberly Gedeon of Laptop Mag and TechRadar Cameras editor, Mark Wilson. \r\nTOPIC TIMESTAMPS03:52 - Canon EOS R508:36 - PS5 Robot Friends12:46 - Surface Pro … [+992 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Future Games Show Announcement Trailer - Coming June 2020 - GamesRadar", "description": "See the most exciting console, mobile and streaming games of 2020 in one show with a mixture of exclusives, deep dives and developer interviews. Coming June ...", "url": "https://www.youtube.com/watch?v=DbLFsALqD_0", "urlToImage": null, "publishedAt": "2020-04-24T15:00:12Z", "content": "See the most exciting console, mobile and streaming games of 2020 in one show with a mixture of exclusives, deep dives and developer interviews. Coming June 2020.Subscribe to Gamesradar: http://goo.gl/cnjsn1"}, {"source": {"id": null, "name": "Zdnet.com"}, "author": "Daphne Leprince-Ringuet", "title": "Coronavirus contact-tracing app: Here’s how we’ll protect your privacy, says NHS - ZDNet", "description": "NHS insists the public's data is safe in the hands of the health services. Privacy campaigners want more detail.", "url": "https://www.zdnet.com/article/coronavirus-contact-tracing-app-heres-how-well-protect-your-privacy-says-nhs/", "urlToImage": null, "publishedAt": "2020-04-24T14:18:00Z", "content": "To earn the trust of the public, privacy will be fundamental to the building the coronavirus contact-tracing app that the UK government is working on, NHSX boss Matthew Gould has said in a new post detailing the organization's commitment to confidentiality - … [+6376 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": "www.facebook.com/christian.n.puno", "title": "Apple will release a new Mac laptop away from Intel - Micky News", "description": "Apple will release a new Mac laptop next year with its processors away from intel, giving users better performance.", "url": "https://micky.com.au/apple-will-release-a-new-mac-laptop-away-from-intel/", "urlToImage": null, "publishedAt": "2020-04-24T13:52:47Z", "content": "It is no doubt that Apple products usually cost high, but users often report it has excellent performance. Apple will release its new Mac laptop next year, according to Bloomberg. It is also said to have more improvements included.\r\nWhat is With the New Mac L… [+3233 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Ryzen 3 3100 and Ryzen 3 3300X Have Very Different CCX Configurations - WccftechTV", "description": "Both Ryzen 3 chips may look the same on the surface, but it's what is going on inside that CCD that is very different. https://wccftech.com/ryzen-3-3100-and-...", "url": "https://www.youtube.com/watch?v=ZaId9IIfeHE", "urlToImage": null, "publishedAt": "2020-04-24T13:05:02Z", "content": null}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Joan E. Solsman", "title": "This Oculus Quest fitness app worked me so hard I forgot to breathe - CNET", "description": "Supernatural is a new spin on virtual reality fitness, and it may save me from backsliding into a lazy slug during lockdown.", "url": "https://www.cnet.com/news/supernatural-vr-fitness-mashup-of-pelaton-and-beat-saber-oculus-quest/", "urlToImage": null, "publishedAt": "2020-04-24T12:57:15Z", "content": "Supernatural sets game-ified, choreographed workouts to popular music in virtual reality. \r\nWithin\r\nSupernatural, a new virtual realityfitness game you can play in your home, isn't playing around. I sweat so hard I have to guzzle five glasses of water for eve… [+9525 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Rachel England", "title": "Nintendo blocks legacy logins after 160,000 accounts were compromised (update) - Yahoo Finance Australia", "description": "Some 160,000 Switch users have been the subject of a data breach.", "url": "https://au.finance.yahoo.com/news/nintendo-blocks-legacy-logins-data-breach-account-120610588.html", "urlToImage": null, "publishedAt": "2020-04-24T12:06:00Z", "content": "Nintendo has shut down NNID logins and is encouraging Switch owners to lock down their accounts after a wave of fraudulent attacks. Nintendo itself has confirmed that the platform has fallen foul of hackers, who are accessing accounts and using linked PayPal … [+3633 chars]"}, {"source": {"id": null, "name": "Happygamer.com"}, "author": "Joshua Goodpastor", "title": "SoundSelf: A Technodelic Is A Unique Soundbased VR Experience Now Availiable For Both PC And Mac VR Systems - Happy Gamer", "description": "Andromeda Entertainment has announced a unique video game experience in an immersive VR world. SoundSelf: A Technodelic is a unique and entrancing...", "url": "https://happygamer.com/soundself-a-technodelic-is-a-unique-soundbased-vr-experience-now-availiable-for-both-pc-and-mac-vr-systems-63644/", "urlToImage": null, "publishedAt": "2020-04-24T09:42:12Z", "content": "Andromeda Entertainment has announced a unique video game experience in an immersive VR world. SoundSelf: A Technodelic is a unique and entrancing experience that takes players on a meditative journey. The game is controlled using your own voice as you hum an… [+2237 chars]"}, {"source": {"id": null, "name": "7news.com.au"}, "author": "AAP", "title": "Apple says ‘no evidence’ a flaw in iPhone email app is security risk for customers - 7NEWS.com.au", "description": "A flaw in an iPhone email app has been exposed but Apple says there is no security risk to its more than half a billion users.", "url": "https://7news.com.au/technology/apple-says-no-evidence-a-flaw-in-iphone-email-app-is-security-risk-for-customers-c-997338", "urlToImage": null, "publishedAt": "2020-04-24T07:01:00Z", "content": "Apple Inc says it has found no evidence a flaw in its email app for iPhones and iPads has been used against customers.\r\nAnd it believes the flaw does not pose an immediate risk to our users.\r\nWatch the video above\r\nSan Francisco-based security firm ZecOps on … [+1400 chars]"}, {"source": {"id": null, "name": "Who.com.au"}, "author": null, "title": "Brendon Fevola slammed for promoting gambling game - Who", "description": "Brendan Fevola and love island star Dom Thomas has been heavily criticised for promoting an online poker machine game.", "url": "https://www.who.com.au/brendon-fevola-slammed-for-promoting-gambling-game", "urlToImage": null, "publishedAt": "2020-04-24T06:17:00Z", "content": "Reforemed gambler Brendan Fevola has been slammed for promoting a slot machine app.\r\n'This awful game being promoted by Dom Thomas and Brendan Fevola is a gateway to gambling addiction and a very real concern with so many of us staying at home during the COVI… [+740 chars]"}, {"source": {"id": null, "name": "Dailymercury.com.au"}, "author": "Grant Edwards", "title": "BMW returns to the original performance flavour - Daily Mercury", "description": "After a diversion from the native recipe, BMW has rediscovered its performance mojo with the 3 Series.", "url": "https://www.dailymercury.com.au/news/bmw-returns-to-the-original-performance-flavour/4002041/", "urlToImage": null, "publishedAt": "2020-04-24T05:28:00Z", "content": "Once BMWs bread and butter, the 3 Series of the new millennium had a tendency to be bland.\r\nGood to drive, yes. Hard to fault, absolutely. But there was little to inspire or excite.\r\nThe compact sedan was lost in a sea of SUVs and swoopy-backed offshoots.\r\nGl… [+4988 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": null, "title": "The Music of Resident Evil 3: A remake of sight and sound - ABC News", "description": "Indulge in a little nostalgia as Game Show features music from new revitalisations of video games from the 90s and early 2000s.", "url": "https://www.abc.net.au/classic/programs/game-show/resident-evil-3/12162076", "urlToImage": null, "publishedAt": "2020-04-24T05:00:00Z", "content": "The 1990s featured many games still beloved and celebrated today for their compelling stories, memorable gameplay, and incredible soundtracks. \r\nSome are remembered for how they pushed against the hardware limitations of the time, while others turned those li… [+1436 chars]"}, {"source": {"id": null, "name": "Eftm.com"}, "author": "http://facebook.com/trevorlong", "title": "iPhone SE Review: Bang for your buck it’s out of this world. - EFTM", "description": "There’s no beating around the bush, smartphones have gotten more and more expensive over recent years, and that’s not just the fault of the Aussie dollar – it’s a competitive market, and consumers have been asking more from the big tech giants. That’s why you…", "url": "https://eftm.com/2020/04/iphone-se-review-bang-for-your-buck-its-out-of-this-world-74881", "urlToImage": null, "publishedAt": "2020-04-24T04:18:45Z", "content": "There’s no beating around the bush, smartphones have gotten more and more expensive over recent years, and that’s not just the fault of the Aussie dollar – it’s a competitive market, and consumers have been asking more from the big tech giants.\r\nThat’s why yo… [+5184 chars]"}, {"source": {"id": null, "name": "Gameconsole.co.nz"}, "author": "Lama Farhat", "title": "Game review: One month with Animal Crossing New Horizons - FutureFive Australia", "description": "If you own a Switch and don’t own a copy of Animal Crossing, then you should probably go get one.", "url": "https://gameconsole.co.nz/story/game-review-one-month-with-animal-crossing-new-horizons", "urlToImage": null, "publishedAt": "2020-04-24T04:16:04Z", "content": "Animal Crossing New Horizons is one of those games that makes Nintendo Stand out from the crowd. It is the type of console exclusive that will make Xbox and PlayStation owners rush to the store to buy a Nintendo Switch. The Franchise has been a fan favourite … [+5296 chars]"}, {"source": {"id": null, "name": "Gadgetguy.com.au"}, "author": null, "title": "Review: Malwarebytes Privacy – a new paid VPN provider - GadgetGuy", "description": "Malwarebytes Privacy is a new VPN (virtual private network) from the same company that has one of, if not the best malware detection and removal solutions Malwarebytes Privacy", "url": "https://www.gadgetguy.com.au/product/malwarebytes-privacy-a-new-paid-vpn-provider/", "urlToImage": null, "publishedAt": "2020-04-24T03:46:22Z", "content": "Malwarebytes Privacy a new paid VPN provider\r\nMalwarebytes Privacy is a new VPN (virtual private network) from the same company that has one of, if not the best malware detection and removal solutions on the planet.\r\nWhile I trust Norton Lifelock, McAfee and … [+2950 chars]"}, {"source": {"id": null, "name": "Distractify.com"}, "author": "Brittany Vincent", "title": "Should You Take Shinra's Stairs or Elevator in 'Final Fantasy 7 Remake'? - Distractify", "description": "In 'Final Fantasy 7 Remake', your choices matter. That's why we've got the lowdown for you on which you should make at the Shinra Building.", "url": "https://www.distractify.com/p/ff7-remake-stairs-or-elevator", "urlToImage": null, "publishedAt": "2020-04-24T02:37:00Z", "content": "Final Fantasy 7 Remake is a game that's filled with several important crossroads throughout its whimsical adventure. Sometimes you might end up choosing a cool dress for Aerith or Tifa. Other times, you might end up making your play time with the game easier … [+2844 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Rebekah Scanlan", "title": "Isolation item earns Aussie $150k in 7 mins - Sunshine Coast Daily", "description": "Australian activewear sales boom during coronavirus lockdown", "url": "https://www.news.com.au/lifestyle/fitness/aussie-makes-150k-in-seven-minutes-off-new-isolation-musthave/news-story/764ecc100b4c25fb218aff38a227eeeb", "urlToImage": null, "publishedAt": "2020-04-24T01:43:00Z", "content": "While coronavirus has had a catastrophic effect on many businesses, the sudden change to everyday life has meant Aussies are spending their cash in unexpected places. Just ask Matilda Murray, who co-owns fitness apparel brand STAX with Don Robertson.\r\nShe sai… [+3914 chars]"}, {"source": {"id": null, "name": "Businessinsider.com.au"}, "author": "Chrissy Montelli", "title": "How to connect a PS4 controller to your Android phone or tablet to play games with it - Business Insider Australia", "description": "", "url": "https://www.businessinsider.com.au/how-to-connect-ps4-controller-to-android-2020-4", "urlToImage": null, "publishedAt": "2020-04-24T01:29:00Z", "content": "Mobile games have become one of the most popular forms of gaming, with millions of Android users playing each day.\r\nBut did you know that it’s possible to play games on your Android using your PlayStation 4 controller? It’s true – and it’s not as tricky as it… [+1606 chars]"}, {"source": {"id": null, "name": "Press-start.com.au"}, "author": "Shannon Grixti", "title": "The First Three Seasons Of Sailor Moon Have Been Put On YouTube For Free - Press Start Australia", "description": "Crunchyroll has announced that they'll be putting the first three seasons of Sailor Moon onto YouTube starting today. As of now, the first 10 episodes have dropped and a further 10 episodes will drop each Friday until July. These episodes are from Sailor Moon…", "url": "https://press-start.com.au/news/2020/04/24/the-first-three-seasons-of-sailor-moon-have-been-put-on-youtube-for-free/", "urlToImage": null, "publishedAt": "2020-04-24T00:56:27Z", "content": "Crunchyroll has announced that they’ll be putting the first three seasons of Sailor Moon onto YouTube starting today.\r\nAs of now, the first 10 episodes have dropped and a further 10 episodes will drop each Friday until July. These episodes are from Sailor Moo… [+181 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Gordon Kelly", "title": "Google Just Gave Millions Of Users A Reason To Quit Chrome, Windows 10 - Forbes", "description": "Google has revealed an unfixable problem which may force you to pick between Windows 10 and Chrome.", "url": "https://www.forbes.com/sites/gordonkelly/2020/04/23/google-chrome-critical-security-exploit-windows-10-upgrade-warning-update-chrome-browser/", "urlToImage": null, "publishedAt": "2020-04-24T00:36:00Z", "content": "Google is always improving Chrome and it recently issued a brilliant (if long overdue) upgrade. That said, there have also been some recent controversial changes, security problems and data concerns and now Google has detailed a serious new problem in Chrome … [+2782 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew Webster", "title": "Travis Scott’s first Fortnite concert was surreal and spectacular - The Verge", "description": "Rapper Travis Scott performed a surreal concert inside of the battle royale game Fortnite, utilizing trippy visuals to create a musical performance that could only be possible in a digital space.", "url": "https://www.theverge.com/2020/4/23/21233637/travis-scott-fortnite-concert-astronomical-live-report", "urlToImage": null, "publishedAt": "2020-04-24T00:29:22Z", "content": "Sicko mode\r\nIf theres one thing you can say about Fortnites live events, its that they keep getting more ambitious. From the original rocket launch to the mech vs. kaiju battle to the black hole that wiped out an entire island, each new event is more elaborat… [+3098 chars]"}, {"source": {"id": null, "name": "Lifehacker.com.au"}, "author": "David Murphy", "title": "Unlock Nvidia's New App To Kill Annoying Background Noise - Lifehacker Australia", "description": "Gaming is great and all—especially during a pandemic, and especially now that you can play a souped-up version of Minecraft with real-time ray tracing—but you can now use your Nvidia graphics card to create real-life magic. Just look at this noise-cancelling …", "url": "https://www.lifehacker.com.au/2020/04/unlock-nvidias-new-app-to-kill-annoying-background-noise/", "urlToImage": null, "publishedAt": "2020-04-24T00:15:00Z", "content": "Gaming is great and allespecially during a pandemic, and especially now that you can play a souped-up version of Minecraft with real-time ray tracingbut you can now use your Nvidia graphics card to create real-life magic. Just look at this noise-cancelling de… [+2494 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Leah Williams", "title": "Steam's Weekend Deals Feature Some Must-Have Indies - Kotaku Australia", "description": "Every weekend lately, Steam has been spotlighting sales from indie developers. This weekend, it's Annapurna Interactive's turn — and there's a bunch of fantastic games on sale that come highly recommended....", "url": "https://www.kotaku.com.au/2020/04/steam-weekend-indie-sale/", "urlToImage": null, "publishedAt": "2020-04-23T23:33:00Z", "content": "Every weekend lately, Steam has been spotlighting sales from indie developers. This weekend, it's Annapurna Interactive's turn and there's a bunch of fantastic games on sale that come highly recommended.\r\nEmotional family tale What Remains of Edith Finch lead… [+2320 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Leah Williams", "title": "Horizon Zero Dawn 2 Rumours Spread After Developers Delete A Tweet - Kotaku Australia", "description": "In a now-deleted tweet, Horizon Zero Dawn developers Guerilla Games listed a job posting for a Senior AI Programmer that included the hashtag #ps5. It's kicked off speculation that the team could be working on an exclusive PlayStation 5 sequel for the much-lo…", "url": "https://www.kotaku.com.au/2020/04/horizon-zero-dawn-2-rumours/", "urlToImage": null, "publishedAt": "2020-04-23T23:31:00Z", "content": "In a now-deleted tweet, Horizon Zero Dawn developers Guerilla Games listed a job posting for a Senior AI Programmer that included the hashtag #ps5. It's kicked off speculation that the team could be working on an exclusive PlayStation 5 sequel for the much-lo… [+2268 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Nathan Grayson", "title": "You Can Finally Apologise For Being Trash In Overwatch - Kotaku Australia", "description": "Who doesn’t love voice lines in Overwatch? They let you say hello. They can help your teammates stay abreast of your ultimate percentage. If you play DPS, you can use them to spam messages about how you need healing until everybody else’s ears seal closed lik…", "url": "https://www.kotaku.com.au/2020/04/you-can-finally-apologize-for-being-trash-in-overwatch/", "urlToImage": null, "publishedAt": "2020-04-23T23:30:00Z", "content": "Who doesnt love voice lines in Overwatch? They let you say hello. They can help your teammates stay abreast of your ultimate percentage. If you play DPS, you can use them to spam messages about how you need healing until everybody elses ears seal closed like … [+2085 chars]"}, {"source": {"id": null, "name": "Lifehacker.com.au"}, "author": "David Murphy", "title": "How To Customise Your Background In Skype Video Calls - Lifehacker Australia", "description": "There’s little I enjoy more than a the well-executed use of a silly background in a video chat. While this quirky feature used to be exclusive to Zoom, more apps are integrating the functionality—including, recently, Microsoft Teams, and now, Microsoft’s own …", "url": "https://www.lifehacker.com.au/2020/04/how-to-customize-your-background-in-skype-video-calls/", "urlToImage": null, "publishedAt": "2020-04-23T23:30:00Z", "content": "Theres little I enjoy more than a the well-executed use of a silly background in a video chat. While this quirky feature used to be exclusive to Zoom, more apps are integrating the functionalityincluding, recently, Microsoft Teams, and now, Microsofts own Sky… [+1265 chars]"}, {"source": {"id": null, "name": "Ausdroid.net"}, "author": null, "title": "Google rolling out Android 11 DP3 to various Pixel phones today - Ausdroid", "description": "This year Google’s developer previews for Android 11 has been not just premonitions for Android 11 but also for Pixel phones this year with some of the new features we are seeing in developer previews making it into stable Android 10 builds on a monthly basis…", "url": "https://ausdroid.net/2020/04/24/google-rolling-out-android-11-dp3-to-various-pixel-phones-today/", "urlToImage": null, "publishedAt": "2020-04-23T22:48:14Z", "content": "This year Google’s developer previews for Android 11 has been not just premonitions for Android 11 but also for Pixel phones this year with some of the new features we are seeing in developer previews making it into stable Android 10 builds on a monthly basis… [+1551 chars]"}, {"source": {"id": null, "name": "Techrepublic.com"}, "author": "Brandon Vigliarolo", "title": "Google Meet: 4 new features in this Zoom alternative - TechRepublic", "description": "Google's enterprise video chat app, Google Meet, now has tiled layouts, higher-quality video sharing, and other user-requested features.", "url": "https://www.techrepublic.com/article/google-meet-4-new-features-in-this-zoom-alternative/", "urlToImage": null, "publishedAt": "2020-04-23T21:37:00Z", "content": "Google's enterprise video chat app, Google Meet, now has tiled layouts, higher-quality video sharing, and other user-requested features.\r\n Google has announced the rollout of four highly requested features to its Meet enterprise video conferencing service. \"R… [+3460 chars]"}, {"source": {"id": null, "name": "Kotaku.com"}, "author": "Ian Walker", "title": "Binding Of Isaac Mod Helps Woman Propose To Her Significant Other - Kotaku", "description": "I’ve never proposed to anybody, but I can imagine it would be pretty anxiety-provoking. I totally understand why some folks prefer to let their favorite video games do the talking. Last week, an Australian woman sat her significant other down to play a modded…", "url": "https://kotaku.com/binding-of-isaac-mod-helps-woman-propose-to-her-signifi-1843029000", "urlToImage": null, "publishedAt": "2020-04-23T21:15:37Z", "content": "Ive never proposed to anybody, but I can imagine it would be pretty anxiety-provoking. I totally understand why some folks prefer to let their favorite video games do the talking. Last week, an Australian woman sat her significant other down to play a modded … [+2707 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Oscar Gonzalez", "title": "Call of Duty Warzone: Cheaters punished, new modes and everything else you need to know - CNET", "description": "Drop in and survive the 150-player battle royale match.", "url": "https://www.cnet.com/news/call-of-duty-warzone-cheaters-punished-new-modes-and-everything-else-you-need-to-know/", "urlToImage": null, "publishedAt": "2020-04-23T20:54:57Z", "content": "Don't expect to build any forts in Warzone.\r\nActivision\r\nCall of Duty: Warzone is the upcoming battle royale mode for the popular military FPS game. Similar to games like Fortnite and Apex Legends, players will compete against other players to survive until t… [+5699 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Here's What You Need to Know About the NEW Sonos Radio Service - GetConnected Media", "description": "https://getconnectedmedia.com - Sonos Radio is arriving in Canada. The FREE ad-supported service is available exclusively to Sonos users and ties together ov...", "url": "https://www.youtube.com/watch?v=-dq1aWvaCtQ", "urlToImage": null, "publishedAt": "2020-04-23T20:52:48Z", "content": "https://getconnectedmedia.com - Sonos Radio is arriving in Canada. The FREE ad-supported service is available exclusively to Sonos users and ties together over 60,000 radio stations from around the world. This dedicated experience offers better categorization… [+1550 chars]"}, {"source": {"id": null, "name": "Couriermail.com.au"}, "author": "Jennifer Dudley-Nicholson", "title": "Is Apple's cheap iPhone worth it? - Lismore Echo", "description": "Apple’s newest iPhone is a device for our times — cheap, powerful, and good with sweat pants — but we look at whether it is good enough to justify an upgrade.", "url": "https://www.couriermail.com.au/technology/smartphones/apples-cheapest-smartphone-reviewed-is-the-second-iphone-se-worth-buying/news-story/3dfba58584edb8fd34495ca267c70b73", "urlToImage": null, "publishedAt": "2020-04-23T19:50:00Z", "content": "Apple's 2020 iPhone might be the perfect device for this year.\r\nAnd, no, that doesn't mean it's a disaster that few anticipated.\r\nThe second iPhone SE ticks the boxes of our time because (a) it's frugal, (b) it's pocketable enough to wear around the house in … [+3775 chars]"}, {"source": {"id": null, "name": "Notebookcheck.net"}, "author": "Alex Alderson", "title": "AirTags, iMac redesign, MacBook Pro 14, new MacBook Pro 16 and more Apple hardware refreshes due by Q4 2020 - Notebookcheck.net", "description": "From the MacBook Pro 14 to the iPhone 12 and everything in between, Apple is planning a bumper hardware refresh by the end of the year. Expect new iMacs, AirTags, Watch Series 6 and MacBook Pro 16 releases.", "url": "https://www.notebookcheck.net/AirTags-iMac-redesign-MacBook-Pro-14-new-MacBook-Pro-16-and-more-Apple-hardware-refreshes-due-by-Q4-2020.462283.0.html", "urlToImage": null, "publishedAt": "2020-04-23T18:07:02Z", "content": "Apple is planning to release a bevvy of new hardware, according to Mark Gurman. Summarised in the graphic below and by MacRumors, Gurman has given credence to multiple rumours about upcoming Apple hardware that have been floating around for a few months now.\r… [+1738 chars]"}, {"source": {"id": null, "name": "Notebookcheck.net"}, "author": "Deirdre O Donnell", "title": "Huawei launches the new MatePad 10.4 in China - Notebookcheck.net", "description": "Huawei's latest tablet is the MatePad 10.4, a slate with a 2K display with the diagonal length it is named for. It is powered by the Kirin 810 and has 4GB or 6GB RAM options, which come in Wi-Fi only and Wi-Fi or LTE SKUs. The OEM has revealed that its starts…", "url": "https://www.notebookcheck.net/Huawei-launches-the-new-MatePad-10-4-in-China.462434.0.html", "urlToImage": null, "publishedAt": "2020-04-23T18:07:02Z", "content": "Huawei has unleashed its new MatePad on the Chinese market today (April 23, 2020). As projected in its recent leaks, it has an \"exclusive education center\" described as full of appropriately engaging content for various age ranges. The user will consume this … [+1314 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Motorola Edge+ unboxing and first impressions - Neowin", "description": "Unboxing and first impressions of Motorola's reentry into the flagship space with the Edge+. It packs a Snapdragon 865 chipset, 12GB RAM, 256GB of UFS 3.0 st...", "url": "https://www.youtube.com/watch?v=OVxig_gFfbc", "urlToImage": null, "publishedAt": "2020-04-23T17:09:54Z", "content": "Unboxing and first impressions of Motorola's reentry into the flagship space with the Edge+. It packs a Snapdragon 865 chipset, 12GB RAM, 256GB of UFS 3.0 storage with Turbo Write, a 108MP main camera, and a 5,000mAh battery."}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Here’s How To Change Your Display Name In VALORANT | TheGamer - TheGamer", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiOWh0dHBzOi8vd3d3LnRoZWdhbWVyLmNvbS9jaGFuZ2UtZGlzcGxheS1uYW1lLWluLXZhbG9yYW50L9IBPWh0dHBzOi8vd3d3LnRoZWdhbWVyLmNvbS9jaGFuZ2UtZGlzcGxheS1uYW1lLWluLXZhbG9yYW50L2FtcC8?oc=5", "urlToImage": null, "publishedAt": "2020-04-23T16:15:44Z", "content": null}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Tech Desk", "title": "PUBG Mobile Ranked Arena Mode: What’s new, how to play - The Indian Express", "description": "Apart from this new Ranked Arena Mode, the EvoGround game mode selection tab also consists of multiple other game modes, including 4v4 Team Deathmatch mode, Domination, Arena Training, Arctic Mode, RageGear and PayLoad.", "url": "https://indianexpress.com/article/technology/gaming/pubg-mobile-ranked-arena-mode-is-here-6375425/", "urlToImage": null, "publishedAt": "2020-04-23T15:11:28Z", "content": "By: Tech Desk | New Delhi | \r\nUpdated: April 23, 2020 8:33:47 pm\r\nIn this, players will start off with a Bronze rank and with continuous matches can push their ranks all the way up to Ace.Tencent Games has released a new game mode, called the Ranked Arena Mod… [+2724 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Ethan Gach", "title": "Stop Killing This Poor Fallout 76 Radstag - Kotaku Australia", "description": "There’s a new mutant in town and it’ll lead you to treasure if you’re not a sociopath....", "url": "https://www.kotaku.com.au/2020/04/stop-killing-this-poor-fallout-76-radstag/", "urlToImage": null, "publishedAt": "2020-04-23T14:00:00Z", "content": "Theres a new mutant in town and itll lead you to treasure if youre not a sociopath.\r\nIf youve been playing Fallout 76 since last weeks Wastelanders update went live you may have run into a new type of irradiated deer called an Observant Radstag. Its friendly … [+1191 chars]"}, {"source": {"id": null, "name": "Notebookcheck.net"}, "author": "Alex Alderson", "title": "Claiming that Apple has underclocked the A13 Bionic in the iPhone SE is ridiculous, and here's why - Notebookcheck.net", "description": "Apple is underclocking the A13 Bionic in the iPhone SE, so the story goes. Citing AnTuTu scores, the new iPhone SE cannot match the performance set by the iPhone 11 Pro or iPhone 11 Pro Max, its A13 Bionic-powered siblings. However, there is little use in ded…", "url": "https://www.notebookcheck.net/Claiming-that-Apple-has-underclocked-the-A13-Bionic-in-the-iPhone-SE-is-ridiculous-and-here-s-why.462248.0.html", "urlToImage": null, "publishedAt": "2020-04-23T13:56:28Z", "content": "AnTuTu has published initial benchmark data for the new iPhone SE, and it is causing a stir. Brought to our attention by MySmartPrice and GSMArena, AnTuTu claims the 256 GB version of the iPhone SE scored 492,166 points. Before we compare this score to any ac… [+1866 chars]"}, {"source": {"id": null, "name": "Press-start.com.au"}, "author": "Shannon Grixti", "title": "Red Dead Redemption 2 Is Coming To Xbox Game Pass - Press Start Australia", "description": "In what is potentially one of the biggest gets so far, Microsoft has announced that Red Dead Redemption 2 is coming to Xbox Game Pass on consoles. The game will launch for Xbox Game Pass on May 7th . The bad news is that it's replacing another Rockstar game i…", "url": "https://press-start.com.au/news/xbox/2020/04/23/red-dead-redemption-2-is-coming-to-xbox-game-pass/", "urlToImage": null, "publishedAt": "2020-04-23T13:23:19Z", "content": "In what is potentially one of the biggest gets so far, Microsoft has announced that Red Dead Redemption 2 is coming to Xbox Game Pass on consoles. The game will launch for Xbox Game Pass on May 7th\r\n. The bad news is that it’s replacing another Rockstar game … [+292 chars]"}, {"source": {"id": null, "name": "Thenewdaily.com.au"}, "author": null, "title": "Facebook Messenger for children lands in Australia - The New Daily", "description": "Facebook's Messenger app for children has officially launched in Australia, allowing kids the chance to chat and video call their friends.", "url": "https://thenewdaily.com.au/life/tech/2020/04/23/facebook-messenger-kids-safe/", "urlToImage": null, "publishedAt": "2020-04-23T12:28:08Z", "content": "Facebook’s Messenger app for children has officially launched in Australia this week, allowing kids the opportunity to chat and video call their friends through the platform.\r\nNot dissimilar to the ‘full-grown’ version, the app has been gradually rolled out t… [+3936 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Moving Out - The First 18 Minutes of Gameplay - IGN", "description": "Watch the first three levels from the couch-moving co-op game.", "url": "https://www.youtube.com/watch?v=vTXwJGZtixk", "urlToImage": null, "publishedAt": "2020-04-23T12:00:35Z", "content": null}, {"source": {"id": null, "name": "Gamesradar.com"}, "author": "Heather Wald", "title": "Xbox Series X loading times are 4x faster says Gears of War developer - GamesRadar+ AU", "description": "The Coalition's Mike Rayner talks about what the Xbox Series X means for game developers", "url": "https://www.gamesradar.com/xbox-series-x-loading-times-are-4x-faster-says-gears-of-war-developer/", "urlToImage": null, "publishedAt": "2020-04-23T11:47:23Z", "content": "The Coalition's studio technical director Mike Rayner recently spoke about the capabilities of the Xbox Series X and what it will mean for game development going forward. \r\nIn an interview with Windows Central\r\n, Rayner spoke about the greatly improved Xbox S… [+2344 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Fortnite Midas' Mission: Visit The Agency, Hayman, and Greasy Graves in a Single Match - Cultured Vultures", "description": "The regular season of Fortnite is drawing to a close, but at least we have one more week of Midas' Mission challenges to dust off, along with the much-antici...", "url": "https://www.youtube.com/watch?v=W_RYcIwB81U", "urlToImage": null, "publishedAt": "2020-04-23T11:41:49Z", "content": null}, {"source": {"id": null, "name": "Pcmag.com"}, "author": "Matthew Humphries", "title": "Crucial Launches Its Fastest Ever M.2 SSD - PCMag", "description": "The P5 is a PCIe 3.0 x4 M.2 SSD capable of reaching 3,400MB/s read speeds and 3,000MB/s writes.", "url": "https://www.pcmag.com/news/crucial-launches-its-fastest-ever-m2-ssd", "urlToImage": null, "publishedAt": "2020-04-23T11:01:10Z", "content": "We're fast approaching the end of the road for PCIe 3.0 as PCIe 4.0 adoption begins by storage and motherboard manufacturers, but Crucial is offering us one more, \"extra fast\" 3.0 drive called the P5.\r\nThe Crucial P5 SSD is a PCIe x4 NVMe M.2 drive using Micr… [+1679 chars]"}, {"source": {"id": null, "name": "Notebookcheck.net"}, "author": "Sanjiv Sathiah", "title": "Here are the recommended PC specs for MS Flight Simulator - Notebookcheck.net", "description": "Microsoft has revealed the specifications required to power its all-new Flight Simulator on PC. In a pleasant surprise, a PC with mid-range specs from 2013 will be able to play it, but a higher end rig from 2019 will be best placed to demonstrate everything t…", "url": "https://www.notebookcheck.net/Here-are-the-recommended-PC-specs-for-MS-Flight-Simulator.462290.0.html", "urlToImage": null, "publishedAt": "2020-04-23T10:41:20Z", "content": "Microsofts all-new Flight Simulator has got the flight sim enthusiast community excited and rightly so as it features some spectacular visuals. If you dont have an Xbox One S or Xbox One X, you will need a PC with Windows 10 to run it and until now it has not… [+1266 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "2020 Mercedes-AMG A45 S review | First Australian drive of the thermonuclear hatchback! | Caradvice - CarAdvice.com", "description": "MORE: https://www.caradvice.com.au/844598/2020-mercedes-amg-a45-s-review/?utm_source=YouTube&utm_medium=text&utm_campaign=YT_DESC | SUBSCRIBE: http://cad.vc/...", "url": "https://www.youtube.com/watch?v=fktudM4UiYQ", "urlToImage": null, "publishedAt": "2020-04-23T10:27:18Z", "content": null}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Darren Allan", "title": "Windows 10 testers can now ‘chat’ to their PC in latest preview - TechRadar", "description": "Natural conversations with Cortana now enabled outside the US", "url": "https://www.techradar.com/news/windows-10-testers-can-now-chat-to-their-pc-in-latest-preview", "urlToImage": null, "publishedAt": "2020-04-23T09:44:00Z", "content": "Windows 10 has a new preview build out which enables Cortanas conversational skills in a number of regions worldwide.\r\nPreviously, Cortanas natural conversational skills were only available to US testers, but with the new build 19613 being pushed out to the f… [+1580 chars]"}, {"source": {"id": null, "name": "Digitalcameraworld.com"}, "author": "Louise Carey", "title": "Canon EOS R6 will reportedly be announced in May 2020 - Digital Camera World", "description": "The Canon EOS R6 might not have the gangbuster features of the R5, but it certainly looks set to impress", "url": "https://www.digitalcameraworld.com/news/canon-eos-r6-will-reportedly-be-announced-in-may-2020", "urlToImage": null, "publishedAt": "2020-04-23T08:41:00Z", "content": "We might be seeing the Canon EOS R6 a little sooner than we initially thought, with current rumors advising that it might be announced as early as May 2020. Considering the current global crisis, this might come as a surprise to some, who might have figured t… [+2189 chars]"}, {"source": {"id": null, "name": "Hitc.com"}, "author": "Callum Smith", "title": "Is Trials Of Mana multiplayer and two-player? Here’s how long the remake is to beat! - HITC - Football, Gaming, Movies, TV, Music", "description": "Everything you must know about whether Trials Of Mana features two-player multiplayer and how long it reportedly takes to beat this remake.", "url": "https://www.hitc.com/en-gb/2020/04/23/is-trials-of-mana-multiplayer-two-player-how-long-to-beat/", "urlToImage": null, "publishedAt": "2020-04-23T07:28:05Z", "content": "Everything you must know about whether Trials Of Mana features two-player multiplayer and how long it reportedly takes to beat this remake.\r\nSquare Enix are releasing another remake quickly on the heels of Final Fantasy VII which is said to be the fastest sel… [+2238 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "India TV Tech Desk", "title": "Fortnite for Android now available on Google Play Store: Here's how you can download - India TV News", "description": "After almost 18 months, Epic Games has finally released Fortnite on the Google Play Store for all Android users. Here's what you need to know.", "url": "https://www.indiatvnews.com/technology/news-fortnite-for-android-finally-comes-to-google-play-store-610130", "urlToImage": null, "publishedAt": "2020-04-23T07:15:00Z", "content": "Fortnite requires an additional download of 7.4GB\r\nFortnite is one of the most popular battle royale games. The game is available on multiple platforms including Android, iOS PS4, PC, Xbox and Nintendo Switch. For smartphones, the game was first introduced in… [+1432 chars]"}, {"source": {"id": null, "name": "Sahiwal.tv"}, "author": "Jeremy Spirogis", "title": "Curtain lifted from Motorola Edge, how is it totally different from larger variants? - Sahiwal Tv", "description": "Motorola has additionally launched Motorola Edge with its Edge + flagship cellphone, which is an inexpensive cellphone. Both the telephones had been to be launched within the Mobile World Congress…", "url": "https://sahiwal.tv/curtain-lifted-from-motorola-edge-how-is-it-different-from-bigger-variants/", "urlToImage": null, "publishedAt": "2020-04-23T06:17:00Z", "content": "Motorola has additionally launched Motorola Edge with its Edge + flagship cellphone, which is an inexpensive cellphone. Both the telephones had been to be launched within the Mobile World Congress (MWC) 2020 however as a consequence of Coronavirus, many main … [+1216 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Final Fantasy VII Remake Review Playthrough #3 - PlayStation Universe", "description": "Final Fantasy VII Remake has finally arrived! Well... the first game anyway. We're so excited about this release that we came up with the idea of starting a ...", "url": "https://www.youtube.com/watch?v=Z3uvdntfuxY", "urlToImage": null, "publishedAt": "2020-04-23T03:21:34Z", "content": null}]}