{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": "the-next-web", "name": "The Next Web"}, "author": "TNW Deals", "title": "Apple Airpods Pro are just the accessory for our new work-from-home lifestyle. - The Next Web", "description": "TLDR: With active noise cancellation, epic sound and a host of Apple-centric features, the Airpods Pro are perfect for making the home office really feel like the office.\nTrying to ...", "url": "https://thenextweb.com/offers/2020/04/26/apple-airpods-pro-are-just-the-accessory-for-our-new-work-from-home-lifestyle/", "urlToImage": null, "publishedAt": "2020-04-26T11:39:44Z", "content": "TLDR: With active noise cancellation, epic sound and a host of Apple-centric features, the Airpods Pro are perfect for making the home office really feel like the office.\r\nTrying to get work done in your house is never as simple as it seems. When youre in the… [+2376 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Jessica Dolcourt", "title": "Galaxy Fold 2 rumors: Stylus, 7.6-inch glass screen, price, August release - CNET", "description": "What will the cameras, features and price for Samsung's next foldable phone be? It's all up in the air for now.", "url": "https://www.cnet.com/news/galaxy-fold-2-rumors-stylus-7-6-inch-glass-screen-price-august-release/", "urlToImage": null, "publishedAt": "2020-04-26T11:24:10Z", "content": "Is the world ready for a second Galaxy Fold?\r\nAngela Lang/CNET\r\nThe phone world is in a weird place, with coronavirusquarantines and lockdowns causing phone sales to plunge by 38% by February compared to last year. Some companies are soldiering through to lau… [+8532 chars]"}, {"source": {"id": null, "name": "Venturebeat.com"}, "author": "Ian Hamilton, UploadVR", "title": "Supernatural gives you a better workout than Beat Saber … or any other VR fitness app - VentureBeat", "description": "After playing Supernatural this week, my legs are sore to a degree unmatched by Beat Saber, Pistol Whip, BoxVR, OhShape, or any other VR app.", "url": "https://venturebeat.com/2020/04/26/supernatural-gives-you-a-better-workout-than-beat-saber-or-any-other-vr-fitness-app/", "urlToImage": null, "publishedAt": "2020-04-26T10:36:06Z", "content": "After playing Supernatural this week, my legs are sore to a degree unmatched by Beat Saber, Pistol Whip, BoxVR, OhShape, or any other VR app.\r\nIts easy to see the influence of those earlier VR games on the new exercise and fitness software from Within, but Su… [+2143 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": null, "title": "‘League of Legends’ Mid-Season Invitational cancelled; Riot focuses on Worlds 2020 - Micky News", "description": "The League of Legends Mid-Season Invitation will not be happening this year. Riot Games will instead take the time to focus on Worlds 2020.", "url": "https://micky.com.au/league-of-legends-mid-season-invitational-cancelled-riot-focuses-on-worlds-2020/", "urlToImage": null, "publishedAt": "2020-04-26T09:35:40Z", "content": "The coronavirus pandemic cancels another highly anticipated big event this year. eSports followers were hopeful that the League of Legends 2020 MSI would still push through after being rescheduled in July.\r\nThe Global League of Legends Esports team has weighe… [+2845 chars]"}, {"source": {"id": null, "name": "Macworld.com"}, "author": "", "title": "Apple’s iPad Pro Magic Keyboard: The heavy truth - Macworld", "description": "It weighs as much as a laptop--and works like one. And it’s just one option among many.", "url": "https://www.macworld.com/article/3539648/heavy-truth-ipad-pro-magic-keyboard.html", "urlToImage": null, "publishedAt": "2020-04-26T09:10:32Z", "content": "When Apple announced the new Magic Keyboard for iPad Pro, it decided to play coy about how much it weighed. The result is that, despite some accurate speculation, none of us found out for sure until this week when the first keyboards arrived in the hands of r… [+5065 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Carina Stathis For Daily Mail Australia", "title": "Disneyland shares their secret recipe for grilled cheese - Daily Mail", "description": "Disneyland has shared its secret grilled cheese sandwich recipe for others to make in the comfort of their own home, as the magical theme parks remain closed due to coronavirus restrictions.", "url": "https://www.dailymail.co.uk/femail/food/article-8257797/Disneyland-shares-secret-recipe-grilled-cheese.html", "urlToImage": null, "publishedAt": "2020-04-26T08:24:47Z", "content": "Ingredients:\r\nCream Cheese Spread\r\n1/2 cup cream cheese\r\n1/2 cup shredded Double Gloucester or cheddar\r\n2 tablespoons heavy cream\r\n1/4 teaspoon coarse salt\r\nGarlic Spread\r\n1 cup mayonnaise\r\n1 &amp; 1/2 teaspoons minced garlic\r\n1/2 teaspoon coarse salt\r\nGrille… [+965 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Douglas Busvine", "title": "Germany flips on smartphone contact tracing, backs Apple and Google - Reuters", "description": "Germany changed course on Sunday over which type of smartphone technology it wanted to use to trace coronavirus infections, backing an approach supported by Apple and Google along with a growing number of other European countries.", "url": "https://www.reuters.com/article/us-health-coronavirus-europe-tech-idUSKCN22807J", "urlToImage": null, "publishedAt": "2020-04-26T08:03:22Z", "content": "BERLIN (Reuters) - Germany changed course on Sunday over which type of smartphone technology it wanted to use to trace coronavirus infections, backing an approach supported by Apple and Google along with a growing number of other European countries. \r\nChancel… [+3449 chars]"}, {"source": {"id": null, "name": "Itnews.com.au"}, "author": null, "title": "NSO ran US-based attack servers: Facebook - iTnews", "description": "Hundreds hacked via QuadraNet and AWS.", "url": "https://www.itnews.com.au/news/nso-ran-us-based-attack-servers-facebook-547219", "urlToImage": null, "publishedAt": "2020-04-26T06:50:00Z", "content": "Facebook has filed legal documents that it says shows that Israeli spyware vendor NSO Group ran command and control servers on American cloud providers, which the social network says were used to hack hundreds of WhatsApp users.\r\nSecurity researcher John Scot… [+2782 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Desire Athow", "title": "This 4TB PCIe SSD can make your Windows laptop feel more like a MacBook Pro - TechRadar", "description": "Assuming you have a compatible laptop, that is", "url": "https://www.techradar.com/news/this-4tb-pcie-ssd-can-make-your-windows-laptop-feel-more-like-a-macbook-pro", "urlToImage": null, "publishedAt": "2020-04-26T03:00:00Z", "content": "The Apple MacBook Pro 16 still holds bragging rights when it comes to the maximum storage capacity available in a traditional portable laptop. \r\nApple uses a proprietary approach, plugging memory chips directly into the motherboard to reach a whopping 8TB of … [+1489 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Tech Desk", "title": "You must check out these interesting new WhatsApp features to chat better - The Indian Express", "description": "At times, it becomes hard to keep a track of all the new features added to WhatsApp so we have listed all features/updates introduced recently.", "url": "https://indianexpress.com/article/technology/social/whatsapp-new-features-6378983/", "urlToImage": null, "publishedAt": "2020-04-26T02:55:24Z", "content": "By: Tech Desk | New Delhi | \r\nUpdated: April 26, 2020 8:24:03 am\r\nRecently added WhatsApp features that you should know about.WhatsApp is one of the most popular messaging services on the planet with over 2 billion worldwide users. The Facebook-owned platform… [+2585 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "admin", "title": "Android app network removed from Google Play Store - Jimmys Post", "description": "", "url": "https://www.news.com.au/technology/gadgets/mobile-phones/android-app-network-removed-from-google-play-store/news-story/aef721ceea32ed6c6f7ca08ee43375c7/", "urlToImage": null, "publishedAt": "2020-04-26T02:14:02Z", "content": "Google has reportedly removed more than 100 apps with tens of millions of downloads after allegations the apps were part of a co-ordinated group that may have violated store policies.The group allegedly involves at least 27 separate app developers (that could… [+7911 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": null, "title": "Huawei AppGallery: Can it replace the Google Play Store? - Micky News", "description": "With Huawei's P40 and P40 Pro only sporting Huawei Media Suite, can the Huawei AppGallery replace the Google Play Store?", "url": "https://micky.com.au/huawei-app-gallery-can-it-replace-the-google-play-store/", "urlToImage": null, "publishedAt": "2020-04-26T00:48:34Z", "content": "The departure of the Google Play Store on Huawei devices started when the U.S. imposed a trade ban on the Chinese OEM. This means that Huawei may run the Android software, but the Google Media Suite is not allowed.\r\nGmail, YouTube, Google Photos, and many mor… [+4628 chars]"}, {"source": {"id": null, "name": "Ausdroid.net"}, "author": null, "title": "LG Velvet specs leak: how good is your Korean? - Ausdroid", "description": "LG are looking to return to the top end of the smartphone market this year with the LG Velvet and all leaks and teasers so far point to it being a decent device. The phone is a great looking device housing mid to premium tier specs. Overnight we have seen a c…", "url": "https://ausdroid.net/2020/04/26/lg-velvet-specs-leak-how-good-is-your-korean/", "urlToImage": null, "publishedAt": "2020-04-26T00:28:53Z", "content": "LG are looking to return to the top end of the smartphone market this year with the LG Velvet and all leaks and teasers so far point to it being a decent device. The phone is a great looking device housing mid to premium tier specs.\r\nOvernight we have seen a … [+1552 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": null, "title": "Xbox Series X is an ‘absolute beast’ says former Playstation developer - Micky News", "description": "An industry veteran and former Playstation developer weigh in on Xbox Series X and PS5 comparisons calling the former an “absolute beast.”", "url": "https://micky.com.au/xbox-series-x-is-an-absolute-beast-says-former-playstation-developer/", "urlToImage": null, "publishedAt": "2020-04-26T00:11:00Z", "content": "Sony and Microsoft had long been neck and neck when it comes to developing gaming consoles. For a long time, Sonys Playstation sat on the top of the industry over Microsofts Xbox. However, things are soon about to change as Microsoft brings in what they are c… [+3147 chars]"}, {"source": {"id": null, "name": "Powerup-gaming.com"}, "author": "Leo Stevenson", "title": "Nautilus is Bilgewater's second Champion; introduces new Keywords Deep and Toss - PowerUp!", "description": "Hot on the heels of the Fizz reveal, Riot has announced Nautilus as Legend of Runeterra's second Champion for the Bilgewater region. A new Champion is", "url": "https://powerup-gaming.com/2020/04/26/nautilus-is-bilgewaters-second-champion-introduces-new-keywords-deep-and-toss/", "urlToImage": null, "publishedAt": "2020-04-25T23:49:05Z", "content": "Hot on the heels of the Fizz reveal, Riot has announced Nautilus as Legend of Runeterra’s second Champion for the Bilgewater region. A new Champion is exciting enough, however, Nautilus introduces two new Keywords and some new ways to play. When Legends of Ru… [+2285 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Ewan Spence", "title": "Apple Leak Reveals Radical New MacBook - Forbes", "description": "Apple's first ARM powered MacBook is expected to launch next year, as Tim Cook moves away from Intel's grasp.", "url": "https://www.forbes.com/sites/ewanspence/2020/04/25/apple-macbook-pro-arm-intel-new-leak-rumor-specs-release-date/", "urlToImage": null, "publishedAt": "2020-04-25T23:36:11Z", "content": "Apple may be preparing to update the 13-inch and 16-inch MacBook Pro machines to Intels tenth-generation processors, but its longstanding project to bring ARM power to its MacOS platform gathers pace, with reports today that a release in 2021 is on the cards.… [+6658 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": null, "title": "Facebook targets rivals with new video chat platform - Micky News", "description": "Facebook is expanding its offerings with a new video chat feature called Messenger Rooms that is likely to rile its competitors.", "url": "https://micky.com.au/facebook-targets-rivals-with-new-video-chat-platform/", "urlToImage": null, "publishedAt": "2020-04-25T22:33:00Z", "content": "On Friday, April 24, Facebook announced a raft of new features including a video calling platform for up to 50 people called Messenger Rooms.\r\nSince the COVID-19 induced global lockdown, two platforms already offering the same service have seen their usage nu… [+1251 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Kevin Knezevic", "title": "Pokemon Go April Abra Community Day Now Live: Shiny Abra, Bonuses, And Extended Hours - GameSpot", "description": "Pokemon Go's delayed Abra Community Day is now set for Saturday, April 25; here's everything you need to know about the event.", "url": "https://www.gamespot.com/articles/pokemon-go-april-abra-community-day-now-live-shiny/1100-6474599/", "urlToImage": null, "publishedAt": "2020-04-25T22:00:00Z", "content": "Pokemon Go's long-delayed Abra Community Day has finally arrived. The event, which was originally slated to take place on March 15 before developer Niantic postponed it due to the COVID-19 pandemic, will now be held today, April 25, more than a month after it… [+3241 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Lloyd Coombes", "title": "Best RPGs 2020: the top role-playing games for console and PC - Techradar Australia", "description": "Grab your broadsword and ready your controller", "url": "https://www.techradar.com/news/best-rpgs", "urlToImage": null, "publishedAt": "2020-04-25T21:07:32Z", "content": "Looking for the best RPGs (or role-playing games) around? Then you've come to the right place.\r\nThese days its more often than not that a game features RPG elements. Whether thats a skill tree, dialogue options, or anything else that was once a staple of the … [+13517 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Locking Villagers In Cages In Animal Crossing: New Horizons - The Vile Villager Episode 3 - GameSpot", "description": "On this episode of The Vile VIllager, Rob and Jake round up their villagers, trap them behind fences, and craft a maze riddled with Pitfall's for them to nav...", "url": "https://www.youtube.com/watch?v=yEhZi9AyhDM", "urlToImage": null, "publishedAt": "2020-04-25T21:00:13Z", "content": "On this episode of The Vile VIllager, Rob and Jake round up their villagers, trap them behind fences, and craft a maze riddled with Pitfall's for them to navigate.\r\nThe Vile Villager has returned, and this time they won't be satisfied with simply toying with … [+1050 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "admin", "title": "Porsche Cayman GT4 review: New range-topping baby 911 - Jimmys Post", "description": "", "url": "https://www.news.com.au/technology/innovation/motoring/luxury/porsche-cayman-gt4-review-new-rangetopping-baby-911/news-story/a5c402443dbd717c8400ca8bffe46cbf/", "urlToImage": null, "publishedAt": "2020-04-25T20:30:52Z", "content": "There is no sports mode in Porsches 718 Cayman GT4.No buttons on the racecar-spec steering wheel, and no safety assistance such as lane keeping assistance or active cruise control. Forget about self-parking systems, drift modes, fake engine noise or multi-col… [+3718 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Jon Fingas", "title": "iPhone SE can take portrait photos of non-humans using an app - Yahoo Lifestyle", "description": "Halide's updated camera apps let you snap iPhone SE portrait photos of anything, not just people.", "url": "https://au.lifestyle.yahoo.com/halide-camera-iphone-se-portaits-of-non-humans-195324723.html", "urlToImage": null, "publishedAt": "2020-04-25T19:53:00Z", "content": "The iPhone SE offers many things for the money, but a powerful portrait mode isnt one of them. Much like the iPhone XR, youre stuck taking portrait photos of people if you use the default camera app a problem at a time when youre supposed to avoid most human … [+747 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Fallout 76: Wastelanders Review - IGN", "description": "Fallout 76: Wastelanders reviewed by David Jagneaux on PlayStation 4 Pro. Also available on PC and Xbox One. \"With the Wastelanders update, Fallout 76 has ta...", "url": "https://www.youtube.com/watch?v=U-uDLErALu0", "urlToImage": null, "publishedAt": "2020-04-25T19:51:32Z", "content": "Fallout 76: Wastelanders reviewed by David Jagneaux on PlayStation 4 Pro. Also available on PC and Xbox One.\r\n\"With the Wastelanders update, Fallout 76 has taken a solid step in the right direction after its dire launch. New human NPCs bring a healthy dose of… [+633 chars]"}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "Riot Games' Closed Beta Game Valorant Comes Competitive Mode - Somag News", "description": "The new FPS game Valorant from Riot Games, which is currently in closed beta, adds competitive mode for players to face opponents at their own level. The new mod will be added with the 0.49 update. The FPS game Valorant, released by Riot Games, the developer …", "url": "https://www.somagnews.com/riot-games-closed-beta-game-valorant-comes-competitive-mode/", "urlToImage": null, "publishedAt": "2020-04-25T19:05:00Z", "content": "The new FPS game Valorant from Riot Games, which is currently in closed beta, adds competitive mode for players to face opponents at their own level. The new mod will be added with the 0.49 update.\r\nThe FPS game Valorant, released by Riot Games, the developer… [+2067 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Zack Zwiezen", "title": "New GTA Online Missions Are All About Preparing For A Recession - Kotaku Australia", "description": "Grand Theft Auto Online received a new update a few days ago that added six new missions. These missions are all about an old-time GTA Online character, Gerald, and his attempts to get ready for an upcoming recession. Five of them are good and one of them is …", "url": "https://www.kotaku.com.au/2020/04/new-gta-online-missions-are-all-about-preparing-for-a-recession/", "urlToImage": null, "publishedAt": "2020-04-25T18:00:00Z", "content": "Grand Theft Auto Online received a new update a few days ago that added six new missions. These missions are all about an old-time GTA Online character, Gerald, and his attempts to get ready for an upcoming recession. Five of them are good and one of them is … [+2803 chars]"}, {"source": {"id": null, "name": "Thetecheducation.com"}, "author": "Tarika Sharma", "title": "Nintendo Switch: Patch Notes 10.0.1 Update For The Popular Console - The Tech Education", "description": "Advertisement Nintendo Switch The Nintendo Switch is developed by Nintendo Platform Technology Development. Foxconn, Hosiden manufactured it. It was released on March 3, 2017 worldwide! So, basically it is a hybrid video game console. Well, it is designed to …", "url": "https://thetecheducation.com/nintendo-switch-patch-notes-10-0-1-update-for-extremely-popular-console-improvements-and-more/", "urlToImage": null, "publishedAt": "2020-04-25T17:36:29Z", "content": "Nintendo Switch\r\nThe Nintendo Switch is developed by Nintendo Platform Technology Development. Foxconn, Hosiden manufactured it. It was released on March 3, 2017 worldwide! So, basically it is a hybrid video game console.\r\nWell, it is designed to fit your lif… [+2087 chars]"}, {"source": {"id": null, "name": "9to5google.com"}, "author": null, "title": "Comment: Can we appreciate how much better Samsung’s software has gotten? - 9to5Google", "description": "Samsung was once the company that gave Android a bad name and it was all because of software. Let's look back at why TouchWiz was so hated.", "url": "https://9to5google.com/2020/04/25/samsung-software-improvements-years/", "urlToImage": null, "publishedAt": "2020-04-25T16:43:45Z", "content": "Shortly after the iPhone SE was announced, a conversation on Twitter ended with me on eBay buying Samsung’s 2014-released Galaxy Alpha on a whim. Today, I spent a bit of time playing around with the phone and it’s given me a new appreciation of just how much … [+3854 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Gareth Beavis", "title": "iPhone SE 2020 teardown reveals intriguing facts about battery and camera - TechRadar", "description": "Things are more similar than we anticipated", "url": "https://www.techradar.com/news/iphone-se-2020-teardown-reveals-intriguing-facts-about-battery-and-camera", "urlToImage": null, "publishedAt": "2020-04-25T16:21:00Z", "content": "Weve been waiting to see what parts are in Apples new iPhone - our iPhone SE review left us with a few questions we wanted answering, and iFixits iPhone SE early teardown has begun to provide a few of them.\r\nWhile theres still more to come when the full teard… [+2050 chars]"}, {"source": {"id": null, "name": "Newsdio.com"}, "author": null, "title": "This impressive Minecraft city was created by a team of professional builders • newsdio - NewsDio", "description": "The Minecraft community is known for its amazing creations, but this impressive city was built by professionals. City of Orario is an incredibly detailed 1500×1500 recreation of Labyrinth City of Orario from the DanMachi anime. Its centerpiece is a huge pilla…", "url": "https://newsdio.com/this-impressive-minecraft-city-was-created-by-a-team-of-professional-builders-%e2%80%a2-newsdio/99798/", "urlToImage": null, "publishedAt": "2020-04-25T16:09:00Z", "content": "The Minecraft community is known for its amazing creations, but this impressive city was built by professionals.City of Orario is an incredibly detailed 1500×1500 recreation of Labyrinth City of Orario from the DanMachi anime. Its centerpiece is a huge pillar… [+1091 chars]"}, {"source": {"id": null, "name": "Bleepingcomputer.com"}, "author": "Mayank Parmar", "title": "Microsoft Edge: New feature and improvements coming soon - BleepingComputer", "description": "Microsoft's Chromium-based Edge browser was released in January to consumers and enterprises and new features, and Microsoft has been busy adding new features to the browser to make it stand out from Google Chrome.", "url": "https://www.bleepingcomputer.com/news/microsoft/microsoft-edge-new-feature-and-improvements-coming-soon/", "urlToImage": null, "publishedAt": "2020-04-25T16:08:55Z", "content": "Microsoft's Chromium-based Edge browser was released in January to consumers and enterprises and new features, and Microsoft has been busy adding new features to the browser to make it stand out from Google Chrome.\r\nSome of these new features include a built-… [+2501 chars]"}, {"source": {"id": null, "name": "Androidauthority.com"}, "author": null, "title": "5 Android apps you shouldn't miss this week - Android Apps Weekly [315] - Android Authority", "description": "The 315th Android Apps Weekly is out! This week we talk about Fortnite in the Play Store, Facebook Gaming, and more.", "url": "https://www.androidauthority.com/android-apps-weekly-315-1110925/", "urlToImage": null, "publishedAt": "2020-04-25T16:02:36Z", "content": "Welcome to the 315th edition of Android Apps Weekly! Here are the big headlines from the last week:\r\n<ul><li>Zoom continues its tumultuous month in India. India didnt ban the app like other governments and companies. Instead, the countrys government deemed th… [+5466 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Matthew Forde", "title": "Sony slip-ups: ahead of the PS5, we look back at the PlayStation tech that just didn't work - TechRadar", "description": "They can't all be winners", "url": "https://www.techradar.com/news/sony-slip-ups-ahead-of-the-ps5-we-look-back-at-the-playstation-tech-that-just-didnt-work", "urlToImage": null, "publishedAt": "2020-04-25T16:00:00Z", "content": "As we motor towards the next generation of consoles, Sony currently holds all of the cards and will be looking to build upon the monumental success it found during the current generation. Its sometimes easy to forget just how well the PlayStation 4 has sold, … [+6393 chars]"}, {"source": {"id": null, "name": "Animenewsnetwork.com"}, "author": null, "title": "Japan Retro Game Association Will Gift 100 Super NES Consoles to Kids Stuck at Home - Anime News Network", "description": "Non-profit will give console, Donkey Kong Country, Final Fantasy VI games", "url": "https://www.animenewsnetwork.com/interest/2020-04-25/japan-retro-game-association-will-gift-100-super-nes-consoles-to-kids-stuck-at-home/.158962", "urlToImage": null, "publishedAt": "2020-04-25T16:00:00Z", "content": "The Japan Retro Game Association (JARGA) announced it will gift 100 Super Nintendo consoles to kids stuck at home due to COVID-19. JARGA will provide the consoles, adapters, one controller, and two games to each child. The association only asks for participan… [+820 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Mariella Moon", "title": "Former Apple designer drops Watch trivia on its fifth anniversary - Yahoo Finance Australia", "description": "Imran Chaudhri, Apple’s design lead for hardware from 1995 to 2016, dropped some details about Apple Watch’s history on its fifth anniversary.  While Chaudhri is no longer with the tech giant, he shared a photo of the Watch team on launch day, as well as a re…", "url": "https://au.finance.yahoo.com/news/former-apple-designer-drops-watch-trivia-on-its-fifth-anniversary-144849444.html", "urlToImage": null, "publishedAt": "2020-04-25T14:48:00Z", "content": "Imran Chaudhri, Apples design lead for hardware from 1995 to 2016, dropped some details about Apple Watchs history on its fifth anniversary. While Chaudhri is no longer with the tech giant, he shared a photo of the Watch team on launch day, as well as a repro… [+1881 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Zack Zwiezen", "title": "Battlefield V Will Get One Final Update In June - Kotaku Australia", "description": "Battlefield developers Dice announced earlier this week that one final update is coming to Battlefield V in June, though they will continue to combat cheaters even after this last update....", "url": "https://www.kotaku.com.au/2020/04/battlefield-v-will-get-one-final-update-in-june/", "urlToImage": null, "publishedAt": "2020-04-25T14:30:00Z", "content": "Battlefield developers Dice announced earlier this week that one final update is coming to Battlefield V in June, though they will continue to combat cheaters even after this last update.\r\nReleased in November 2018, Battlefield V took the popular series back … [+822 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "BARDOWN PLAYS PARTY GAMES: SUPER SMASH BROS. ULTIMATE - TSN", "description": "Prior to quarantine, Marissa, Jesse, Eric and Teddy put up their dukes in Super Smash Bros. Ultimate for the Nintendo Switch. Would Jesse's N64 abilities tra...", "url": "https://www.youtube.com/watch?v=utkNuTUD1Js", "urlToImage": null, "publishedAt": "2020-04-25T13:55:43Z", "content": null}, {"source": {"id": null, "name": "Businessinsider.com.au"}, "author": "Ben Gilbert", "title": "Nintendo says that at least 160000 Switch users' accounts have been hacked — here's how to make your account more secure with two-factor authentication - Business Insider Australia", "description": "Do you have a Nintendo Switch? Did you also have a Nintendo 3DS or Wii U?", "url": "https://www.businessinsider.com.au/how-to-set-up-nintendo-switch-two-factor-authentication-2020-4", "urlToImage": null, "publishedAt": "2020-04-25T12:50:00Z", "content": "<ul><li>Nintendo’s Switch game console is wildly popular, with over 50 million units sold – and it’s currently out of stock nearly everywhere due to increased demand as millions are forced indoors amid the coronavirus pandemic.</li><li>\r\nAs more people than e… [+2175 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Simon Parkin", "title": "Streets of Rage 4 review – the return of the beat 'em up - The Guardian", "description": "This lovingly created sequel offers all the action and fun of a 90s arcade game", "url": "https://www.theguardian.com/games/2020/apr/25/streets-of-rage-4-review-the-return-of-the-beat-em-up", "urlToImage": null, "publishedAt": "2020-04-25T12:04:06Z", "content": "In the Netflix animated series Hi Score Girl, a romantic comedy set in early-90s Japan, Haruo Yaguchi, a low-achieving high-school loner is whiling away his time in the local video game arcades when he meets Akira Ono, a popular wunderkind from a wealthy fami… [+4209 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Lynn La", "title": "iPhone SE vs. iPhone 8 comparison: Which $400 iPhone should you get? - CNET", "description": "Some retailers are still selling the iPhone 8 despite Apple discontinuing the device. But you should just get the new iPhone SE instead.", "url": "https://www.cnet.com/news/iphone-se-vs-iphone-8-spec-comparison-which-400-iphone-should-you-get/", "urlToImage": null, "publishedAt": "2020-04-25T11:28:26Z", "content": "In a bid to lure budget-minded iPhone fans, Apple debuted its new iPhone SE for 2020 on April 15 for $399 (£419, AU$749). It's a sequel to its 2016 iPhone of the same name. The new iPhone SE's specs are similar to the iPhone 8 from three years ago, which is l… [+8211 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "David Nield", "title": "Apple and Google explain more about the privacy of their Covid-19 tracking apps - TechRadar", "description": "\"Exposure notification\" will be opt in", "url": "https://www.techradar.com/news/apple-and-google-explain-more-about-the-privacy-of-their-covid-19-tracking-apps", "urlToImage": null, "publishedAt": "2020-04-25T10:30:00Z", "content": "In the not-too-distant future, we could all be walking around with a smartphone app designed to track and trace the spread of Covid-19. That has set some privacy alarm bells ringing, and now Apple and Google have explained more about how their apps will work … [+2089 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Matt Hanson", "title": "Smartphones are a bad deal – let's hope laptops don't go the same way - TechRadar", "description": "Opinion: forced obsolescence is a menace", "url": "https://www.techradar.com/news/smartphones-are-a-bad-deal-lets-hope-laptops-dont-go-the-same-way", "urlToImage": null, "publishedAt": "2020-04-25T10:00:00Z", "content": "Imagine buying a new laptop, only to find that three years later Microsoft/Apple stopped offering software updates for it, effectively forcing you to upgrade in order to ensure you had a machine that was secure and ran smoothly.\r\nAnd imagine that, during thos… [+5094 chars]"}, {"source": {"id": null, "name": "Gamerturn.com"}, "author": "Jack Jaff", "title": "‘Overwatch’ update on PTR adds changes to communications wheel - Gamer Turn", "description": "Although it’s already a couple of years old, Blizzard’s hit multiplayer shooter can still use some upgrades from time to time. As promised, the next Overwatch update will revamp the communication wheel – which has been requested by fans for a long time. Last …", "url": "https://www.gamerturn.com/overwatch-update-on-ptr-adds-changes-to-communications-wheel/", "urlToImage": null, "publishedAt": "2020-04-25T09:38:24Z", "content": "Although its already a couple of years old, Blizzards hit multiplayer shooter can still use some upgrades from time to time. As promised, the next Overwatch update will revamp the communication wheel which has been requested by fans for a long time.Last week,… [+2205 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": null, "title": "Big tech companies play crucial role during COVID-19 pandemic - Micky News", "description": "As the world races against the clock to find the cure against COVID-19, big tech companies are also stepping up to their role.", "url": "https://micky.com.au/big-tech-companies-play-crucial-role-during-covid-19-pandemic/", "urlToImage": null, "publishedAt": "2020-04-25T08:44:17Z", "content": "Before the widespread threat of the COVID-19 virus, big tech companies are among the most vilified industries. They are criticized over allegations of unethical data harvesting and tracking users.\r\nRecently, these very same critics are tapping the massive com… [+2510 chars]"}, {"source": {"id": null, "name": "Channelnews.com.au"}, "author": "David Richards", "title": "Was CES 2020 A Super Spreader For COVID-19 After Tens Of Thousands Of Chinese Poured Into The US Event From Wuhan & Hubei Provence. - ChannelNews", "description": null, "url": "https://www.channelnews.com.au/was-ces-2020-a-super-spreader-for-covid-19-after-tens-of-thousands-of-chinese-poured-into-the-us-event-from-wuhan-provence/", "urlToImage": null, "publishedAt": "2020-04-25T08:20:12Z", "content": "One third of CES the world’s biggest Consumer Electronics Show in Las Vegas is Chinese exhibitors and at the 2020 show. tens of thousands of Chinese visitors poured into the event which is now being investigated as a hot spot that helped propel COVID-19 in th… [+3655 chars]"}, {"source": {"id": null, "name": "Notebookcheck.net"}, "author": "Daniel R Deakin", "title": "AMD Ryzen 3 3300X starts cementing its position as a budget CPU champion by beating the Intel Core i3-10300 in Time Spy benchmark - Notebookcheck.net", "description": "An AMD Ryzen 3 3300X and an Intel Core i3-10300 have been spotted in a comparison on 3DMark’s Time Spy benchmark. In another blow for Team Blue, it appears that the new budget Matisse chip from AMD has the edge on the upcoming Comet Lake processor. The Ryzen …", "url": "https://www.notebookcheck.net/AMD-Ryzen-3-3300X-starts-cementing-its-position-as-a-budget-CPU-champion-by-beating-the-Intel-Core-i3-10300-in-Time-Spy-benchmark.462912.0.html", "urlToImage": null, "publishedAt": "2020-04-25T08:03:15Z", "content": "We already had some first benchmark results for both the AMD Ryzen 3 3300X and the Ryzen 3 3100, where both of the recently announced processors managed to thoroughly challenge Intels aging Kaby Lake Core i7-7700K desktop processor. However, it seems the Ryze… [+1184 chars]"}, {"source": {"id": null, "name": "Trueachievements.com"}, "author": "Heidi Nicholas", "title": "Sci-fi adventure Deliver Us The Moon joins Xbox Game Pass and Game Pass for PC today - TrueAchievements", "description": "Deliver Us The Moon is a sci-fi action adventure title which draws inspiration from movies such as Interstellar, and which joins the Xbox Game Pass and Xbox Game Pass for PC services today as a day one addition.", "url": "https://www.trueachievements.com/n41593/deliver-us-the-moon", "urlToImage": null, "publishedAt": "2020-04-25T07:59:53Z", "content": "The Xbox team has been busy lately: just yesterday, they surprise-dropped the announcement that Red Dead Redemption 2 will join Xbox Game Pass in May. Before that, they announced new titles for Xbox Game Pass, along with several new titles for Xbox Game Pass … [+1728 chars]"}, {"source": {"id": null, "name": "Pickr.com.au"}, "author": "Leigh :) Stark", "title": "Hisense looks to size, quality for 4K TVs in 2020 - Pickr", "description": "Democratising TV technology and making tellies affordable for all, Hisense is cleaning the range in 2020 and pulling back to two, with the choice down to size.", "url": "https://www.pickr.com.au/news/2020/hisense-looks-to-size-quality-for-4k-tvs-in-2020/", "urlToImage": null, "publishedAt": "2020-04-25T05:53:35Z", "content": "Democratising TV technology and making tellies affordable for all, Hisense is cleaning the range in 2020 and pulling back to two, with the choice down to size. \r\nIt’s not just Samsung and LG showing off their latest TVs, because it’s TV changeover season, whi… [+4671 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "NVIDIA RTX Voice Benchmark on GTX vs. RTX GPUs, Gaming Performance, & Voice Quality - Gamers Nexus", "description": "This benchmark tests NVIDIA RTX Voice for gaming performance impact, mostly to determine if RT hardware is even being used. 2080 Super, 2060, and GTX 1080 in...", "url": "https://www.youtube.com/watch?v=f_obMmLXlP4", "urlToImage": null, "publishedAt": "2020-04-25T04:03:07Z", "content": null}, {"source": {"id": null, "name": "Phonemantra.com"}, "author": "Admin", "title": "Microsoft asks to properly complain about the \"disastrous\" update of Windows 10, Problems are being studied - Phone Mantra", "description": "The recent planned update of the Windows 10 operating system has turned out to users a whole set of serious problems, complaints about which began almost immediately.", "url": "https://phonemantra.com/microsoft-asks-to-properly-complain-about-the-disastrous-update-of-windows-10-problems-are-being-studied/", "urlToImage": null, "publishedAt": "2020-04-25T01:38:00Z", "content": "The Windows 10 update on April 14th under KB4549951 was supposed to patch four very serious security holes in the operating system. The update was highly recommended for all users. \r\nAmong the complaints are the  blue screen of death, a global system crash, d… [+632 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Oscar Gonzalez", "title": "Travis Scott event in Fortnite: How to watch the encore and find the Giant Astro Heads - CNET", "description": "The rapper dropped new tracks in a jaw-dropping concert. Catch the next show at midnight.", "url": "https://www.cnet.com/news/travis-scott-event-in-fortnite-how-to-watch-the-encore-and-find-the-giant-astro-heads/", "urlToImage": null, "publishedAt": "2020-04-25T01:02:37Z", "content": "Play some Fortnite and listen to a new track from Travis Scott.\r\nEpic Games\r\nFortnite events aren't only for players to check out new content from developer Epic Games. The popular battle royale game has also played host to multiple premieres and collaboratio… [+3718 chars]"}, {"source": {"id": null, "name": "Ubergizmo.com"}, "author": "Tyler Lee", "title": "Samsung’s Smartwatches Get A New Blood Pressure Monitoring App - Ubergizmo", "description": "Our smartwatches are getting better at what they do, where they can monitor more than just our daily activities like our steps taken, calories burnt, and so on. For example, the Apple Watch comes with an ECG monitoring tool that can alert the wearer if there …", "url": "https://www.ubergizmo.com/2020/04/samsung-smartwatch-blood-pressure-monitor/", "urlToImage": null, "publishedAt": "2020-04-25T00:42:49Z", "content": "Our smartwatches are getting better at what they do, where they can monitor more than just our daily activities like our steps taken, calories burnt, and so on. For example, the Apple Watch comes with an ECG monitoring tool that can alert the wearer if there … [+1254 chars]"}, {"source": {"id": null, "name": "Ausdroid.net"}, "author": null, "title": "Google bringing “Live Captions” to phone calls - Ausdroid", "description": "When new features are added to Android they aren’t just added all at once. The developers usually add the code bit by bit and luckily for us we have some extremely clever folks over at XDA Developers who trawl through the code of newly released files to find …", "url": "https://ausdroid.net/2020/04/25/google-bringing-live-captions-to-phone-calls/", "urlToImage": null, "publishedAt": "2020-04-24T23:35:05Z", "content": "When new features are added to Android they aren’t just added all at once. The developers usually add the code bit by bit and luckily for us we have some extremely clever folks over at XDA Developers who trawl through the code of newly released files to find … [+2603 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": null, "title": "‘Monster Hunter World: Iceborne’ gets update 13.5, including two new monsters - Micky News", "description": "The version 13.5 update just arrived for Monster Hunter World: Iceborne brings in improvements, added crafts, and introduces two new monsters", "url": "https://micky.com.au/monster-hunter-world-iceborne-gets-update-13-5-including-two-new-monsters/", "urlToImage": null, "publishedAt": "2020-04-24T22:57:00Z", "content": "The rolled out update is available to both the PC and console versions of the game.\r\nThe version 13.5 update just arrived for Monster Hunter World: Iceborne that brings in improvements, added crafts, and introduces two new monsters for players to slay. The ro… [+3165 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": "www.facebook.com/christian.n.puno", "title": "Ford Mustang Cobra Jet 1400: Time for electric cars to take the limelight - Micky News", "description": "Time for electric cars to take limelight, Ford mechanics and scientists took this further. The result? 'Ford Mustang Cobra Jet 1400'", "url": "https://micky.com.au/ford-mustang-cobra-jet-1400-time-for-electric-cars-to-take-the-limelight/", "urlToImage": null, "publishedAt": "2020-04-24T22:43:00Z", "content": "The Ford Mustang Cobra Jet 1400 isnt a typical electric car. This cars creation coincided with drag racing in mind. Imagine how much electrical power it needs to go on such high speed. According to its creators, this monster car can reach a fourth of a mile w… [+2234 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Logitech G G203 LIGHTSYNC Promo Video - Techaeris", "description": "This is an overview of the new Logitech G G203 LIGHTSYNC Gaming Mouse. The video was provided by Logitech for resharing. Available in May buy here: https://w...", "url": "https://www.youtube.com/watch?v=i3_Ale_138I", "urlToImage": null, "publishedAt": "2020-04-24T21:57:36Z", "content": null}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "James O'Connor", "title": "Animal Crossing Update 1.2.0 Patch Notes: Look For Redd And Leif In Latest Update - GameSpot", "description": "The new Animal Crossing update adds new vendors, and makes a few other tweaks in the Nintendo Switch game.", "url": "https://www.gamespot.com/articles/animal-crossing-update-120-patch-notes-redd-and-le/1100-6476401/", "urlToImage": null, "publishedAt": "2020-04-24T20:11:00Z", "content": "The new Animal Crossing: New Horizons update, which brings the game up to version 1.2.0, is live now. It's a big one--it expands the museum and brings new vendors to your island. If 1.2.0 does not automatically download, you can search for a software update f… [+1903 chars]"}, {"source": {"id": null, "name": "Caradvice.com.au"}, "author": "Justin Narayan", "title": "Ford Mustang crowned the most successful sports car of 2019 - CarAdvice", "description": "America just wasn’t enough for the original pony car. The Ford Mustang has officially gone global. Last year saw the Mustang rise to the top of the sports car world, with recognition from fans from...", "url": "https://www.caradvice.com.au/845186/ford-mustang-crowned-the-most-successful-sports-car-of-2019/", "urlToImage": null, "publishedAt": "2020-04-24T20:05:00Z", "content": "More than 100,000 Mustangs were sold globally last year. Even though sales have waned in Australia, it remains one of Ford's most popular models.\r\nAmerica just wasn’t enough for the original pony car. The Ford Mustang has officially gone global.\r\nLast year sa… [+1907 chars]"}, {"source": {"id": null, "name": "Lifehacker.com.au"}, "author": "David Murphy", "title": "Are You Charging Your MacBook On The Wrong Side? - Lifehacker Australia", "description": "Yes, you read that headline correctly. There is apparently a “right” way and a “wrong” way to connect devices to a MacBook with Thunderbolt/USB-C ports on both sides. Doing it wrong can affect your computer’s performance....", "url": "https://www.lifehacker.com.au/2020/04/are-you-charging-your-macbook-on-the-wrong-side/", "urlToImage": null, "publishedAt": "2020-04-24T19:30:00Z", "content": "Yes, you read that headline correctly. There is apparently a right way and a wrong way to connect devices to a MacBook with Thunderbolt/USB-C ports on both sides. Doing it wrong can affect your computers performance.\r\nI recently encountered this knowledge on … [+3969 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Ian Walker", "title": "Final Fantasy VII Remake Made Me Climb 59 Flights Of Stairs And I Loved It - Kotaku Australia", "description": "I recently arrived at Shinra headquarters in my playthrough of Final Fantasy VII Remake. After Cloud and his squad fight their way through the parking garage, they enter the spacious reception area to find the place deserted. Our heroes have two ways to reach…", "url": "https://www.kotaku.com.au/2020/04/final-fantasy-vii-remake-made-me-climb-59-flights-of-stairs-and-i-loved-it/", "urlToImage": null, "publishedAt": "2020-04-24T19:00:00Z", "content": "I recently arrived at Shinra headquarters in my playthrough of Final Fantasy VII Remake. After Cloud and his squad fight their way through the parking garage, they enter the spacious reception area to find the place deserted. Our heroes have two ways to reach… [+3078 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Valve Source Code LEAKED - Hot off the Press Start #34 - GameFront", "description": "Support us on Patreon! - https://www.patreon.com/gamefront - James is back once more with the latest gaming news, including more bad news for GeForce Now, ju...", "url": "https://www.youtube.com/watch?v=D37UfGQ1x1o", "urlToImage": null, "publishedAt": "2020-04-24T18:47:41Z", "content": "Support us on Patreon! - https://www.patreon.com/gamefront - James is back once more with the latest gaming news, including more bad news for GeForce Now, justice for Warzone cheaters, and the source code for Team Fortress 2 and CS:GO leaking online.\r\n#GeForc… [+287 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Carly Page", "title": "The Dell XPS 15 2020 may have been redesigned to take on the MacBook Pro - TechRadar", "description": "Incoming model will boast smaller bezels and upward-firing speakers", "url": "https://www.techradar.com/news/the-dell-xps-15-2020-may-have-been-redesigned-to-take-on-the-macbook-pro", "urlToImage": null, "publishedAt": "2020-04-24T17:31:00Z", "content": "Dell looks poised to release an all-new version of its XPS 15 laptop that will take a number of design clues from the recently-revamped Dell XPS 13\r\n.\r\nThats according to leaked images posted on the Korea Energy Agency Efficiency Standardization Certification… [+2119 chars]"}, {"source": {"id": null, "name": "Lifehacker.com.au"}, "author": "Brendan Hesse", "title": "Don't Let Microsoft Word Judge You For Using Two Spaces Between Sentences - Lifehacker Australia", "description": "Microsoft has taken an official stance on one of the internet’s most divisive questions, firmly coming down on the side of minimalism in the “one-space versus two-spaces after a sentence” debate. Word’s automatic spelling and grammar checker will now flag any…", "url": "https://www.lifehacker.com.au/2020/04/dont-let-microsoft-word-judge-you-for-using-two-spaces-between-sentences/", "urlToImage": null, "publishedAt": "2020-04-24T17:15:00Z", "content": "Microsoft has taken an official stance on one of the internets most divisive questions, firmly coming down on the side of minimalism in the one-space versus two-spaces after a sentence debate. Words automatic spelling and grammar checker will now flag anythin… [+1903 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Daymare 1998 (Resident Evil 2 Tribute) - Official Console Launch Trailer - IGN", "description": "Daymare 1998, the Resident Evil 2 tribute game, finally arrives on PlayStation 4 and Xbox One on April 28th. Check out the official console launch trailer he...", "url": "https://www.youtube.com/watch?v=BiWnPEGvWcA", "urlToImage": null, "publishedAt": "2020-04-24T17:00:11Z", "content": null}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Leah Williams", "title": "The Good, The Bad, And The Annoying Of Borderlands 3's \"Revenge Of The Cartels\" Event - Kotaku Australia", "description": "It’s been less than a month since Borderlands 3’s latest big expansion landed with a bang, but vault hunters already have access to another brand-new playground in which they can fire 87 bazillion guns. It’s called Villa Ultraviolet. It’s drenched in neon and…", "url": "https://www.kotaku.com.au/2020/04/the-good-the-bad-and-the-annoying-of-borderlands-3s-revenge-of-the-cartels-event/", "urlToImage": null, "publishedAt": "2020-04-24T17:00:00Z", "content": "Its been less than a month since Borderlands 3s latest big expansion landed with a bang, but vault hunters already have access to another brand-new playground in which they can fire 87 bazillion guns. Its called Villa Ultraviolet. Its drenched in neon and gau… [+4795 chars]"}, {"source": {"id": null, "name": "Notebookcheck.net"}, "author": "Alex Alderson", "title": "Huawei FreeBuds 3i: Apple AirPods Pro clones that come with 24 dB(A) ANC and Quick Pairing - Notebookcheck.net", "description": "Huawei has ditched the design of the FreeBuds 3, according to leaked renders of new TWS earbuds published by WinFuture. Featuring a white design, silicone tips, ANC and a compact charging case, the FreeBuds 3i will likely be pitched as AirPods Pro competitors.", "url": "https://www.notebookcheck.net/Huawei-FreeBuds-3i-Apple-AirPods-Pro-clones-that-come-with-24-dB-A-ANC-and-Quick-Pairing.462687.0.html", "urlToImage": null, "publishedAt": "2020-04-24T16:45:46Z", "content": "Huawei has developed a new set of TWS earbuds, the FreeBuds 3i. Brought to our attention by WinFuture via Caschys Blog, the new set of TWS earbuds resemble a cross between the FreeBuds 3 and the original FreeBuds. The FreeBuds 3i look somewhat like the Apple … [+792 chars]"}, {"source": {"id": null, "name": "Androidheadlines.com"}, "author": null, "title": "Huawei MatePad Pro Review: Powerful, Beautiful & Google-Free - Android Headlines", "description": "The Huawei MatePad Pro is one of the best Android tablets on the market, without a doubt, as we found out in our full review of the device.", "url": "https://www.androidheadlines.com/2020/04/huawei-matepad-pro-review", "urlToImage": null, "publishedAt": "2020-04-24T15:35:58Z", "content": "The Huawei MatePad Pro is Huawei's new flagship tablet. This is the very first high-end tablet that the company announced without support for Google applications. The Huawei MatePad Pro comes with HMS (Huawei Mobile Services) pre-installed, instead of GMS (Go… [+21455 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "iPhone SE review, Canon EOS R5 new specs and Surface Pro 8 rumors | Noise Cancelling Podcast 008 - TechRadar", "description": "More tech news and painfully honest reviews from Gareth and Sherri as they’re joined by two new voices: Kimberly Gedeon of Laptop Mag and TechRadar Cameras e...", "url": "https://www.youtube.com/watch?v=bPYeSWVgSXw", "urlToImage": null, "publishedAt": "2020-04-24T15:00:19Z", "content": "More tech news and painfully honest reviews from Gareth and Sherri as theyre joined by two new voices: Kimberly Gedeon of Laptop Mag and TechRadar Cameras editor, Mark Wilson. \r\nTOPIC TIMESTAMPS03:52 - Canon EOS R508:36 - PS5 Robot Friends12:46 - Surface Pro … [+992 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Future Games Show Announcement Trailer - Coming June 2020 - GamesRadar", "description": "See the most exciting console, mobile and streaming games of 2020 in one show with a mixture of exclusives, deep dives and developer interviews. Coming June ...", "url": "https://www.youtube.com/watch?v=DbLFsALqD_0", "urlToImage": null, "publishedAt": "2020-04-24T15:00:12Z", "content": "See the most exciting console, mobile and streaming games of 2020 in one show with a mixture of exclusives, deep dives and developer interviews. Coming June 2020.Subscribe to Gamesradar: http://goo.gl/cnjsn1"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Christine Fisher", "title": "Telegram promises secure group video calls sometime this year - Yahoo Finance Australia", "description": "Telegram says it will add secure group video calls in 2020.", "url": "https://au.finance.yahoo.com/news/telegram-secure-group-video-calls-142035892.html", "urlToImage": null, "publishedAt": "2020-04-24T14:20:00Z", "content": "Now that the coronavirus pandemic has made video calls increasingly popular and critical, services like Zoom, Google Meet, WhatsApp and Telegram are vying for attention. Telegram seems to think it can get ahead by focusing on security. Today, the messaging ap… [+1329 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "XCOM: Chimera Squad Gameplay - WccftechTV", "description": "Review: https://wccftech.com/review/xcom-chimera-squad-successful-experiment/ XCOM: Chimera Squad is out now on PC via Steam. ►www.facebook.com/wccftech ►www...", "url": "https://www.youtube.com/watch?v=9YUdyq4yGoE", "urlToImage": null, "publishedAt": "2020-04-24T11:10:55Z", "content": "Review: https://wccftech.com/review/xcom-chim...\r\nXCOM: Chimera Squad is out now on PC via Steam.\r\nwww.facebook.com/wccftechwww.twitter.com/wccftechdotcomwww.youtube.com/WccftechTV\r\nVisit us daily at www.wccftech.com for the absolute latest in PC Hardware, Ga… [+33 chars]"}]}