{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Kotaku Australia"}, "author": null, "title": "Half-Life: Alyx Helped Change Valve’s Approach To Development - Kotaku Australia", "description": "Valve has famously had a flat, pick-your-own-project approach to game development. But with Half-Life: Alyx, all of that changed.", "url": "https://www.kotaku.com.au/2020/07/half-life-alyx-helped-change-valves-approach-to-development/", "urlToImage": "https://www.kotaku.com.au/content/uploads/sites/3/2020/07/10/making-of-half-life-alyx-1-1280x720.png", "publishedAt": "2020-07-10T01:18:00Z", "content": "Since the foundation of Valves now-famous no-management work style, the company always believed that staff would be the happiest if they picked their own projects.\r\nBut then Half-Life: Alyx came arou… [+2715 chars]"}, {"source": {"id": null, "name": "Micky News"}, "author": null, "title": "Thunderbolt will survive the Apple Silicon transition - Micky News", "description": "Thunderbolt support will still be available on future Apple Silicon powered devices as guaranteed by the company itself.", "url": "https://micky.com.au/thunderbolt-will-survive-the-apple-silicon-transition/", "urlToImage": "https://micky.com.au/wp-content/uploads/2020/07/shutterstock_1480682231-1.jpg", "publishedAt": "2020-07-10T00:39:49Z", "content": "WWDC 2020 marked the end of the Intel era with Apple. Tim Cook announced that the company is taking the next step in its computer development phase. As such, the Apple Silicon change was announced. C… [+2589 chars]"}, {"source": {"id": null, "name": "Kotaku Australia"}, "author": null, "title": "I Got Totally Rinsed In GTFO While The Developers Laughed - Kotaku Australia", "description": "I've been waiting to play GTFO, a 4-player horror shooter from 10 Chambers Collective. But it's a game you really need a proper team for (especially since there's no matchmaking yet). So the developers offered to help out.", "url": "https://www.kotaku.com.au/2020/07/gtfo-i-got-totally-rinsed-while-the-developers-laughed/", "urlToImage": "https://www.kotaku.com.au/content/uploads/sites/3/2020/07/10/gtfo-rundown-1-1280x720.png", "publishedAt": "2020-07-09T23:36:00Z", "content": "Ive been waiting to play GTFO, a 4-player horror shooter from 10 Chambers Collective. But its a game you really need a proper team for (especially since theres no matchmaking yet). So the developers … [+1528 chars]"}, {"source": {"id": null, "name": "Eftm.com"}, "author": "Daniel Tyson", "title": "Next gen Google Home shows up with Nest styling - EFTM", "description": "A new version of the Google Home smart speaker – likely to launch under the Nest branding – is getting ready to launch. The speaker has passed through the US Federal Communications Commission (FCC) where a few photos of the device have come to light.  The lis…", "url": "https://eftm.com/2020/07/next-gen-google-home-shows-up-with-nest-styling-78222", "urlToImage": "https://eftm.com/wp-content/uploads/2020/07/Google-Nest-Home-Speaker.jpg", "publishedAt": "2020-07-09T23:31:32Z", "content": "A new version of the Google Home smart speaker – likely to launch under the Nest branding – is getting ready to launch. The speaker has passed through the US Federal Communications Commission (FCC) w… [+1703 chars]"}, {"source": {"id": null, "name": "PC Gamer"}, "author": "Steven Messner", "title": "Why WoW: Shadowlands' biggest feature could make or break this expansion - PC Gamer", "description": "Covenants offer all the RPG depth and choice that players yearn for, but worries about balance might make it all for nothing.", "url": "https://www.pcgamer.com/wow-covenants/", "urlToImage": "https://cdn.mos.cms.futurecdn.net/doccxi77gej8E3ijgEdQVA-1200-80.jpg", "publishedAt": "2020-07-09T23:23:00Z", "content": "Many of the biggest choices in World of Warcraft happen during character creation. I've spent hours debating myself over which class or race to play, but few other choices in World of Warcraft, like … [+10321 chars]"}, {"source": {"id": null, "name": "Lifehacker Australia"}, "author": null, "title": "Replace Your Logitech Harmony Express with a Free Harmony Elite Remote Right Now - Lifehacker Australia", "description": "Logitech will sunset its Harmony Express remote in just a few weeks, after barely a full year on the market. Don’t worry, though; you’ll be able to get an even better smart remote for free. But you should put in the request sooner rather than later. Logitech …", "url": "https://www.lifehacker.com.au/2020/07/replace-your-logitech-harmony-express-with-a-free-harmony-elite-remote-right-now/", "urlToImage": "https://www.lifehacker.com.au/content/uploads/sites/4/2020/07/10/mse6jt0dkrowgrymlnpf-1280x719.jpg", "publishedAt": "2020-07-09T22:48:00Z", "content": "Logitech will sunset its Harmony Express remote in just a few weeks, after barely a full year on the market. Dont worry, though; youll be able to get an even better smart remote for free. But you sho… [+1846 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "David McCowen", "title": "Mercedes unveils race car for the road, the new AMG GT Black Series - NEWS.com.au", "description": "Mercedes unveils race car for the road", "url": "https://www.news.com.au/technology/innovation/motoring/motoring-news/mercedes-unveils-race-car-for-the-road/news-story/1110555007245e59f6c5ff2ff0722c16", "urlToImage": "https://cdn.newsapi.com.au/image/v1/621666681f6fd1d3425ddc48a7d1f057?width=650", "publishedAt": "2020-07-09T22:38:03Z", "content": "Mercedes has confirmed one of the worst-kept secrets in performance motoring: a range-topping Black Series version of its fastest car is on the way.Instagram leaks triggered the release of a teaser v… [+1762 chars]"}, {"source": {"id": null, "name": "Eftm.com"}, "author": "Daniel Tyson", "title": "Google accidentally reveals Android 11 launch date in a video - EFTM", "description": "Google launched the Android 11 Developer preview in February, and though they outlined a schedule for point releases at the time, COVID-19 has played merry hell with schedules for everyone and their targets slipped. The launch of Android 11 was pegged for Q3,…", "url": "https://eftm.com/2020/07/google-accidentally-reveals-android-11-launch-date-in-a-video-78218", "urlToImage": "https://eftm.com/wp-content/uploads/2020/02/Android-11-Dialscreenshot-1000x600.png", "publishedAt": "2020-07-09T22:31:17Z", "content": "Google launched the Android 11 Developer preview in February, and though they outlined a schedule for point releases at the time, COVID-19 has played merry hell with schedules for everyone and their … [+1814 chars]"}, {"source": {"id": null, "name": "Kotaku Australia"}, "author": null, "title": "Over 50 Sexual Misconduct Allegations Have The Super Smash Bros. Community In Turmoil - Kotaku Australia", "description": "The competitive community for Nintendo’s popular Super Smash Bros. series has recently been rocked by an overwhelming amount of sexual misconduct allegations. An endless stream of victims — many speaking out against highly-skilled, popular, or otherwise power…", "url": "https://www.kotaku.com.au/2020/07/over-50-sexual-misconduct-allegations-have-the-super-smash-bros-community-in-turmoil/", "urlToImage": "https://www.kotaku.com.au/content/uploads/sites/3/2020/07/10/nioaaluflsokhlr8uzus-1280x720.jpg", "publishedAt": "2020-07-09T22:25:00Z", "content": "The competitive community for Nintendos popular Super Smash Bros. series has recently been rocked by an overwhelming amount of sexual misconduct allegations. An endless stream of victims many speakin… [+8505 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "How to Get Apple’s iOS 14 Public Beta Right Now - Gizmodo Australia", "description": "It's WWDC day, which means a huge amount of Apple news just got announced. Leading the pack was iOS 14, which has some cool new features. The good news is you don't need to wait for the new iPhone 12 to try it. You can use iOS 14 right now, if you dare.", "url": "https://www.gizmodo.com.au/2020/07/ios-14-beta-how-to-get/", "urlToImage": "https://www.gizmodo.com.au/content/uploads/sites/2/2020/06/23/2020-06-23_030803-1280x720.png", "publishedAt": "2020-07-09T22:25:00Z", "content": "WWDC was a few weeks ago now, and with it came a huge amount of Apple news just got announced. Leading the pack was iOS 14, which has some cool new features. The good news is you dont need to wait fo… [+2650 chars]"}, {"source": {"id": null, "name": "Press Start Australia"}, "author": "Shannon Grixti", "title": "PS5 Box Art And Game Cases Have Been Revealed - Press Start Australia", "description": "Sony has revealed the first look at PS5 box art starting with Spider-Man: Miles Morales. It looks like the box size will stay the same, but the game cases will sport a new white PS5 strip down the top and side, instead of the dark blue strip that we're used t…", "url": "https://press-start.com.au/news/playstation/2020/07/10/ps5-box-art-and-game-cases-has-been-revealed/", "urlToImage": "https://cdn.pressstart.com.au/wp-content/uploads/2020/07/Spider-Man.jpg", "publishedAt": "2020-07-09T22:16:00Z", "content": "Sony has revealed the first look at PS5 box art starting with Spider-Man: Miles Morales.\r\nIt looks like the box size will stay the same, but the game cases will sport a new white PS5 strip down the t… [+274 chars]"}, {"source": {"id": null, "name": "GameSpot"}, "author": "James Carr", "title": "Twitch Criticized For Black Lives Matter Video Featuring Mostly White Streamers - GameSpot", "description": "The video, that has since been deleted, featured many popular white streamers talking about Black Lives Matter.", "url": "https://www.gamespot.com/articles/twitch-criticized-for-black-lives-matter-video-fea/1100-6479546/", "urlToImage": "https://gamespot1.cbsistatic.com/uploads/screen_kubrick/1599/15997278/3697851-twitch.jpg", "publishedAt": "2020-07-09T20:37:00Z", "content": "Twitch has received backlash on Twitter after sharing a Black Lives Matter video that featured very few Black streamers. The video, which Twitch has since deleted, featured mostly white streamers, pr… [+2693 chars]"}, {"source": {"id": null, "name": "Newcastleherald.com.au"}, "author": "Christine McGinn", "title": "Demand for mental health service surges - Newcastle Herald", "description": "Two leading Australian crisis support services have been smashed with calls for help during the COVID-19 pandemic. Victorians made up almost half of all calls...", "url": "https://www.newcastleherald.com.au/story/6827228/demand-for-mental-health-service-surges/?cs=9397", "urlToImage": "https://nnimgt-a.akamaihd.net/transform/v1/crop/frm/silverstone-feed-data/9a5b9068-c0c3-4d8d-8185-ae3c79484379.jpg/r0_74_800_526_w1200_h678_fmax.jpg", "publishedAt": "2020-07-09T20:00:17Z", "content": ""}, {"source": {"id": null, "name": "GameSpot"}, "author": "Chloi Rad", "title": "How To Swim And Dive In Animal Crossing - GameSpot", "description": "Where to get the wet suit, how to get in the water, tips on how to swim fast, and how to dive for sea creatures in New Horizons.", "url": "https://www.gamespot.com/articles/how-to-swim-and-dive-in-animal-crossing/1100-6479322/", "urlToImage": "https://gamespot1.cbsistatic.com/uploads/screen_kubrick/1594/15949828/3694437-swimming5.jpg", "publishedAt": "2020-07-09T19:57:00Z", "content": "Animal Crossing: New Horizons launched wave one of its summer update early this month, which means you can now swim and dive in the ocean around your island. To start swimming in Animal Crossing, you… [+5910 chars]"}, {"source": {"id": null, "name": "PC Gamer"}, "author": "Andy Chalk", "title": "Sony invests $250 million into Epic Games - PC Gamer", "description": "Epic said the investment will enable greater collaboration between the two companies.", "url": "https://www.pcgamer.com/sony-invests-dollar250-million-into-epic-games/", "urlToImage": "https://cdn.mos.cms.futurecdn.net/G3dZxxnuKLD5U8cpihEkia-1200-80.jpg", "publishedAt": "2020-07-09T19:32:00Z", "content": "Sony has made a $250 million investment into Epic Games, granting it a minority share of the company and opening the door to a deeper collaboration between them. Specific plans for the future weren't… [+2302 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "This Tiny Wearable Air Conditioner Fits In Your Pocket | Future Blink - Mashable", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9SGd2UGFvVGwtd0nSAQA?oc=5", "urlToImage": null, "publishedAt": "2020-07-09T19:30:00Z", "content": null}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Mackenzie Frazier", "title": "Galaxy S20 price cut: save up to $300 on the S20, S20 Plus, and S20 Ultra at Best Buy - TechRadar", "description": "Save on the Samsung Galaxy S20 lineup with qualified activation", "url": "https://www.techradar.com/news/galaxy-s20-price-cut-save-up-to-dollar300-on-the-s20-s20-plus-and-s20-ultra-at-best-buy", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Teg4AthbuSWMbPZFBwFArD-1200-80.jpg", "publishedAt": "2020-07-09T19:03:00Z", "content": "For a limited time, you can score a price cut on TechRadar's best phone of 2020, the Samsung Galaxy S20, at Best Buy. The retailer is offering up to $300 in savings on the Galaxy S20, S20 Plus, and S… [+1585 chars]"}, {"source": {"id": null, "name": "Kotaku Australia"}, "author": null, "title": "Just-Revealed Superhot Sequel Is Free For Owners Of The Original - Kotaku Australia", "description": "What started out as free downloadable content for time-manipulation action game Superhot has blossomed into Superhot: Mind Control Delete, a new standalone game four times as large as the original. It’s launching on July 16 for PC, PlayStation 4, and PC, and …", "url": "https://www.kotaku.com.au/2020/07/just-revealed-superhot-sequel-is-free-for-owners-of-the-original/", "urlToImage": "https://www.kotaku.com.au/content/uploads/sites/3/2020/07/10/sspphkecswfzputwbk32-1280x720.jpg", "publishedAt": "2020-07-09T19:00:00Z", "content": "What started out as free downloadable content for time-manipulation action game Superhot has blossomed into Superhot: Mind Control Delete, a new standalone game four times as large as the original. I… [+1525 chars]"}, {"source": {"id": null, "name": "9to5Mac"}, "author": null, "title": "9to5Mac Happy Hour 285: iOS 14 and macOS Big Sur impressions - 9to5Mac", "description": "This week Zac and Benjamin discuss the iOS 14 public beta, two weeks using macOS Big Sur and the latest OS updates, favorite under-the-radar features so far, and much more. Here’s the live stream for today’s episode starting at 4 p.m. ET (or the video after 5…", "url": "https://9to5mac.com/2020/07/09/9to5mac-happy-hour-285/", "urlToImage": "https://9to5mac.com/wp-content/uploads/sites/6/2018/04/9to5mac-happy-hour-lead1.jpg?quality=82&strip=all", "publishedAt": "2020-07-09T18:57:00Z", "content": "This week Zac and Benjamin discuss the iOS 14 public beta, two weeks using macOS Big Sur and the latest OS updates, favorite under-the-radar features so far, and much more.\r\nHeres the live stream for… [+615 chars]"}, {"source": {"id": null, "name": "DC Rainmaker"}, "author": "DC Rainmaker", "title": "GoPro Adds Webcam Feature to Hero 8 Black: How to guide - DC Rainmaker", "description": "Today GoPro has launched a beta feature for the Hero 8 Black that allows you to use it as a tethered USB webcam for apps like Zoom, Teams, Twitch, and basically any other app that can use a USB webcam", "url": "https://www.dcrainmaker.com/2020/07/gopro-adds-webcam-feature-to-hero-8-black-how-to-guide.html", "urlToImage": "https://media.dcrainmaker.com/images/2020/07/DSC_7024.jpg", "publishedAt": "2020-07-09T18:35:56Z", "content": "Today GoPro has launched a beta feature for the Hero 8 Black that allows you to use it as a tethered USB webcam for apps like Zoom, Teams, Twitch, and basically any other app that can use a USB webca… [+5787 chars]"}, {"source": {"id": null, "name": "ZDNet"}, "author": "Catalin Cimpanu", "title": "Zoom working on patching zero-day disclosed in Windows client - ZDNet", "description": "Security firm has disclosed today a zero-day vulnerability in Zoom's Windows client.", "url": "https://www.zdnet.com/article/zoom-working-on-patching-zero-day-disclosed-in-its-windows-client/", "urlToImage": "https://zdnet1.cbsistatic.com/hub/i/r/2020/04/09/ab9e0888-b6d3-49aa-b2a8-f1a05c32a4e8/thumbnail/770x578/12d5cf6a001d5cbe478fc764835dbede/zoom-logo.jpg", "publishedAt": "2020-07-09T18:00:00Z", "content": "Image: Zoom, ZDNet\r\nVideo conferencing software Zoom is working on patching a zero-day vulnerability that was disclosed online earlier today in a blog post by cyber-security firm ACROS Security.\r\nThe… [+2528 chars]"}, {"source": {"id": null, "name": "GameSpot"}, "author": "Mat Paget", "title": "PlayStation 5 Pre-Orders: Sign Up For Pre-Order Page Notifications At Major Stores - GameSpot", "description": "The PlayStation 5 is set to release at the end of this year, and if you're interested in snagging one, you can sign up for PS5 pre-order notifications now.", "url": "https://www.gamespot.com/articles/playstation-5-preorders-sign-up-for-preorder-page-/1100-6475811/", "urlToImage": "https://gamespot1.cbsistatic.com/uploads/screen_kubrick/1551/15511094/3682248-ps5.jpg", "publishedAt": "2020-07-09T15:46:00Z", "content": "Sony revealed the PlayStation 5 for the first time in a reveal event last month. Along with a slew of next-generation games, the company gave us our first look at the PS5 console and several of its f… [+5801 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Stephanie Mansour", "title": "Why Apple AirPods are the best wireless earbuds of 2020 - NBC News", "description": "Why AirPods are the best wireless earbuds to use while working out to music, working from home and for travel in 2020, according to a personal trainer.", "url": "https://www.nbcnews.com/shopping/tech-gadgets/apple-airpods-2-best-earbuds-n1233263", "urlToImage": "https://media1.s-nbcnews.com/j/newscms/2020_28/3395687/apple-airpods-ode-kr-2x1-tease-200709_202b53771f6f37bec922da6e6751c797.nbcnews-fp-1200-630.jpg", "publishedAt": "2020-07-09T15:38:00Z", "content": "Whether Im working out at home (as many of us have been forced to do in recent months), sweating outdoors or (eventually) working out at a gym (again), having reliable headphones that are easy to set… [+4425 chars]"}, {"source": {"id": null, "name": "Micky News"}, "author": null, "title": "How to take down a 'Warzone' Juggernaut and win 'Call of Duty's' new mode - Micky News", "description": "Call of Duty Season 4 introduces the time-limited Juggernaut Royale. However, taking down a Warzone Juggernaut will take a lot of skill and patience.", "url": "https://micky.com.au/how-to-take-down-a-warzone-juggernaut-and-win-call-of-dutys-new-mode/", "urlToImage": "https://micky.com.au/wp-content/uploads/2020/07/maxresdefault-2020-07-09T052755.008.jpg", "publishedAt": "2020-07-09T15:08:13Z", "content": "Players who have played Call of Duty Modern Warfare or Spec Ops mode are familiar with the concept of the Warzone Juggernaut. They might even find it memorable and intimidating because it is really d… [+2596 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Ryan Gilliam", "title": "Tetris gets mobile game show with cash prizes, battle royale mode - Polygon", "description": "A new Tetris update from N3twork switches up the decades-old Tetris formula with some new gameplay. Players can participate in a nightly Tetris game show for cash prizes, Tetris Primetime, a new battle royale mode, and more, on Android and iOS.", "url": "https://www.polygon.com/2020/7/9/21318575/tetris-ios-android-primetime-battle-royale-marathon-mobile", "urlToImage": "https://cdn.vox-cdn.com/thumbor/T7IYdqD9nc9lVpQEhmnni02dbzc=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/20074685/Tetris__Mobile_Game_for_Android_and_iOS___Official_Trailer_0_11_screenshot.png", "publishedAt": "2020-07-09T15:00:03Z", "content": "Its like HQ Trivia, but for Tetris"}, {"source": {"id": "australian-financial-review", "name": "Australian Financial Review"}, "author": "John Davidson", "title": "The Chromebook that acts like a computer (but isn't quite) - The Australian Financial Review", "description": "If you have, say, a least-favourite child who needs to do software development for school, a low-cost Chromebook is now a very viable option.", "url": "https://www.afr.com/technology/the-chromebook-that-acts-like-a-computer-but-isn-t-quite-20200702-p558cg", "urlToImage": "https://static.ffx.io/images/$zoom_0.5174%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_82/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/3d97474609665be3c999204838f5172ae307c88d", "publishedAt": "2020-07-09T14:00:00Z", "content": "But then Google added to Chrome OS the ability to run Android apps , and then, more recently, it added the ability to run Linux apps: something which educators and software developers, in particular,… [+3487 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Moto G8 Power Lite Review: Best Phone Under Rs. 10000? | 4GB RAM, 64GB Storage, Stock Android - Gadgets 360", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9MTU3S1BDWFhVRFXSAQA?oc=5", "urlToImage": null, "publishedAt": "2020-07-09T13:55:21Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "NVIDIA's GeForce RTX 3060 Rumored To Feature GA106 GPUs - WccftechTV", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9dkZvQzhJUTlydzjSAQA?oc=5", "urlToImage": null, "publishedAt": "2020-07-09T13:46:56Z", "content": null}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Austen Goslin", "title": "How Riot made Valorant’s new dragon-themed Elderflame gun skins - Polygon", "description": "Valorant’s great-looking new Elderflame skin line is more elaborate than any other cosmetic in the game, but items as complicated as these new Judge, Vandal, Operator, Frenzy, and Knife skins weren’t easy for Riot to make.", "url": "https://www.polygon.com/2020/7/9/21317964/valorant-elderflame-dragon-gun-skins-weapons-operator-judge-frenzy-knife-vandal", "urlToImage": "https://cdn.vox-cdn.com/thumbor/kX6vwu_TdyvscjnzhVOUO69byYE=/143x0:1597x761/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/20073722/ElderFlame_Thumbnail_Final_v1.jpg", "publishedAt": "2020-07-09T13:33:58Z", "content": "On Wednesday morning, Riot Games announced Valorants most elaborate set of skins so far, themed with dragon designs. They also look great. Each different gun-dragon has its own roars, firing sounds, … [+4538 chars]"}, {"source": {"id": null, "name": "Press Start Australia"}, "author": "Shannon Grixti", "title": "Crash Bandicoot: On The Run Is A Mobile Crash Game And Actually Looks Decent - Press Start Australia", "description": "It's been long rumoured, but King Online has finally revealed Crash Bandicoot: On The Run which is coming to Apple and Android devices in the near future. The game features Crash, Coco and Aku Aku and appears to be an endless runner game which has an art styl…", "url": "https://press-start.com.au/news/playstation/2020/07/09/crash-bandicoot-on-the-run-is-a-mobile-crash-game-and-actually-looks-decent/", "urlToImage": "https://cdn.pressstart.com.au/wp-content/uploads/2020/07/Crash-Bandicoot-On-The-Run.jpg", "publishedAt": "2020-07-09T13:06:00Z", "content": null}, {"source": {"id": null, "name": "Tom's Guide"}, "author": "Richard Priday", "title": "OnePlus Nord images just leaked — and the iPhone SE is in trouble - Tom's Guide", "description": "OnePlus Nord leaked images reveal why you should be excited for this phone", "url": "https://www.tomsguide.com/news/oneplus-nord-leaked-images-give-us-full-look-at-iphone-se-killer", "urlToImage": "https://cdn.mos.cms.futurecdn.net/f26LzVaR4PRfvkJ3N2BxWm-1200-80.jpg", "publishedAt": "2020-07-09T12:47:00Z", "content": "The OnePlus Nord is only a couple of weeks from launch and now we have new images of the front and the back of this mid-range phone to tide us over until the big July 21 launch.\r\nThe renders come cou… [+3014 chars]"}, {"source": {"id": null, "name": "Finder.com.au"}, "author": "Chris Stead", "title": "Canon EOS R5 vs EOS R6: Price, release date, specs and hands-on - finder.com.au", "description": "Canon has revealed its 2020 EOS R cameras, with new entries in its 5 Series and 6 Series models. What's the difference? Let's compare the EOS R5 vs EOS R6.", "url": "https://www.finder.com.au/canon-eos-r5-vs-eos-r6-mirrorless-cameras", "urlToImage": "https://dvh1deh6tagwk.cloudfront.net/finder-au/wp-uploads/2020/07/Canon-R5-vs-R6-F.jpg", "publishedAt": "2020-07-09T12:05:06Z", "content": "SUMMARY: The EOS R5 will release in late July 2020, while the EOS R6 will follow in late August 2020. Canon is letting retailers set the price and that's come in at around AU$6,899 for the R5 body, a… [+15925 chars]"}, {"source": {"id": null, "name": "Android Central"}, "author": "Andrew Martonik", "title": "Microsoft has given us no reason to believe the Surface Duo will be any good - Android Central", "description": "Microsoft has made some amazing Surface products, but there's nothing in its history, or what we know so far, that leads me to be confident that the Surface Duo will be a good product. It's incredibly ambitious, but it's being set up to fail.", "url": "https://www.androidcentral.com/microsoft-has-given-us-no-reason-believe-surface-duo-will-be-good", "urlToImage": "https://www.androidcentral.com/sites/androidcentral.com/files/styles/large/public/article_images/2019/10/surface-duo-official-video-2-44ol-44ol.jpg", "publishedAt": "2020-07-09T12:00:02Z", "content": "Source: Microsoft\r\nIf you stay in your Android lane and don't pay too close attention to what Microsoft is up to, you probably forgot the company's first Android, the Surface Duo, is set to debut soo… [+8992 chars]"}, {"source": {"id": null, "name": "PCGamesN"}, "author": "Carrie Talbot", "title": "League of Legends patch 10.15 notes – Lillia, Spirit Blossom skins, Swain changes, Yone? - PCGamesN", "description": "LoL patch 10.15 brings a new Champion, skin line, changes for Swain, and possible signs that Yone's not dead after all...", "url": "https://www.pcgamesn.com/league-of-legends/lol-patch-1015", "urlToImage": "https://www.pcgamesn.com/wp-content/uploads/2020/07/lol_league_of_legends_lillia_splash_art.jpg", "publishedAt": "2020-07-09T11:53:00Z", "content": "It’s been a big couple of days for League of Legends. LoL patch 10.14 has landed on the MOBA game’s live servers, the Spirit Blossom skins have been unveiled, and – of course – we’ve got a brand-new … [+9612 chars]"}, {"source": {"id": null, "name": "Micky News"}, "author": null, "title": "'Paper Mario: The Origami King': New gameplay footage revealed - Micky News", "description": "Paper Mario The Origami King is only a few days away from releasing and there's a new gameplay footage to get players by on the wait.", "url": "https://micky.com.au/paper-mario-the-origami-king-new-gameplay-footage-revealed/", "urlToImage": "https://micky.com.au/wp-content/uploads/2020/07/Paper-Mario-The-Origami-King.jpg", "publishedAt": "2020-07-09T11:16:00Z", "content": "Paper Mario: The Origami King is the next installment in the popular RPG franchise. The previous entry in the Wii U wasn’t as well received as other titles, but fans have high hopes for the upcoming … [+2181 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Lexy Savvides", "title": "Wireless earbuds under $50: All the best options I've found so far - CNET", "description": "If you don't want to spend a bundle on AirPods or Galaxy Buds Plus, you can still get a great pair of wireless earbuds.", "url": "https://www.cnet.com/news/best-budget-wireless-earbuds-under-50-cheap-alternative-to-airpods-galaxy-buds-2020/", "urlToImage": "https://cnet1.cbsistatic.com/img/7u_b9_NdpJCGj7TSY_XcBfg2K5Q=/756x567/2020/05/05/adb33018-5125-48f4-9c47-2b8dc5227ed8/img-4180.jpg", "publishedAt": "2020-07-09T11:00:53Z", "content": "Lexy Savvides/CNET\r\nPopular wireless earbuds such as the AirPods or Galaxy Buds Plus can cost $150 or more, but you don't necessarily need to spend that much cash if you want a pair that's great for … [+6257 chars]"}, {"source": {"id": null, "name": "GamesRadar+"}, "author": "Alex Avard", "title": "Naughty Dog is already hiring to develop a new single player game - GamesRadar+ AU", "description": "Naughty Dog confirms it's working on a new single player game and \"next generation graphics analysis\" in latest hiring spree", "url": "https://www.gamesradar.com/naughty-dog-is-already-hiring-to-develop-a-new-singleplayer-game-and-next-generation-graphics/", "urlToImage": "https://cdn.mos.cms.futurecdn.net/VoSu2Ufz9TDh6tuHBMf899-1200-80.jpg", "publishedAt": "2020-07-09T09:25:00Z", "content": "Naughty Dog is already hiring for a new single player game and developers who can work on \"next generation graphics\", less than a month after the release of The Last of Us 2.\r\nA job listing on the st… [+1552 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Mark Sparrow", "title": "Want AirPod Style Without Paying Apple Prices? EarFun Air Are An Affordable Alternative - Forbes", "description": "These EarFun earbuds are housed in their own smart charging case with a neat flip-top lid. The case can be charged either by USB or on any Qi charging mat.", "url": "https://www.forbes.com/sites/marksparrow/2020/07/09/want-airpod-style-without-paying-apple-prices-earfun-air-make-for--affordable-alternatives/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F5efa073e8afb180007162bef%2F0x0.jpg", "publishedAt": "2020-07-09T07:49:00Z", "content": "The EarFun Air true wireless earphones are water-resistant to IPX7 standard.\r\nEarFun\r\nRegular readers will know how much I like to seek out a genuine bargain on your behalf. This month, Ive found a g… [+6103 chars]"}, {"source": {"id": null, "name": "NME"}, "author": null, "title": "Ubisoft empowers audiences in its new Battle Royale – will it work? - NME", "description": "The ambitions of ‘Hyper Scape’ as a live-streaming behemoth demand a loyal viewership – but is the gameplay good enough to muster an audience?", "url": "https://www.nme.com/features/ubisoft-empowers-audiences-in-its-new-battle-royale-will-it-work-2704459", "urlToImage": "https://www.nme.com/wp-content/uploads/2020/07/070920-Hyper-Scape-Ubisoft.jpeg", "publishedAt": "2020-07-09T07:00:00Z", "content": "With all the dependability of the setting sun, a new battle royale has crossed our collective horizon. Almost every publisher in the games industry has had a pop at biting this phenomenon, with many … [+4037 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "OLED vs QLED TVs: What’s the Difference? - Gizmodo Australia", "description": "There's a fierce battle raging between the two.", "url": "https://www.gizmodo.com.au/2020/07/oled-vs-qled-tvs-differences/", "urlToImage": "https://www.gizmodo.com.au/content/uploads/sites/2/2020/07/09/GettyImages-540797347-1280x853.jpg", "publishedAt": "2020-07-09T04:41:00Z", "content": "Theres a fierce battle raging between OLED and the suspiciously similar-sounding QLED, and it all might be a bit baffling if youre in the market for a new TV. But whats the real difference between th… [+6957 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "OnePlus Nord price and specs leak ahead of official launch - The Indian Express", "description": "OnePlus will be launching its new affordable Nord smartphone on July 21 via an AR event. Here's how much it could cost.", "url": "https://indianexpress.com/article/technology/mobile-tabs/oneplus-nord-photos-specifications-leaked-6495799/", "urlToImage": "https://images.indianexpress.com/2020/07/OnePlus-Nord-evoMAG.ro-759.jpg?w=759", "publishedAt": "2020-07-09T03:20:21Z", "content": "By: Tech Desk | New Delhi | \r\nUpdated: July 9, 2020 9:20:21 am\r\nThe listing states that the Nord will sport a triple camera setup on the back. (Image: evoMAG.ro)OnePlus will be launching its new affo… [+2111 chars]"}, {"source": {"id": null, "name": "Kotaku Australia"}, "author": null, "title": "Here’s JB Hi-Fi’s Best Gaming Deals This Week - Kotaku Australia", "description": "JB Hi-Fi's got more gaming bargains going, including AAA console titles for under $10, retro consoles and some cheap gaming peripherals.", "url": "https://www.kotaku.com.au/2020/07/jb-hifi-best-gaming-deals-this-week/", "urlToImage": "https://www.kotaku.com.au/content/uploads/sites/3/2019/03/Assassins-Creed-Odyssey-game-Kassandra-xlarge_trans_NvBQzQNjv4BqNUHzxaamNmHDqK-YksWRz2o-yMLyYquKCawpyDOW254.jpg", "publishedAt": "2020-07-09T02:02:00Z", "content": "If youre stuck for things to play, JBs gaming deals this week include good prices on Far Cry: New Dawn, Assassins Creed: Odyssey, Need for Speed: HEAT, the GRID reboot and more.\r\nThe latest offers fr… [+1292 chars]"}, {"source": {"id": null, "name": "CarBuzz"}, "author": "Karl Furlong", "title": "TEASED: This Is Lamborghini's Brand New Model - CarBuzz", "description": "A few days ago, we reported that Lamborghini had something exciting planned for this week. The Italian auto...", "url": "https://carbuzz.com/news/teased-this-is-lamborghinis-brand-new-model", "urlToImage": "http://cdn.carbuzz.com/gallery-images/1600/729000/600/729649.jpg", "publishedAt": "2020-07-09T01:51:20Z", "content": "A few days ago, we reported that Lamborghini had something exciting planned for this week. The Italian automaker didn't give too much away, though, beyond a single, obscure teaser image shared on soc… [+365 chars]"}, {"source": {"id": null, "name": "iTWire"}, "author": "Sam Varghese", "title": "Qualcomm releases new platform that betters the Snapdragon 865 - iTWire", "description": "Chipmaker Qualcomm Technologies has released the Qualcomm Snapdragon 865 Plus 5G Mobile Platform, to follow its most successful platform this year, the Snapdragon 865 that has powered more than 140 devices - announced or in development – the most premium-tier…", "url": "https://www.itwire.com/mobility/qualcomm-releases-new-platform-that-betters-the-snapdragon-865.html", "urlToImage": "https://www.itwire.com/media/k2/items/cache/6c4a4689f3532af7f126e516a65a93a4_XS.jpg", "publishedAt": "2020-07-09T01:07:45Z", "content": "Chipmaker Qualcomm Technologies has released the Qualcomm Snapdragon 865 Plus 5G Mobile Platform, to follow its most successful platform this year, the Snapdragon 865 that has powered more than 140 d… [+2936 chars]"}, {"source": {"id": null, "name": "iTnews"}, "author": null, "title": "Microsoft EEG studies show video meetings stress people out - iTnews", "description": "Measures brainwave activity.", "url": "https://www.itnews.com.au/news/microsoft-eeg-studies-show-video-meetings-stress-people-out-550248", "urlToImage": "https://i.nextmedia.com.au/News/zoom.jpg", "publishedAt": "2020-07-09T00:58:00Z", "content": "It's official: video meetings are hard work and tire people quickly, according to a study done by Microsoft.\r\nRemote collabaration has become much more commonplace during the COVID-19 pandemic, with … [+2754 chars]"}, {"source": {"id": null, "name": "PC Gamer"}, "author": "Andy Chalk", "title": "Valorant's first 'Ultra' skin set will cost $100 - PC Gamer", "description": "It's swanky, but wow, that price.", "url": "https://www.pcgamer.com/valorants-first-ultra-skin-set-will-cost-you-a-cool-dollar100/", "urlToImage": "https://cdn.mos.cms.futurecdn.net/aoMzdgjCHvTbkpwXQt6xUc-1200-80.jpg", "publishedAt": "2020-07-08T23:51:00Z", "content": "Remember back in the long-ago days of yore, when everyone got angry because Bethesda was charging a couple of bucks for a suit of armor for your horse? The outrage was real, but as Tom pointed out la… [+2100 chars]"}, {"source": {"id": null, "name": "Business Insider Australia"}, "author": "Christian de Looper", "title": "We compared Apple's MacBook Air and MacBook Pro to see which laptop is better — and the 13-inch MacBook Pro is the winner - Business Insider Australia", "description": "", "url": "https://www.businessinsider.com.au/apple-macbook-air-vs-macbook-pro-specs-2019-8", "urlToImage": "https://static.businessinsider.com/image/5d545a1ccd97844ac67abd42-.jpg", "publishedAt": "2020-07-08T23:15:00Z", "content": "<ul><li>Apple’s MacBook has long been the go-to laptop for students, professionals, and creatives.</li><li>\r\nThere are a few MacBook models these days, including the MacBook Air and MacBook Pro.\r\n</l… [+5558 chars]"}, {"source": {"id": null, "name": "WAtoday"}, "author": "Aja Styles", "title": "Zoom out: Why video conferencing was most annoying to West Australians - WAtoday", "description": "If you found yourself swearing over lags and poor video quality while using Zoom and others, you were not alone. At times it was enough to make you want to switch on Netflix instead, with good reason.", "url": "https://www.watoday.com.au/national/western-australia/zoom-out-why-video-conferencing-was-most-annoying-to-west-australians-20200708-p55a6d.html", "urlToImage": "https://static.ffx.io/images/$zoom_0.5064%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_125/t_crop_custom/q_86%2Cf_auto/515e9475121f24cbf1251143c8e477f4979c1271", "publishedAt": "2020-07-08T22:09:00Z", "content": "WA had the worst Zoom conferencing of the nation, while local YouTube fans would have also been left disappointed by delays and faulty streams from the seven biggest providers: Telstra, Optus, iiNet,… [+3220 chars]"}, {"source": {"id": null, "name": "Kotaku Australia"}, "author": null, "title": "Fortnite YouTubers Buy Mansion, Decorate It Like Sad Teenagers - Kotaku Australia", "description": "Behold the One Per cent Fortnite house, a mansion some gaming YouTubers bought and proceeded to turn into a vaguely fun-looking giant home office. It’s both a reminder that even when you’ve “made it” as an influencer the grind never stops, and also that most …", "url": "https://www.kotaku.com.au/2020/07/fortnite-youtubers-buy-mansion-decorate-it-like-sad-teenagers/", "urlToImage": "https://www.kotaku.com.au/content/uploads/sites/3/2020/07/09/evxf5c12fulz9dl8zujq.png", "publishedAt": "2020-07-08T20:00:00Z", "content": "Behold the One Per cent Fortnite house, a mansion some gaming YouTubers bought and proceeded to turn into a vaguely fun-looking giant home office. Its both a reminder that even when youve made it as … [+2945 chars]"}, {"source": {"id": null, "name": "Lifehacker Australia"}, "author": null, "title": "Get a Custom Playlist with Spotify’s ‘Soundtrack Your Workout’ Tool - Lifehacker Australia", "description": "Bored with your workout mix? Us too. Especially if you’ve been working out at home — alone — for the duration of the pandemic, it’s unsurprising that you’re tired of listening to the same music, and perfectly understandable if you also feel overwhelmed at the…", "url": "https://www.lifehacker.com.au/2020/07/get-a-custom-playlist-with-spotifys-soundtrack-your-workout-tool/", "urlToImage": "https://www.lifehacker.com.au/content/uploads/sites/4/2020/07/09/nxj59jffbqv8jlerptlp-1280x720.jpg", "publishedAt": "2020-07-08T20:00:00Z", "content": "Bored with your workout mix? Us too. Especially if youve been working out at home alone for the duration of the pandemic, its unsurprising that youre tired of listening to the same music, and perfect… [+2441 chars]"}, {"source": {"id": null, "name": "ESPN Australia"}, "author": "Arda Ocal", "title": "Ninja does surprise stream on YouTube, teases future announcements - ESPN Australia", "description": "Ninja streamed on his YouTube channel for the first time, peaking at around 150,000 viewers.", "url": "https://www.espn.com.au/esports/story/_/id/29429840/ninja-does-surprise-stream-youtube-teases-future-announcements", "urlToImage": "https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2018%2F0428%2Fr360004_2_1296x729_16%2D9.jpg", "publishedAt": "2020-07-08T19:29:04Z", "content": "Tyler \"Ninja\" Blevins made a surprise appearance on YouTube on Wednesday, beginning a livestream on his official channel at around 1:30 p.m. ET.\r\nThe stream, which lasted for roughly 90 minutes and w… [+1285 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Call of Duty: Warzone MFAM Gauntlet Series from NICKMERCS Gets Activision Support - GameRant", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiTWh0dHBzOi8vZ2FtZXJhbnQuY29tL2NhbGwtb2YtZHV0eS13YXJ6b25lLW1mYW0tZ2F1bnRsZXQtbmlja21lcmNzLWFjdGl2aXNpb24v0gFRaHR0cHM6Ly9nYW1lcmFudC5jb20vY2FsbC1vZi1kdXR5LXdhcnpvbmUtbWZhbS1nYXVudGxldC1uaWNrbWVyY3MtYWN0aXZpc2lvbi9hbXAv?oc=5", "urlToImage": null, "publishedAt": "2020-07-08T17:01:00Z", "content": null}, {"source": {"id": null, "name": "ComicBook.com"}, "author": "Tyler Fischer", "title": "These Nintendo Switch Hidden Gems Cost as Little as $1.49 for a Limited Time - ComicBook.com", "description": "There's never a lack of games to play on the Nintendo Switch and Nintendo Switch Lite. Even during slow months like July, there's always something to play thanks to Nintendo eShop sales that discount Nintendo Switch games to absurdly cheap prices. For example…", "url": "https://comicbook.com/gaming/news/nintendo-switch-lite-games-eshop-sale-cheap-july/", "urlToImage": "https://media.comicbook.com/2020/07/nintendo-switch-grey-1228040-1280x0.jpeg", "publishedAt": "2020-07-08T15:48:00Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "LITTLE HOPE - Will Poulter Becomes a PLAYABLE Video Game Character - Den of Geek", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9cGFfWlZNTkM4Y2fSAQA?oc=5", "urlToImage": null, "publishedAt": "2020-07-08T15:31:50Z", "content": null}, {"source": {"id": null, "name": "PCMag.com"}, "author": "Matthew Humphries", "title": "Lenovo's Latest Mobile Monitor Doubles as a Drawing Tablet - PCMag", "description": "The ThinkVision M14t  is a 14-inch FHD portable monitor with 10-point touch, 300 nits brightness, an active pen, and adjustable stand that only weighs 698 grams.", "url": "https://www.pcmag.com/news/lenovos-latest-mobile-monitor-doubles-as-a-drawing-tablet", "urlToImage": "https://i.pcmag.com/imagery/articles/04ic9LhzbQEabFO6mBNlg81-1.fit_lim.size_1200x630.v_1594216221.jpg", "publishedAt": "2020-07-08T14:07:35Z", "content": "(Image: Lenovo)\r\nIf you'd like a bit more screen real estate on your laptop, but want to remain mobile and keep your bag weight down, Lenovo has a new portable monitor it would like you to consider. … [+1600 chars]"}, {"source": {"id": null, "name": "Pickr.com.au"}, "author": "Leigh :) Stark", "title": "Samsung’s next Note coming in August - Pickr", "description": "Even though you shouldn't expect journalists to fly to the next Note launch, that doesn't mean a new Galaxy Note for 2020 isn't on the cards.", "url": "https://www.pickr.com.au/news/2020/samsungs-next-note-coming-in-august/", "urlToImage": "https://cdn.pickr.com.au/wp-content/uploads/2020/07/galaxy-unpacked-2020-02.jpg", "publishedAt": "2020-07-08T13:58:16Z", "content": "Even though you shouldn’t expect journalists to fly to the next Note launch, that doesn’t mean a new Galaxy Note for 2020 isn’t on the cards.\r\nWe’re at the halfway mark for the year, and that means i… [+1842 chars]"}, {"source": {"id": null, "name": "Vooks"}, "author": null, "title": "Story of Seasons: Friends of Mineral Town (Switch) Review - Vooks", "description": "Story of Seasons: Friends of Mineral Town will delight nostalgia-seekers. However, there’s still plenty of room to grow post-Stardew Valley.", "url": "https://www.vooks.net/story-of-seasons-friends-of-mineral-town-switch-review/", "urlToImage": "https://www.vooks.net/img/2020/07/Story-of-Seasons-Friends-of-Mineral-Town-banner.jpg", "publishedAt": "2020-07-08T13:18:05Z", "content": "Step back into 2003 with Story of Seasons:Friends of Mineral Town, a remake that stays wonderfully faithful to the original, but feels slightly bare in light of how the farming and life management ge… [+4450 chars]"}, {"source": {"id": null, "name": "Vooks"}, "author": "www.facebook.com/maxigeek", "title": "Get ready to rumble in WWE 2K Battlegrounds - Vooks", "description": "Only slightly more fake than the actual WWE", "url": "https://www.vooks.net/get-ready-to-rumble-in-wwe-2k-battlegrounds/", "urlToImage": "https://www.vooks.net/img/2020/07/wwe-bg-vooks.jpg", "publishedAt": "2020-07-08T12:00:53Z", "content": "2K have finally taken the covers off WWE 2K Battlegrounds and put out a full reveal trailer, as well as some details on the game, check out the trailer first.\r\nThe game is coming to Switch on Septemb… [+1631 chars]"}, {"source": {"id": null, "name": "Maxim"}, "author": "Maxim Video", "title": "This Aston Martin DB5 Comes With a Rear Smoke Screen and Twin Front 'Machine Guns' - Maxim", "description": "The first of 25 \"continuation\" Aston Martin DB5s based on the iconic, superspy-spec custom model driven by Sean Connery in 1964's Goldfinger has been", "url": "https://www.maxim.com/rides/aston-martin-goldfinger-db5-continuation-completed", "urlToImage": "https://www.maxim.com/.image/t_share/MTczODAxNTU5Mzc2MDEyODU4/aston-martin-db5-goldfinger-continuation-promo.jpg", "publishedAt": "2020-07-08T12:00:00Z", "content": "The first of 25 \"continuation\" Aston Martin DB5s based on the iconic, superspy-spec custom model driven by Sean Connery in 1964's Goldfinger has been completed. \r\nAston Martin\r\nThanks for watching!\r\n… [+2040 chars]"}, {"source": {"id": null, "name": "What Hi-Fi? US"}, "author": "Becky Roberts", "title": "H.266 video codec is good news for 4K and 8K streaming - What Hi-Fi?", "description": "The new Versatile Video Coding (VVC) standard can halve the file size of a 90-minute 4K video without losing quality", "url": "https://www.whathifi.com/news/h266-video-codec-is-good-news-for-4k-and-8k-streaming", "urlToImage": "https://cdn.mos.cms.futurecdn.net/aULMRh4EXZAUag2YdX2ePM-1200-80.jpg", "publishedAt": "2020-07-08T11:24:00Z", "content": "German video codec developer Fraunhofer HHI has announced a new compression standard that promises to notably improve the efficiency of video streaming.\r\nPoised as a successor to High Efficiency Vide… [+1537 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "The best Bluetooth speakers 2020 | The top portable speakers for any budget - TechRadar", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9dV8zZTVtUnFTelnSAQA?oc=5", "urlToImage": null, "publishedAt": "2020-07-08T11:00:30Z", "content": null}, {"source": {"id": null, "name": "techAU"}, "author": "jasoncartwright", "title": "Telstra supporting Melbourne-based customers during Coronavirus lockdown with free data - techAU", "description": "Things are tough in Victoria right now and specifically in Melbourne as they enter another 6 weeks of lock down due to the Coronavirus outbreak. Thankfully some companies are doing what they can to help. Telstra is offering eligible consumer and small busines…", "url": "https://techau.com.au/telstra-supporting-melbourne-based-customers-during-coronavirus-lockdown-with-free-data/", "urlToImage": "https://i2.wp.com/s3-ap-southeast-2.amazonaws.com/techau-images/WP%20Media%20Folder%20-%20techau/wp-content/uploads/2020/07/Melbourne.jpg?fit=1194%2C826&ssl=1", "publishedAt": "2020-07-08T10:54:28Z", "content": "Things are tough in Victoria right now and specifically in Melbourne as they enter another 6 weeks of lock down due to the Coronavirus outbreak. \r\nThankfully some companies are doing what they can to… [+1789 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Edwina Carr Barraclough", "title": "Best wireless headphones: What are the best noise cancelling earbuds? - NEWS.com.au", "description": "From noise cancelling to weatherproof, these are the best wireless headphones", "url": "https://www.news.com.au/best-of/electronics/from-noise-cancelling-to-weatherproof-these-are-the-best-wireless-headphones/news-story/e1240a1b5a63b92ffc12efc76b76d13d", "urlToImage": "https://cdn.newsapi.com.au/image/v1/cb43ae3dc3a3f945f1aa0ea71f4603f0?width=650", "publishedAt": "2020-07-08T10:50:40Z", "content": "Long gone are the days where you had to endure tangled and cumbersome headphones connected precariously to your phone. With most major brands offering wireless headphones — or wireless earbuds, if yo… [+3057 chars]"}, {"source": {"id": null, "name": "CinemaBlend"}, "author": "Jason Wiese", "title": "What To Watch On Amazon Prime Video If You Love Kristen Stewart - CinemaBlend", "description": "If you are a Kristen Stewart fan with an Amazon Prime membership, you are in the right place...", "url": "https://www.cinemablend.com/news/2549592/what-to-watch-on-amazon-prime-video-if-you-love-kristen-stewart", "urlToImage": "https://img.cinemablend.com/quill/f/3/f/d/8/d/f3fd8d0c3473c0b815cc92f7cd7404c4614297ec.jpg", "publishedAt": "2020-07-08T10:00:00Z", "content": "The lives of a troubled teen (Jamie Bell) and his younger brother (Devon Alan) are upended by the appearance of their ex-convict uncle (Josh Lucas), whom their widowed pig farmer father (Dermot Mulro… [+435 chars]"}, {"source": {"id": null, "name": "GamesRadar+"}, "author": "Alex Avard", "title": "Call of Duty: Modern Warfare nearly had a zombies mode, and we've just got our first look at it - GamesRadar+ AU", "description": "Call of Duty: Modern Warfare dev shares concept art for scrapped zombies mode", "url": "https://www.gamesradar.com/call-of-duty-modern-warfare-nearly-had-a-zombies-mode-and-weve-just-got-our-first-look-at-it/", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ftLz2ZLVsChqam2TmMbp8E-1200-80.jpg", "publishedAt": "2020-07-08T09:47:00Z", "content": "A never-before-seen batch of Call of Duty: Modern Warfare zombies concept art has revealed Infinity Ward's early (and scrapped) ideas for bringing the franchise's famous PvE mode to its 2019 shooter.… [+1514 chars]"}, {"source": {"id": null, "name": "GamesRadar+"}, "author": "Alex Avard", "title": "Microsoft is reportedly telling developers that Xbox Series X game upgrades have to be free - GamesRadar+ AU", "description": "Microsoft wants all next-gen game upgrades to be free on Xbox Series X", "url": "https://www.gamesradar.com/microsoft-is-reportedly-telling-developers-that-xbox-series-x-game-upgrades-have-to-be-free/", "urlToImage": "https://cdn.mos.cms.futurecdn.net/iGoyV8755hauMhq55pVC2J-1200-80.jpg", "publishedAt": "2020-07-08T09:29:00Z", "content": "Xbox Series X game upgrades could be free for all cross-gen titles, with Microsoft said to be pushing for publishers to refrain from charging extra to those who want a next-gen copy of a game they al… [+1367 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Darren Allan", "title": "AMD Ryzen 4000 desktop CPUs looking ‘great’ and on track to launch in 2020 - TechRadar", "description": "According to CEO Lisa Su", "url": "https://www.techradar.com/news/amd-ryzen-4000-desktop-cpus-looking-great-and-on-track-to-launch-in-2020", "urlToImage": "https://cdn.mos.cms.futurecdn.net/YV8LJcRoWpTnBzFH5L5NB4-1200-80.jpg", "publishedAt": "2020-07-08T09:14:00Z", "content": "AMD Ryzen 4000 desktop processors built on the Zen 3 architecture are on schedule to launch later in 2020, according to the companys CEO.\r\nLisa Su took to Twitter to celebrate the launch of new Ryzen… [+2092 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Jack Gramenz", "title": "Fortnite streamer Daniel Harrison’s journey to 1 million YouTube subscribers - NEWS.com.au", "description": "Fortnite streamer Daniel Harrison’s journey to 1 million YouTube subscribers", "url": "https://www.news.com.au/technology/home-entertainment/gaming/fortnite-streamer-daniel-harrisons-journey-to-1-million-youtube-subscribers/news-story/fa723f63b03423579238a485257bd785", "urlToImage": "https://cdn.newsapi.com.au/image/v1/25de5e32dd4c5ede32ee38578a7f2cde?width=650", "publishedAt": "2020-07-08T08:46:27Z", "content": "Daniel Harrison was just 17 when he left home with $20 to his name. Now, a little more than five years later he’s one of our country’s biggest video game streamers.\r\nHe’s managed to become a YouTube … [+7142 chars]"}, {"source": {"id": null, "name": "Press Start Australia"}, "author": "Shannon Grixti", "title": "Watch Dogs 2 Will Be Free On Monday Morning - Press Start Australia", "description": "Ubisoft has announced that those that tune in to Ubisoft Forward on Monday morning will be able to download Watch Dogs 2 for free on PC. All you have to do is login with your uPlay account anytime on Monday morning between the pre-show starting (at 4:00am AES…", "url": "https://press-start.com.au/news/pcmac/2020/07/08/watch-dogs-2-will-be-free-on-monday-morning/", "urlToImage": "https://cdn.pressstart.com.au/wp-content/uploads/2020/07/Waatch-Dogs-2.jpg", "publishedAt": "2020-07-08T08:27:27Z", "content": "Ubisoft has announced that those that tune in to Ubisoft Forward on Monday morning will be able to download Watch Dogs 2 for free on PC.\r\nAll you have to do is login with your uPlay account anytime o… [+468 chars]"}, {"source": {"id": null, "name": "HITC - Football, Gaming, Movies, TV, Music"}, "author": "Callum Smith", "title": "How to find and catch horseshoe crab in Animal Crossing New Horizons - HITC - Football, Gaming, Movies, TV, Music", "description": "The Animal Crossing New Horizons summer update has added a bunch of sea creatures to catch in addition to the plethora of new bugs and...", "url": "https://www.hitc.com/en-gb/2020/07/08/animal-crossing-new-horizons-horseshoe-crab-how-to-catch-find/", "urlToImage": "https://www.hitc.com/static/uploads/2020/07/How-to-find-and-catch-horseshoe-crab-in-Animal-Crossing-New-Horizons.jpg", "publishedAt": "2020-07-08T07:03:00Z", "content": "The Animal Crossing New Horizons summer update has added a bunch of sea creatures to catch in addition to the plethora of new bugs and fish for July. One of the many sea creatures you can pluck from … [+1598 chars]"}]}