{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Micky.com.au"}, "author": null, "title": "‘The Last of Us’ Part 2 YouTube video leak source is identified by Sony - Micky News", "description": "Sony had recently announced that the source of the YouTube video leak on Naughty Dog's The Last of Us Part 2 has already been identified.", "url": "https://micky.com.au/the-last-of-us-part-2-youtube-video-leak-source-is-identified-by-sony/", "urlToImage": "https://micky.com.au/wp-content/uploads/2020/05/Screen-Shot-2020-05-04-at-5.15.41-PM.png", "publishedAt": "2020-05-04T10:21:17Z", "content": "The popular action-horror survival game, The Last of Us which was first released in 2013, brings the gamer into the world of Joel and Ellie. Set in the apocalyptic era of the United States,  Joel and Ellie need to fight other humans who have become infected w… [+3119 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Mark Wycislik-Wilson", "title": "New browser plugin generates burner email addresses to protect you from spam - TechRadar", "description": "Firefox Private Relay add-on will protect you from junk emails", "url": "https://www.techradar.com/news/new-browser-plugin-generates-burner-email-addresses-to-protect-you-from-spam", "urlToImage": "https://cdn.mos.cms.futurecdn.net/S7By2Nhh8y8JcP9aUxFgfB-1200-80.jpg", "publishedAt": "2020-05-04T10:21:00Z", "content": "Creating burner email addresses (which redirect messages to your real inbox  but can be deleted easily) is about to get much easier thanks to a new browser extension.\r\nSigning up for online services often means handing over your email address, and this can me… [+2304 chars]"}, {"source": {"id": null, "name": "Motorauthority.com"}, "author": "Viknesh Vijayenthiran", "title": "2021 Porsche 718 Cayman GT4 RS spy shots and video - Motor Authority", "description": "Porsche is about to go beyond the 414-horsepower 718 Cayman GT4 with an RS version that could borrow liberally from the 911 GT3.", "url": "https://www.motorauthority.com/news/1124057_2021-porsche-718-cayman-gt4-rs-spy-shots-and-video", "urlToImage": "https://images.hgmsites.net/hug/2021-porsche-718-cayman-gt4-rs-spy-shots--photo-credits-baldauf-sb-medien_100745942_h.jpg", "publishedAt": "2020-05-04T10:20:44Z", "content": "If the 2020 Porsche 718 Cayman GT4 doesn't seem like enough, know the German marque didn't throw every ounce of performance at the car just yet.\r\nYes, there is a more hardcore 718 Cayman GT4 RS, or something along those lines, in the offing, something Porsche… [+1834 chars]"}, {"source": {"id": null, "name": "Gamesradar.com"}, "author": "Alex Avard", "title": "Call of Duty: Warzone plans to release on PS5 and Xbox Series X as the \"one constant\" for every new game in the franchise - GamesRadar+ AU", "description": "Warzone the \"through line that connects all of the different\" Call of Duty games going forward, confirms Infinity Ward", "url": "https://www.gamesradar.com/call-of-duty-warzone-plans-to-release-on-ps5-and-xbox-series-x-as-the-one-constant-for-every-new-game-in-the-franchise/", "urlToImage": "https://cdn.mos.cms.futurecdn.net/bevNkY3EuFpHQgmdiUuiWH-1200-80.jpg", "publishedAt": "2020-05-04T09:55:29Z", "content": "Call of Duty: Modern Warfare's free to play battle royale spin-off, Call of Duty: Warzone, has a long life ahead of it, including plans for a port for next-gen consoles the PS5 and Xbox Series X, and integration with future games in Activision's first-person … [+1414 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Henry St Leger", "title": "The PS5's 'instant' demos could pave the way for a better PS Now - TechRadar", "description": "Could PS5 games be playable 'within seconds'?", "url": "https://www.techradar.com/news/the-ps5s-instant-demos-could-pave-the-way-for-a-better-ps-now", "urlToImage": "https://cdn.mos.cms.futurecdn.net/udyrykPZU785aY7aCmf9cc-1200-80.jpg", "publishedAt": "2020-05-04T09:49:00Z", "content": "Looking forward to the PS5? One of the latest rumors surrounding the console concerns demos available for PS5 games, with one source claiming that every PS5 game will come with a free demo as standard. Whats more, the way its described hints at a smart use of… [+2729 chars]"}, {"source": {"id": null, "name": "Hitc.com"}, "author": "Callum Smith", "title": "Summer Game Fest schedule: Phase 1 publishers and platforms confirmed - HITC - Football, Gaming, Movies, TV, Music", "description": "The Summer Game Fest schedule will be soon be announced meanwhile all of the phase 1 publishers and platforms have been confirmed.", "url": "https://www.hitc.com/en-gb/2020/05/04/summer-game-fest-schedule-phase-1-publishers-platforms/", "urlToImage": "https://cdn.hitc-s.com/i/1818/summer_game_fest_schedule_phase_1_publishers_and_platforms_confi_1546656.jpg", "publishedAt": "2020-05-04T09:43:35Z", "content": "The Summer Game Fest schedule will be soon be announced meanwhile all of the phase 1 publishers and platforms have been confirmed.\r\nSeeing as there's no E3 2020 or any other in-house gaming events thanks to the coronavirus pandemic, Geoff Keighley has announc… [+3277 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Daniel Cooper", "title": "India's biggest mobile carrier left COVID-19 self-test data unsecured - Yahoo Finance Australia", "description": "Facebook's new best friend left a database connected to its COVID-19 checker unsecured for anyone to snoop.", "url": "https://au.finance.yahoo.com/news/jio-covid-19-database-leak-091506881.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/.Kbu_90H4GXpzRCWGBXKmw--~B/aD0yMDUxO3c9MzA3NztzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2020-04/a8668420-84d6-11ea-bafc-85853b066758", "publishedAt": "2020-05-04T09:15:00Z", "content": "Jio, the Indian mobile giant Facebook just bought a 9.9 percent stake in, may be at the center of its own privacy snafu. According to TechCrunch, the company didnt secure a database connected to a COVID-19 symptom checker it launched in March. Security resear… [+784 chars]"}, {"source": {"id": null, "name": "Motor1.com"}, "author": "Angel Sergeev", "title": "Tourists Are Back At The Nurburgring, See Their Cars - Motor1 ", "description": "\"Contactless tourist drives\" allow you to visit the track in a time of a global pandemic.", "url": "https://www.motor1.com/news/419745/tourists-back-at-nurburgring-video/", "urlToImage": "https://cdn.motor1.com/images/mgl/EjY93/s3/nurburgring-contactless-tourist-drives.jpg", "publishedAt": "2020-05-04T08:42:04Z", "content": "With a new concept, which focuses on the health of everyone involved, the Nürburgring will start on Thursday, April 30th, with \"contactless tourist drives\". Since the beginning of the Corona crisis, tourist drives will be the first activity that can take plac… [+2999 chars]"}, {"source": {"id": null, "name": "Theregister.co.uk"}, "author": "Robbie Harb", "title": "NASA signs deals to put a rocket under Artemis flights until 2029 - The Register", "description": "Orders 18 RS-25 core-stage engines from Aerojet Rocketdyne", "url": "https://www.theregister.co.uk/2020/05/04/nasa_sls_artemis_engine_orders/", "urlToImage": "https://regmedia.co.uk/2020/05/04/nasa_space_launch_system_first_stage.jpg", "publishedAt": "2020-05-04T07:57:00Z", "content": "NASA has picked an engine supplier for its controversial Space Launch System (SLS) program weeks after an audit chastised the space agency for blowing its budget.\r\nThe space agency said on Saturday it will plunge $1.79bn into a new order of 18 RS-25 engines f… [+2401 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Gareth Beavis", "title": "How to watch today's Joe Wicks' PE workout live today on YouTube - TechRadar", "description": "It's the beginning of the week - here's how to do PE with Joe (and Rosie Wicks too)", "url": "https://www.techradar.com/news/joe-wicks-pe-workout-youtube-monday-may-4", "urlToImage": "https://cdn.mos.cms.futurecdn.net/cSTcvWYdDVpqJbXdMs2rcj-1200-80.jpg", "publishedAt": "2020-05-04T07:40:00Z", "content": "Good morning - and welcome to a new week of doing PE with Joe Wicks. If you've been following from the start, you know the drill: if you want to watch today's workout, we're here to help (in more ways than just supplying the link).\r\nIf you're new to things, w… [+9347 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Vic Hood", "title": "How to get a Valorant beta key: what you need to know about Riot's new game - TechRadar New Zealand", "description": "From the makers of League of Legends", "url": "https://www.techradar.com/how-to/how-to-get-a-valorant-beta-key", "urlToImage": "https://cdn.mos.cms.futurecdn.net/3H8Ur89ptqGLvNcCShW6Dh-1200-80.jpg", "publishedAt": "2020-05-04T05:50:56Z", "content": "Valorant is the latest game from League of Legends developer, Riot Games. The 5v5 tactical shooter may be in closed beta, but don't think you can simply jump in and check it out. Getting a Valorant beta key is hard.\r\nIn order to be in with the chance of getti… [+7328 chars]"}, {"source": {"id": null, "name": "Idg.com.au"}, "author": "Fergus Halliday", "title": "Samsung Galaxy Z Flip review: Killer form-factor, lethal price-tag - Good Gear Guide", "description": "Brilliant form-factor, lethal price-tag", "url": "https://www.pcworld.idg.com.au/review/samsung/z-flip/678962/", "urlToImage": "https://www.goodgearguide.com.au/products/image/12913/angle/8/1500x1500/404220/", "publishedAt": "2020-05-04T05:43:33Z", "content": "Should You Buy The Galaxy Z Flip?\r\nSamsungs second stab at making a foldable smartphone has a killer form-factor that sets it apart from almost everything else out there. Unfortunately, by most metrics, it also lags behind everything else you could possibly b… [+12048 chars]"}, {"source": {"id": null, "name": "Gamersnexus.net"}, "author": "Eric Hamilton", "title": "HW News - Intel Xe GPU, NVIDIA Ampere Next-Gen GPUs, AMD CPU Sales Up, GPU Down - GamersNexus", "description": "AMD reconfirmed its commitment to RDNA2 in 2020, despite global economic and manufacturing challenges. NVIDIA, meanwhile, invites everyone to \"get amped\" for its upcoming GTC Online event, a clear indicator of Ampere GPUs.", "url": "https://www.gamersnexus.net/news-pc/3578-hw-news-intel-xe-gpu-nvidia-ampere-gpus-amd-cpu-sales", "urlToImage": "https://www.gamersnexus.net/media/k2/items/cache/410c9434c4dba55fe75434212a73bf09_M.jpg", "publishedAt": "2020-05-04T05:26:02Z", "content": "AMD Earnings: GPU Sales Decrease, CPU Increase\r\nAMD has reported its earnings for the first quarter, and it looks like AMD notched another record quarter. AMDs 1Q20 revenue came in at $1.79B, which is a 40% increase YoY, but a 16% decrease over last quarter. … [+13926 chars]"}, {"source": {"id": null, "name": "Ladbible.com"}, "author": "Stewart Perrie", "title": "Cyberpunk 2077 Won’t Be Censored In Australia And Gets R18+ Classification - LADbible", "description": "This will not be okay for kids.", "url": "https://www.ladbible.com/entertainment/gaming-cyberpunk-2077-wont-be-censored-in-australia-20200504", "urlToImage": "https://images.ladbible.com/thumbnail?type=jpeg&url=http://beta.ems.ladbiblegroup.com/s3/content/cc3e38935eaf978fed22095b035e018e.png&quality=70&width=808", "publishedAt": "2020-05-04T04:59:11Z", "content": "Hype for the video game Cyberpunk 2077 is reaching fever pitch. \r\nPeople are very excited about the first-person action game, where you get to play as 'V' in Night City, an American megacity in the Free State of California. V is a mercenary whose voice, face,… [+2466 chars]"}, {"source": {"id": null, "name": "Techguide.com.au"}, "author": "Stephen Fenech", "title": "Apple releases beta software update for the COVIDSafe app on iPhones - Tech Guide", "description": "Apple has just released the beta version of its iOS software that will allow the iPhone version of the Australian government’s COVIDSafe app to operate even more efficiently.This upcoming update will provide an API (application programming interface)", "url": "https://www.techguide.com.au/news/apps-news-feed/apple-releases-beta-software-update-covidsafe-app-iphones/", "urlToImage": "https://www.techguide.com.au/wp-content/uploads/2020/04/COVIDSafeDay11.jpeg", "publishedAt": "2020-05-04T04:24:06Z", "content": "Apple has just released the beta version of its iOS software that will allow the iPhone version of the Australian governments COVIDSafe app to operate even more efficiently.\r\nThis upcoming update will provide an API (application programming interface) for pub… [+1455 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Manish Singh", "title": "Classplus raises $9M to grow its Shopify-like platform for teachers and coaching centers in India - Yahoo Finance Australia", "description": "An India-based startup that has built a Shopify -like platform for coaching centers to accept fees digitally from students, and deliver classes and study material online has received the nod -- and capital -- from a number of high-profile investors.  The busi…", "url": "https://au.finance.yahoo.com/news/classplus-raises-9m-grow-shopify-023029112.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/lb8vCm0JTO.govadfUo2Mw--~B/aD05Mjk7dz0xNTAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/techcrunch_350/9bf66accc7e434081bcbd3b8e7a30d9c", "publishedAt": "2020-05-04T02:39:20Z", "content": "An India-based startup that has built a Shopify -like platform for coaching centers to accept fees digitally from students, and deliver classes and study material online has received the nod -- and capital -- from a number of high-profile investors.\r\nThe busi… [+3033 chars]"}, {"source": {"id": null, "name": "Marketingmag.com.au"}, "author": null, "title": "A survival kit to remote working - Marketing magazine Australia", "description": "For years now two of the most prevalent buzzwords across industries and professions have been agility and flexibility. Along with hot desking and remote working, they have epitomised a worldwide trend for BAU wherever that U is, as it were. Who knew that all …", "url": "https://www.marketingmag.com.au/hubs-c/a-survival-kit-to-remote-working/", "urlToImage": "https://www.marketingmag.com.au/wp-content/uploads/2020/04/Untitled-design.png", "publishedAt": "2020-05-04T02:02:31Z", "content": "For years now two of the most prevalent buzzwords across industries and professions have been agility and flexibility. Along with hot desking and remote working, they have epitomised a worldwide trend for BAU wherever that U is, as it were.\r\nWho knew that all… [+4654 chars]"}, {"source": {"id": null, "name": "Ausdroid.net"}, "author": null, "title": "Google Pixel 4a camera review leaks - Ausdroid", "description": "Every time a phone is about to be announced it seems that someone “accidentally” leaks the phone and its details on their website / YouTube channel. Overnight we have seen both. Related to the camera sample leak last week, Tecnolike Plus has revealed their Pi…", "url": "https://ausdroid.net/2020/05/04/google-pixel-4a-camera-review-leaks/", "urlToImage": "https://i2.wp.com/ausdroid.net/wp-content/uploads/2020/03/pixel-4a-evan-2.png?fit=872%2C506&ssl=1", "publishedAt": "2020-05-04T01:18:45Z", "content": null}, {"source": {"id": null, "name": "Phonemantra.com"}, "author": "Gourav", "title": "Apple computers say goodbye to VR. Valve discontinued SteamVR support on macOS - Phone Mantra", "description": "She appeared there in 2017 SteamVR support came on macOS in 2017. However, for the most part, Apple computers are not particularly suitable for games, and even more so games in virtual reality.  Apple computers say goodbye to VR. Valve discontinued SteamVR su…", "url": "https://phonemantra.com/apple-computers-say-goodbye-to-vr-valve-discontinued-steamvr-support-on-macos/", "urlToImage": "https://phonemantra.com/wp-content/uploads/2020/05/SteamVR.jpg", "publishedAt": "2020-05-04T01:02:00Z", "content": "Apparently, over the past few years, the platform has not become at least somewhat in demand on macOS, so in the end, Valve decided to stop supporting SteamVR on this operating system.\r\nThe short message said that Valve intends to concentrate on Windows and L… [+186 chars]"}, {"source": {"id": null, "name": "Remoteworkertech.asia"}, "author": "Sara Barker", "title": "Interview: How Google Meet tackles security in the remote working age - SecurityBrief Australia", "description": "I spoke to Google Cloud’s Asia Pacific and China (APAC) head of security for networking and collaboration specialists, Mark Johnston.", "url": "https://remoteworkertech.asia/story/interview-how-google-meet-tackles-security-in-the-remote-working-age", "urlToImage": "https://securitybrief.com.au/uploads/story/2020/05/01/Mark_1.jpg", "publishedAt": "2020-05-04T00:50:09Z", "content": "2020 may well be the year of the videoconference, as business travellers leave their suitcases at home and look to the internet to cover those all-important meetings. Google Meet is one video platform that has risen to the top of the ranks, with the company r… [+6516 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Jack Gramenz", "title": "Apple tweaks Face ID to bypass facial masks during coronavirus pandemic - NEWS.com.au", "description": "Apple tweaks Face ID to bypass facial masks during coronavirus pandemic", "url": "https://www.news.com.au/technology/gadgets/mobile-phones/apple-tweaks-face-id-to-bypass-facial-masks-during-coronavirus-pandemic/news-story/d92611ae435b92589db6323b6f3216d0", "urlToImage": "https://cdn.newsapi.com.au/image/v1/2b18f9d02f6546a7ec162059faae29ea?width=650", "publishedAt": "2020-05-04T00:42:38Z", "content": "Apple is updating its operating system to make it quicker to bypass the Face ID system to unlock your iPhone after a surge in people wearing facial masks to defend against coronavirus.Apple introduced the Face ID unlock system in 2017’s iPhone X.\r\nPreviously … [+2943 chars]"}, {"source": {"id": null, "name": "Lifehacker.com.au"}, "author": "David Murphy", "title": "Why Can't My Smart Speakers Stream Music Correctly? - Lifehacker Australia", "description": "It’s a common issue: You, or someone you know, has splurged on an amazingly fast internet connection—but they still can’t get their wired and wireless devices to play nicely within their home or apartment. This invariably leads to the question, “Why am I payi…", "url": "https://www.lifehacker.com.au/2020/05/why-cant-my-smart-speakers-stream-music-correctly/", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/pttpkxmxjrah96x1fbpc.jpg", "publishedAt": "2020-05-03T22:29:00Z", "content": "Its a common issue: You, or someone you know, has splurged on an amazingly fast internet connectionbut they still cant get their wired and wireless devices to play nicely within their home or apartment. This invariably leads to the question, Why am I paying s… [+9514 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Jon Fingas", "title": "France will start testing its COVID-19 tracking app the week of May 11th - Yahoo News Australia", "description": "France will learn about the efficacy of COVID-19 tracking apps when it starts testing StopCOVID the week of May 11th.", "url": "https://au.news.yahoo.com/france-covid-19-tracking-app-testing-starts-may-11-week-222030056.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/S_gzvqN3mwXWwlqtVter_g--~B/aD0zNDQ0O3c9NTAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2020-05/be0b1580-8d7c-11ea-bfed-6ff5b710e8c7", "publishedAt": "2020-05-03T22:20:00Z", "content": "France was one of the first countries scrambling to create a COVID-19 contact tracing app, and now its close to finding out how its app works in practice. Digital Affairs Minister Cedric O has stated (via Reuters) that Frances StopCOVID should enter real-worl… [+1177 chars]"}, {"source": {"id": null, "name": "Happygamer.com"}, "author": "Seb Bates", "title": "Overwatch Makes Massive Changes To Hero Pools And Removes Restrictions From Most Ranks - Happy Gamer", "description": "There has been a fair bit of controversy around Hero Pools in Overwatch since their release, from the banning of Echo shortly after her introduction...", "url": "https://happygamer.com/overwatch-makes-massive-changes-to-hero-pools-and-removes-restrictions-from-most-ranks-64683/", "urlToImage": "https://happygamer.com/wp-content/uploads/2020/05/6f57a131feb590e3d3822f4ce195662c.png", "publishedAt": "2020-05-03T21:12:13Z", "content": "There has been a fair bit of controversy around Hero Pools in Overwatch since their release, from the banning of Echo shortly after her introduction to the game, to players concerned that the new algorithm is not working as intended. It seems now that Blizzar… [+2187 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Steven Musil", "title": "Apple CEO Tim Cook invokes 1918 epidemic in virtual commencement address - CNET", "description": "Cook draws comparison between what the graduates can achieve under these trying times to the accomplishments of those who lived through the 1918 flu epidemic.", "url": "https://www.cnet.com/news/apple-ceo-tim-cook-invokes-1918-epidemic-in-virtual-commencement-address/", "urlToImage": "https://cnet1.cbsistatic.com/img/qGnOk3mGaERk6rA4uoaLnQB07Qc=/756x567/2020/05/03/ea203aa6-f38e-484e-abf9-7b31abff89cc/cook-ohio-state-address-2020.jpg", "publishedAt": "2020-05-03T20:12:44Z", "content": "Apple CEO Tim Cook delivers a virtual commencement address to Ohio State's graduating class of 2020.\r\nOhio State via YouTube\r\nFor the most up-to-date news and information about the coronavirus pandemic, visit the WHO website.\r\nApple CEO Tim Cook on Sunday del… [+2352 chars]"}, {"source": {"id": null, "name": "Tomsguide.com"}, "author": "Louis Ramirez", "title": "Insanely cheap Google Home deal drops price to $29 - Tom's Guide", "description": "This smart speaker can extend Google's tools beyond your computer or mobile device.", "url": "https://www.tomsguide.com/news/insanely-cheap-google-home-deal-drops-price-to-dollar29", "urlToImage": "https://cdn.mos.cms.futurecdn.net/8AVJHS9E29TFh97hUG9RBD-1200-80.jpg", "publishedAt": "2020-05-03T20:04:20Z", "content": "Update: Best Buy has sold out, but Kohl's and Home Depot have stock at the same $29 price. \r\nBlack Friday is nowhere on our minds right now, but Best Buy is offering an insane Black Friday-like price on the OG Google Home smart speaker. \r\nFor a limited time, … [+1371 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Souhardya Biswas", "title": "Epic Games Cancel Fortnite World Cup 2020 and Other Tournaments To Be Held Online - Essentially Sports", "description": "There is a feeling of disappointment across gaming communities as the list of canceled events keeps growing. Fortnite World Cup 2020 is the latest addition.", "url": "https://www.essentiallysports.com/epic-games-cancel-fortnite-world-cup-2020-and-other-tournaments-to-be-held-online-esports-news-2020/", "urlToImage": "https://image-cdn.essentiallysports.com/wp-content/uploads/20200504003306/unnamed-57.jpg", "publishedAt": "2020-05-03T19:17:00Z", "content": "The coronavirus pandemic has been raging across the globe for several months, infecting and endangering millions of lives. Lives of numerous unfortunate people have succumbed to the virus. The only way to break the chain of transmission is by practicing stric… [+2544 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Eddie Makuch", "title": "Assassin's Creed Valhalla: Choose Between Man And Woman - GameSpot", "description": "Ubisoft's next big Assassin's Creed game will carry forward the option from Odyssey, letting you choose a male or female character.", "url": "https://www.gamespot.com/articles/assassins-creed-valhalla-choose-between-man-and-wo/1100-6476675/", "urlToImage": "https://gamespot1.cbsistatic.com/uploads/screen_kubrick/1179/11799911/3664187-491495eaa1d61e8d7e1.77200813-acv_visceral_combat_male.jpg", "publishedAt": "2020-05-03T19:04:00Z", "content": "2018's Assassin's Creed Odyssey allowed players to choose their gender, picking between a man or a woman, and 2020's game Assassin's Creed Valhalla will carry this feature forward. Rather than have two siblings available this time, however, you will choose be… [+1810 chars]"}, {"source": {"id": null, "name": "Finder.com.au"}, "author": "Alex Kidman", "title": "Apple iPhone SE 2020 review - finder.com.au", "description": "Apple's upgraded iPhone SE 2020 doesn't have great battery life, but it's an excellent option, especially for those looking to upgrade from an older iPhone.", "url": "https://www.finder.com.au/apple-iphone-se-2020", "urlToImage": "https://www.finder.com.au/wp-content/uploads/2020/04/AppleiPhoneSE2020_SamplePortraitPhoto_1_AlexKidman_Finder_738x554.jpg", "publishedAt": "2020-05-03T18:37:53Z", "content": "The iPhone SE 2020 only features a single 12MP lens at the rear, and that's a very retro design decision on Apple's part. Apple has officially played it a little coy when asked if it is in fact the same 12MP lens array as found in 2017's iPhone 8, but an inde… [+3964 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Zack Zwiezen", "title": "Fans Are Using Forced Perspective In Animal Crossing To Create Some Amazing Things - Kotaku Australia", "description": "Animal Crossing: New Horizons has a large community of fans who all seem to have endless creative ideas. One new creative trick that’s become popular is using forced perspective to create impressive landscapes and scenes....", "url": "https://www.kotaku.com.au/2020/05/fans-are-using-forced-perspective-in-animal-crossing-to-create-some-amazing-things/", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/oh913yo8yyunsahpd50p.jpg", "publishedAt": "2020-05-03T18:00:00Z", "content": "Animal Crossing: New Horizons has a large community of fans who all seem to have endless creative ideas. One new creative trick thats become popular is using forced perspective to create impressive landscapes and scenes.\r\nForced perspective is when you distan… [+1161 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Lynn La", "title": "Pixel 4A and 4A XL: Rumors, release dates, specs, prices and more - CNET", "description": "The most compelling rumors surrounding Google's next budget phones.", "url": "https://www.cnet.com/news/pixel-4a-and-4a-xl-rumors-release-dates-specs-prices-more/", "urlToImage": "https://cnet4.cbsistatic.com/img/WAAC5M0Uh4YYt9EatKW1J4ze8vs=/2019/11/16/8da2a1b6-cb94-4129-90b5-93469ab0bc8f/20191017-google-pixel-4-001.jpg", "publishedAt": "2020-05-03T17:16:57Z", "content": "The Pixel 4 XL.\r\nStephen Shankland/CNET\r\nIn May of last year, Google launched the Pixel 3A and 3A XL. It was the Pixel phones' first foray into a more affordable price bracket -- and perhaps Google's return to the cheaper Nexus days of yore. Priced at hundred… [+4531 chars]"}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "Xiaomi Mi Band 5 Live View [Update] - Somag News", "description": "Mi Band 5, the new smart wristband of Xiaomi, one of the most remarkable technology manufacturers of recent times, was first seen as a bloody live. The images say that the new bracelet will appear with an oval and perforated design instead of the classic squa…", "url": "https://www.somagnews.com/xiaomi-mi-band-5-live-view-update/", "urlToImage": "https://www.somagnews.com/wp-content/uploads/2020/05/26-2-e1588524396449.jpg", "publishedAt": "2020-05-03T16:46:00Z", "content": "Mi Band 5, the new smart wristband of Xiaomi, one of the most remarkable technology manufacturers of recent times, was first seen as a bloody live. The images say that the new bracelet will appear with an oval and perforated design instead of the classic squa… [+2084 chars]"}, {"source": {"id": null, "name": "Canberratimes.com.au"}, "author": "Steve Evans", "title": "Diary of an Optimist: Your essential guide to essential pandemic reading - The Canberra Times", "description": "Which is more essential, toilet paper or a book?", "url": "https://www.canberratimes.com.au/story/6737755/your-essential-guide-to-essential-pandemic-reading/", "urlToImage": "https://nnimgt-a.akamaihd.net/transform/v1/crop/frm/steve.evans/abf43fbe-f4b0-45aa-8ae7-8dbb2cf7fc30.jpg/r1_509_3316_2382_w1200_h678_fmax.jpg", "publishedAt": "2020-05-03T16:00:00Z", "content": ""}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Steve Watts", "title": "In Time For Star Wars Day, Star Wars Battlefront 2 Gets Final Content Update - GameSpot", "description": "You can don Darth Maul's robotic legs and Palpatine's stylish new robes while doing battle on Scarif with the last Star Wars Battlefront 2 update.", "url": "https://www.gamespot.com/articles/in-time-for-star-wars-day-star-wars-battlefront-2-/1100-6476589/", "urlToImage": "https://gamespot1.cbsistatic.com/uploads/screen_kubrick/1585/15855271/3663235-swbf2-1920x1080-march-patch-scarif-vista.jpg.adapt.crop16x9.1455w.jpg", "publishedAt": "2020-05-03T15:57:00Z", "content": "The Skywalker Saga of Star Wars films has come to a close, and Star Wars Battlefront 2 is finishing up too. The latest update, which will be the final major piece of post-launch content, adds loads of cosmetic options, game mode changes, and balance tweaks. A… [+1504 chars]"}, {"source": {"id": null, "name": "Somagnews.com"}, "author": null, "title": "The 7.26c Patch for Dota 2 Includes Many Skill Changes - Somag News", "description": "The new patch of Dota 2, one of Valve’s favorite games, 7.26c has been officially released. There are many changes to the patch. The most striking of these is the ability changes. Valve officially launched the 7.26c patch for Dota 2, which was followed with i…", "url": "https://www.somagnews.com/7-26c-patch-dota-2-includes-many-skill-changes/", "urlToImage": "https://www.somagnews.com/wp-content/uploads/2020/05/10-3-e1588521214277.jpg", "publishedAt": "2020-05-03T15:53:00Z", "content": "The new patch of Dota 2, one of Valve’s favorite games, 7.26c has been officially released. There are many changes to the patch. The most striking of these is the ability changes.\r\nValve officially launched the 7.26c patch for Dota 2, which was followed with … [+2145 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Zack Zwiezen", "title": "Even After A Large Increase Due To Half-Life: Alyx, Less Than 2% Of Steam Users Own VR Headsets - Kotaku Australia", "description": "Half-Life: Alyx helped lead a large surge of new VR headsets being connected to Steam, according to data from Valve. However, the percentage of Steam users who own VR headsets is still hovering at around 1.9%....", "url": "https://www.kotaku.com.au/2020/05/even-after-a-large-increase-due-to-half-life-alyx-less-than-2-of-steam-users-own-vr-headsets/", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/blddykvb0pwpklsgtm5l.jpg", "publishedAt": "2020-05-03T15:25:00Z", "content": "Half-Life: Alyx helped lead a large surge of new VR headsets being connected to Steam, according to data from Valve. However, the percentage of Steam users who own VR headsets is still hovering at around 1.9%.\r\nAccording to a recent hardware survey from Valve… [+1450 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "David Nield", "title": "Apple's 13-inch MacBook Pro refresh could bring more memory and storage - TechRadar", "description": "Double the RAM, double the SSD?", "url": "https://www.techradar.com/news/apples-13-inch-macbook-pro-refresh-could-bring-more-memory-and-storage", "urlToImage": "https://cdn.mos.cms.futurecdn.net/c2oPFfxE4Scj2mhmpCGV7c-1200-80.jpg", "publishedAt": "2020-05-03T15:00:00Z", "content": "At this point it seems inevitable that Apple is going to refresh its 13-inch MacBook Pro line in the same way that it recently did with the 16-inch models we saw last year, and new leaks hint that more memory and more storage are on the way too.\r\nTrusted tips… [+1650 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Android TV devices can now be added to speaker groups in the Google Home app - XDA Developers", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiRGh0dHBzOi8vd3d3LnhkYS1kZXZlbG9wZXJzLmNvbS9hbmRyb2lkLXR2LXNwZWFrZXItZ3JvdXAtZ29vZ2xlLWhvbWUv0gFIaHR0cHM6Ly93d3cueGRhLWRldmVsb3BlcnMuY29tL2FuZHJvaWQtdHYtc3BlYWtlci1ncm91cC1nb29nbGUtaG9tZS9hbXAv?oc=5", "urlToImage": null, "publishedAt": "2020-05-03T14:34:21Z", "content": null}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Davey Winder", "title": "Ghost Confirms Hack Attack: 750,000 Users Spooked By Critical Vulnerability - Forbes", "description": "Popular open-source blogging platform with more than 2 million installs confirms it has been hacked.", "url": "https://www.forbes.com/sites/daveywinder/2020/05/03/ghost-confirms-hack-attack-750000-users-spooked-by-critical-vulnerability/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F5eaec088bf289800084684a1%2F0x0.jpg", "publishedAt": "2020-05-03T13:30:35Z", "content": "A popular open-source blogging platform confirms it has been hacked\r\nGetty\r\nPopular open-source blogging platform with more than 2 million installs confirms it has been hacked.\r\nAlthough most people tend to immediately think of WordPress when asked to name a … [+3461 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Rumors Swirl on NVIDIA's Ampere GPUs Being TSMC 7nm - WccftechTV", "description": "NVIDIA’s Ampere GPUs Based on TSMC’s 7nm Node, Next-Gen Hopper GPUs Based on Samsung’s 5nm EUV Process, Alleges Rumor – Mass Production Begins This Quarter h...", "url": "https://www.youtube.com/watch?v=CtCibD1ZUcM", "urlToImage": "https://i.ytimg.com/vi/CtCibD1ZUcM/maxresdefault.jpg", "publishedAt": "2020-05-03T13:12:44Z", "content": "NVIDIAs Ampere GPUs Based on TSMCs 7nm Node, Next-Gen Hopper GPUs Based on Samsungs 5nm EUV Process, Alleges Rumor Mass Production Begins This Quarter\r\nhttps://wccftech.com/nvidias-ampere-g...\r\nwww.facebook.com/wccftechwww.twitter.com/wccftechdotcomwww.youtub… [+128 chars]"}, {"source": {"id": null, "name": "Pcmag.com"}, "author": "Justin Herrick", "title": "New Sonos Playbar Leak Hints at Redesign - PCMag AU", "description": "Introduced in 2013, Sonos’ Playbar is long-overdue for a redesign. Sonos now appears set to release a modernized unit with a fresh look and upgraded features like Dolby Atmos sometime in June.", "url": "https://au.pcmag.com/mp3-players/66725/new-sonos-playbar-leak-hints-at-redesign", "urlToImage": "https://sm.pcmag.com/t/pcmag_au/news/n/new-sonos-/new-sonos-playbar-leak-hints-at-redesign_cxbf.1200.jpg", "publishedAt": "2020-05-03T13:09:00Z", "content": "Sonos could soon release a new Playbar, replacing its top-tier soundbar that debuted in 2013. Zatz Not Funny obtained images of the still-unofficial product, and its clear that Sonos plans to align the new Playbar's appearance with the rest of its lineup thro… [+1738 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Can Intel's 10th Gen desktop CPUs compete, or are they more of the same? | Upscaled Mini - Engadget", "description": "Intel's new \"Comet Lake\" 10th gen desktop CPUS check a lot of boxes, up to 10 cores on a flagship, even higher boost speeds (up to 5.3GHz), and hyperthreadin...", "url": "https://www.youtube.com/watch?v=6o6IqOMgZnU", "urlToImage": "https://i.ytimg.com/vi/6o6IqOMgZnU/maxresdefault.jpg", "publishedAt": "2020-05-03T13:00:06Z", "content": "Intel's new \"Comet Lake\" 10th gen desktop CPUS check a lot of boxes, up to 10 cores on a flagship, even higher boost speeds (up to 5.3GHz), and hyperthreading down the line. But they're also still the same 14nm process and Skylake architecture we've seen over… [+589 chars]"}, {"source": {"id": null, "name": "Purexbox.com"}, "author": "Pure Xbox", "title": "The Best Xbox One Controller Has Been Crowned In An Official Instagram Poll - Pure Xbox", "description": "Here's the winner", "url": "https://www.purexbox.com/news/2020/05/the_best_xbox_one_controller_has_been_crowned_in_an_official_instagram_poll", "urlToImage": "https://images.purexbox.com/3ae9aab3cc0a5/1280x720.jpg", "publishedAt": "2020-05-03T11:00:00Z", "content": "The official Xbox UK Instagram has been putting Xbox One controllers in head-to-head voting battles all week, and a winner has finally been crowned! Social Marketing Manager Graeme Boyd (AceyBongos) took to Twitter to reveal that the Sea of Thieves Limited Ed… [+560 chars]"}, {"source": {"id": null, "name": "Perfdrive.com"}, "author": null, "title": "Meet C9 TenZ - The first player to reach the highest Valorant rank - Sportskeeda", "description": null, "url": "http://validate.perfdrive.com/sportskeeda/captcha?ssa=2686bb6b-a0b4-68b9-8065-e527cef65942&ssc=http:%2F%2Fwww.sportskeeda.com%2Fesports%2Fmeet-c9-tenz-the-first-player-to-reach-the-highest-valorant-rank&ssi=c72a57f4-a33a-a1f6-b0a4-8cc7610727f1&ssk=contactus@shieldsquare.com&ssm=87595908409775786108070642096593&ssn=b0e3fa912f1cd43df1b30925f0ab66893b119d069224-a80d-a622-7b5de7&sso=7e960c02-4123824f4672f009ab64528ceeba69e8ae652aacde90bbeb&ssp=13854960901588541978158854608980433&ssq=18596550303048729218203030439570958453935&ssr=NTEuMTYxLjE0LjQx&sst=Mozilla/5.0 (Windows NT 6.2) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/28.0.1464.0 Safari/537.36&ssw=", "urlToImage": null, "publishedAt": "2020-05-03T10:00:18Z", "content": "...but your activity and behavior on this site made us think that you are a bot.\r\nNote: A number of things could be going on here.\r\n<ol><li>If you are attempting to access this site using an anonymous Private/Proxy network, please disable that and try accessi… [+157 chars]"}, {"source": {"id": null, "name": "Notebookcheck.net"}, "author": "Daniel R Deakin", "title": "AMD Ryzen 5 4600HS in Asus ROG Zephyrus G14 scores higher than the average Intel Core i7-10750H on UserBenchmark but still gets a lower bench result - Notebookcheck.net", "description": "An AMD Ryzen 5 4600HS APU sample has been spotted on UserBenchmark as part of an Asus ROG Zephyrus G14 laptop. The new Ryzen 4000 chip racked up some excellent scores on the benchmark that offered a higher overall score than the average overall score of all t…", "url": "https://www.notebookcheck.net/AMD-Ryzen-5-4600HS-in-Asus-ROG-Zephyrus-G14-scores-higher-than-the-average-Intel-Core-i7-10750H-on-UserBenchmark-but-still-gets-a-lower-bench-result.463601.0.html", "urlToImage": "https://www.notebookcheck.net/fileadmin/Notebooks/News/_nc3/rog_zephyrus_7.jpg", "publishedAt": "2020-05-03T09:11:30Z", "content": "UserBenchmarks questionable scoring system seems to have been tested once again thanks to the appearance of an AMD Ryzen 5 4600HS sample on the test site. The Ryzen 4000 part was tested inside an Asus ROG Zephyrus G14 GA401II gaming laptop. The overall benchm… [+1745 chars]"}, {"source": {"id": null, "name": "Glitched.online"}, "author": "https://www.facebook.com/marco.cocomello", "title": "Free Games - Assassin's Creed 2, Child of Light & Rayman Legends - GLITCHED", "description": "", "url": "https://www.glitched.online/free-games-assassins-creed-2-and-more/", "urlToImage": "https://www.glitched.online/wp-content/uploads/2020/05/apps.24056.67608528792882784.56fd0e59-8e5c-4c63-9eca-864b4e57fa73.jpg", "publishedAt": "2020-05-03T08:47:02Z", "content": null}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Adam Mccleery For Daily Mail Australia", "title": "Residents at Sydney high-rise wait up to an hour to enter the lift due to COVID-19 restrictions - Daily Mail", "description": "Residents at a Sydney high rise are waiting up to an hour to get the lift to their apartments because of COVID-19 social distancing restrictions.", "url": "https://www.dailymail.co.uk/news/article-8281427/Residents-Sydney-high-rise-wait-hour-enter-lift-COVID-19-restrictions.html", "urlToImage": "https://i.dailymail.co.uk/1s/2020/05/03/03/27937922-0-image-a-20_1588471295389.jpg", "publishedAt": "2020-05-03T07:52:00Z", "content": "A frustrated resident has shared a photo of a huge queue to the elevators at his high-rise Sydney apartment building due to coronavirus social distancing restrictions.\r\nThe man shared a photo showing a line of people stretching from the lobby of V by Crown Gr… [+2907 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": null, "title": "EventBot is the newest Android malware that invades banking apps and bypasses 2FA - Micky News", "description": "EventBot, the newest Android malware breaks in banking apps, cryptocurrency wallets, and copies two-factor authentication codes.", "url": "https://micky.com.au/eventbot-is-the-newest-android-malware-that-invades-banking-apps-and-bypasses-2fa/", "urlToImage": "https://micky.com.au/wp-content/uploads/2020/05/pix-credit-card-hack.jpg", "publishedAt": "2020-05-03T04:06:15Z", "content": "The newest Android malware puts all Android users at risk as it invades devices without the user noticing it. Whats worse is that the said threat has the capability to access confidential applications and even bypass the two-factor authentication.\r\nA team of … [+2617 chars]"}, {"source": {"id": null, "name": "Mamamia.com.au"}, "author": "Beth Bruno", "title": "\"I pray you have found a way to heal the wounds I created.\" A letter to my estranged daughter. - Mamamia", "description": "A letter to my estranged daughter: You were precious beyond words and I loved you so fiercely, but I should have been taking better care of you.", "url": "https://www.mamamia.com.au/letter-to-estranged-daughter/", "urlToImage": "https://cdn.mamamia.com.au/wp/wp-content/uploads/2020/04/23181700/GettyImages-1138408920-2.jpg", "publishedAt": "2020-05-03T03:40:51Z", "content": "I wonder, though, if you weren’t attempting to cover the pain, to mitigate the pain for us. It was a job you never should have taken on, and if I had realised what was happening, I would have made sure that you were getting your needs met, not allowing you to… [+2233 chars]"}, {"source": {"id": null, "name": "Comicbook.com"}, "author": "Tyler Fischer", "title": "Nintendo Switch Getting New Sci-Fi Thriller This August - ComicBook.com", "description": "Nintendo Switch is getting a new sci-fi thriller. Wired Productions and Keoken Interactive have announced that Deliver Us The Moon is coming to the Nintendo platform this August, or more specifically, August 14. We knew the 2019's sci-fi game was coming to th…", "url": "https://comicbook.com/gaming/news/nintendo-switch-lite-deliver-us-the-moon-release-date/", "urlToImage": "https://media.comicbook.com/2020/05/deliver-us-the-moon-3-1218618-640x320.jpeg", "publishedAt": "2020-05-03T02:43:48Z", "content": "Nintendo Switch is getting a new sci-fi thriller. Wired Productions and Keoken Interactive have announced that Deliver Us The Moon is coming to the Nintendo platform this August, or more specifically, August 14. We knew the 2019's sci-fi game was coming to th… [+1912 chars]"}, {"source": {"id": null, "name": "Micky.com.au"}, "author": null, "title": "New Summer Game Fest announced by Geoff Keighley - Micky News", "description": "Geoff Keighley has announced Summer Game Fest, a 4-month online festival that offers in-game events, breaking news, and free playable content.", "url": "https://micky.com.au/new-summer-game-fest-announced-by-geoff-keighley/", "urlToImage": "https://micky.com.au/wp-content/uploads/2020/05/geoff-keighley-summer-game-fest.jpg", "publishedAt": "2020-05-03T01:35:00Z", "content": "The newly unveiled Summer Game Fest will happen from May through August of this year and is being positioned by Keighley as an industry-wide global event that celebrates video games.\r\nKeighley took the opportunity to do the unveiling himself through his offic… [+3014 chars]"}, {"source": {"id": null, "name": "Notebookcheck.net"}, "author": "Alex Alderson", "title": "Energy Star confirms Core i7-1065G7 and 32 GB of RAM for the Surface Book 3 but no Ryzen 4000 Renoir options; third Surface Go 2 SKU confirmed too - Notebookcheck.net", "description": "Featuring a Core i7-1065G7 and 32 GB of RAM, the Surface Book 3 SKUs that have flown through Energy Star are sizeable upgrades over their predecessors. It looks increasingly unlikely that there will be any Ryzen 4000 Renoir options, though. Energy Star has co…", "url": "https://www.notebookcheck.net/Energy-Star-confirms-Core-i7-1065G7-and-32-GB-of-RAM-for-the-Surface-Book-3-but-no-Ryzen-4000-Renoir-options-third-Surface-Go-2-SKU-confirmed-too.463569.0.html", "urlToImage": "https://www.notebookcheck.net/fileadmin/Notebooks/News/_nc3/download4691.png", "publishedAt": "2020-05-03T00:31:30Z", "content": "The Surface Book 3 has reared its head again, this time at Energy Star. Listed along with the Surface Go 2 in recent certification publications, Microsoft is expected to unveil new Surface hardware this month.\r\nWhile the Surface Book 3 has been nailed on as o… [+2607 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Love Bug's creator tracked down to repair shop - BBC News", "description": "Two decades after the world's first major computer virus, an author finds the perpetrator in Manila.", "url": "https://www.bbc.co.uk/news/technology-52458765", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/51F8/production/_112048902_love_bug-nc-1.png", "publishedAt": "2020-05-03T00:07:48Z", "content": "The man behind the world's first major computer virus outbreak has admitted his guilt, 20 years after his software infected millions of machines worldwide.\r\nFilipino Onel de Guzman, now 44, says he unleashed the Love Bug computer worm to steal passwords so he… [+4937 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Lynn La", "title": "iPhone SE vs. iPhone 8 comparison: Which $400 iPhone should you get? - CNET", "description": "Some retailers are still selling the iPhone 8 despite Apple discontinuing the device. But you should just get the new iPhone SE instead.", "url": "https://www.cnet.com/news/iphone-se-vs-iphone-8-specs-comparison-400-iphone-should-you-get-buy-price/", "urlToImage": "https://cnet2.cbsistatic.com/img/rRpPCtNX3TwDGXdL9PWDQ18zBQg=/2020/04/25/45482eb3-9ef6-4294-91ab-efd1f3c1dabc/apple-iphone-se-1339-edit.jpg", "publishedAt": "2020-05-02T23:27:08Z", "content": "In a bid to lure budget-minded iPhone fans, Apple debuted its new iPhone SE for 2020 for $399 (£419, AU$749). The new iPhone SE's specs and looks are similar to the iPhone 8 from three years ago, which is likely the reason why the tech company announced it wo… [+8360 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "The Last of Us 2 Available For Pre-Order Again After Delay and Leaks - Screen Rant", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiP2h0dHBzOi8vc2NyZWVucmFudC5jb20vbGFzdC1vZi11cy0yLXByZW9yZGVyLWFmdGVyLWRlbGF5LWxlYWtzL9IBQ2h0dHBzOi8vc2NyZWVucmFudC5jb20vbGFzdC1vZi11cy0yLXByZW9yZGVyLWFmdGVyLWRlbGF5LWxlYWtzL2FtcC8?oc=5", "urlToImage": null, "publishedAt": "2020-05-02T22:25:50Z", "content": null}, {"source": {"id": null, "name": "Businessinsider.com.au"}, "author": "Kelly McLaughlin", "title": "A 104-year-old Brooklyn woman who lived through the Spanish flu and once had stage 4 melanoma just recovered from the coronavirus - Business Insider Australia", "description": "A 104-year-old woman in New York is recovering from COVID-19, and her nursing home is calling it a “miracle.”", "url": "https://www.businessinsider.com.au/104-year-old-ida-acconciamessa-survived-covid-19-2020-5", "urlToImage": "https://i.insider.com/5eadc5b73dac9a776540f7f3", "publishedAt": "2020-05-02T19:40:02Z", "content": "<ul><li>\r\nIda Acconciamessa, who lives at the Sheepshead Nursing and Rehabilitation Centre in Brooklyn, New York, is recovering from COVID-19 after testing positive for the virus on April 4.\r\n</li><li>\r\nHer daughter, Barbara Senese, told CBS News that Acconci… [+2654 chars]"}, {"source": {"id": null, "name": "Gizmodo.com.au"}, "author": "Alyse Stanley", "title": "These Coronavirus-Fighting Smart Glasses Can 'See' Your Temperature - Gizmodo Australia", "description": "Chinese startup Rokid has found a unique and somewhat terrifying market foothold for its AI and augmented-reality tech amid the coronavirus pandemic: smart glasses that clock the temperature of those around you....", "url": "https://www.gizmodo.com.au/2020/05/these-coronavirus-fighting-smart-glasses-can-see-your-temperature/", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/k6kv1rtarufnuoacjqsa.jpg", "publishedAt": "2020-05-02T18:53:00Z", "content": "Chinese startup Rokid has found a unique and somewhat terrifying market foothold for its AI and augmented-reality tech amid the coronavirus pandemic: smart glasses that clock the temperature of those around you.\r\nThe Hangzhou-based company has already sold ro… [+2112 chars]"}, {"source": {"id": null, "name": "Happygamer.com"}, "author": "Kevin J. Kessler", "title": "Sony Announces A Brand New Release Date For Ghost Of Tsushima Following COVID-19 Delays - Happy Gamer", "description": "A lot of attention is currently being paid to Sony's major announcement that The Last of Us Part II will be released on June 19. However, part of...", "url": "https://happygamer.com/sony-announces-a-brand-new-release-date-for-ghost-of-tsushima-following-covid-19-delays-64574/", "urlToImage": "https://happygamer.com/wp-content/uploads/2020/01/3065b8feacf8178ef3668275113090d9.jpg", "publishedAt": "2020-05-02T17:52:15Z", "content": "A lot of attention is currently being paid to Sony’s major announcement that The Last of Us Part II will be released on June 19. However, part of that same announcement gave us an all-new release date for Sucker Punch’s samurai adventure game, Ghost of Tsushi… [+2118 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Jon Fingas", "title": "Sonos is reportedly giving the Playbar a long-awaited redesign - Yahoo Finance Australia", "description": "Sonos appears to be giving the Playbar an overdue makeover, including a slicker  design and likely connectivity improvements.", "url": "https://au.finance.yahoo.com/news/sonos-playbar-redesign-leak-174437699.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/9O2TkiKY7xJ3wxNYvX.f9w--~B/aD03MTM7dz0xNjAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2020-05/95c00d10-8c82-11ea-afa4-77fbf955e161", "publishedAt": "2020-05-02T17:44:00Z", "content": "Youd be forgiven for thinking that Sonos had forgotten about the Playbar while its been happy to introduce newer hardware like the Beam and Playbase, its original soundbar still has that 2013-era design and core functionality. At last, though, Sonos appears r… [+1229 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Steve Watts", "title": "The Last Of Us 2 And Ghost Of Tsushima Both Delayed, Coming This Summer - GameSpot", "description": "It's back-to-back blockbusters as Sony announces two of its biggest PS4 games, The Last of Us Part 2 and Ghost of Tsushima, will hit within a month of each other.", "url": "https://www.gamespot.com/articles/the-last-of-us-2-and-ghost-of-tsushima-both-delaye/1100-6476536/", "urlToImage": "https://gamespot1.cbsistatic.com/uploads/screen_kubrick/1585/15855271/3662287-3165121-screen_tlou2_teaser_03.jpg", "publishedAt": "2020-05-02T17:27:00Z", "content": "Sony has announced new release dates for two of its biggest PS4 blockbusters, both coming within the next few months. The Last of Us 2, which had been delayed indefinitely due to coronavirus, is now releasing on June 19, and Ghost of Tsushima, the next game f… [+1449 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Alessandro Barbosa", "title": "Call Of Duty: Modern Warfare's Enormous Patch Size Annoys Players - GameSpot", "description": "With another large update this week, Call of Duty: Modern Warfare's file size is approaching half that of standard console hard drives.", "url": "https://www.gamespot.com/articles/call-of-duty-modern-warfares-enormous-patch-size-a/1100-6476643/", "urlToImage": "https://gamespot1.cbsistatic.com/uploads/screen_kubrick/1585/15853545/3663782-7710237981-apps.1926.68332208580498659.9222b095-8101-4531-b386-33547ee9944f.9fe84d5d-ef45-4807-98c3-d0978ab24399", "publishedAt": "2020-05-02T17:16:00Z", "content": "Since launch, Call of Duty: Modern Warfare has been steadily growing in size thanks to its frequent, large updates. Following this week's latest patch and additional DLC content, the Modern Warfare file size now occupies close to 200GB on any given platform, … [+3298 chars]"}, {"source": {"id": null, "name": "Purexbox.com"}, "author": "Pure Xbox", "title": "More Xbox Series X Reveal Plans Will Be Announced Next Week, Says Exec - Pure Xbox", "description": "\"We've got a lot to share this summer\"", "url": "https://www.purexbox.com/news/2020/05/more_xbox_series_x_reveal_plans_will_be_announced_next_week_says_exec", "urlToImage": "https://images.purexbox.com/929cfcfd3b4bb/1280x720.jpg", "publishedAt": "2020-05-02T17:00:00Z", "content": "We're all eagerly anticipating next week's big Xbox Series X event as part of Inside Xbox, but first-party titles from Xbox Game Studios won't be featured. GM of Xbox Game Marketing Aaron Greenberg has elaborated on this, confirming that more Xbox Series X re… [+1262 chars]"}, {"source": {"id": null, "name": "Happygamer.com"}, "author": "Jeremy Green", "title": "Cyberpunk 2077 Is Still Getting An R18+ Rating In Australia Despite Graphic Content - Happy Gamer", "description": "It's pretty clear that Cyberpunk 2077 is not for the faint of heart. CD Projekt Red is including a lot of graphic content in this upcoming RPG, which...", "url": "https://happygamer.com/cyberpunk-2077-is-still-getting-an-r18-rating-in-australia-despite-graphic-content-64527/", "urlToImage": "https://happygamer.com/wp-content/uploads/2020/05/db4fb40298d3094e69f2e68f1d552601.jpg", "publishedAt": "2020-05-02T16:51:12Z", "content": "It’s pretty clear that Cyberpunk 2077 is not for the faint of heart. CD Projekt Red is including a lot of graphic content in this upcoming RPG, which is great news if you like games that really go for it. However, this has caused a lot of Australian gamers so… [+2100 chars]"}, {"source": {"id": null, "name": "Pcmag.com"}, "author": "Justin Herrick", "title": "EVO 2020 is Online-Only This Summer - PCMag AU", "description": "With large groups of people at risk of catching and spreading COVID-19, the Evolution Championship Series (EVO) will not hold its annual event in Las Vegas. It will, however, stream online.", "url": "https://au.pcmag.com/gaming-4/66723/evo-2020-is-online-only-this-summer", "urlToImage": "https://sm.pcmag.com/t/pcmag_au/news/e/evo-2020-i/evo-2020-is-online-only-this-summer_pzhe.1200.jpg", "publishedAt": "2020-05-02T16:37:00Z", "content": "Everyone will watch the Evolution Championship Series (EVO) from afar this summer. Its transitioning to an online-only format in 2020 due to the coronavirus outbreak, the organization behind it announced on Twitter, but will still offer a full lineup of tourn… [+1388 chars]"}, {"source": {"id": null, "name": "Androidauthority.com"}, "author": "https://www.facebook.com/browncscott", "title": "Samsung Galaxy S20 Ultra emulator tests: Can it run Dolphin and Citra? - Android Authority", "description": "Few emulators tax the system more than Dolphin and Citra, so how does the highest-spec Android phone handle them?", "url": "https://www.androidauthority.com/samsung-galaxy-s20-ultra-dolphin-citra-emulator-android-1110763/", "urlToImage": "https://cdn57.androidauthority.net/wp-content/uploads/2020/04/Samsung-Galaxy-S20-Ultra-GameCube-Emulation-with-Xbox-Controller-in-One-Hand-920x470.jpg", "publishedAt": "2020-05-02T16:30:32Z", "content": "In the world of console emulation on Android phones and tablets, few emulators tax the system more than Dolphin (GameCube/Wii) and Citra (Nintendo 3DS). Since the Samsung Galaxy S20 Ultra is one of the most powerful phones on the market today, I wanted to kno… [+11449 chars]"}, {"source": {"id": null, "name": "Thetecheducation.com"}, "author": "Hashim", "title": "Destiny 2: Where Is Xur This Week And What Is He Selling? - The Tech Education", "description": "Fans of Destiny 2 will know what it’s like to play in its immersive nature of the game and graphics. And why won’t it be? As all, it is developed by the legendary Bungie.  If the name doesn’t ring a bell, then try remembering the most epic games like Halo, My…", "url": "https://thetecheducation.com/destiny-2-where-is-xur-this-week-and-what-is-he-selling/", "urlToImage": "https://thetecheducation.com/wp-content/uploads/2020/05/960x0.jpg", "publishedAt": "2020-05-02T16:05:11Z", "content": "Fans of Destiny 2 will know what it’s like to play in its immersive nature of the game and graphics. And why won’t it be? As all, it is developed by the legendary Bungie.  If the name doesn’t ring a bell, then try remembering the most epic games like Halo, My… [+1594 chars]"}, {"source": {"id": null, "name": "Kotaku.com.au"}, "author": "Zack Zwiezen", "title": "Memorial Statues Honouring Soldier Voice Actor Rick May Appear In Team Fortress 2 - Kotaku Australia", "description": "Valve has updated Team Fortress 2 and added memorial statues featuring the Solider as a tribute to Rick May, who died last month....", "url": "https://www.kotaku.com.au/2020/05/memorial-statues-honoring-soldier-voice-actor-rick-may-appear-in-team-fortress-2/", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/tllcbuaduv7mpbqoogov.jpg", "publishedAt": "2020-05-02T15:00:00Z", "content": "Valve has updated Team Fortress 2 and added memorial statues featuring the Solider as a tribute to Rick May, who died last month.\r\nMay, who voiced the Soldier in Team Fortress 2, passed on Apri 13 away due to complications involving COVID-19 after recovering … [+416 chars]"}, {"source": {"id": null, "name": "Ladbible.com"}, "author": "Vikki Blake", "title": "​Yes, You Can Complete 'Star Wars Jedi: Fallen Order' Without A Lightsaber - LADbible", "description": "Just go sith it.", "url": "https://www.ladbible.com/technology/gaming-can-you-finish-star-wars-jedi-fallen-order-without-a-lightsaber-20200502", "urlToImage": "https://images.ladbible.com/thumbnail?type=jpeg&url=http://beta.ems.ladbiblegroup.com/s3/content/7f7a1ec75ead4d14be78d99248c1a623.png&quality=70&width=808", "publishedAt": "2020-05-02T14:58:43Z", "content": "Have you ever thought about completing a Star War video game without using the lightsaber? \r\nNope, me neither. But while it might sound counter-intuitive - surely lightsabers are a huge part of why we play Star Wars games in the first place? - YouTuber SixToo… [+2185 chars]"}, {"source": {"id": null, "name": "Theburnin.com"}, "author": null, "title": "Samsung, Huawei claim 68 percent of Q1 5G phone shipments - The Burn-In", "description": "Smartphone giants Samsung and Huawei account for 68 percent of global 5G smartphone shipments in the first quarter of 2020.", "url": "https://www.theburnin.com/technology/samsung-huawei-68-percent-global-5g-smartphone-shipments-q1-2020-5/", "urlToImage": "https://www.theburnin.com/wp-content/uploads/2019/03/5G-technology-is-set-to-revolutionize-specific-industries.jpg", "publishedAt": "2020-05-02T13:34:00Z", "content": "The 5G rollout is just beginning. However, it is clear that a few frontrunners have established themselves at the head of the industry. Samsung and Huawei are both vying for 5G supremacy.\r\nData from the first quarter of 2020 confirms this. According to a repo… [+2771 chars]"}, {"source": {"id": null, "name": "Stevivor.com"}, "author": "http://www.facebook.com/SWrightAU", "title": "Xbox Games with Gold May 2020: Overlord, V-Rally 4, more - Stevivor", "description": "Xbox Games with Gold May 2020 free games have been detailed by Microsoft overnight. Those who are subscribed to Xbox Live Gold or Xbox Game Pass Ultimate will be able to claim the below games over the month of May 2020.", "url": "https://stevivor.com/news/releases/xbox-games-with-gold-may-2020-overlord-v-rally-4-more/", "urlToImage": "https://stevivor.com/wp-content/uploads/2020/04/xbox-games-with-gold-may-2020.jpg", "publishedAt": "2020-05-02T09:33:00Z", "content": "Stevivor is an independent video games outlet that has serviced Australia, New Zealand and the world since 2009.\r\nWe've been featured on Google News since 2014, and Apple News, OpenCritic and Metacritic since 2016. We were added to the The Game Awards' jury i… [+279 chars]"}]}