{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "YouTube"}, "author": null, "title": "FORTNITE: Chapter 2 - Season 3 FULL BATTLE PASS REVEAL [NO COMMENTARY] - Cultured Vultures", "description": "With the second season of the game's second chapter now behind ahead us, it's time to look at the kind of drip we can expect from the Fortnite: Chapter 2 - S...", "url": "https://www.youtube.com/watch?v=mGtx2Sdo4l8", "urlToImage": "https://i.ytimg.com/vi/mGtx2Sdo4l8/maxresdefault.jpg", "publishedAt": "2020-06-17T08:18:33Z", "content": null}, {"source": {"id": "the-next-web", "name": "The Next Web"}, "author": "Napier Lopez", "title": "Razer's THX Spatial Audio gives your headphones surround sound for 20 bucks - The Next Web", "description": "Since acquiring THX in 2016, Razer has been busy bolstering its audio offerings beyond its gaming brand (see: the company’s recently-announced Opus headphones). Now the company is leveraging THX‘s clout in the cinema space by offering its surround-sound-for-h…", "url": "https://thenextweb.com/plugged/2020/06/16/razers-thx-spatial-audio-gives-your-headphones-surround-sound-for-20-bucks/", "urlToImage": "https://img-cdn.tnwcdn.com/image/plugged?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2020%2F06%2FSnag_1cc026ab.png&signature=66bca71aa0d1d641b562fb4c8ad0f6f9", "publishedAt": "2020-06-17T07:04:46Z", "content": "Since acquiring THX in 2016, Razer has been busy bolstering its audio offerings beyond its gaming brand (see: the companys recently-announced Opus headphones). Now the company is leveraging THXs clou… [+2863 chars]"}, {"source": {"id": null, "name": "Kotaku Australia"}, "author": null, "title": "Former Evo Champion Banned From Multiple Fighting Game Events After Racist Tweet - Kotaku Australia", "description": "After posting a tweet that both mocked the Black Lives Matter movement and peddled in racist tropes, former Evo champion Ryan “Filipino Champ” Ramirez has been banned from several fighting game events. This includes an indefinite suspension from Capcom-relate…", "url": "https://www.kotaku.com.au/2020/06/former-evo-champion-banned-from-multiple-fighting-game-events-after-racist-tweet/", "urlToImage": "https://www.kotaku.com.au/content/uploads/sites/3/2020/06/17/hypwgknyfz6aaqqoqyob.jpg", "publishedAt": "2020-06-17T04:34:25Z", "content": "After posting a tweet that both mocked the Black Lives Matter movement and peddled in racist tropes, former Evo champion Ryan Filipino Champ Ramirez has been banned from several fighting game events.… [+2125 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Proton's updated price list with 0% sales tax! | ICYMI #353 - SoyaCincau", "description": "Shortly after the release of its new MacBook Pro 13, Apple has updated its MacBook Pro 16 offering with a new powerful GPU option. And if you are a Malaysian...", "url": "https://www.youtube.com/watch?v=bjkTDuplT9c", "urlToImage": "https://i.ytimg.com/vi/bjkTDuplT9c/maxresdefault.jpg", "publishedAt": "2020-06-17T04:13:22Z", "content": null}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "", "title": "Researchers taught a robot to suture by showing it surgery videos - Engadget", "description": "The UC Berkeley team, led by Dr. Ajay Tanwani, has developed a semi-supervised AI deep-learning system, dubbed Motion2Vec.", "url": "https://www.engadget.com/intel-uc-berkeley-motion2vec-ai-robot-surgery-203003829.html", "urlToImage": "https://o.aolcdn.com/images/dims?resize=1200%2C630&crop=1200%2C630%2C0%2C0&quality=95&image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-images%2F2020-06%2Fafb09bd0-b00a-11ea-bb76-33d30c303593&client=amp-blogside-v2&signature=16a013bb876a1014e38228dde6d4fc53f6124ec7", "publishedAt": "2020-06-17T03:57:55Z", "content": "“There's a lot of appeal in learning from visual observations, compared to traditional interfaces for learning in a static way or learning from [mimicking] trajectories, because of the huge amount of… [+3082 chars]"}, {"source": {"id": null, "name": "GameSpot"}, "author": "Ginny Woo", "title": "KFC Opens A Location In Animal Crossing: New Horizons - GameSpot", "description": "Those who can't get enough of KFC can now visit a virtual one in Animal Crossing: New Horizons.", "url": "https://www.gamespot.com/articles/kfc-opens-a-location-in-animal-crossing-new-horizo/1100-6478604/", "urlToImage": "https://gamespot1.cbsistatic.com/uploads/screen_kubrick/1580/15803022/3687318-main.jpeg", "publishedAt": "2020-06-17T03:23:00Z", "content": "Fans of the Colonel may be pleased to note that he's brought his signature chicken to everyone's new favorite island hangout. Yes, an official KFC location has opened in Animal Crossing: New Horizons… [+1911 chars]"}, {"source": {"id": null, "name": "PhoneArena"}, "author": "Alan Friedman", "title": "Apple will benefit from iPhone 12 5G super-cycle; \"it's the perfect storm,\" says analyst - PhoneArena", "description": "Wedbush analyst Daniel Ives now expects Apple to unveil the 5G 2020 iPhone 12 models in September and release them in October. He says that Apple will benefit from a 5G Super-Cycle.", "url": "https://www.phonearena.com/news/analyst-sees-5g-super-cycle-for-the-iphone-12-line_id125361", "urlToImage": "https://i-cdn.phonearena.com/images/article/125361-two/Apple-will-benefit-from-iPhone-12-5G-super-cycle-its-the-perfect-storm-says-analyst.jpg", "publishedAt": "2020-06-17T03:17:00Z", "content": "All content, features, and design are Copyright 2001-2020 PhoneArena.com.PhoneArena may receive a small commission if you purchase through affiliate links on this page.All rights reserved. Reproducti… [+88 chars]"}, {"source": {"id": null, "name": "Kotaku Australia"}, "author": null, "title": "Humble Bundle’s $50 Racial Justice Bundle Is Filled With Bangers - Kotaku Australia", "description": "Humble Bundle's latest charity bundle includes Elite Dangerous, Observer, Bioshock Remastered, with all proceeds from the bundle funding racial justice.", "url": "https://www.kotaku.com.au/2020/06/humble-bundle-racial-justice-bundle/", "urlToImage": "https://www.kotaku.com.au/content/uploads/sites/3/2019/08/elite-dangerous-raygun-brown-7.jpg", "publishedAt": "2020-06-17T02:40:21Z", "content": "The games community has come together to support the Black Lives Matter movement taking place around the world. The latest company to throw support behind the cause is Humble Bundle, which has launch… [+2417 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Tasneem Akolawala", "title": "Oppo Find X2, Oppo Find X2 Pro Launching in India Today: How to Watch Live Stream, Expected Price, More - Gadgets 360", "description": "Oppo Find X2 series is all set to launch in India today. The company is expected to unveil both Oppo Find X2 and Oppo Find X2 Pro phones in the country.", "url": "https://gadgets.ndtv.com/mobiles/news/oppo-find-x2-pro-india-launch-today-expected-price-specifications-livestream-link-2247282", "urlToImage": "https://i.gadgets360cdn.com/large/oppo_find_x2_launch_1592311134429.jpg", "publishedAt": "2020-06-17T02:39:06Z", "content": "Oppo Find X2 series is all set to launch in India today. The company is expected to unveil both Oppo Find X2 and Oppo Find X2 Pro phones in the country. The two phones debuted in March in Europe. The… [+3424 chars]"}, {"source": {"id": null, "name": "Kotaku Australia"}, "author": null, "title": "The Most Interesting Demos From Steam’s Summer Festival - Kotaku Australia", "description": "Steam's Summer Festival is finally live, and there's a ton of cool and unusual games you probably haven't heard of before - and they're playable right now.", "url": "https://www.kotaku.com.au/2020/06/steam-summer-festival-best-demos-pc/", "urlToImage": "https://www.kotaku.com.au/content/uploads/sites/3/2020/06/17/ss_40980e169e83f35dcdb6e54d542781ccfc7d90c0.600x3381.jpg", "publishedAt": "2020-06-17T02:32:10Z", "content": "After a week-long delay, Steams Summer Festival is finally here. For regular folk, it turns Steam into a giant stream of cool demos that you can check out right now. Theres a ton of cool games you ca… [+6555 chars]"}, {"source": {"id": null, "name": "CarAdvice"}, "author": "Ben Zachariah", "title": "2021 BMW M5 revealed, Australian launch due in October - CarAdvice", "description": "BMW has launched the facelifted 2021 BMW M5 and M5 Competition with a sharper design and upgraded suspension. Australian buyers will only have access to the higher-spec 2021 BMW M5 Competition, due...", "url": "https://www.caradvice.com.au/858418/2021-bmw-m5-official-pictures-and-launch-date-revealed/", "urlToImage": "https://media.caradvice.com.au/image/private/c_fill,q_auto,f_auto,w_960,h_500/lozxetwhezpuoeih2tdf.jpg", "publishedAt": "2020-06-17T01:49:00Z", "content": "Australia will only receive the M5 Competition, with the standard M5 to be dropped from the local line-up.\r\nBMW has launched the facelifted 2021 BMW M5 and M5 Competition with a sharper design and up… [+2368 chars]"}, {"source": {"id": null, "name": "Teslarati"}, "author": "https://www.facebook.com/13ericralph31", "title": "SpaceX Starship will need fleet of ocean spaceports, says Elon Musk - Teslarati", "description": "SpaceX CEO Elon Musk says that the company is going to build multiple massive “floating spaceports” to enable Starship launches to Mars and the Moon, as well as point-to-point travel around the Earth. First confirmed in job listings and later backed up by Mus…", "url": "https://www.teslarati.com/spacex-starship-floating-spaceports/", "urlToImage": "https://www.teslarati.com/wp-content/uploads/2020/06/Starship-floating-spaceport-BFR-2017-SpaceX-1-day-crop-1024x448.jpg", "publishedAt": "2020-06-17T01:11:22Z", "content": "SpaceX CEO Elon Musk says that the company is going to build multiple massive “floating spaceports” to enable Starship launches to Mars and the Moon, as well as point-to-point travel around the Earth… [+3001 chars]"}, {"source": {"id": null, "name": "Kotaku Australia"}, "author": null, "title": "How To Watch The Latest Pokémon Presents In Australia - Kotaku Australia", "description": "The latest Pokémon presents will share news and updates from the franchise, including a new look at the Isle of Armor DLC for Sword and Shield.", "url": "https://www.kotaku.com.au/2020/06/pokemon-presents-australia-how-to-watch/", "urlToImage": "https://www.kotaku.com.au/content/uploads/sites/3/2020/06/17/pokemon-presents.jpg", "publishedAt": "2020-06-17T00:32:15Z", "content": "You know its a stacked month for gaming when a Pokémon presentation flies under the radar.\r\nThe latest Pokémon Presents event takes place late Wednesday night on YouTube. It coincides with the releas… [+2185 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Kyle Hyatt", "title": "Donkervoort's D8 GTO-JD70 generates 2 G's of lateral grip on street tires - CNET", "description": "This mutant Lotus 7 and Audi hybrid might be the most extreme car that the Dutch company has ever built.", "url": "https://www.cnet.com/roadshow/news/donkervoort-d8-gto-jd70-audi-lotus-lateral-grip/", "urlToImage": "https://cnet1.cbsistatic.com/img/3tapKi902K4S32of-6P-iq7ID8I=/2020/06/17/bd0d9434-67fc-42ec-9b6d-5424aab3b574/screen-shot-2020-06-16-at-5-13-08-pm.png", "publishedAt": "2020-06-17T00:31:09Z", "content": "Now, \"Donkervoort D8 GTO-JD70\" might not roll off the tongue with ease, and it may look like the unwanted love child of a Caterham 7 and a Transformer, but when you pack the kind of performance that … [+2669 chars]"}, {"source": {"id": null, "name": "Yanko Design"}, "author": "Sarang Sheth", "title": "SATECHI's magnetic dock lets you charge your Apple Watch using your iPad Pro! - Yanko Design", "description": null, "url": "https://www.yankodesign.com/2020/06/16/satechis-magnetic-dock-lets-you-charge-your-apple-watch-using-your-ipad-pro/", "urlToImage": null, "publishedAt": "2020-06-17T00:01:26Z", "content": "Go ahead and add yet another incredible feature to the iPad Pro. The tablet already did have the ability to reverse-charge devices, but with Satechi’s Apple Watch dock, the iPad Pro can charge and do… [+1042 chars]"}, {"source": {"id": null, "name": "GamesRadar+"}, "author": "Jordan Gerblick", "title": "Ratchet and Clank PS5 lets you play as the new female Lombax - GamesRadar+ AU", "description": "Insomniac Games revealed the \"mysterious\" new Lombax is a playable character in Ratchet and Clank: Rift Apart", "url": "https://www.gamesradar.com/ratchet-and-clank-ps5-lets-you-play-as-the-new-female-lombax/", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Ftq2iXRaDXrexxYrPeQHd3-1200-80.jpg", "publishedAt": "2020-06-16T23:43:57Z", "content": "The new Lombax seen in the PS5 trailer for Ratchet and Clank: Rift Apart is a playable character, Insomniac Games has confirmed.\r\nInsomniac took to Twitter today to add this one key detail about the … [+1406 chars]"}, {"source": {"id": null, "name": "BetaNews"}, "author": null, "title": "AMD slam dunks on Intel with new Ryzen 3000XT processors and B550 chipset - BetaNews", "description": "Both Intel and AMD make great processors, but for the most part, Intel has long been the market leader for enthusiasts. When building a gaming PC, consumers have historically chosen Intel for its superior performance in games -- particularly when multi-core d…", "url": "https://betanews.com/2020/06/16/amd-ryzen-3000xt/", "urlToImage": "https://betanews.com/wp-content/uploads/2020/06/slam_dunk_basketball-50x50.jpg", "publishedAt": "2020-06-16T23:36:07Z", "content": "Both Intel and AMD make great processors, but for the most part, Intel has long been the market leader for enthusiasts. When building a gaming PC, consumers have historically chosen Intel for its sup… [+3122 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "Adobe Flash Is Actually Going to Die This Time, For Real - Gizmodo Australia", "description": "Three years ago, long after the rise (and fall) of Flash, Adobe announced that its once-ubiquitous multimedia platform was finally going away. But Adobe never provided a specific date for when Flash would reach its end-of-life. Now we know: Adobe Flash is goi…", "url": "https://www.gizmodo.com.au/2020/06/adobe-flash-is-actually-going-to-die-this-time-for-real/", "urlToImage": "https://www.gizmodo.com.au/content/uploads/sites/2/2020/06/17/ctaykfu94q9zz1uv9uxj.jpg", "publishedAt": "2020-06-16T23:26:36Z", "content": "Three years ago, long after the rise (and fall) of Flash, Adobe announced that its once-ubiquitous multimedia platform was finally going away. But Adobe never provided a specific date for when Flash … [+1997 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "RIP, Bose AR, We Hardly Knew Ye - Gizmodo Australia", "description": "Bose seemed like a company that had a slightly different, incredibly interesting vision for augmented reality. It was different from other tech companies’ approaches — Bose put AR in its Bose Frames sunglasses, but it wasn’t like the AR glasses or headsets th…", "url": "https://www.gizmodo.com.au/2020/06/rip-bose-ar-we-hardly-knew-ye/", "urlToImage": "https://www.gizmodo.com.au/content/uploads/sites/2/2020/06/17/zsftbpkkxggmirqeexdb.jpg", "publishedAt": "2020-06-16T23:19:15Z", "content": "Bose seemed like a company that had a slightly different, incredibly interesting vision for augmented reality. It was different from other tech companies approaches Bose put AR in its Bose Frames sun… [+3827 chars]"}, {"source": {"id": null, "name": "Press Start Australia"}, "author": "Shannon Grixti", "title": "Kingdom Hearts: Melody Of Memory Is Coming To Nintendo Switch, PS4 And Xbox One - Press Start Australia", "description": "Square Enix has announced Kingdom Hearts: Melody of Memory which is a music memory game that's coming to Nintendo Switch, PS4 and Xbox One later this year. The game will include four modes including an online mode and will launch with over 140 songs. We don't…", "url": "https://press-start.com.au/news/playstation/2020/06/17/kingdom-hearts-melody-of-memory-is-coming-to-nintendo-switch-ps4-and-xbox-one/", "urlToImage": "https://cdn.pressstart.com.au/wp-content/uploads/2020/06/Kingdom-Hearts-Melody.jpg", "publishedAt": "2020-06-16T23:07:03Z", "content": "Square Enix has announced Kingdom Hearts: Melody of Memory which is a music memory game that’s coming to Nintendo Switch, PS4 and Xbox One later this year.\r\nThe game will include four modes including… [+153 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Rachel Lerman", "title": "Instagram is becoming a go-to news source for younger readers - The Washington Post", "description": "Young people in the U.S. have especially turned to Instagram as a source of news during the coronavirus pandemic.", "url": "https://www.washingtonpost.com/technology/2020/06/16/whatsapp-instagram-covid-news/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/NQCOKQU43EI6VLLZ5334242GIE.jpg&w=1440", "publishedAt": "2020-06-16T21:59:38Z", "content": "But as reliance on social media for news increases, so do concerns about the spread of misinformation even from the people turning to social media in the first place.\r\nFifty-six percent said they wer… [+4752 chars]"}, {"source": {"id": null, "name": "CarAdvice"}, "author": "Kez Casey", "title": "Ford Transit van gets Ranger Raptor grille but not the performance - CarAdvice", "description": "Ford of Europe has brought some Ranger Raptor design flare to the front end of a new series of Transit vans – but, unfortunately, these models are unlikely for Australia even though they are made i...", "url": "https://www.caradvice.com.au/858242/ford-transit-van-gets-ranger-raptor-grille-but-not-the-performance/", "urlToImage": "https://media.caradvice.com.au/image/private/c_fill,q_auto,f_auto,w_960,h_500/y013rrfl2gvsjgz1ycam.jpg", "publishedAt": "2020-06-16T21:53:00Z", "content": "What happens if you blend a Ford Ranger Raptor and Transit van? Sadly, we may never get to find out.\r\nFord of Europe has brought some Ranger Raptor design flare to the front end of a new series of Tr… [+3600 chars]"}, {"source": {"id": null, "name": "Kotaku Australia"}, "author": null, "title": "The Perfect Gaming PC Case For Rainbow Six Siege Fans - Kotaku Australia", "description": "Today NZXT, maker of gaming PCs and gaming PC parts, revealed the latest in its CRFT line of custom limited edition hardware. Limited to 500 pieces worldwide, CRFT 06 H510 Siege is a very special version of the company’s H510 case designed especially for fans…", "url": "https://www.kotaku.com.au/2020/06/the-perfect-gaming-pc-case-for-rainbow-six-siege-fans/", "urlToImage": "https://www.kotaku.com.au/content/uploads/sites/3/2020/06/17/xtxsh3ae5ttqbn9yakqp.jpg", "publishedAt": "2020-06-16T21:32:18Z", "content": "Today NZXT, maker of gaming PCs and gaming PC parts, revealed the latest in its CRFT line of custom limited edition hardware. Limited to 500 pieces worldwide, CRFT 06 H510 Siege is a very special ver… [+3876 chars]"}, {"source": {"id": null, "name": "XDA Developers"}, "author": "Joe Fedewa", "title": "Google Stadia adds 3 RPGs: The Elder Scrolls: Online, Windbound, and Cris Tales, drops Premiere Edition price to $99 - XDA Developers", "description": "Google is bringing 3 new RPGs to Stadia, including The Elder Scrolls: Online. The cost of the Stadia Premiere Edition starter kit has been dropped.", "url": "https://www.xda-developers.com/google-stadia-elder-scrolls-online-windbound-cris-tales-premiere-edition-99/", "urlToImage": "https://www.xda-developers.com/files/2019/08/google-stadia-controller.jpg", "publishedAt": "2020-06-16T21:04:09Z", "content": "Google is adding new games to Stadia nearly every week. This week, the company is starting with three new RPGs, including The Elder Scrolls: Online. In addition, the cost of the Stadia Premiere Editi… [+1836 chars]"}, {"source": {"id": null, "name": "GameSpot"}, "author": "Gabe Gurwin", "title": "PS5 Reveal Event: Every New Game And Detail Revealed By Sony - GameSpot", "description": "If you missed Sony's Future of Gaming stream and PS5 reveal, here's every game that was revealed for the platform, plus other exciting announcements", "url": "https://www.gamespot.com/articles/ps5-reveal-event-every-new-game-and-detail-reveale/1100-6478266/", "urlToImage": "https://gamespot1.cbsistatic.com/uploads/screen_kubrick/313/3136061/3682666-ps5555.jpg", "publishedAt": "2020-06-16T20:33:00Z", "content": "Sony's big PlayStation 5 games reveal event, titled The Future of Gaming, revealed a ton of upcoming PS5 games, new and current-gen. You can watch the entire thing right here and learn about every si… [+8747 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "David Thomas Henry Wright", "title": "Beauty in code – 5 ways digital poetry combines human and computer languages - The Conversation AU", "description": "Human existence is now permeated by computer language. Digital artists combine human and computer codes to create digital poetry.", "url": "https://theconversation.com/beauty-in-code-5-ways-digital-poetry-combines-human-and-computer-languages-140344", "urlToImage": "https://images.theconversation.com/files/342041/original/file-20200616-23247-16dkmi8.jpg?ixlib=rb-1.1.0&rect=12%2C257%2C4157%2C2078&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2020-06-16T20:00:00Z", "content": "Since lockdown, everyone has had to rely heavily on digital technologies: be it Zoom work meetings and lengthy email chains, gaming and streaming services for entertainment, or social media platforms… [+5283 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "", "title": "Google optimizes its WiFi routers for slow internet connections - Engadget", "description": "Google has updated its WiFi routers to boost performance with slow internet connections, helping them handle more tasks at once.", "url": "https://www.engadget.com/google-nest-wifi-improvements-for-slow-internet-connections-190131040.html", "urlToImage": "https://o.aolcdn.com/images/dims?resize=1200%2C630&crop=1200%2C630%2C0%2C0&quality=95&image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-uploaded-images%2F2020-06%2Ff7649b10-aff7-11ea-83f3-f4cfa4d5be8f&client=amp-blogside-v2&signature=85414ab0600a5c940eba9cf2a626f77996ab1441", "publishedAt": "2020-06-16T19:35:10Z", "content": "Google’s WiFi routers should now handle overloaded internet providers more gracefully. It’s delivering an update to Nest WiFi and Google WiFi routers that improves “overall” performance with slow int… [+379 chars]"}, {"source": {"id": null, "name": "Android Central"}, "author": "Ara Wagoner", "title": "New leaks point to Galaxy Watch 3 using most of Watch Active 2's health sensors - Android Central", "description": "Leaks keep dripping out for the upcoming Galaxy Watch 3, but today's leaks seem to point to the new watch looking exceedingly familiar to a current model: the Galaxy Watch Active 2.", "url": "https://www.androidcentral.com/new-leaks-point-galaxy-watch-3-using-most-watch-active-2s-health-sensors", "urlToImage": "https://www.androidcentral.com/sites/androidcentral.com/files/styles/large/public/article_images/2020/05/galaxy-watch-active-2-heart-rate-hero.jpg?itok=reQ9Q4am", "publishedAt": "2020-06-16T17:59:33Z", "content": "We're still awaiting the imminent launch of the Galaxy Watch 3 after support pages for the new model went live a week ago, but today brought us two leaks of the upcoming watch's specs after the watch… [+1814 chars]"}, {"source": {"id": null, "name": "XDA Developers"}, "author": "https://www.facebook.com/arolwright", "title": "Some Android apps on F-Droid will eventually lose access to Google Play purchases - XDA Developers", "description": "Users downloading apps from F-Droid may eventually run into a small issue: They might not be able to use Google Play billing anymore.", "url": "https://www.xda-developers.com/f-droid-android-apps-google-play-purchases/", "urlToImage": "https://www.xda-developers.com/files/2017/01/F-Droid-Feature-Image-XDA-Portal-Red.png", "publishedAt": "2020-06-16T17:33:37Z", "content": "If you’re interested in running free and open-source Android applications, then you’ve probably heard of F-Droid. While its limited catalog of apps makes it far from an actual alternative to the Goog… [+2271 chars]"}, {"source": {"id": null, "name": "Kotaku Australia"}, "author": null, "title": "Everything We Know About The Xbox Series X - Kotaku Australia", "description": "We’re still months away from the “holiday 2020” season, which means we’re months away from the Xbox Series X existing in the wild. There’s a new Halo on the horizon, and we’ve all heard plenty about those teraflops, but beyond that, information has come out s…", "url": "https://www.kotaku.com.au/2020/06/everything-we-know-about-the-xbox-series-x/", "urlToImage": "https://www.kotaku.com.au/content/uploads/sites/3/2020/06/17/gezmfebnhwsrgtxceytm-1024x576.png", "publishedAt": "2020-06-16T17:12:21Z", "content": "Were still months away from the holiday 2020 season, which means were months away from the Xbox Series X existing in the wild. Theres a new Halo on the horizon, and weve all heard plenty about those … [+10358 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Ron Miller", "title": "Dropbox introduces slew of new features for business and home users - TechCrunch", "description": "Dropbox has always been about file storage, sharing and collaboration, but it wants to stretch beyond those roots and provide customers, especially those using the Dropbox Plus paid tier with a set of additional capabilities that typically would have involved…", "url": "http://techcrunch.com/2020/06/16/dropbox-introduces-slew-of-new-features-for-business-and-home-users/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2018/09/GettyImages-633110660.jpg?w=600", "publishedAt": "2020-06-16T16:41:09Z", "content": "Dropbox has always been about file storage, sharing and collaboration, but it wants to stretch beyond those roots and provide customers, especially those using the Dropbox Plus paid tier with a set o… [+2835 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Dave Thier", "title": "7 Things To Know Before Buying A Ticket To Pokémon GO Fest 2020 - Forbes", "description": "Here's what you need to know before buying at ticket to Pokémon GO Fest 2020.", "url": "https://www.forbes.com/sites/davidthier/2020/06/16/7-things-to-know-before-buying-a-ticket-to-pokmon-go-fest-2020/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F5ee8ef98bcc30e0006c1dc54%2F0x0.jpg", "publishedAt": "2020-06-16T16:30:45Z", "content": "Pokemon GO\r\nCredir: Niantic\r\nPokémon GO Fest will be, necessarily, different this year. Niantics massive Pokémon GO celebration is usually an in-person affair, with thousands of eager trainers swarmi… [+3025 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Stan Schroeder", "title": "Google Meet gets its own tab in your phone's Gmail - Mashable", "description": "Meet is now even more closely integrated with Gmail.", "url": "https://mashable.com/article/google-meet-gmail-android-ios/", "urlToImage": "https://mondrian.mashable.com/2020%252F06%252F16%252F0b%252F59fe625c777148b9b9ad53631c69e775.54bb6.jpg%252F1200x630.jpg?signature=en64qZoyGNjujRSOpxBCVoQ0UWY=", "publishedAt": "2020-06-16T16:01:52Z", "content": "In April, Google integrated its video call service Meet into Gmail on the web, making it possible to start or join a Meet call from Gmail with a single click. Now, Google is also integrating Meet wit… [+1347 chars]"}, {"source": {"id": null, "name": "PetaPixel"}, "author": null, "title": "Adobe Unveils Major App Updates for Photoshop, Lightroom, and Camera RAW - PetaPixel", "description": "Early this morning, Adobe unveiled a massive feature drop across the entire Creative Cloud ecosystem. Every app that matters to photographers—from", "url": "https://petapixel.com/2020/06/16/adobe-unveils-major-app-updates-for-photoshop-lightroom-and-camera-raw/", "urlToImage": "https://petapixel.com/assets/uploads/2020/06/selectsubject.jpg", "publishedAt": "2020-06-16T15:09:00Z", "content": "Early this morning, Adobe unveiled a massive feature drop across the entire Creative Cloud ecosystem. Every app that matters to photographersfrom Photoshop, to Lightroom, to Camera RAWhas been update… [+3994 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Vic Hood", "title": "Don't like the PS5 design? PS5 special editions will offer options 'beyond anything seen before' - Techradar Australia", "description": "You can scrap that white PS5 if you want…", "url": "https://www.techradar.com/news/dont-like-the-ps5-design-ps5-special-editions-will-offer-options-beyond-anything-seen-before", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ETuyybM77kJYNYDJpNAUkU-1200-80.jpg", "publishedAt": "2020-06-16T15:07:18Z", "content": "Not a fan of the PS5 design? Well, don't worry, as there will be plenty of PS5 special editions available that will offer an alternative to the futuristic, white PlayStation 5, and with more customiz… [+1329 chars]"}, {"source": {"id": null, "name": "Asia Times"}, "author": null, "title": "Huawei outpaces rivals with chip sanctions ploy - Asia Times", "description": "In a rare bonanza before United States sanctions kick in, Chinese tech giant Huawei shipped more smartphones worldwide than its competitors in April, according to Hong Kong-based market consultants…", "url": "https://asiatimes.com/2020/06/huawei-outpaces-rivals-with-chip-sanctions-ploy/", "urlToImage": "https://i0.wp.com/asiatimes.com/wp-content/uploads/2020/06/bkn-20200518131313501-0518_00972_001_01b.jpg?fit=780%2C558&ssl=1", "publishedAt": "2020-06-16T14:16:00Z", "content": "In a rare bonanza before United States sanctions kick in, Chinese tech giant Huawei shipped more smartphones worldwide than its competitors in April, according to Hong Kong-based market consultants.\r… [+5568 chars]"}, {"source": {"id": null, "name": "CarAdvice"}, "author": "Ben Zachariah", "title": "Video: 2021 Ford Mustang Mach 1 revealed - CarAdvice", "description": "The 2021 Ford Mustang Mach 1 has been unveiled in the US, showcasing a track-focused, limited-edition pony car that cherry-picks from its stablemates. Reading more like a Greatest Hits album, the M...", "url": "https://www.caradvice.com.au/858341/video-2021-ford-mustang-mach-1-revealed/", "urlToImage": "https://media.caradvice.com.au/image/private/c_fill,q_auto,f_auto,w_960,h_500/dctqm6fd1ptmskuemgep.jpg", "publishedAt": "2020-06-16T14:01:00Z", "content": "New track-focused Mustang Mach 1 bridges gap between GT and Shelby models, borrows from Bullitt, GT350, and GT500.\r\nThe 2021 Ford Mustang Mach 1 has been unveiled in the US, showcasing a track-focuse… [+2282 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "'Hey Siri, I'm getting pulled over'- Shortcut app allows users to quickly record police - KGW News", "description": "A viral post claims that iPhone users who are pulled over by the police can say a key phrase to Siri that will automatically start recording the interaction ...", "url": "https://www.youtube.com/watch?v=1ufIa-IK7LE", "urlToImage": "https://i.ytimg.com/vi/1ufIa-IK7LE/maxresdefault.jpg", "publishedAt": "2020-06-16T13:55:48Z", "content": "A viral post claims that iPhone users who are pulled over by the police can say a key phrase to Siri that will automatically start recording the interaction and send the video to an emergency contact… [+202 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew Webster", "title": "Valorant is getting its first proper tournament series - The Verge", "description": "Riot Games took a big step toward turning tactical shooter Valorant into the next big esport, with the announcement of the Valorant Ignition Series, a competitive tournament series that starts on June 19th.", "url": "https://www.theverge.com/21292718/valorant-ignition-tournament-series-esports-riot-games-date", "urlToImage": "https://cdn.vox-cdn.com/thumbor/lKXau-6XCQISg1i_eoh5egvg4gE=/0x75:3840x2085/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19950007/Reveal_ReactorA_VALORANT.jpg", "publishedAt": "2020-06-16T13:30:13Z", "content": "A big step toward becoming a major esport\r\nRiot Games just took a big step toward turning its team shooter Valorant into the next big competitive game. Today, the developer announced the Valorant Ign… [+2444 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "The Last of Us - 14 Amazing Facts You Probably Don't Know - GamingBolt", "description": "Naughty Dog's 2013 masterpiece The Last of Us is one of the most beloved, most talked-about games of the last decade or two, so it's hard to come across deta...", "url": "https://www.youtube.com/watch?v=PoRHLlvv0e8", "urlToImage": "https://i.ytimg.com/vi/PoRHLlvv0e8/maxresdefault.jpg", "publishedAt": "2020-06-16T13:30:06Z", "content": null}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Chaim Gartenberg", "title": "The Lenovo Flex 5G is the world’s first 5G laptop you can actually buy - Circuit Breaker", "description": "Lenovo has announced a price and release date for its new Flex 5G laptop: it’ll be available as a Verizon exclusive on June 18th for $1,399.99, making it the first available 5G laptop in the world. It’s powered by Qualcomm’s Snapdragon 8cx chipset and X55 5G …", "url": "https://www.theverge.com/circuitbreaker/21292067/lenovo-flex-5g-laptop-date-price-verizon-exclusive", "urlToImage": "https://cdn.vox-cdn.com/thumbor/81x_CH-Tl-SH8CXqzOpQteA8hwY=/0x65:1280x735/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/20036235/lenovo.jpg", "publishedAt": "2020-06-16T13:03:16Z", "content": "Filed under:\r\nAvailable on June 18th for $1,399.99 as a Verizon exclusive\r\nForget 5G phones: Lenovo is officially kicking off the 5G laptop race with the Flex 5G, which will be released on June 18th … [+2656 chars]"}, {"source": {"id": null, "name": "PCMag.com"}, "author": null, "title": "Corsair ONE a100 - Review 2020 - PCMag AU", "description": "Corsair's One a100 desktop delivers incredible performance from its 16-core AMD processor and Nvidia GeForce RTX 2080 Ti in a petite, nearly silent design. Just watch that price tag.", "url": "https://au.pcmag.com/desktop-pcs/67322/corsair-one-a100", "urlToImage": "https://sm.pcmag.com/t/pcmag_au/review/c/corsair-on/corsair-one-a100_yxe1.1200.jpg", "publishedAt": "2020-06-16T13:01:00Z", "content": "Corsair's One has become something of a legend among small-form-factor gaming desktops, packing top-shelf performance into an incredibly compact, column-shaped case that generates little to no noise.… [+11532 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Gigabyte B550 Aorus Master Review - EVERYTHING you could want, BUT... - KitGuruTech", "description": "The B550 embargo has lifted and we can share our first B550 motherboard reviews! Here Luke is looking at the Gigabyte B550 Aorus Master, a premium offering w...", "url": "https://www.youtube.com/watch?v=kUS2ay2_4QQ", "urlToImage": "https://i.ytimg.com/vi/kUS2ay2_4QQ/maxresdefault.jpg", "publishedAt": "2020-06-16T13:00:19Z", "content": "The B550 embargo has lifted and we can share our first B550 motherboard reviews! Here Luke is looking at the Gigabyte B550 Aorus Master, a premium offering with a top-notch power delivery solution. H… [+1476 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Sareena Dayaram", "title": "iPhone X vs. iPhone 11: All the specs, and which to buy in 2020 - CNET", "description": "Despite what it might sound like, the iPhone 11 is not the successor to the iPhone X. Find out which of the two iPhone makes more sense for your needs.", "url": "https://www.cnet.com/news/iphone-x-vs-iphone-11-all-specs-which-to-buy-2020/", "urlToImage": "https://cnet1.cbsistatic.com/img/_I-kmUSoVDaJwjPvucZYVJY6ECI=/756x567/2020/06/09/858ac82b-942f-4245-bd36-207fa945e02b/apple-iphone-11-2612.jpg", "publishedAt": "2020-06-16T12:42:57Z", "content": "Apple's iPhone X (2017) dumped the home button and replaced it with gestures and dumped the fingerprint scanner and replaced it with facial recognition. \r\nSarah Tew/CNET\r\nWhen the iPhone X was unveil… [+10108 chars]"}, {"source": {"id": null, "name": "The Australian"}, "author": null, "title": "Scientists create way to spy on conversations with the help of a light bulb - The Australian", "description": "Subscribe to The Australian to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.theaustralian.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2020-06-16T10:55:00Z", "content": null}, {"source": {"id": null, "name": "Press Start Australia"}, "author": "Shannon Grixti", "title": "Amazon Is Having A Smart Light Sale - Press Start Australia", "description": "Amazon's mid-year sale has a few more weeks left. You can find everything on sale HERE, but right now (in addition to all the great games they've got on sale), they've also got a bunch of smart lights on sale. Amazon Echo Show 8 - $129 Amazon Echo Dot - $49 L…", "url": "https://press-start.com.au/bargains/2020/06/16/amazon-is-having-a-smart-light-sale/", "urlToImage": "https://cdn.pressstart.com.au/wp-content/uploads/2020/06/Amazon-Smart-Light-Sale.jpg", "publishedAt": "2020-06-16T08:42:16Z", "content": null}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "Ferrari Doesn’t Care - Gizmodo Australia", "description": "Ferrari, a boutique hat company that also sells rich people cars, recently took it upon itself to remake one of the great car films ever shot, with one of the best drivers in the world, in one of the best locations in the world, with one of its newest and...", "url": "https://www.gizmodo.com.au/2020/06/ferrari-doesnt-care/", "urlToImage": "https://www.gizmodo.com.au/content/uploads/sites/2/2020/06/16/cjlfaibd9lpscmh9l9k2-1024x549.png", "publishedAt": "2020-06-16T08:06:38Z", "content": "Ferrari, a boutique hat company that also sells rich people cars, recently took it upon itself to remake one of the great car films ever shot, with one of the best drivers in the world, in one of the… [+2842 chars]"}, {"source": {"id": null, "name": "Kotaku Australia"}, "author": null, "title": "Fortnite Breaks Twitch’s All-Time Concurrent Viewer Record After Locking Tons Of Players Out Of Event - Kotaku Australia", "description": "Today, Fortnite’s oft-delayed season-ending “Device” event finally took place, dotting the map with explosions before submerging it beneath the ocean. Over two million viewers tuned in on Twitch to watch the sea consume all, a grim preview of the future that …", "url": "https://www.kotaku.com.au/2020/06/fortnite-breaks-twitchs-all-time-concurrent-viewer-record-after-locking-tons-of-players-out-of-event-2/", "urlToImage": "https://www.kotaku.com.au/content/uploads/sites/3/2020/06/16/vyfjuesdkkkfsow5uooy-1024x576.png", "publishedAt": "2020-06-16T04:14:18Z", "content": "Today, Fortnites oft-delayed season-ending Device event finally took place, dotting the map with explosions before submerging it beneath the ocean. Over two million viewers tuned in on Twitch to watc… [+4887 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "Microsoft Broke One of Its Most Useful Windows 10 Features With Its Latest Update - Gizmodo Australia", "description": "Microsoft has had one heck of a time fixing bugs in its last couple of Windows 10 versions. Many users, myself included, stuck with version 1809 longer than we anticipated because of all the bugs in version 1903 when it rolled out last year. One bug prevented…", "url": "https://www.gizmodo.com.au/2020/06/microsoft-broke-one-of-its-most-useful-windows-10-features-with-its-latest-update/", "urlToImage": "https://www.gizmodo.com.au/content/uploads/sites/2/2020/06/16/hcudcmvf9kdakwfuokos-1024x576.jpg", "publishedAt": "2020-06-16T03:39:14Z", "content": "Microsoft has had one heck of a time fixing bugs in its last couple of Windows 10 versions. Many users, myself included, stuck with version 1809 longer than we anticipated because of all the bugs in … [+2630 chars]"}, {"source": {"id": null, "name": "Kotaku Australia"}, "author": null, "title": "Duke Nukem Isn’t Worth Fighting Yet Another Lawsuit Over - Kotaku Australia", "description": "Gearbox is suing 3D Realms parent company Apogee Software for a breach of contract in regard to ownership of the Duke Nukem franchise, according to a lawsuit filed last Friday. This is just the latest in a series of Duke­-related legal complaints stretching b…", "url": "https://www.kotaku.com.au/2020/06/duke-nukem-isnt-worth-fighting-yet-another-lawsuit-over/", "urlToImage": "https://www.kotaku.com.au/content/uploads/sites/3/2020/06/16/hhq5gt2wfdrrztdombd2.png", "publishedAt": "2020-06-16T03:32:15Z", "content": "Gearbox is suing 3D Realms parent company Apogee Software for a breach of contract in regard to ownership of the Duke Nukem franchise, according to a lawsuit filed last Friday. This is just the lates… [+2936 chars]"}, {"source": {"id": null, "name": "Press Start Australia"}, "author": "Shannon Grixti", "title": "PAX Australia 2020 Has Been Cancelled - Press Start Australia", "description": "It's been announced that PAX Australia 2020 will no longer take place. The event was set to take place from October 9th to October 11th. In a statement posted on the company's social media pages, it was announced that the next edition of the event will now ta…", "url": "https://press-start.com.au/news/2020/06/16/pax-australia-2020-has-been-cancelled/", "urlToImage": "https://cdn.pressstart.com.au/wp-content/uploads/2020/06/PAX-AUS-2020.jpg", "publishedAt": "2020-06-16T02:29:56Z", "content": "It’s been announced that PAX Australia 2020 will no longer take place. The event was set to take place from October 9th to October 11th.\r\nIn a statement posted on the company’s social media pages, it… [+1554 chars]"}, {"source": {"id": null, "name": "iTnews"}, "author": null, "title": "Intel to add anti-malware tech to processors - Security - Hardware - iTnews", "description": "NOP to ROP, JOP and COP with CET.", "url": "https://www.itnews.com.au/news/intel-to-add-anti-malware-tech-to-processors-549300", "urlToImage": "https://i.nextmedia.com.au/News/Intel-Tiger-Lake-1-1.jpg", "publishedAt": "2020-06-16T02:25:00Z", "content": "Chip giant Intel intends to add hardware protection against common malware attacks into its processors, work that is four years in gestation.\r\nKnown as control-flow enforcement technology or CET, the… [+1616 chars]"}, {"source": {"id": null, "name": "CarAdvice"}, "author": "Ben Zachariah", "title": "2021 BMW M5 facelift leaked online - CarAdvice", "description": "The 2021 BMW M5 facelift has been leaked online, a day before the official unveiling. BMW's iconic performance sedan misses out on the oversized 'coffin-shaped' kidney grilles, as seen on the recen...", "url": "https://www.caradvice.com.au/858136/2021-bmw-m5-facelift-leaked-online/", "urlToImage": "https://media.caradvice.com.au/image/private/c_fill,q_auto,f_auto,w_960,h_500/r60vodgdncay7kdfymfq.jpg", "publishedAt": "2020-06-16T00:46:00Z", "content": "The 2021 BMW M5 facelift has been leaked online, a day before the official unveiling.\r\nBMW's iconic performance sedan misses out on the oversized 'coffin-shaped' kidney grilles, as seen on the recent… [+1084 chars]"}, {"source": {"id": null, "name": "Kotaku Australia"}, "author": null, "title": "All The Sequels That Should Come To Next Gen Consoles - Kotaku Australia", "description": "Control. InFAMOUS Second Son. Crash Bandicoot. All these classic games and more deserve sequels. Will we see them in the upcoming console generation?", "url": "https://www.kotaku.com.au/2020/06/next-gen-console-games-sequels/", "urlToImage": "https://www.kotaku.com.au/content/uploads/sites/3/2020/06/infamous-second-son.jpg", "publishedAt": "2020-06-15T23:00:00Z", "content": "Now we know what the PlayStation 5 looks like, and what we can expect to play. Naturally, many games so far are sequels, including the next Ratchet &amp; Clank adventure, Resident Evil VIII and Spide… [+6491 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "That Microsoft Dual Screen Android Phone May Be Coming a Lot Sooner Than You Think - Gizmodo Australia", "description": "A few months ago, rumours started making the rounds that Microsoft’s upcoming dual-screen phone — the Surface Duo — might go on sale significantly earlier than Microsoft’s original late 2020 release date. But now, based on new rumours, it appears that one of …", "url": "https://www.gizmodo.com.au/2020/06/that-microsoft-dual-screen-android-phone-may-be-coming-a-lot-sooner-than-you-think/", "urlToImage": "https://www.gizmodo.com.au/content/uploads/sites/2/2020/06/16/wg9citfquooqilqkzowy.jpg", "publishedAt": "2020-06-15T21:42:52Z", "content": "A few months ago, rumours started making the rounds that Microsofts upcoming dual-screen phone the Surface Duo might go on sale significantly earlier than Microsofts original late 2020 release date. … [+3098 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Alex Hern", "title": "Apple News algorithms pick more celeb stories than human editors, study finds - The Guardian", "description": "Automated section of app took a third of its content from two sources: CNN and Fox News", "url": "https://www.theguardian.com/technology/2020/jun/15/apple-news-algorithms-pick-more-celeb-stories-than-human-editors-says-study", "urlToImage": "https://i.guim.co.uk/img/media/ea40af0bfa2f835126ec022f7464bf6053ebab15/0_202_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=6fcd164700ad35402d8d3229d42c16e4", "publishedAt": "2020-06-15T20:22:39Z", "content": "When algorithms replace humans in charge of editing news, they tend to select more stories about celebrities from a less diverse selection of publications, according to research.\r\nJack Bandy and Nich… [+2615 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Summer in Mara | Review in 3 Minutes - The Escapist", "description": "Join our YouTube Membership program for Early Access to videos, badges, emojis, bonus content and more. ►► https://www.youtube.com/channel/UCqg5FCR7NrpvlBWMX...", "url": "https://www.youtube.com/watch?v=1l80V0GHw_I", "urlToImage": "https://i.ytimg.com/vi/1l80V0GHw_I/maxresdefault.jpg", "publishedAt": "2020-06-15T20:00:00Z", "content": "Join our YouTube Membership program for Early Access to videos, badges, emojis, bonus content and more. https://www.youtube.com/channel/UCqg5...\r\nAmy Campbell reviews Summer in Mara, developed by Chi… [+507 chars]"}, {"source": {"id": null, "name": "Android Authority"}, "author": "https://www.facebook.com/browncscott", "title": "Android 11 beta phones: Is yours supported? - Android Authority", "description": "Update: We now have download links for the Xiaomi Mi 10 (but not the Mi 10 Pro, unfortunately).", "url": "https://www.androidauthority.com/android-11-beta-support-1127476/", "urlToImage": "https://cdn57.androidauthority.net/wp-content/uploads/2020/06/Android-11-logo-stock-photo-on-smartphone-7-920x470.jpg", "publishedAt": "2020-06-15T19:20:33Z", "content": "Update, June 15, 2020 (03:27 PM ET): Xiaomi was one of the first non-Google companies to confirm that it would have some phones in the Android 11 beta program. However, we didnt have any download lin… [+1590 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Ryan Gilliam", "title": "Destiny 2 players are back on the AFK Forge farm in Season of Arrivals - Polygon", "description": "Destiny 2’s Season of Arrivals recently launched, and players are already cheesing the new content. Players are using the Forges from Black Armory to farm Umbral Engrams and Altered Element.", "url": "https://www.polygon.com/2020/6/15/21291859/destiny-2-season-of-arrival-umbral-engram-altered-element-farm-afk-forge", "urlToImage": "https://cdn.vox-cdn.com/thumbor/K6Zk0ScULZZt21BrHtlbPQ92GRc=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/20035822/Season_of_Arrivals_Gear_10.jpg", "publishedAt": "2020-06-15T19:01:35Z", "content": "Bungie launched Destiny 2s latest season, Season of Arrivals, on June 9, alongside its reveal ofDestiny 2: Beyond Light this fall. But since the seasons launch, players have resurrected an old glitch… [+2138 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "PS5 - All Games, Consoles, And Details Revealed - Comicbook.com", "description": "The PS5 revealed its epic design and tons of new titles, including Spider-Man: Miles Morales, a new Ratchet & Clank, and more! Brandon Davis has all of the d...", "url": "https://www.youtube.com/watch?v=1GbV3nxFhNU", "urlToImage": "https://i.ytimg.com/vi/1GbV3nxFhNU/hqdefault.jpg", "publishedAt": "2020-06-15T19:00:00Z", "content": null}, {"source": {"id": null, "name": "Android Central"}, "author": "Samuel Tolbert", "title": "Horizon Forbidden West for PS5: Everything you need to know - Android Central", "description": "Horizon Forbidden West follows Aloy as she explores west into the former USA. This new title from Guerrilla Games is showing off just what the PS5 hardware is capable of. Here's everything you need to know.", "url": "https://www.androidcentral.com/horizon-forbidden-west", "urlToImage": "https://www.androidcentral.com/sites/androidcentral.com/files/styles/large/public/article_images/2020/06/horizon-forbidden-west-aloy-bow.jpg?itok=grtStlM8", "publishedAt": "2020-06-15T18:11:03Z", "content": "Source: Sony Interactive Entertainment\r\nOne of the biggest games revealed at the PlayStation 5 showcase was Horizon Forbidden West. Developed by Guerrilla Games, this PS5 title is bringing the Decima… [+4395 chars]"}, {"source": {"id": null, "name": "http://mp1st.com/category/news"}, "author": "Alex Co", "title": "Xbox Smart Delivery Explained, Will Be Available for Xbox Game Pass - MP1st", "description": "Microsoft has released a new blog update explaining the Xbox Smart Delivery features and how Xbox Game Pass titles will be available for it.", "url": "https://mp1st.com/news/xbox-smart-delivery-explained-will-be-available-for-xbox-game-pass", "urlToImage": "https://mp1st.com/wp-content/uploads/2020/06/xbox-smart.jpg", "publishedAt": "2020-06-15T18:06:58Z", "content": "Aside from introducing better tech under the hood, Microsofts next-gen console the Xbox Series X will also offer other innovative features such as Xbox Smart Delivery. What is it exactly? According t… [+2948 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Heroes of the Storm - Mei Reveal Trailer - IGN", "description": "Overwatch's ice-harnessing scientist, Mei, joins the Heroes of the Storm roster.", "url": "https://www.youtube.com/watch?v=bXSLlqpKWyA", "urlToImage": "https://i.ytimg.com/vi/bXSLlqpKWyA/maxresdefault.jpg", "publishedAt": "2020-06-15T18:00:08Z", "content": "Overwatch's ice-harnessing scientist, Mei, joins the Heroes of the Storm roster."}, {"source": {"id": null, "name": "Grand Tour Nation"}, "author": "Austin Crosby", "title": "With Gran Turismo 7 Around The Corner, What Does 2020 Sim Racing Look Like? - Grand Tour Nation", "description": "A Car Community of the Grand Tour & Top Gear Fans", "url": "https://www.grandtournation.com/cars/with-gran-turismo-7-around-the-corner-whats-the-2020-racing-simulator-outlook/", "urlToImage": "https://i1.wp.com/grandtournation.com/wp-content/uploads/2020/06/With-Gran-Turismo-7-Around-The-Corner-Whats-The-2020-Racing-Simulator-Outlook.jpg?fit=1920%2C1052&ssl=1", "publishedAt": "2020-06-15T17:30:35Z", "content": "With the recent reveal of the new Playstation 5, everyone has become even more hyped for the next generation of their favorite games. As Sony gave us the first look at Gran Turismo 7, the latest entr… [+5197 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Bonnie Burton", "title": "No, KFC isn't releasing a game console to compete with Sony's PS5 - CNET", "description": "The fast food chain trolls Sony and Microsoft on social media with its own fake console reveal.", "url": "https://www.cnet.com/news/no-kfc-isnt-releasing-a-game-console-to-compete-with-sonys-ps5/", "urlToImage": "https://cnet2.cbsistatic.com/img/dmaLUrOZYHd-MzatVuqRVenKbJs=/2020/06/15/24035e45-9c3e-4f0b-bdcc-2b66f6206e32/twitter-in-stream-wide-kfconsole1.jpg", "publishedAt": "2020-06-15T17:29:20Z", "content": "What's really going on in this KFConsole video announcement from KFC?\r\nVideo screenshot by Bonnie Burton/CNET\r\nNot to be outdone by Sony's PlayStation 5 and Microsoft's Xbox Series X, fast food resta… [+2702 chars]"}, {"source": {"id": null, "name": "MusicTech"}, "author": null, "title": "Steinberg’s Cubasis 3 is now available on Android devices - MusicTech", "description": "Google’s mobile OS gets a major addition to its music-making app catalogue with Steinberg’s Cubasis 3.1.", "url": "https://www.musictech.net/news/steinbergs-cubasis-3-is-now-available-on-android-devices/", "urlToImage": "https://www.musictech.net/wp-content/uploads/2020/06/Cubasis-3-1400x1050-1.jpg", "publishedAt": "2020-06-15T17:09:04Z", "content": "Googles mobile OS gets a major addition to its music-making app catalogue with Steinbergs Cubasis 3.1. The mobile DAW has been around on iOS for seven years now, alongside the likes of GarageBand and… [+2416 chars]"}, {"source": {"id": null, "name": "TechSpot"}, "author": "Rob Thubron", "title": "Github says it will replace the terms whitelist, blacklist, and master/slave for being racially insensitive - TechSpot", "description": "Github CEO Nat Friedman said the firm was working to replace the terms ‘master’ and ‘slave’ with the likes of ‘main/default/primary’ and ‘secondary.’ Users will also find ‘blacklist’ and ‘whitelist’ dropped for ‘allow list’ and ‘deny/exclude list,’ writes ZDN…", "url": "https://www.techspot.com/news/85631-github-replace-terms-whitelist-blacklist-masterslave-racially-insensitive.html", "urlToImage": "https://static.techspot.com/images2/news/bigimage/2019/07/2019-07-29-image-3.png", "publishedAt": "2020-06-15T15:59:00Z", "content": "A hot potato: Days after it was reported that more tech companies and insiders were calling for racially insensitive terms such as whitelist, blacklist, and master/slave to be replaced, Github has re… [+1910 chars]"}, {"source": {"id": null, "name": "Micky News"}, "author": null, "title": "‘Super Smash Bros. Ultimate’ DLC: Best ‘ARMS’ characters as DLC - Micky News", "description": "June is a big month for players of Super Smash Bros. Ultimate as the roster is expected to expand with a brand new DLC. However, we’re at the halfway point of the month, and we’ve still yet to see the next Super Smash Bros. Ultimate DLC. What we do know for n…", "url": "https://micky.com.au/super-smash-bros-ultimate-dlc-best-arms-characters-as-dlc/", "urlToImage": "https://micky.com.au/wp-content/uploads/2020/06/Super-Smash-Bros.-Ultimate.jpg", "publishedAt": "2020-06-15T14:32:06Z", "content": "What we do know for now is that the next Super Smash Bros. Ultimate DLC will be a character from Nintendo’s ARMs. There are many possible candidates in the game, so it’s tough to pick one that’s fitt… [+2153 chars]"}, {"source": {"id": null, "name": "PCMag.com"}, "author": "Matthew Humphries", "title": "Samsung Launches Odyssey G9 and G7 QLED Monitors With 1000R Curvature - PCMag AU", "description": "The Odyssey monitors are the first to use a 1000R curvature according to Samsung and can be pre-ordered today.", "url": "https://au.pcmag.com/monitors/67303/samsung-launches-odyssey-g9-and-g7-qled-monitors-with-1000r-curvature", "urlToImage": "https://sm.pcmag.com/t/pcmag_au/news/s/samsung-la/samsung-launches-odyssey-g9-and-g7-qled-monitors-with-1000r_dzsa.1200.jpg", "publishedAt": "2020-06-15T12:00:00Z", "content": "Samsung is today opening pre-orders for the Odyssey G9 and G7 monitors it first introduced back as CES 2020 in January.\r\nIf you like curved and ultrawide monitors then the Odyssey lineup is certainly… [+1668 chars]"}, {"source": {"id": null, "name": "TechSpot"}, "author": "Rob Thubron", "title": "KFC's console boasts 4K, 120fps, and a chicken chamber - TechSpot", "description": "This is, of course, a joke by the fast-food chain, riding the wave of hype from the recent PS5 reveal. It comes from the company’s gaming Twitter and Instagram accounts, which share game-related memes. It even has a YouTube channel&hellip;", "url": "https://www.techspot.com/news/85626-kfc-unveils-chicken-cooking-next-gen-console.html", "urlToImage": "https://static.techspot.com/images2/news/bigimage/2020/06/2020-06-15-image-9.jpg", "publishedAt": "2020-06-15T10:17:00Z", "content": "WTF?! Do you feel like the Xbox Series X is too boxy? Does the PlayStation 5 design hurt your eyes? If so, you could always opt for a third option that not only promises true 4K at 120 fps but will a… [+1365 chars]"}]}