{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Dexerto.com"}, "author": "Andy Williams", "title": "Calls for Alinity to be banned on Twitch following livestream accident - Dexerto", "description": "Twitch star Alinity Divine has found herself in the public spotlight yet again, after a slip-up on steam.", "url": "https://www.dexerto.com/entertainment/calls-for-alinity-to-be-banned-on-twitch-following-livestream-accident-1357732", "urlToImage": null, "publishedAt": "2020-04-25T10:05:07Z", "content": "Twitch streamer Natalia ‘Alinity’ Mogollon has found herself at the center of controversy again, as calls for her to be banned from the platform have spread on social media after her April 24 livestream.\r\nThis follows her previous high-profile controversy, wh… [+2675 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Matt Hanson", "title": "Smartphones are a bad deal – let's hope laptops don't go the same way - TechRadar", "description": "Opinion: forced obsolescence is a menace", "url": "https://www.techradar.com/news/smartphones-are-a-bad-deal-lets-hope-laptops-dont-go-the-same-way", "urlToImage": null, "publishedAt": "2020-04-25T10:00:00Z", "content": "Imagine buying a new laptop, only to find that three years later Microsoft/Apple stopped offering software updates for it, effectively forcing you to upgrade in order to ensure you had a machine that was secure and ran smoothly.\r\nAnd imagine that, during thos… [+5094 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Emilia Bona", "title": "Room by room tour of £975k West Derby villa with pool, cinema and a lot of crushed velvet - Liverpool Echo", "description": "It's been decorated in the current owner's signature style", "url": "https://www.liverpoolecho.co.uk/news/property/room-room-tour-975k-west-18122972", "urlToImage": null, "publishedAt": "2020-04-25T08:58:01Z", "content": "A five-bedroom villa has come on the market in West Derby - and it's got some seriously luxurious features. \r\nThe property has its own private swimming pool as well as a cinema and games room, with plush furnishings throughout.\r\nPhotos uploaded to Zoopla offe… [+3735 chars]"}, {"source": {"id": null, "name": "Eurogamer.net"}, "author": "Wesley Yin-Poole", "title": "Final Fantasy 7 Remake save editor makes Red XIII briefly playable - Eurogamer.net", "description": null, "url": "https://www.eurogamer.net/articles/2020-04-25-final-fantasy-7-remake-save-editor-makes-red-xiii-briefly-playable", "urlToImage": null, "publishedAt": "2020-04-25T08:48:00Z", "content": "Many Final Fantasy 7 fans were disappointed to learn key character Red XIII is not playable in the Final Fantasy 7 Remake, despite being one of the stars of the original game. But it turns out he is playable - briefly - via save editing.\r\nFinal Fantasy 7's ic… [+1581 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Aaron Brown", "title": "Google Chrome rival brings a feature social media fans will adore in latest update - Express", "description": "OPERA has rolled out support for a handy new feature that should appeal to social media obsessives. Here's everything you need to know.", "url": "https://www.express.co.uk/life-style/science-technology/1273390/Google-Chrome-Rival-Opera-Social-Media-Instagram-Fans-Update-New-Feature", "urlToImage": null, "publishedAt": "2020-04-25T07:03:29Z", "content": null}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Aaron Brown", "title": "WhatsApp update DOUBLES the maximum number of people in a video call - Express", "description": "WHATSAPP has expanded the maximum number of people who can take part in a video call at the same time - doubling the previous limit of four simultaneous callers. Just as before, these video calls will be end-to-end encrypted.", "url": "https://www.express.co.uk/life-style/science-technology/1273575/WhatsApp-Maximum-Number-People-Video-Call-Double-Limit-Update-iPhone-Android", "urlToImage": null, "publishedAt": "2020-04-25T06:42:31Z", "content": null}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Aaron Brown", "title": "Time to ditch WhatsApp and Houseparty? Google just made a huge change to your video calls - Express", "description": "GOOGLE has rolled out a colossal change to its video chat application, Google Duo, that promises to dramatically boost the video quality - even when making calls on sluggish home internet connections. Coupled with a number of new features added to the app, it…", "url": "https://www.express.co.uk/life-style/science-technology/1273369/Ditch-WhatsApp-Houseparty-Video-Calls-Google-Duo-Quality-Stream-Slow-Internet", "urlToImage": null, "publishedAt": "2020-04-25T06:36:39Z", "content": null}, {"source": {"id": null, "name": "Tomsguide.com"}, "author": "Roland Moore-Colyer", "title": "Xbox Series X's crazy fast load times revealed — and PS5 should be worried - Tom's Guide", "description": "Xbox Series X super-fast SSD loads Gears 5 four times faster than Xbox One", "url": "https://www.tomsguide.com/news/xbox-series-xs-crazy-fast-load-times-revealed-and-ps5-should-be-worried", "urlToImage": null, "publishedAt": "2020-04-25T06:25:00Z", "content": "Microsofts Xbox Series X will load games much, much faster than the Xbox One, even if a games code isnt tweaked for the next-generation console. \r\nGears 5 loads four times faster on the Xbox Series X than it does on the Xbox One, according to Mike Rayner, tec… [+2197 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Aaron Brown", "title": "Netflix solves a huge headache for Android users, but iPhone loses out on awesome update - Express", "description": "NETFLIX has solved one of the biggest pains when watching shows or movies on your Android smartphone or tablet. But despite many iPhone and iPad owners suffering the same headache ...there's no sign of a fix. Here's everything you need to know about the new f…", "url": "https://www.express.co.uk/life-style/science-technology/1273343/Netflix-Update-Solve-Headache-Android-No-iPhone-Users", "urlToImage": null, "publishedAt": "2020-04-25T06:06:34Z", "content": "Of course, it's still possible that you could drop your phone and somehow accidentally manage to hit the unlock button two times in quick succession, followed by the pause button – but that's much less likely than the single-tap needed to wreak havoc beforeha… [+613 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "David Snelling", "title": "Samsung reveals another blockbuster 4K TV update for your television - Express", "description": "SAMSUNG is back with even more updates for your TV and here's what's now available on your 4K television.", "url": "https://www.express.co.uk/life-style/science-technology/1273517/Samsung-4K-TV-update-Apple-Music-app", "urlToImage": null, "publishedAt": "2020-04-25T06:01:07Z", "content": "“Our goal has always been to deliver the best entertainment experiences to consumers – and as people spend more time at home, we are more committed to that mission than ever,” said Salek Brodsky, Vice President of Strategic Partnerships and Business Developme… [+665 chars]"}, {"source": {"id": null, "name": "Nintendolife.com"}, "author": "Nintendo Life", "title": "Animal Crossing Appears To Have Nerfed Tarantula And Scorpion Spawn Rates - Nintendo Life", "description": "Data mine of recent update reveals all", "url": "http://www.nintendolife.com/news/2020/04/animal_crossing_appears_to_have_nerfed_tarantula_and_scorpion_spawn_rates", "urlToImage": null, "publishedAt": "2020-04-25T04:45:00Z", "content": "Earlier this week, Nintendo rolled out Version 1.2.0 of Animal Crossing: New Horizons. It added Leif, Redd, new seasonal events, and the 'Bank of Nook' even lowered the interest rate for all savings accounts. These weren't the only significant changes, though… [+1286 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Desire Athow", "title": "This AMD Ryzen notebook deal is probably the best we've ever seen - TechRadar", "description": "Lenovo and AMD provide a glimpse into the future", "url": "https://www.techradar.com/news/this-amd-ryzen-laptop-is-the-probably-the-best-notebook-deal-ever", "urlToImage": null, "publishedAt": "2020-04-25T03:00:00Z", "content": "We reviewers are used to obsessing over incremental technology changes, but every now and then a supernova appears on our radar - something that can single handedly change the status quo.\r\nThe AMD Ryzen 4000 family is one such supernova and promises to bring … [+1829 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By James Pero For Dailymail.com", "title": "Apple and Google promise to discontinue COVID-19 tracking following the pandemic - Daily Mail", "description": "The decision to disable tech supporting contact tracing apps designed to monitor the spread of COVID-19 be made on a geographic basis according to representatives.", "url": "https://www.dailymail.co.uk/sciencetech/article-8255441/Apple-Google-promise-discontinue-COVID-19-tracking-following-pandemic.html", "urlToImage": null, "publishedAt": "2020-04-25T02:49:20Z", "content": "For the first time, Apple and Google have publicly committed to discontinuing their coronavirus tracking program once the pandemic is officially declared over.\r\nAs noted by The Verge, both companies committed to winding a contact tracing program down in a cal… [+2352 chars]"}, {"source": {"id": null, "name": "Androidauthority.com"}, "author": null, "title": "OnePlus massively downsizing European teams as focus shifts to key markets - Android Authority", "description": "OnePlus appears to be struggling in the European market, as the company is substantially reducing its workforce in the area.", "url": "https://www.androidauthority.com/oneplus-downsizing-europe-1111481/", "urlToImage": null, "publishedAt": "2020-04-25T00:30:08Z", "content": "OnePlus appears to be struggling in the European market, as the company is downsizing heavily, reducing its workforce in the region by a substantial margin.\r\nAccording to a report from Engadget, the primary countries seeing layoffs are the UK, France, and Ger… [+1162 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Anthony Spadafora", "title": "Ubuntu 20.04 adds VPN and support for a key Windows 10 feature - TechRadar", "description": "Latest Ubuntu release includes WireGuard and exFAT support", "url": "https://www.techradar.com/news/ubuntu-2004-adds-vpn-and-support-for-a-key-windows-10-feature", "urlToImage": null, "publishedAt": "2020-04-24T21:40:00Z", "content": "Canonical has released the latest version of its Ubuntu Linux distribution which offers a number of exciting new features designed to improve performance and security.\r\nUbuntu 20.04, aka Focal Fossa, is based on the Linux 5.4 kernel and this long-term-support… [+1714 chars]"}, {"source": {"id": null, "name": "Digitalspy.com"}, "author": "Chris Edwards", "title": "Nintendo addresses major security breach - digitalspy.com", "description": "There have been reported incidents of unauthorised access to user accounts.", "url": "https://www.digitalspy.com/tech/a32270793/nintendo-security-breach/", "urlToImage": null, "publishedAt": "2020-04-24T20:38:00Z", "content": "Nintendo has addressed a major security breach as it encourages users to take new security steps. \r\nIn a statement on its official website, the gaming company said it is continuing to investigate recent incidents of unauthorised access to Nintendo Accounts, b… [+1827 chars]"}, {"source": {"id": null, "name": "Rockpapershotgun.com"}, "author": null, "title": "This Minecraft map attempts to simulate social distancing during a pandemic - Rock Paper Shotgun", "description": "Blockdown Simulator has you take on the role of a nurse or a spectator as you cure villagers of a zombie pandemic.", "url": "https://www.rockpapershotgun.com/2020/04/24/this-minecraft-map-attempts-to-simulate-social-distancing-during-a-pandemic/", "urlToImage": null, "publishedAt": "2020-04-24T19:24:00Z", "content": "Are all you kids out there still playing Minecraft? Let’s hope so, because some folks have made a Minecraft map to teach you younguns about how social distancing and healthcare services work together to beat a pandemic. It sounds a bit corny off the cuff but … [+2478 chars]"}, {"source": {"id": null, "name": "Pushsquare.com"}, "author": "Push Square", "title": "Talking Point: What Free May 2020 PS Plus Games Do You Want? - Push Square", "description": "When will May 2020's PlayStation Plus lineup be announced?", "url": "http://www.pushsquare.com/news/2020/04/talking_point_what_free_may_2020_ps_plus_games_do_you_want", "urlToImage": null, "publishedAt": "2020-04-24T18:00:00Z", "content": "Whats the May 2020 PlayStation Plus lineup? And when will the May 2020 PS Plus games be announced? Sony's service has quietly been on a very good run, with Uncharted 4: A Thief's End and DiRT Rally 2.0 both very good additions in April. The Japanese giant has… [+1798 chars]"}, {"source": {"id": null, "name": "Gamesindustry.biz"}, "author": null, "title": "Google abandons Stadia Base branding as it launches free tier - GamesIndustry.biz", "description": "Free trials of Stadia Pro can essentially transition into free use of the service, now just called Stadia", "url": "https://www.gamesindustry.biz/articles/2020-04-24-google-has-launched-stadia-base-but-its-ditching-that-name", "urlToImage": null, "publishedAt": "2020-04-24T17:38:06Z", "content": "Share this article\r\nCompanies in this article\r\nGoogle\r\nEven though Google has effectively launched its free tier of Stadia, Stadia Base, it's no longer calling it that.\r\nEarlier this month, Google announced it would offer two free months of Stadia Pro, which … [+1125 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Carly Page", "title": "The Dell XPS 15 2020 may have been redesigned to take on the MacBook Pro - TechRadar", "description": "Incoming model will boast smaller bezels and upward-firing speakers", "url": "https://www.techradar.com/news/the-dell-xps-15-2020-may-have-been-redesigned-to-take-on-the-macbook-pro", "urlToImage": null, "publishedAt": "2020-04-24T17:31:00Z", "content": "Dell looks poised to release an all-new version of its XPS 15 laptop that will take a number of design clues from the recently-revamped Dell XPS 13\r\n.\r\nThats according to leaked images posted on the Korea Energy Agency Efficiency Standardization Certification… [+2119 chars]"}, {"source": {"id": null, "name": "Trueachievements.com"}, "author": "Heidi Nicholas", "title": "Sci-fi adventure Deliver Us The Moon joins Xbox Game Pass and Game Pass for PC today - TrueAchievements", "description": "Deliver Us The Moon is a sci-fi action adventure title which draws inspiration from movies such as Interstellar, and which joins the Xbox Game Pass and Xbox Game Pass for PC services today as a day one addition.", "url": "https://www.trueachievements.com/n41593/deliver-us-the-moon", "urlToImage": null, "publishedAt": "2020-04-24T17:19:36Z", "content": "The Xbox team has been busy lately: just yesterday, they surprise-dropped the announcement that Red Dead Redemption 2 will join Xbox Game Pass in May. Before that, they announced new titles for Xbox Game Pass, along with several new titles for Xbox Game Pass … [+1728 chars]"}, {"source": {"id": null, "name": "Eurogamer.net"}, "author": "Will Judd", "title": "Best graphics card 2020: every major Nvidia and AMD GPU tested - Eurogamer.net", "description": "After testing every major Nvidia and AMD graphics card on the market, we present our top recommendations for 1080p, 1440p and 4K PC builds.", "url": "https://www.eurogamer.net/articles/digitalfoundry-best-graphics-card-every-amd-nvidia-tested-7001", "urlToImage": null, "publishedAt": "2020-04-24T16:31:00Z", "content": "The DF guide to the fastest and best value video cards on the market.\r\nReplacing your graphics card is the number one upgrade you can make for your PC and the most profound in terms of improving gaming performance, so it makes sense to spend some time researc… [+17794 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Adam Marshall", "title": "Samsung smartphone sale: save hundreds on S20, Z Flip, Note 10, S10 Lite and more - TechRadar", "description": "Up to £195 off - but this flash sale ends on Monday", "url": "https://www.techradar.com/uk/news/samsung-smartphone-sale-save-hundreds-on-s20-z-flip-note-10-s10-lite-and-more", "urlToImage": null, "publishedAt": "2020-04-24T16:30:00Z", "content": "If you've been sat looking at your battered old smartphone and thinking it's high time for an upgrade, then your ticket may just have come in. All Samsung phone deals have been slashed by 15% this weekend only - with the Samsung S20, Note 10 and even the Gala… [+4136 chars]"}, {"source": {"id": null, "name": "Peterboroughtoday.co.uk"}, "author": "By The Newsroom", "title": "Tributes to inspiring Cambridgeshire mum and NHS worker who has died after contracting COVID-19 - Peterborough Telegraph", "description": "Tributes have been paid to a dedicated and caring NHS member who has died after contracting COVID-19.", "url": "https://www.peterboroughtoday.co.uk/news/people/tributes-inspiring-cambridgeshire-mum-and-nhs-worker-who-has-died-after-contracting-covid-19-2549445", "urlToImage": null, "publishedAt": "2020-04-24T15:58:00Z", "content": "Jenny Esson (45), who had underlying health conditions, became unwell whilst working from home, before sadly passing away on Friday, 17 April at Cambridge University Hospitals NHS Foundation Trust.\r\nShe worked for Cambridgeshire and Peterborough NHS Foundatio… [+2333 chars]"}, {"source": {"id": null, "name": "Whathifi.com"}, "author": "Becky Scarrott", "title": "Save £170 on award-winning Astell & Kern SR15 hi-res music player - What Hi-Fi?", "description": "The excellent Astell & Kern A&norma SR15 is now on sale", "url": "https://www.whathifi.com/news/award-winning-astell-and-kern-hi-res-music-player-slashed-in-price-at-amazon", "urlToImage": null, "publishedAt": "2020-04-24T15:09:00Z", "content": "It's a familiar story: a shiny new kid appears on the block and the old guard receives a heavy discount. However, while a successor to the Astell &amp; Kern A&amp;norma SR15 has been announced, in the form of the A&amp;norma SR25, that revered old guard, the … [+1483 chars]"}, {"source": {"id": null, "name": "Gamesradar.com"}, "author": "Austin Wood", "title": "Bungie commits to long-term plans for Destiny 2 which will be revealed this season - GamesRadar+", "description": "\"There is a long way to go before we have it in a place we are truly proud of,\" Luke Smith says", "url": "https://www.gamesradar.com/bungie-commits-to-long-term-plans-for-destiny-2-which-will-be-revealed-this-season/", "urlToImage": null, "publishedAt": "2020-04-24T15:06:37Z", "content": "Bungie is finally ready to reveal its updated long-term plans for Destiny 2.\r\n\"Theres been a growing list of concerns with the game lately: Trials, the rise in cheaters, our new Seasonal model, the balance between rewards you earn vs. items you buy,\" says \r\np… [+2495 chars]"}, {"source": {"id": null, "name": "Pushsquare.com"}, "author": "Push Square", "title": "Grab Pac-Man Championship Edition 2 for Free on PS4 - Push Square", "description": "Through until 10th May", "url": "http://www.pushsquare.com/news/2020/04/grab_pac-man_championship_edition_2_for_free_on_ps4", "urlToImage": null, "publishedAt": "2020-04-24T14:30:00Z", "content": "For the past couple of days, Pac-Man Championship Edition 2 has been listed for free on various storefronts before promptly being pulled. Now we know why. Publisher Bandai Namco is indeed allowing everyone with a PlayStation 4 to pick up a free digital copy o… [+910 chars]"}, {"source": {"id": null, "name": "Theregister.co.uk"}, "author": "Matthew Hughes", "title": "Android 11 Developer Preview 3 allows your mobe to become a router via USB Ethernet – if you can get a decent signal - The Register", "description": "Plus: Multitasking and other functions rejigged, but no promises they'll stick", "url": "https://www.theregister.co.uk/2020/04/24/android_11_dp3/", "urlToImage": null, "publishedAt": "2020-04-24T14:29:00Z", "content": "Google's third developer preview (DP3) of the Android 11 operating system is an enticing look at the future of the platform, where new features and UI tweaks abound.\r\nBut before we get into the meat of things, a bit of a throat-clearing. In the past, features… [+2358 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Huawei Music is offering 3-months of free trial for new subscribers in Europe - XDA Developers", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiYGh0dHBzOi8vd3d3LnhkYS1kZXZlbG9wZXJzLmNvbS9odWF3ZWktbXVzaWMtb2ZmZXJpbmctMy1tb250aHMtZnJlZS10cmlhbC1uZXctc3Vic2NyaWJlcnMtZXVyb3BlL9IBZGh0dHBzOi8vd3d3LnhkYS1kZXZlbG9wZXJzLmNvbS9odWF3ZWktbXVzaWMtb2ZmZXJpbmctMy1tb250aHMtZnJlZS10cmlhbC1uZXctc3Vic2NyaWJlcnMtZXVyb3BlL2FtcC8?oc=5", "urlToImage": null, "publishedAt": "2020-04-24T14:13:21Z", "content": null}, {"source": {"id": null, "name": "Eurogamer.net"}, "author": "Emma Kent", "title": "PUBG adding bots to public matches on console - Eurogamer.net", "description": null, "url": "https://www.eurogamer.net/articles/2020-04-24-pubgs-adding-bots-to-public-matches-on-console", "urlToImage": null, "publishedAt": "2020-04-24T13:54:00Z", "content": "It's almost inevitable: once a multiplayer game's been out for some time, veteran players tend to pull ahead to a point where newer players just can't keep up. The situation is the same for PUBG, which has now developed a player base so proficient that new jo… [+3625 chars]"}, {"source": {"id": null, "name": "Kitguru.net"}, "author": "Mustafa Mahmoud", "title": "Mick Gordon promises to fix bad DOOM Eternal soundtrack himself - KitGuru", "description": "A few days ago, the official OST for the highly-praised DOOM Eternal was released to those who purchased the game’s collector’s edition. Unfortunately, some fans noticed that the soundtrack featured m", "url": "https://www.kitguru.net/gaming/uncategorized/mustafa-mahmoud/mick-gordon-promises-to-fix-bad-doom-eternal-soundtrack-himself/", "urlToImage": null, "publishedAt": "2020-04-24T13:53:21Z", "content": "A few days ago, the official OST for the highly-praised DOOM Eternal was released to those who purchased the games collectors edition. Unfortunately, some fans noticed that the soundtrack featured much flatter dynamic mixing when compared to DOOM (2016). The … [+1530 chars]"}, {"source": {"id": null, "name": "Nintendolife.com"}, "author": "Nintendo Life", "title": "Random: Nintendo Says Streets Of Rage 4 Is Out On Switch, But It Definitely Isn't - Nintendo Life", "description": "Here we go again", "url": "http://www.nintendolife.com/news/2020/04/random_nintendo_says_streets_of_rage_4_is_out_on_switch_but_it_definitely_isnt", "urlToImage": null, "publishedAt": "2020-04-24T13:00:00Z", "content": "It would appear that Nintendo is still confused over the official release date of Streets of Rage 4 on Switch, following up on its initial erroneous eShop listing with a new, incorrect news post.\r\nYou may remember that at the start of the month, the Nintendo … [+1226 chars]"}, {"source": {"id": null, "name": "Techspot.com"}, "author": "Rob Thubron", "title": "Malwarebytes steps into the VPN space with WireGuard-based service - TechSpot", "description": "Available now for Windows 7 and higher—Mac, Android, iOS, and Chrome OS are coming soon—Malwarebytes Privacy costs $59.99 per year. You can also get it bundled with a 1-year license of Malwarebytes Premium for $89.99, saving buyers $49.99. Both options&hellip;", "url": "https://www.techspot.com/news/84974-malwarebytes-steps-vpn-space-wireguard-based-service.html", "urlToImage": null, "publishedAt": "2020-04-24T12:37:00Z", "content": "In brief: Malwarebytes is joining the list of antivirus companies that also offer a VPN. Called Malwarebytes Privacy, the service uses a newer and faster protocol: WireGuard. \r\nAvailable now for Windows 7 and higherMac, Android, iOS, and Chrome OS are coming … [+1527 chars]"}, {"source": {"id": null, "name": "Darko.audio"}, "author": "John H. Darko", "title": "10 more thoughts on the Chord 2go + Hugo 2 - Darko.Audio", "description": "A deeper dive on the bolt-on network streamer.", "url": "https://darko.audio/2020/04/10-more-thoughts-on-the-chord-2go-hugo-2/", "urlToImage": null, "publishedAt": "2020-04-24T12:10:14Z", "content": "What’s the best network streamer for the Chord Electronics Hugo 2 DAC / headphone amplifier? With the introduction of the 2go, it took Chord themselves to strip away any choice paralysis. The 2go is a bolt-on module that turns the Hugo 2 into a wired/wireless… [+6569 chars]"}, {"source": {"id": null, "name": "Gamesradar.com"}, "author": "Benjamin Abbott", "title": "Nintendo Switch deal stock alert: Lite bundles now available with Animal Crossing, Mario Kart and more - GamesRadar+ UK", "description": "Avoid the price gougers and find out where Nintendo Switch Lite is in stock before they vanish", "url": "https://www.gamesradar.com/uk/where-to-find-nintendo-switch-lite-UK-offers/", "urlToImage": null, "publishedAt": "2020-04-24T11:43:00Z", "content": "This is not a drill, Nintendo Switch deals are back in stock for the cheaper, handheld-only Lite model. Better yet, you can buy it on its own, or in a Switch bundle with a decent game and save a few quid while you're at it.\r\nThat's big news: due to the curren… [+6484 chars]"}, {"source": {"id": null, "name": "Rockpapershotgun.com"}, "author": null, "title": "Try Call Of Duty: Modern Warfare's multiplayer for free this this weekend through Warzone - Rock Paper Shotgun", "description": "From today until Monday, you'll be able to play five maps from Call Of Duty: Modern Warfare's multiplayer for free on a playlist inside Warzone.", "url": "https://www.rockpapershotgun.com/2020/04/24/try-call-of-duty-modern-warfares-multiplayer-for-free-this-this-weekend-through-warzone/", "urlToImage": null, "publishedAt": "2020-04-24T11:32:00Z", "content": "From today until Monday, you’ll be able to play some of Call Of Duty: Modern Warfare‘s multiplayer for free. This trial is actually taking place inside CoD: Warzone, their free-to-play battle royale game, with five Modern Warfare team deathmatch maps going on… [+1346 chars]"}, {"source": {"id": null, "name": "Androidauthority.com"}, "author": null, "title": "LG Velvet launch date set for May 7, will be unveiled through livestream - Android Authority", "description": "LG's new mid-ranger with “lustrous smoothness” and “premium softness” is coming next month.", "url": "https://www.androidauthority.com/lg-velvet-release-date-1111112/", "urlToImage": null, "publishedAt": "2020-04-24T11:27:46Z", "content": null}, {"source": {"id": null, "name": "Gizmodo.co.uk"}, "author": null, "title": "Apple iPhone SE: First Look Review - Gizmodo UK", "description": "Being able to get the best phone processor on the market in a sub-£500 phone is a real power move by Apple.", "url": "https://www.gizmodo.co.uk/2020/04/apple-iphone-se-first-look-review/", "urlToImage": null, "publishedAt": "2020-04-24T11:00:00Z", "content": "Last year, Google turned the mid-range phone market on its head by introducing the ludicrously-priced and well-specced Pixel 3a. A few other brands have followed suit since then, but none have been quite as exciting as the new iPhone SE. Now it truly seems li… [+9454 chars]"}, {"source": {"id": null, "name": "Pocket-lint.com"}, "author": "Pocket-lint", "title": "Zoom vs Microsoft Teams vs Google Meet: What's the best video conferencing service? - Pocket-lint", "description": "Video conferencing software and apps are an essential means of communication for all sorts of people and businesses.", "url": "https://www.pocket-lint.com/apps/news/151947-zoom-vs-microsoft-teams-vs-google-meet-what-s-the-difference", "urlToImage": null, "publishedAt": "2020-04-24T10:48:44Z", "content": "Video conferencing software and apps are an essential means of communication for all sorts of people and businesses.\r\nWhether you're in a long-distance relationship, taking an online class, or working from home, you need a way to connect over video conferenci… [+7023 chars]"}, {"source": {"id": null, "name": "Eurogamer.net"}, "author": "Wesley Yin-Poole", "title": "WWE 2K21 canned after disastrous WWE 2K20 - Eurogamer.net", "description": null, "url": "https://www.eurogamer.net/articles/2020-04-24-wwe-2k21-canned-after-disastrous-wwe-2k20", "urlToImage": null, "publishedAt": "2020-04-24T10:28:00Z", "content": "WWE 2K21 is canned, WWE has confirmed.\r\nDuring WWE's financial call overnight, interim chief financial officer Frank Riddick said: \"There's not going to be a launch of the game this year.\"\r\nThe news comes after last year's disastrous launch of WWE 2K20, which… [+830 chars]"}, {"source": {"id": null, "name": "Rockpapershotgun.com"}, "author": null, "title": "XCOM: Chimera Squad is out now, and it's half-price - Rock Paper Shotgun", "description": "It’s time to put down your world-saving guns and pick up your alien-policemen batons, because XCOM: Chimera Squad is out.", "url": "https://www.rockpapershotgun.com/2020/04/24/xcom-chimera-squad-is-out-now-and-its-half-price/", "urlToImage": null, "publishedAt": "2020-04-24T10:17:00Z", "content": "It’s time to put down your world-saving guns and pick up your alien-policing batons, because XCOM: Chimera Squad is out. XCOPS takes a big sidewards leap away from the main series, boiling down turn-based combat into single-room encounters. Developers Firaxis… [+2356 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Jeff Parsons", "title": "Beware the WhatsApp 'free beer' scam to get your personal data - Metro.co.uk", "description": "The hoax is currently circulating on WhatsApp", "url": "https://metro.co.uk/2020/04/24/beware-whatsapp-free-beer-text-just-scam-get-private-information-12603287/", "urlToImage": null, "publishedAt": "2020-04-24T09:29:18Z", "content": "The hoax is spreading through WhatsApp (Picture: Getty)\r\nA WhatsApp message promising what everyone could do with right now a free beer is nothing more than a dangerous hoax.\r\nIf you get the message, which is seemingly from Dutch beer company Heineken, ignore… [+1983 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Cindy Tran for Daily Mail Australia", "title": "Peeling carrots wrong your whole life! Video showing the correct way takes the internet by storm - Daily Mail", "description": "A British man has discovered a simple way to peel carrots in just seconds - and it turns out thousands of home cooks have all been doing it wrong their whole lives.", "url": "https://www.dailymail.co.uk/femail/article-8252137/Peeling-carrots-wrong-life-Video-showing-correct-way-takes-internet-storm.html", "urlToImage": null, "publishedAt": "2020-04-24T09:06:00Z", "content": "Most people peel their carrots from the base to the point in one direction away from their hand, but a video demonstration has emerged showing a much faster and efficient way of using the vegetable peeler.\r\nThe footage, posted on Reddit by an anonymous user, … [+2015 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "GameCentral", "title": "Elijah Wood visits fan's Animal Crossing game, picks her fruit - Metro.co.uk", "description": "Frodo Baggins himself has turned out to be a keen Animal Crossing: New Horizons player, after taking a trip to a fan's island to sell his turnips.", "url": "https://metro.co.uk/2020/04/24/elijah-wood-turns-fans-animal-crossing-new-horizons-game-takes-fruit-12603310/", "urlToImage": null, "publishedAt": "2020-04-24T08:50:30Z", "content": "The moment Elijah Wood arrived in Animal Crossing (pic: jessa)\r\nFrodo Baggins himself has turned out to be a keen Animal Crossing: New Horizons player, after taking a trip to a fans island to sell his turnips.\r\nSince Animal Crossing: New Horizons is now offic… [+2245 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Abdul Q", "title": "OnePlus 8 Pro suffers screen issues, but the company is working on a fix - TechRadar India", "description": "Inconsistent colors for some", "url": "https://www.techradar.com/news/oneplus-8-pro-suffers-screen-issues-but-the-company-is-working-on-a-fix", "urlToImage": null, "publishedAt": "2020-04-24T08:36:00Z", "content": "OnePlus is no stranger to display issues with its phones, and it seems a new one has crept up with its latest OnePlus 8 Pro.\r\nSome users have taken to Reddit and the popular OnePlus forums to voice their concern over screen tech issues they've discovered.\r\nSo… [+1744 chars]"}, {"source": {"id": null, "name": "Ladbible.com"}, "author": "Ewan Moore", "title": "'Call Of Duty: Modern Warfare' Multiplayer Is Free To Play This Weekend - LADbible", "description": "Get it while it's hot", "url": "https://www.ladbible.com/technology/gaming-call-of-duty-modern-warfare-multiplayer-free-to-play-this-weekend-20200424", "urlToImage": null, "publishedAt": "2020-04-24T08:34:35Z", "content": "Activision has announced that Call Of Duty: Modern Warfare's multiplayer will once again be available to play for free all weekend. Starting tonight (Friday, April 24th) at 6pm, and ending on Monday April 27th at 6pm, you can bask in the warm glow of a select… [+2171 chars]"}, {"source": {"id": null, "name": "Kotaku.com"}, "author": null, "title": "You Can Finally Apologise for Being Crap in Overwatch - Kotaku UK", "description": "Blizzard is going to add a voice line feature that speaks to me on a very personal level: the ability to apologise.", "url": "https://kotaku.com/you-can-finally-apologize-for-being-trash-in-overwatch-1843029325", "urlToImage": null, "publishedAt": "2020-04-24T08:00:00Z", "content": "Who doesnt love voice lines in Overwatch? They let you say hello. They can help your teammates stay abreast of your ultimate percentage. If you play DPS, you can use them to spam messages about how you need healing until everybody elses ears seal closed like … [+2085 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "https://www.facebook.com/TechRadar", "title": "iPhone SE review (2020): Apple finally has a cheap iPhone to review - TechRadar", "description": "The 2020 iPhone SE is lightweight, cheap and future-proofed - well done, Apple", "url": "https://www.techradar.com/uk/reviews/iphone-se", "urlToImage": null, "publishedAt": "2020-04-24T07:30:00Z", "content": "Two-minute review\r\nThe iPhone SE 2020 is built around one goal: to create a new iPhone for less money than ever, and it achieves that well. For just $399 / £419 / AU$749 you can have a brand-new handset from Apple its one of the best iPhones ever created and … [+23328 chars]"}, {"source": {"id": null, "name": "Canaries.co.uk"}, "author": "Norwich City", "title": "New date for The Killers concert - News - Canaries.co.uk", "description": "Norwich City Football Club can confirm the rescheduling and a new date for the concert with The Killers at Carrow Road.", "url": "https://www.canaries.co.uk/News/2020/april/new-date-for-the-killers-concert/", "urlToImage": null, "publishedAt": "2020-04-24T06:38:52Z", "content": "Norwich City Football Club can confirm the rescheduling and a new date for the concert with The Killers at Carrow Road.\r\nThe concert was initially scheduled for June 2020, but owing to the current COVID-19 pandemic it has now been rearranged to take place on … [+710 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "David Snelling", "title": "Apple Watch turns FIVE: The biggest 5 upgrades that have changed this smartwatch - Express", "description": "THE Apple Watch is celebrating a big birthday today as this wearable officially turns five. Here are some of the ways that it has changed over the last five years.", "url": "https://www.express.co.uk/life-style/science-technology/1273252/Apple-Watch-update-news-features-upgrade-five", "urlToImage": null, "publishedAt": "2020-04-24T06:14:59Z", "content": null}, {"source": {"id": null, "name": "Gsmarena.com"}, "author": null, "title": "iPhone SE teardown: What happens when you put an iPhone 8 motherboard into the iPhone SE? - comments - GSMArena.com", "description": null, "url": "https://www.gsmarena.com/newscomm-42845.php", "urlToImage": null, "publishedAt": "2020-04-24T05:48:06Z", "content": "RejZoR, 23 hours agoPpl are forgetting that just throwing high end spec HW at the problem doesn't solve everything... moreIOS is superior? lol.This phone can only be called a success if it creates a dent in the marketshare of Android which I simply don't see … [+6776 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Ammar Kalia, Ellen E Jones, Phil Harrison, Paul Howlett, Graeme Virtue", "title": "TV tonight: celebrating the Hubble telescope - The Guardian", "description": "As our eye in the sky reaches its 30th year, a fascinating special tells its story; Anneka Rice and Laurence Llewelyn-Bowen join Joe Lycett. Here’s what to watch this evening", "url": "https://www.theguardian.com/tv-and-radio/2020/apr/24/tv-tonight-celebrating-the-hubble-telescope", "urlToImage": null, "publishedAt": "2020-04-24T05:01:06Z", "content": "Hubble: The Wonders of Space Revealed\r\n9pm, BBC Two\r\nIn orbit since April 1990 and having travelled more than 6.5bn kilometers around Earth, the Hubble telescope has done more than perhaps any other scientific experiment to reveal the extent of our universe. … [+2409 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Alice Cachia For Mailonline", "title": "House out of the Swinging Sixties complete with untouched interiors on sale for £1.3m in Highgate - Daily Mail", "description": "The four-bedroom north London home was built in the 60s and is in the much-sought after leafy Highgate. It is stockpiled full of opulent Modernist decor and sculptures fitting of the Swinging Sixties.", "url": "https://www.dailymail.co.uk/news/article-8250835/House-Swinging-Sixties-complete-untouched-interiors-sale-1-3m-Highgate.html", "urlToImage": null, "publishedAt": "2020-04-24T03:07:45Z", "content": "A time capsule home straight out of the Swinging Sixties has gone on the market for the first time - and it's complete with virtually untouched interiors.    \r\nThe four-bedroom north London home was built in the 60s and is in the much-sought after leafy Highg… [+5098 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Jordan Ramée", "title": "CS:GO And Team Fortress Source Code Leaked, But Valve Isn't Worried - GameSpot", "description": "Though it's now become a problem in 2020, the leak of the source code for Team Fortress 2 and Counter-Strike:Global Offensive actually traces back to 2018.", "url": "https://www.gamespot.com/articles/csgo-and-team-fortress-source-code-leaked-but-valv/1100-6476395/", "urlToImage": null, "publishedAt": "2020-04-24T02:00:00Z", "content": "Valve seemingly has a bit of a leak problem right now, as the source code for both Team Fortress 2 and Counter-Strike: Global Offensive has recently made its way into the public eye. Or at least, that's how it appears. The source code has actually been public… [+4707 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "Sarah Corker", "title": "Coronavirus: 'Our wedding is cancelled but we still have to pay' - BBC News", "description": "Venues are forcing couples to pay big cancellation fees for weddings delayed by the lockdown.", "url": "https://www.bbc.com/news/business-52400441", "urlToImage": null, "publishedAt": "2020-04-23T23:25:00Z", "content": "Let us know you agree to cookies\r\nWe use cookies to give you the best online experience. Please let us know if you agree to all of these cookies.\r\nVideo caption\r\n 'We've saved so hard for so long for it, it's beyond belief almost'\r\nBrides and grooms say they … [+8104 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "With humans vulnerable: How about a digital helper? - BBC News", "description": "Robots and digital assistants have proved useful during the Covid-19 pandemic but are still limited.", "url": "https://www.bbc.co.uk/news/business-52290562", "urlToImage": null, "publishedAt": "2020-04-23T23:15:10Z", "content": "Image copyrightCloudmindsImage caption\r\n The XR-1 at a hospital in China\r\nSince February, California-based manufacturer CloudMinds has shipped more than 100 robots to China.\r\nMany of those have gone to hospitals, where the XR-1 provides information to patient… [+5071 chars]"}, {"source": {"id": null, "name": "Thetimes.co.uk"}, "author": "Tom Knowles, Technology Correspondent", "title": "You've had your chips, Apple to tell Intel - The Times", "description": "Apple may start releasing Mac computers that come with its own chips again from next year, ditching Intel’s processor after 16 years, according to insiders.The iPhone maker is reportedly creating", "url": "https://www.thetimes.co.uk/article/youve-had-your-chips-apple-to-tell-intel-0hjs5wwbj", "urlToImage": null, "publishedAt": "2020-04-23T23:01:00Z", "content": "Apple may start releasing Mac computers that come with its own chips again from next year, ditching Intels processor after 16 years, according to insiders.\r\nThe iPhone maker is reportedly creating processors for laptops and desktop computers, based on the chi… [+522 chars]"}, {"source": {"id": null, "name": "Dbltap.com"}, "author": "Daniel Kortenhaus", "title": "Fortnite Fan Theory Suggests The Game Might Return to its Original Map - DBLTAP", "description": "Epic Games is often known for their leaks and teases within Fortnite, sending fans into frenzy and speculation about the upcoming changes they will see in the g", "url": "https://www.dbltap.com/posts/fortnite-fan-theory-suggests-the-game-might-return-to-its-original-map-01e6ky14azf4", "urlToImage": null, "publishedAt": "2020-04-23T17:32:31Z", "content": "Epic Games is often known for their leaks and teases within Fortnite, sending fans into frenzy and speculation about the upcoming changes they will see in the game. From this week's underwater swimming leak to a new doomsday device, Epic certainly isn't stopp… [+997 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jay Peters", "title": "Apple’s new Magic Keyboard for the iPad Pro is covered under AppleCare Plus - The Verge", "description": "If you have AppleCare Plus for your iPad Pro, Apple’s new Magic Keyboard for the iPad Pro is covered by that policy. The AppleCare Plus service fee for the Magic Keyboard is $29. That policy covers an Apple Pencil, too.", "url": "https://www.theverge.com/2020/4/23/21232811/apple-magic-keyboard-ipad-pro-applecare-plus-covered", "urlToImage": null, "publishedAt": "2020-04-23T17:25:46Z", "content": "It has a $29 service fee\r\nPhoto by Vjeran Pavic / The Verge\r\nApples new Magic Keyboard for the iPad Pro is a pretty expensive accessory the 11-inch version costs $299, while the 12.9-inch version costs $349 but if you have AppleCare Plus coverage for your iPa… [+1476 chars]"}, {"source": {"id": null, "name": "Chromeunboxed.com"}, "author": "https://chromeunboxed.com/author/robbypayne/", "title": "PWAs installed from the Play Store have a few tricks up their sleeve that add to their native feel - Chrome Unboxed", "description": "We spent a bit of time last week talking about the arrival of two apps in the Play Store for Chromebooks that have been there for a while, but are now in a new form: the PWA (progressive web app). On a Chromebook, if you head to the Play Store and attempt to …", "url": "https://chromeunboxed.com/chrome-os-chromebooks-pwa-google-play-store-install/", "urlToImage": null, "publishedAt": "2020-04-23T17:00:04Z", "content": "We spent a bit of time last week talking about the arrival of two apps in the Play Store for Chromebooks that have been there for a while, but are now in a new form: the PWA (progressive web app). On a Chromebook, if you head to the Play Store and attempt to … [+4024 chars]"}, {"source": {"id": null, "name": "Whatculture.com"}, "author": "Dan Curtis", "title": "10 PS5 Exclusives That Would DESTROY Xbox Series X - WhatCulture", "description": "Move over MS - these potential PS5 exclusive games could be incredible.", "url": "https://whatculture.com/gaming/10-ps5-exclusives-that-would-destroy-xbox-series-x", "urlToImage": null, "publishedAt": "2020-04-23T15:41:17Z", "content": "If everything still goes to plan, the PS5 is looking to be released this holiday season.\r\nWhile we haven't even seen the console yet, it's an exciting time. Sony is sitting on an absolute goldmine of established IPs they can potentially use as launch window t… [+782 chars]"}, {"source": {"id": null, "name": "Fortniteinsider.com"}, "author": null, "title": "Fortnite Challenges Week 10: Midas' Mission Part 2 Available 23rd April - Fortnite Insider", "description": "Here are all of the Fortnite challenges that have just been released for the second part of Midas’ Mission.  Every week in Fortnite Battle Royale, ten new challenges are released and are available to complete on Thursdays. We are now in Week 10 of this season…", "url": "https://fortniteinsider.com/fortnite-challenges-week-10-midas-mission-part-2-available-23rd-april/", "urlToImage": null, "publishedAt": "2020-04-23T15:04:00Z", "content": "Here are all of the Fortnite challenges that have just been released for the second part of Midas’ Mission. \r\nEvery week in Fortnite Battle Royale, ten new challenges are released and are available to complete on Thursdays. We are now in Week 10 of this seaso… [+1576 chars]"}, {"source": {"id": null, "name": "Howtogeek.com"}, "author": "Justin Duino", "title": "Become a Tiger King with These 3D Google Animals and Objects - How-To Geek", "description": "Google now offers amazing 3D augmented reality animals and objects on nearly any iPhone, iPad, or Android phone. You can find them with a quick search on Chrome. Using Google’s ARCore technology, you can study realistic-looking objects in the world around you.", "url": "https://www.howtogeek.com/669563/become-the-tiger-king-with-these-3d-google-animals-and-objects/", "urlToImage": null, "publishedAt": "2020-04-23T14:00:28Z", "content": "Justin Duino\r\nGoogle now offers amazing 3D augmented reality animals and objects on nearly any iPhone, iPad, or Android phone. You can find them with a quick search on Chrome. Using Google’s ARCore technology, you can study realistic-looking objects in the wo… [+2635 chars]"}, {"source": {"id": null, "name": "Hulldailymail.co.uk"}, "author": "Aaron Brown, Brett Gibbons", "title": "Google Chrome users may need to update browser in security emergency - Leicestershire Live", "description": "Users have been advised to install the update as soon as possible", "url": "https://www.hulldailymail.co.uk/news/uk-world-news/google-chrome-users-need-update-4071643", "urlToImage": null, "publishedAt": "2020-04-23T12:56:00Z", "content": "Search engine Google has launched an emergency update for Chrome users worldwide amid a security scare.\r\n Users have been advised to install the update as soon as possible but Google is not revealing the full extent of the flaw, which carries the codename CVE… [+1296 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Liam Martin", "title": "Fortnite Astro Heads Astronomical challenge map locations REVEALED - Express", "description": "FORTNITE fans can unlock new rewards as part of the Travis Scott Astronomical event. Here's where to bounce off Giant Astro Heads to solve the challenge.", "url": "https://www.express.co.uk/entertainment/gaming/1271865/Fortnite-Bounce-off-Giant-Astro-Heads-Travis-Scott-Astronomical-challenge-SOLVED", "urlToImage": null, "publishedAt": "2020-04-23T12:19:00Z", "content": "Fortnite fans are working their way through the Travis Scott Astronomical challenges on PS4, Xbox One, Nintendo Switch, iOS, Android and PC.\r\nThe full Travis Scott Astronomical event will take place between April 23 to April 25.\r\n\"An other-worldly experience … [+1743 chars]"}, {"source": {"id": null, "name": "Topgear.com"}, "author": "Tom Harrison", "title": "Say hello to Ford's 1400bhp electric Mustang - Top Gear", "description": "The Cobra Jet 1400 Prototype should “crush” the ¼-mile in about eight seconds", "url": "https://www.topgear.com/car-news/electric/say-hello-fords-1400bhp-electric-mustang", "urlToImage": null, "publishedAt": "2020-04-23T11:07:15Z", "content": "Back in 1968 Ford built 50 special lightweight Mustangs specifically for drag racing. Some 40 years later it revived the practice, and most years since has built small batches of these fat-tyred, turn-key but non road-legal Mustangs. Theyre called Cobra Jets,… [+1250 chars]"}, {"source": {"id": null, "name": "Thetimes.co.uk"}, "author": "David Sanderson, Arts Correspondent", "title": "Sales of plague novels soar amid coronavirus lockdown - The Times", "description": "Sales of classic novels are up, many featuring tales of plagues.Research by the Reading Agency charity has highlighted increasing sales of books about the spread of viruses and diseases, such as", "url": "https://www.thetimes.co.uk/article/sales-of-plague-novels-soar-3hwphvfql", "urlToImage": null, "publishedAt": "2020-04-23T11:00:00Z", "content": "Sales of classic novels are up, many featuring tales of plagues.\r\nResearch by the Reading Agency charity has highlighted increasing sales of books about the spread of viruses and diseases, such as Daniel Defoes A Journal of the Plague Year.\r\nOther titles expe… [+461 chars]"}, {"source": {"id": null, "name": "Digitalcameraworld.com"}, "author": "James Artaius", "title": "Samsung killer! Motorola Edge+ packs 108MP camera, 6K video and 5G speed - Digital Camera World", "description": "The new Motorola Edge+ flagship camera phone delivers 108MP images and 6K video for ultimate content creation", "url": "https://www.digitalcameraworld.com/news/samsung-killer-motorola-edge-packs-108mp-camera-6k-video-and-5g-speed", "urlToImage": null, "publishedAt": "2020-04-23T09:49:00Z", "content": "Motorola has launched its long-awaited flagship phone, the Motorola Edge+  and it's gunning for Samsung's top slot, with a 108MP primary camera, 6K video and 5G super speed. \r\nAlready looking like one of the best camera phones, the headline feature of the Mot… [+2416 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Matt Hanson", "title": "This Windows 10 update fail is the most serious yet – here’s what you need to do - TechRadar", "description": "Latest Windows 10 update is causing crashes and deleting files", "url": "https://www.techradar.com/news/this-windows-10-update-fail-is-the-most-serious-yet-heres-what-you-need-to-do", "urlToImage": null, "publishedAt": "2020-04-23T09:14:00Z", "content": "Windows 10 is suffering yet more problems thanks to a faulty update and this one could be its most serious one yet, with users reporting Blue Screen of Death errors and deleted files after installing Windows 10 KB4549951.\r\nWindows 10 KB4549951 was released by… [+3547 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "David Snelling", "title": "Some BT, Virgin Media and Sky customers just received the broadband news they wanted - Express", "description": "BT, VIRGIN Media, Sky and many other broadband customers have just received some good news as it's revealed that UK download speeds are finally getting faster.", "url": "https://www.express.co.uk/life-style/science-technology/1272146/BT-broadband-Virgin-Media-sky-best-speeds-internet-downloads", "urlToImage": null, "publishedAt": "2020-04-22T05:43:35Z", "content": null}]}