{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Kellie Chudzinski For Dailymail.com", "title": "Jodie Turner-Smith calls herself a 'milk factory' a week after giving birth to her first child - Daily Mail", "description": "She just welcomed her first child, with husband Joshua Jackson, last week. And Jodie Turner-Smith shared a selfie to Instagram on Saturday looking a bit exhausted from caring for her newborn.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-8257649/Jodie-Turner-Smith-calls-milk-factory-week-giving-birth-child.html", "urlToImage": null, "publishedAt": "2020-04-26T14:38:32Z", "content": "She just welcomed her first child, with husband Joshua Jackson, just last week. \r\nAnd Jodie Turner-Smith shared a selfie to Instagram on Saturday as she took a brief break from caring for her newborn. \r\nThe Queen and Slim star joked that she was a 'milk facto… [+2445 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Souhardya Biswas", "title": "DrDisrespect Roasts Shroud And Mixer For Xbox Commercial - Essentially Sports", "description": "After that, DrDisrespect roasted Shroud by comparing the Xbox advertisement with footage from his own announcement video he did with Twitch.", "url": "https://www.essentiallysports.com/drdisrespect-roasts-shroud-and-mixer-for-xbox-commercial-esports-news-2020/", "urlToImage": null, "publishedAt": "2020-04-26T13:44:00Z", "content": "Michael ‘Shroud‘ Grzesiek and Guy ‘DrDisrespect’ Beahm are two of the biggest content creators for their respective streaming platforms. Recently, Shroud teamed up with Microsoft’s Xbox to give us a commercial. Though, DrDisrespect and Shroud are friends, tha… [+1889 chars]"}, {"source": {"id": null, "name": "Pushsquare.com"}, "author": "Push Square", "title": "Days Gone Developer Sony Bend Recruiting for AAA PS5 Project - Push Square", "description": "Cinematic quality", "url": "http://www.pushsquare.com/news/2020/04/days_gone_developer_sony_bend_recruiting_for_aaa_ps5_project", "urlToImage": null, "publishedAt": "2020-04-26T13:30:00Z", "content": "Days Gone is one of the most underrated games of the generation and I had more fun playing it than critical darlings like Uncharted 4 and Horizon Zero Dawn.\r\nIt wasn't perfect, but had such potential and was so good to play in comparison to what some critics … [+342 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "10 Greatest Gaming Gadgets Of All Time - TheGamer", "description": "Must have gaming accessories that every gamer needs to enhance their video game experience. From Nintendo Switch Pro controllers, gaming chairs, ps4 accessor...", "url": "https://www.youtube.com/watch?v=syHU2IH1C2s", "urlToImage": null, "publishedAt": "2020-04-26T13:15:02Z", "content": "Must have gaming accessories that every gamer needs to enhance their video game experience. From Nintendo Switch Pro controllers, gaming chairs, ps4 accessories, and even some fan favorites for Xbox play! \r\nSUBSCRIBE NOW to The Gamer! Click here: https://goo.… [+1385 chars]"}, {"source": {"id": null, "name": "Eurogamer.net"}, "author": "John Linneman", "title": "DF Retro takes on the epic Final Fantasy 7 saga - Eurogamer.net", "description": null, "url": "https://www.eurogamer.net/articles/digitalfoundry-2020-final-fantasy-7-retro", "urlToImage": null, "publishedAt": "2020-04-26T13:00:00Z", "content": "The recent release of Final Fantasy 7 Remake is the end of a long, long story - and the beginning of a new one. One of the most significant releases in the original PlayStation's library, FF7 redefined the JRPG with its combination of pre-rendered backgrounds… [+5015 chars]"}, {"source": {"id": null, "name": "Theregister.co.uk"}, "author": "Shaun Nichols", "title": "Sophos XG firewalls hacked, hotfix ready. Texts wreck Apple iThings. Yup, business as usual in infosec world - The Register", "description": "Plus Office 2016, 2019 patches – and a barn-load of other security bits and bytes", "url": "https://www.theregister.co.uk/2020/04/26/security_roundup_240420/", "urlToImage": null, "publishedAt": "2020-04-26T12:04:00Z", "content": "Roundup It's time to dig in to another Register security roundup.\r\nSophos has rushed out a hotfix for its XG Firewall products to close an SQL injection vulnerability after hackers were spotted exploiting the hole in the wild. The flaw can be abused to steal … [+8843 chars]"}, {"source": {"id": null, "name": "Eurogamer.net"}, "author": "Vikki Blake", "title": "Help bring Wolfenstein: The Board Game to life with this Kickstarter campaign - Eurogamer.net", "description": null, "url": "https://www.eurogamer.net/articles/2020-04-26-help-bring-wolfenstein-the-board-game-to-life-with-this-kickstarter-campaign", "urlToImage": null, "publishedAt": "2020-04-26T12:01:00Z", "content": "A Kickstarter campaign to bring a Wolfenstein board game to life has generated over ten times its original goal.\r\nThe fundraiser for Wolfenstein: The Board Game - the campaign for which went live on 14th April, 2020, and has \" beta\" approval of both MachineGa… [+1739 chars]"}, {"source": {"id": null, "name": "Rockpapershotgun.com"}, "author": null, "title": "Riot looking for \"long-term solutions\" after devs report sexist harassment in Valorant - Rock Paper Shotgun", "description": "As Riot employees - including Valorant's own executive producer - report toxic abuse in-game, Riot promise \"long-term solutions\" against bad actors", "url": "https://www.rockpapershotgun.com/2020/04/26/riot-looking-for-long-term-solutions-after-devs-report-sexist-harassment-in-valorant/", "urlToImage": null, "publishedAt": "2020-04-26T11:59:00Z", "content": "A tough stance on cheaters, bots and key-resellers. In-depth training modes. For a traditionally inaccessible genre, Valorant seems to be trying its hardest to be as welcoming as possible – and now, that means making sure people can play nice on their battlef… [+2973 chars]"}, {"source": {"id": null, "name": "Sammobile.com"}, "author": "SamMobile", "title": "Here’s a Samsung smartphone with a pop-up camera because nothing makes sense anymore - SamMobile", "description": "Samsung hasn't really opted for any extraordinary solutions for the front camera just to achieve a higher screen-to-body ratio. It ...", "url": "https://www.sammobile.com/news/samsung-smartphone-pop-up-camera-nothing-makes-sense", "urlToImage": null, "publishedAt": "2020-04-26T11:51:34Z", "content": "Samsung hasn’t really opted for any extraordinary solutions for the front camera just to achieve a higher screen-to-body ratio. It has stuck with its Infinity-O, Infinity-V and Infinity-U notched solutions with the Galaxy A80 being the only exception.\r\nThe Ga… [+1732 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "TechRadar Team", "title": "7 PS4 games worth buying before the PSN Spring Sale ends - TechRadar India", "description": "Our favorite deals from the latest PS4 sale", "url": "https://www.techradar.com/news/7-ps4-games-worth-buying-before-the-psn-spring-sale-ends", "urlToImage": null, "publishedAt": "2020-04-26T11:00:00Z", "content": "If you're a PS4 player stuck indoors during these very boring times, you've probably noticed that Sony has been running a Spring sale for the past few weeks. As tempting as it is to look at your pile of shame and decide not to buy something, there are a few d… [+4809 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "BBC News", "title": "Coronavirus: Minecraft virtual nightclub raises money for NHS - BBC News", "description": "With the nation urged to stay at home, a night out in a virtual club proves a big draw for three friends.", "url": "https://www.bbc.co.uk/news/av/uk-england-birmingham-52419775/coronavirus-minecraft-virtual-nightclub-raises-money-for-nhs", "urlToImage": null, "publishedAt": "2020-04-26T10:55:44Z", "content": null}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Sean Keach", "title": "Call of Duty Warzone Gulag tips and tricks – Activision reveals best way to win EVERY match-up - The Sun", "description": "", "url": "http://www.thesun.co.uk/tech/11473847/call-of-duty-warzone-gulag-tips-tricks-how-to-win/", "urlToImage": null, "publishedAt": "2020-04-26T10:00:03Z", "content": "TRYING to dominate in Warzone, but keep being sent to the Gulag? There are plenty of tips and tricks to earn a return to the battlefield.\r\nActivision the gaming giant behind Call of Duty: Modern Warfare has revealed its top pointers for crushing your enemies … [+5533 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "David Lumb", "title": "Motorola Edge Plus vs Samsung Galaxy S20 Plus vs iPhone 11 Pro Max - TechRadar India", "description": "Top smartphones, top prices", "url": "https://www.techradar.com/news/motorola-edge-plus-vs-samsung-galaxy-s20-plus-vs-iphone-11-pro-max", "urlToImage": null, "publishedAt": "2020-04-26T10:00:00Z", "content": "While rumors led us to expect a proper flagship from Motorola, we didnt anticipate that the Motorola Edge Plus would be so full-featured and impressive.\r\nThe Motorola Edge Plus is Motos first flagship smartphone in nearly half a decade, and with that it deser… [+8216 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Liam Martin", "title": "PS5 vs Xbox Series X: 'Exciting' Microsoft plans spell BIG trouble for PlayStation - Express", "description": "XBOX fans have every right to feel confident that the Series X will be a big improvement over the PS5.", "url": "https://www.express.co.uk/entertainment/gaming/1273827/Xbox-Series-X-PS5-Microsoft-PlayStation-next-gen-Phil-Spencer", "urlToImage": null, "publishedAt": "2020-04-26T09:57:00Z", "content": null}, {"source": {"id": null, "name": "Notebookcheck.net"}, "author": "Sanjiv Sathiah", "title": "Former Apple designer reveals original sketches, other tidbits about genesis of Apple Watch - Notebookcheck.net", "description": "Apple Watch is by a long way the world’s most popular smartwatch and it is now five years old. To mark the occasion, one of the former lead designers for the Watch has taken to Twitter to reveal some behind the scenes details never before revealed.", "url": "https://www.notebookcheck.net/Former-Apple-designer-reveals-original-sketches-other-tidbits-about-genesis-of-Apple-Watch.462935.0.html", "urlToImage": null, "publishedAt": "2020-04-26T09:54:54Z", "content": "Smartwatches have been around for a number of years with companies like Sony leading the way. Sony, incredibly, even owns the name smartwatch among its trademarks although it now seems to have given up on making them anymore. It wasnt until the Apple Watch la… [+1177 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Aaron Brown", "title": "Time to ditch WhatsApp and Houseparty? Google just made a huge change to your video calls - Express", "description": "GOOGLE has rolled out a colossal change to its video chat application, Google Duo, that promises to dramatically boost the video quality - even when making calls on sluggish home internet connections. Coupled with a number of new features added to the app, it…", "url": "https://www.express.co.uk/life-style/science-technology/1273369/Ditch-WhatsApp-Houseparty-Video-Calls-Google-Duo-Quality-Streaming-Slow-Internet-WiFi", "urlToImage": null, "publishedAt": "2020-04-26T09:43:00Z", "content": null}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Aaron Brown", "title": "iPhone users warned: Viewing this text can crash ANY Apple smartphone - Express", "description": "WATCH OUT, iPhone owners! Apple smartphones can be crashed by a string of text sent in text messages or shared on websites or online forums. The text causes your iPhone to freeze.", "url": "https://www.express.co.uk/life-style/science-technology/1273586/iPhone-Warning-iOS-Text-Message-Crash-Any-Apple-Smartphone", "urlToImage": null, "publishedAt": "2020-04-26T09:39:00Z", "content": null}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Aaron Brown", "title": "WhatsApp update DOUBLES the maximum number of people you can include in video calls - Express", "description": "WHATSAPP has expanded the maximum number of people who can take part in a video call at the same time - doubling the previous limit of four simultaneous callers. Just as before, these video calls will be end-to-end encrypted.", "url": "https://www.express.co.uk/life-style/science-technology/1273575/WhatsApp-Maximum-8-People-Video-Call-Limit-Double-Update-iPhone-Android", "urlToImage": null, "publishedAt": "2020-04-26T09:36:00Z", "content": null}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Carina Stathis For Daily Mail Australia", "title": "Disneyland shares their secret recipe for grilled cheese - Daily Mail", "description": "Disneyland has shared its secret grilled cheese sandwich recipe for others to make in the comfort of their own home, as the magical theme parks remain closed due to coronavirus restrictions.", "url": "https://www.dailymail.co.uk/femail/food/article-8257797/Disneyland-shares-secret-recipe-grilled-cheese.html", "urlToImage": null, "publishedAt": "2020-04-26T08:24:47Z", "content": "Ingredients:\r\nCream Cheese Spread\r\n1/2 cup cream cheese\r\n1/2 cup shredded Double Gloucester or cheddar\r\n2 tablespoons heavy cream\r\n1/4 teaspoon coarse salt\r\nGarlic Spread\r\n1 cup mayonnaise\r\n1 &amp; 1/2 teaspoons minced garlic\r\n1/2 teaspoon coarse salt\r\nGrille… [+965 chars]"}, {"source": {"id": null, "name": "Nintendolife.com"}, "author": "Nintendo Life", "title": "A Cool Animal Crossing: New Leaf Feature Might Be Coming To New Horizons - Nintendo Life", "description": "Could it be making the Switch?", "url": "http://www.nintendolife.com/news/2020/04/a_cool_animal_crossing_new_leaf_feature_might_be_coming_to_new_horizons", "urlToImage": null, "publishedAt": "2020-04-26T08:05:00Z", "content": "I think there's a good chance that all of the features (the coffee shop, Museum Shop, that rumored second upgrade for Nook's Cranny, vegetables, swimming, Dream Suite, etc.) will be introduced over time, perhaps as seasonal/quarterly updates over the first ye… [+942 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nAnnabel Jones,", "title": "DIY hair special: how to blow-dry, colour roots, and tong your hair like a pro - Telegraph.co.uk", "description": "The ultimate guide to mastering the basics, from the perfect glossy blow-dry to the proper way to apply a hair mask", "url": "https://www.telegraph.co.uk/beauty/hair/diy-hair-special-blow-dry-colour-roots-tong-hair-like-pro/", "urlToImage": null, "publishedAt": "2020-04-26T07:00:00Z", "content": "Touch up your roots (without ruining your colour)\r\nTop Colourist Josh Wood shares tips to covering greys at home \r\nIf its been one month since you saw your colourist... conceal roots \r\nIts not long since you had your colour done, so you can stick with touch-u… [+1708 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Sirin Kale", "title": "How coronavirus helped TikTok find its voice - The Guardian", "description": "The video-sharing app’s blend of memes, jokes and skits have been a surprise lockdown hit – but teen users are worried it will lose its cool", "url": "https://www.theguardian.com/technology/2020/apr/26/how-coronavirus-helped-tiktok-find-its-voice", "urlToImage": null, "publishedAt": "2020-04-26T07:00:00Z", "content": null}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Zak Doffman", "title": "Huawei Surprises Millions Of Users With Stunning Google Alternative - Forbes", "description": "Good news for Huawei users—not good news for Google.", "url": "https://www.forbes.com/sites/zakdoffman/2020/04/26/huawei-surprises-millions-of-users-with-stunning-google-alternative/", "urlToImage": null, "publishedAt": "2020-04-26T06:19:25Z", "content": "Sergei Karpukhin/TASS\r\nThe Google stakes for Huawei have never been higher. The company is clear that 2020 will be its toughest year yet. Its own New Years message described it as a battle for survival, and its first-quarter growth saw growth of just 1.4% com… [+4636 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Dion Dassanayake", "title": "Google’s latest Android update might stop you using your smartphone - Express.co.uk", "description": "ANDROID fans have just received a new update from Google which might actually help them to stop using their phones when they head to bed.", "url": "https://www.express.co.uk/life-style/science-technology/1273599/Google-latest-Android-update-stop-you-using-smartphone", "urlToImage": null, "publishedAt": "2020-04-26T06:01:00Z", "content": "Android users have seen Google push out a new update that brings with it a timely and helpful feature. Android is one of the most used pieces of software in the world, with the Google mobile OS installed on over 2.5billion devices. Such a huge userbase means … [+1666 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Dion Dassanayake", "title": "Time to ditch WhatsApp? Rival chat app gets vital feature fans have been waiting for - Express", "description": "WHATSAPP fans have been given a big reason to crossover after a chat app rival got a major feature first.", "url": "https://www.express.co.uk/life-style/science-technology/1273605/WhatsApp-rival-vital-chat-app-feature", "urlToImage": null, "publishedAt": "2020-04-26T05:02:24Z", "content": "The Viber self destructing message feature, which was previously only available in secret chats, can now be used in all one-on-one conversations.\r\nThe new Viber feature lets users set a timer ranging from a few seconds to a few days until the message gets del… [+452 chars]"}, {"source": {"id": null, "name": "Pistonheads.com"}, "author": "Matt Bird", "title": "BMW 340i (F30) manual | Spotted - Pistonheads.com", "description": "Craving the six-cylinder, manual drivetrain modest BMW saloons no longer get? Here's just the thing...", "url": "https://www.pistonheads.com/news/general/bmw-340i-f30-manual--spotted/42295", "urlToImage": null, "publishedAt": "2020-04-26T05:01:31Z", "content": "As a car buying nation, we British tend to be quite overt in our spec choices. Even with the smallest engines, we tend to plump for the big wheels, sportier trims and fancier options. Look at how popular the M Sport, S Line, AMG Line and R-Design models are o… [+3525 chars]"}, {"source": {"id": null, "name": "Autocar.co.uk"}, "author": null, "title": "Bringing up the rear: Top 10 rear-wheel steering cars - Autocar", "description": "Rear-wheel steering systems are once again in the spotlight, but the idea isn’t new. We pick 10 pioneers of the corner-taming technology", "url": "https://www.autocar.co.uk/car-news/features/bringing-rear-top-10-rear-wheel-steering-cars", "urlToImage": null, "publishedAt": "2020-04-26T05:00:00Z", "content": "It shouldnt come as a great surprise that one of the most hotly debated automotive chassis technologies originated in Japan, a nation whose residents appear to be born with a fascination for high-tech gadgets and gizmos.\r\nActive rear-wheel steering was introd… [+1138 chars]"}, {"source": {"id": null, "name": "Whatculture.com"}, "author": "James Weeds", "title": "WWE 2K New Video Game - What Can We Expect & How WWE Games Can Recover - WhatCulture", "description": "Who else jumped for joy at the recent confirmation of 2K21’s cancellation?", "url": "https://whatculture.com/gaming/wwe-2k-new-video-game-what-can-we-expect-how-wwe-games-can-recover", "urlToImage": null, "publishedAt": "2020-04-26T03:58:20Z", "content": "2K Games\r\nConfirming the cancellation of this years instalment in the WWE 2K series, 2K games are set to share details on the future of the franchise this Monday with the possible unveil of an alternative wrestling game.\r\nAfter a dreadful launch of WWE 2K20, … [+1149 chars]"}, {"source": {"id": null, "name": "Twinfinite.net"}, "author": "Zhiqing Wan", "title": "Valorant's Competitive Mode Explained, Ranking System and Lack of Decay Detailed - Twinfinite", "description": "Riot Games has just released some new details about the competitive mode for Valorant and how it will work in the game itself.", "url": "https://twinfinite.net/2020/04/valorants-competitive-mode-explained-ranking-system-and-lack-of-decay-detailed/", "urlToImage": null, "publishedAt": "2020-04-26T03:06:48Z", "content": "Developed by Riot Games, Valorant is the newest and hottest competitive shooter game around. After an extensive beta period with just casual matches, Riot is finally ready to share some details about the competitive mode and explain exactly how it’ll work.\r\nT… [+1655 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Desire Athow", "title": "This 4TB PCIe SSD can make your Windows laptop feel more like a MacBook Pro - TechRadar", "description": "Assuming you have a compatible laptop, that is", "url": "https://www.techradar.com/news/this-4tb-pcie-ssd-can-make-your-windows-laptop-feel-more-like-a-macbook-pro", "urlToImage": null, "publishedAt": "2020-04-26T03:00:00Z", "content": "The Apple MacBook Pro 16 still holds bragging rights when it comes to the maximum storage capacity available in a traditional portable laptop. \r\nApple uses a proprietary approach, plugging memory chips directly into the motherboard to reach a whopping 8TB of … [+1494 chars]"}, {"source": {"id": null, "name": "Nintendolife.com"}, "author": "Nintendo Life", "title": "Ty The Tasmanian Tiger 5 Could Happen, But Would Require \"A Much Bigger Budget\" - Nintendo Life", "description": "And development team", "url": "http://www.nintendolife.com/news/2020/04/ty_the_tasmanian_tiger_5_could_happen_but_would_require_a_much_bigger_budget", "urlToImage": null, "publishedAt": "2020-04-26T02:00:00Z", "content": "As we already know, Krome Studios would like to portTy The Tasmanian Tiger2 and 3 to the Nintendo Switch provided the original sells enough, but what are the chances of a brand new entry in the Aussie-made 3D platformer series happening?\r\nAccording to the cre… [+1075 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "GameCentral", "title": "Square Enix are going to regret ever starting Final Fantasy 7 Remake - Metro.co.uk", "description": "A reader offers a spoiler-filled exploration of Final Fantasy 7 Remake’s ending and why he thinks it bodes poorly for future sequels.", "url": "https://metro.co.uk/2020/04/26/square-enix-going-regret-ever-starting-final-fantasy-7-remake-readers-feature-12607826/", "urlToImage": null, "publishedAt": "2020-04-26T00:29:32Z", "content": "Final Fantasy 7 Remake no end in sight (pic: Square Enix)\r\nA reader offers a spoiler-filled exploration of Final Fantasy 7 Remakes ending and why he thinks it bodes poorly for future sequels.\r\nBy now I imagine most people that have an interest in Final Fantas… [+4353 chars]"}, {"source": {"id": null, "name": "Teneightymagazine.com"}, "author": null, "title": "MrBeast Rock Paper Scissors Livestream Hacked After Tfue Leaked Room Code – TenEighty — Internet culture in focus - TenEighty", "description": null, "url": "https://teneightymagazine.com/2020/04/26/mrbeast-rock-paper-scissors-livestream-hacked-after-tfue-leaked-room-code/", "urlToImage": null, "publishedAt": "2020-04-25T23:19:16Z", "content": "Jimmy ‘MrBeast’ Donaldson, was forced to temporarily pause the rock, paper, scissors tournament featuring 32 creators after the platform being used to host creators was leaked by Turner ‘Tfue’ Tenney.\r\n“I’m so sorry”, Turner said after accidentally leaking th… [+1152 chars]"}, {"source": {"id": null, "name": "Thetimes.co.uk"}, "author": "Madeleine Spence and Shanti Das", "title": "Coronavirus: bootleg beauticians brush off rules to tackle haircare crisis - The Times", "description": "In a new age of prohibition, the bootleggers have turned to haircare. A largely clandestine industry of hairdressers, stylists and colourists is testing the limits of the coronavirus lockdown in ways", "url": "https://www.thetimes.co.uk/article/coronavirus-bootleg-beauticians-brush-off-rules-to-tackle-haircare-crisis-7pgfg86wn", "urlToImage": null, "publishedAt": "2020-04-25T23:01:00Z", "content": "In a new age of prohibition, the bootleggers have turned to haircare. A largely clandestine industry of hairdressers, stylists and colourists is testing the limits of the coronavirus lockdown in ways that are stretching the governments definitions of essentia… [+503 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Debbie White", "title": "China now ‘trying to steal US research’ on coronavirus even after its role in unleashing the pandemic - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11480928/china-steal-us-research-coronavirus-pandemic/", "urlToImage": null, "publishedAt": "2020-04-25T20:00:25Z", "content": "CHINA has been accused of trying to steal coronavirus research from US labs, hospitals and pharmaceutical firms, an investigation reveals.\r\nAnd it appears the regimes game plan is to beat the rest of the world in producing the first vaccine against the bug - … [+7115 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Fallout 76: Wastelanders Review - IGN", "description": "Fallout 76: Wastelanders reviewed by David Jagneaux on PlayStation 4 Pro. Also available on PC and Xbox One. \"With the Wastelanders update, Fallout 76 has ta...", "url": "https://www.youtube.com/watch?v=U-uDLErALu0", "urlToImage": null, "publishedAt": "2020-04-25T19:51:32Z", "content": "Fallout 76: Wastelanders reviewed by David Jagneaux on PlayStation 4 Pro. Also available on PC and Xbox One.\r\n\"With the Wastelanders update, Fallout 76 has taken a solid step in the right direction after its dire launch. New human NPCs bring a healthy dose of… [+633 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "", "title": "Former Apple designer drops Watch trivia on its fifth anniversary - Engadget", "description": "Imran Chaudhri, Apple’s design lead for hardware from 1995 to 2016, dropped some details about Apple Watch’s history on its fifth anniversary.  While Chaudhri is no longer with the tech giant, he shared a photo of the Watch team on launch day, as well as a re…", "url": "https://www.engadget.com/former-apple-designer-drops-watch-trivia-on-its-fifth-anniversary-144849444.html", "urlToImage": null, "publishedAt": "2020-04-25T18:39:26Z", "content": "Imran Chaudhri, Apple’s design lead for hardware from 1995 to 2016, dropped some details about Apple Watch’s history on its fifth anniversary. While Chaudhri is no longer with the tech giant, he shared a photo of the Watch team on launch day, as well as a rep… [+906 chars]"}, {"source": {"id": null, "name": "Notebookcheck.net"}, "author": "Deirdre O Donnell", "title": "A new leak hints at the launch of a 2020 Samsung Galaxy Watch - Notebookcheck.net", "description": "Samsung has reportedly had a new product certified with the MIIT regulator in China. Based on its model number, it is likely to be a full-screened wearable. Therefore, a successor for the Galaxy Watch Active 2 may be in the offing.", "url": "https://www.notebookcheck.net/A-new-leak-hints-at-the-launch-of-a-2020-Samsung-Galaxy-Watch.462930.0.html", "urlToImage": null, "publishedAt": "2020-04-25T18:13:26Z", "content": "Samsung has allegedly certified a novel device with the MIIT. In fact, there are 2 model numbers in evidence in the documentation in question (SM-R840 and R850). However, they are so similar that it is likely they are 2 variants of the same product, perhaps w… [+780 chars]"}, {"source": {"id": null, "name": "Nintendolife.com"}, "author": "Nintendo Life", "title": "The Pokémon Company Apologises For Featuring Dewgong In The Fourth Episode Of Twilight Wings - Nintendo Life", "description": "As it's not available in Sword and Shield", "url": "http://www.nintendolife.com/news/2020/04/the_pokemon_company_apologises_for_featuring_dewgong_in_the_fourth_episode_of_twilight_wings", "urlToImage": null, "publishedAt": "2020-04-25T17:30:00Z", "content": "@KayFiOS Agreed. I've been playing since Red, completed the Red Dex and the National Dex in Pokemon X/Y. The series as a whole has steadily stagnated over the years, with brief moments of improvement only acting as a band-aid for the lack of ambition and aiml… [+5140 chars]"}, {"source": {"id": null, "name": "Entertainmentdaily.co.uk"}, "author": "Entertainment Daily", "title": "Gogglebox's Pete: Prince William and Mark Wright 'punching above their weight' - Entertainment Daily", "description": "Viewers were amused by Pete's observation", "url": "https://www.entertainmentdaily.co.uk/tv/gogglebox-pete-prince-william-and-mark-wright-punching-above-their-weight/", "urlToImage": null, "publishedAt": "2020-04-25T16:42:55Z", "content": "Gogglebox viewers saw the funny side as Pete Sandiford compared the Duke and Duchess of Cambridge to Michelle Keegan and Mark Wright claiming both men were \"punching above their weight\".\r\nThe couch potato critic shared his thoughts as he watched a clip of the… [+2157 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Matthew Forde", "title": "Sony slip-ups: ahead of the PS5, we look back at the PlayStation tech that just didn't work - TechRadar", "description": "They can't all be winners", "url": "https://www.techradar.com/news/sony-slip-ups-ahead-of-the-ps5-we-look-back-at-the-playstation-tech-that-just-didnt-work", "urlToImage": null, "publishedAt": "2020-04-25T16:00:00Z", "content": "As we motor towards the next generation of consoles, Sony currently holds all of the cards and will be looking to build upon the monumental success it found during the current generation. Its sometimes easy to forget just how well the PlayStation 4 has sold, … [+6393 chars]"}, {"source": {"id": null, "name": "Eurogamer.net"}, "author": "Wesley Yin-Poole", "title": "This stunning Minecraft city was created by a team of professional builders - Eurogamer.net", "description": null, "url": "https://www.eurogamer.net/articles/2020-04-25-this-stunning-minecraft-city-was-created-by-a-team-of-professional-builders", "urlToImage": null, "publishedAt": "2020-04-25T15:31:00Z", "content": "The Minecraft community is known for its incredible creations - but this stunning city was built by the pros.\r\nCity of Orario is an incredibly detailed 1500x1500 recreation of The Labyrinth City of Orario from the DanMachi anime. Its centrepiece is a massive … [+1151 chars]"}, {"source": {"id": null, "name": "Eurogamer.net"}, "author": "Wesley Yin-Poole", "title": "Video game cheating is back in the headlines - Eurogamer.net", "description": null, "url": "https://www.eurogamer.net/articles/2020-04-25-video-game-cheating-is-back-in-the-headlines", "urlToImage": null, "publishedAt": "2020-04-25T14:04:00Z", "content": "Video game cheating has been around for as long as video games. But the eternal issue has once again hit the headlines - and developers are struggling to cope.\r\nCall of Duty: Modern Warfare, Destiny 2, PlayerUnknown's Battlegrounds and Valorant have all been … [+7112 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Tom Bedford", "title": "Samsung Galaxy Tab S7: what we want to see - TechRadar", "description": "Samsung's new top-end tablet", "url": "https://www.techradar.com/news/samsung-galaxy-tab-s7", "urlToImage": null, "publishedAt": "2020-04-25T14:00:00Z", "content": "The Samsung Galaxy Tab S7 is expected to be released by the end of 2020, giving Samsung another shot at toppling Apple's reign as the most popular tablet manufacturer.\r\nSucceeding the Galaxy Tab S6 from 2019, the Samsung Galaxy Tab S7 will be Samsung's top-en… [+7671 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nLizzie Roberts", "title": "Contact tracing: how has it worked for other countries, and could it really help ease UK lockdown? - The Telegraph", "description": "From teams of 'corona detectives' to Army cadets making thousands of calls a day, countries are tracking the spread of Covid-19", "url": "https://www.telegraph.co.uk/news/2020/04/25/what-contact-tracing-how-work-countries-uk-lockdown/", "urlToImage": null, "publishedAt": "2020-04-25T13:41:28Z", "content": "Countries around the world are rushing to launch contact tracing apps to identify who an infected person has had contact with, as part of efforts to slow the spread of the coronavirus. \r\nThe UK Government has announced the infrastructure was being put in plac… [+1754 chars]"}, {"source": {"id": null, "name": "Eurogamer.net"}, "author": "Wesley Yin-Poole", "title": "The curious case of Call of Duty: Warzone crossplay - Eurogamer.net", "description": null, "url": "https://www.eurogamer.net/articles/2020-04-25-the-curious-case-of-call-of-duty-warzone-crossplay", "urlToImage": null, "publishedAt": "2020-04-25T12:52:00Z", "content": "Last week, Eurogamer revealed how Call of Duty players on console were disabling crossplay in order to escape cheaters on PC. But it turns out not all console players have this option.\r\nMuch was made of Call of Duty's new crossplay feature when it was confirm… [+4114 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Simon Parkin", "title": "Streets of Rage 4 review – the return of the beat 'em up - The Guardian", "description": "This lovingly created sequel offers all the action and fun of a 90s arcade game", "url": "https://www.theguardian.com/games/2020/apr/25/streets-of-rage-4-review-the-return-of-the-beat-em-up", "urlToImage": null, "publishedAt": "2020-04-25T12:04:06Z", "content": "In the Netflix animated series Hi Score Girl, a romantic comedy set in early-90s Japan, Haruo Yaguchi, a low-achieving high-school loner is whiling away his time in the local video game arcades when he meets Akira Ono, a popular wunderkind from a wealthy fami… [+4209 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Jeff Parsons", "title": "Apple Magic Keyboard review: the ultimate iPad Pro accessory - Metro.co.uk", "description": "This iPad Pro peripheral finally bridges the gap between tablet and laptop", "url": "https://metro.co.uk/2020/04/25/apple-magic-keyboard-review-crucial-ipad-pro-accessory-12588777/", "urlToImage": null, "publishedAt": "2020-04-25T09:53:53Z", "content": "The Magic Keyboard turns the iPad Pro into a floating display (Apple)\r\nFor the last few iPad generations Apple has been pushing to turn the tablet into more of a productivity device akin to your laptop.\r\nHardware additions like the Apple Pencil and Smart Keyb… [+5263 chars]"}, {"source": {"id": null, "name": "Fossbytes.com"}, "author": "Sarvottam Kumar", "title": "After Ubuntu 20.04 Release, Ubuntu 20.10 Is Codenamed 'Groovy Gorilla' - Fossbytes", "description": "A day after Ubuntu 20.04 release, the Ubuntu development team is gearing up to make the next Ubuntu 20.10 groovier with Gorilla. 'Groovy Gorilla' is now the codename chosen for Ubuntu 20.10 which will release on October 22, 2020.", "url": "https://fossbytes.com/ubuntu-20-10-groovy-gorilla-codename/", "urlToImage": null, "publishedAt": "2020-04-25T09:35:00Z", "content": "A day after the Ubuntu 20.04 release, the Ubuntu development team is gearing up to make the next Ubuntu 20.10 groovier with “Gorilla.”\r\nFollowing the traditional method of codenaming each version, ‘Groovy Gorilla’ is now the codename for the Ubuntu 20.10. Wel… [+1750 chars]"}, {"source": {"id": null, "name": "Trueachievements.com"}, "author": "Heidi Nicholas", "title": "Sci-fi adventure Deliver Us The Moon joins Xbox Game Pass and Game Pass for PC today - TrueAchievements", "description": "Deliver Us The Moon is a sci-fi action adventure title which draws inspiration from movies such as Interstellar, and which joins the Xbox Game Pass and Xbox Game Pass for PC services today as a day one addition.", "url": "https://www.trueachievements.com/n41593/deliver-us-the-moon", "urlToImage": null, "publishedAt": "2020-04-25T07:59:53Z", "content": "The Xbox team has been busy lately: just yesterday, they surprise-dropped the announcement that Red Dead Redemption 2 will join Xbox Game Pass in May. Before that, they announced new titles for Xbox Game Pass, along with several new titles for Xbox Game Pass … [+1728 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Aaron Brown", "title": "Google Chrome rival brings a feature social media fans will adore in latest update - Express", "description": "OPERA has rolled out support for a handy new feature that should appeal to social media obsessives. Here's everything you need to know.", "url": "https://www.express.co.uk/life-style/science-technology/1273390/Google-Chrome-Rival-Opera-Social-Media-Instagram-Fans-Update-New-Feature", "urlToImage": null, "publishedAt": "2020-04-25T07:03:29Z", "content": null}, {"source": {"id": null, "name": "Digitalcameraworld.com"}, "author": "Louise Carey", "title": "iPhone 12: What we know so far about September 2020 iPhone release - Digital Camera World", "description": "The iPhone 12 is set to be announced in September, but what are we expecting from the latest iPhone generation?", "url": "https://www.digitalcameraworld.com/news/iphone-12-what-we-know-so-far-about-september-2020-iphone-release", "urlToImage": null, "publishedAt": "2020-04-25T07:02:00Z", "content": "With only a matter of months to go until Apple's traditional September iPhone launch event, the internet is already abuzz with rumors and speculation on what the iPhone 12 release is going to look like. With the 2019 iPhone 11 release leaving some feeling und… [+6096 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Dion Dassanayake", "title": "Windows 10 update could DELETE your files and bricks PCs in fresh blow to Microsoft users - Express", "description": "WINDOWS 10 users have been dealt yet another download blow, with a new Microsoft update capable of deleting user files and bricking your PC.", "url": "https://www.express.co.uk/life-style/science-technology/1273596/Windows-10-update-deletes-files-bricks-PCs-Microsoft", "urlToImage": null, "publishedAt": "2020-04-25T06:06:53Z", "content": "And another posted: \"My system automatically updated on the 19th of April. I lost some important word files of my university. And a folder.\r\n\"I have looked on the temporary folders and I have tried to uninstall the update but they do not appear\".\r\nWindows Lat… [+612 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Aaron Brown", "title": "Netflix solves a huge headache for Android users, but iPhone loses out on awesome update - Express", "description": "NETFLIX has solved one of the biggest pains when watching shows or movies on your Android smartphone or tablet. But despite many iPhone and iPad owners suffering the same headache ...there's no sign of a fix. Here's everything you need to know about the new f…", "url": "https://www.express.co.uk/life-style/science-technology/1273343/Netflix-Update-Solve-Headache-Android-No-iPhone-Users", "urlToImage": null, "publishedAt": "2020-04-25T06:06:34Z", "content": "Of course, it's still possible that you could drop your phone and somehow accidentally manage to hit the unlock button two times in quick succession, followed by the pause button – but that's much less likely than the single-tap needed to wreak havoc beforeha… [+613 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "", "title": "Should I buy a Nintendo Switch for my kids in lockdown? - The Guardian", "description": "Our two 10-year-olds are asking for new games – but I’m wondering if there’s a less costly alternative", "url": "https://www.theguardian.com/money/2020/apr/25/buy-nintendo-switch-kids-lockdown-games", "urlToImage": null, "publishedAt": "2020-04-25T06:04:02Z", "content": "Every week a Guardian Money reader submits a question, and its up to you to help him or her out a selection of the best answers will appear in next Saturdays paper.\r\nFive weeks into lockdown and our two 10-year-olds are badgering us to buy some new electronic… [+301 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "David Snelling", "title": "Samsung reveals another blockbuster 4K TV update for your television - Express", "description": "SAMSUNG is back with even more updates for your TV and here's what's now available on your 4K television.", "url": "https://www.express.co.uk/life-style/science-technology/1273517/Samsung-4K-TV-update-Apple-Music-app", "urlToImage": null, "publishedAt": "2020-04-25T06:01:07Z", "content": "“Our goal has always been to deliver the best entertainment experiences to consumers – and as people spend more time at home, we are more committed to that mission than ever,” said Salek Brodsky, Vice President of Strategic Partnerships and Business Developme… [+665 chars]"}, {"source": {"id": null, "name": "Pistonheads.com"}, "author": "Mike Duff", "title": "Rolls-Royce Silver Seraph | The Brave Pill - Pistonheads.com", "description": "In terms of miles covered, could this be the highest Roller?", "url": "https://www.pistonheads.com/news/general/rolls-royce-silver-seraph--the-brave-pill/42296", "urlToImage": null, "publishedAt": "2020-04-25T05:03:51Z", "content": "There is no shortage of Rolls-Royces with low mileages out there, but that doesn't mean they are better prospects than the ones that have lived life a little. And here's one that has lived life a lot - a Silver Seraph that has managed to rack up the impressiv… [+7030 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Desire Athow", "title": "This AMD Ryzen notebook deal is probably the best we've ever seen - TechRadar", "description": "Lenovo and AMD provide a glimpse into the future", "url": "https://www.techradar.com/news/this-amd-ryzen-laptop-is-the-probably-the-best-notebook-deal-ever", "urlToImage": null, "publishedAt": "2020-04-25T03:00:00Z", "content": "We reviewers are used to obsessing over incremental technology changes, but every now and then a supernova appears on our radar - something that can single handedly change the status quo.\r\nThe AMD Ryzen 4000 family is one such supernova and promises to bring … [+1829 chars]"}, {"source": {"id": null, "name": "Futuregamereleases.com"}, "author": "Dejan Kacurov", "title": "Pokemon Go Free Promo Code That you Can Claim Until April 26 - Future Game Releases", "description": "Trainers, Niantic and Pokemon Go are generous again and they've shared a new free promo code, which can be used to claim free items. Niantic shared the 13-characters code on their official Twitter acc", "url": "https://www.futuregamereleases.com/2020/04/pokemon-go-free-promo-code-that-you-can-claim-until-april-26/", "urlToImage": null, "publishedAt": "2020-04-25T01:02:29Z", "content": "Trainers, Niantic and Pokemon Go are generous again and they’ve shared a new free promo code, which can be used to claim free items.\r\nNiantic shared the 13-characters code on their official Twitter account. This code can be claimed online or in-app (android u… [+419 chars]"}, {"source": {"id": null, "name": "Androidpolice.com"}, "author": null, "title": "OnePlus reportedly issues massive layoffs in largest European markets - Android Police", "description": "OnePlus has reportedly made severe staffing cuts in its European operations. While the tech brand has experienced massive growth in other markets over the", "url": "https://www.androidpolice.com/2020/04/25/oneplus-reportedly-issued-massive-layoffs-in-largest-european-markets/", "urlToImage": null, "publishedAt": "2020-04-24T21:06:06Z", "content": "This story was originally published 2020/04/24 1:52pm PDTon Apr 24, 2020 and last updated 2020/04/25 12:38pm PDTApr 25, 2020. \r\nOnePlus has reportedly made severe staffing cuts in its European operations. While the tech brand has experienced massive growth in… [+3233 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Jonathan Chadwick For Mailonline", "title": "Colour paint technology cools buildings by reflecting the sun - Daily Mail", "description": "New colour paint designed to cool buildings by reflecting the sun could become an eco-friendly alternative to air conditioners, US materials scientists report.", "url": "https://www.dailymail.co.uk/sciencetech/article-8254793/Colour-paint-technology-cools-buildings-reflecting-sun.html", "urlToImage": null, "publishedAt": "2020-04-24T20:46:33Z", "content": "A new form of doubled-layered coloured paint designed to cool buildings by reflecting the sun could become an eco-friendly alternative to air conditioners.\r\nUS materials scientists say their array of coloured multi-layered paints can dramatically cool sun-bla… [+4159 chars]"}, {"source": {"id": null, "name": "Digitalspy.com"}, "author": "Chris Edwards", "title": "Nintendo addresses major security breach - digitalspy.com", "description": "There have been reported incidents of unauthorised access to user accounts.", "url": "https://www.digitalspy.com/tech/a32270793/nintendo-security-breach/", "urlToImage": null, "publishedAt": "2020-04-24T20:38:00Z", "content": "Nintendo has addressed a major security breach as it encourages users to take new security steps. \r\nIn a statement on its official website, the gaming company said it is continuing to investigate recent incidents of unauthorised access to Nintendo Accounts, b… [+1827 chars]"}, {"source": {"id": null, "name": "Pushsquare.com"}, "author": "Push Square", "title": "Talking Point: What Free May 2020 PS Plus Games Do You Want? - Push Square", "description": "When will May 2020's PlayStation Plus lineup be announced?", "url": "http://www.pushsquare.com/news/2020/04/talking_point_what_free_may_2020_ps_plus_games_do_you_want", "urlToImage": null, "publishedAt": "2020-04-24T18:00:00Z", "content": "Whats the May 2020 PlayStation Plus lineup? And when will the May 2020 PS Plus games be announced? Sony's service has quietly been on a very good run, with Uncharted 4: A Thief's End and DiRT Rally 2.0 both very good additions in April. The Japanese giant has… [+1798 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Carly Page", "title": "The Dell XPS 15 2020 may have been redesigned to take on the MacBook Pro - TechRadar", "description": "Incoming model will boast smaller bezels and upward-firing speakers", "url": "https://www.techradar.com/news/the-dell-xps-15-2020-may-have-been-redesigned-to-take-on-the-macbook-pro", "urlToImage": null, "publishedAt": "2020-04-24T17:31:00Z", "content": "Dell looks poised to release an all-new version of its XPS 15 laptop that will take a number of design clues from the recently-revamped Dell XPS 13\r\n.\r\nThats according to leaked images posted on the Korea Energy Agency Efficiency Standardization Certification… [+2119 chars]"}, {"source": {"id": null, "name": "Inews.co.uk"}, "author": "Alex Nelson", "title": "Travis Scott Fortnite event: what time live concerts are, how to get the new skin and Astronomical challenges explained - inews", "description": "Astronomical is 'a one of a kind musical journey featuring Travis Scott'", "url": "https://inews.co.uk/culture/gaming/travis-scott-fortnite-event-concert-live-when-time-uk-new-skin-astronomical-challenges-update-explained-2544889", "urlToImage": null, "publishedAt": "2020-04-24T17:11:27Z", "content": "Astronomical is 'a one of a kind musical journey featuring Travis Scott'\r\nSaturday, 25th April 2020, 8:48 am\r\nUpdated Saturday, 25th April 2020, 1:43 pm\r\nThe latest crossover event to come to Fortnite has been revealed, and includes another huge live concert … [+3117 chars]"}, {"source": {"id": null, "name": "Gamasutra.com"}, "author": "Bryant Francis", "title": "Obituary: Hellblade mental health consultant Jenny Esson - Gamasutra", "description": "Jenny Esson, one of the mental health professionals who contributed to the development of  Hellblade: Senua's Sacrifice  has passed away at age 45 from COVID-19.", "url": "https://www.gamasutra.com/view/news/361807/Obituary_Hellblade_mental_health_consultant_Jenny_Esson.php", "urlToImage": null, "publishedAt": "2020-04-24T17:10:39Z", "content": "Jenny Esson, one of the medical professionals who consulted on the development of Ninja Theory's Hellblade: Senua's Sacrifice, has passed away from COVID-19 at age 45. The studio noted her passing via Twitter.\r\nEsson worked for Cambridgeshire and Peterborough… [+698 chars]"}, {"source": {"id": null, "name": "Eurogamer.net"}, "author": "Will Judd", "title": "Best graphics card 2020: every major Nvidia and AMD GPU tested - Eurogamer.net", "description": "After testing every major Nvidia and AMD graphics card on the market, we present our top recommendations for 1080p, 1440p and 4K PC builds.", "url": "https://www.eurogamer.net/articles/digitalfoundry-best-graphics-card-every-amd-nvidia-tested-7001", "urlToImage": null, "publishedAt": "2020-04-24T16:31:00Z", "content": "The DF guide to the fastest and best value video cards on the market.\r\nReplacing your graphics card is the number one upgrade you can make for your PC and the most profound in terms of improving gaming performance, so it makes sense to spend some time researc… [+17794 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Adam Marshall", "title": "Samsung smartphone sale: save hundreds on S20, Z Flip, Note 10, S10 Lite and more - TechRadar", "description": "Up to £195 off - but this flash sale ends on Monday", "url": "https://www.techradar.com/uk/news/samsung-smartphone-sale-save-hundreds-on-s20-z-flip-note-10-s10-lite-and-more", "urlToImage": null, "publishedAt": "2020-04-24T16:30:00Z", "content": "If you've been sat looking at your battered old smartphone and thinking it's high time for an upgrade, then your ticket may just have come in. All Samsung phone deals have been slashed by 15% this weekend only - with the Samsung S20, Note 10 and even the Gala… [+4136 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nJames Gurney", "title": "Seven of the best new men’s timepieces from Watches & Wonders - Telegraph.co.uk", "description": "On 25 April, a new online platform will unveil a host of watch models, which will be available in 2020", "url": "https://www.telegraph.co.uk/luxury/watches/seven-best-new-mens-timepieces-watches-wonders/", "urlToImage": null, "publishedAt": "2020-04-24T16:20:00Z", "content": "A certain less is more applies to many watches being launched, as brands opt to play safe for the most part but as that quite often means better, its almost a relief. Take Jaeger-LeCoultres Master Control Calendar (or, somewhat more enticingly, Quantième à Da… [+425 chars]"}, {"source": {"id": null, "name": "Whathifi.com"}, "author": "Becky Scarrott", "title": "Save £170 on award-winning Astell & Kern SR15 hi-res music player - What Hi-Fi?", "description": "The excellent Astell & Kern A&norma SR15 is now on sale", "url": "https://www.whathifi.com/news/award-winning-astell-and-kern-hi-res-music-player-slashed-in-price-at-amazon", "urlToImage": null, "publishedAt": "2020-04-24T15:09:00Z", "content": "It's a familiar story: a shiny new kid appears on the block and the old guard receives a heavy discount. However, while a successor to the Astell &amp; Kern A&amp;norma SR15 has been announced, in the form of the A&amp;norma SR25, that revered old guard, the … [+1483 chars]"}]}