{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": "techradar", "name": "TechRadar"}, "author": "Darren Allan", "title": "AMD Cezanne leak hints at next-gen laptop CPUs with RDNA 2 graphics that go for Intel’s jugular - TechRadar Singapore", "description": "Zen 3 APUs with RDNA 2-powered integrated graphics, rumor has it", "url": "https://www.techradar.com/news/amd-cezanne-leak-hints-at-next-gen-laptop-cpus-with-rdna-2-graphics-that-go-for-intels-jugular", "urlToImage": null, "publishedAt": "2020-04-25T22:50:00Z", "content": "AMD Ryzen 4000 (codenamed Renoir) mobile chips are still very much fresh on the scene and making a huge impact in terms of competitiveness in the laptop world but weve already seen a leak for next-gen APUs apparently codenamed Cezanne (a name which has been d… [+2934 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Debbie White", "title": "China now ‘trying to steal US research’ on coronavirus even after its role in unleashing the pandemic - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11480928/china-steal-us-research-coronavirus-pandemic/", "urlToImage": null, "publishedAt": "2020-04-25T20:00:25Z", "content": "CHINA has been accused of trying to steal coronavirus research from US labs, hospitals and pharmaceutical firms, an investigation reveals.\r\nAnd it appears the regimes game plan is to beat the rest of the world in producing the first vaccine against the bug - … [+7115 chars]"}, {"source": {"id": null, "name": "Androidpolice.com"}, "author": null, "title": "OnePlus reportedly issues layoffs in largest European markets (Update: Official statement) - Android Police", "description": "OnePlus has reportedly made severe staffing cuts in its European operations. While the tech brand has experienced massive growth in other markets over the", "url": "https://www.androidpolice.com/2020/04/25/oneplus-reportedly-issued-massive-layoffs-in-largest-european-markets/", "urlToImage": null, "publishedAt": "2020-04-25T19:53:55Z", "content": "This story was originally published 2020/04/24 1:52pm PDTon Apr 24, 2020 and last updated 2020/04/25 12:38pm PDTApr 25, 2020. \r\nOnePlus has reportedly made severe staffing cuts in its European operations. While the tech brand has experienced massive growth in… [+3233 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Fallout 76: Wastelanders Review - IGN", "description": "Fallout 76: Wastelanders reviewed by David Jagneaux on PlayStation 4 Pro. Also available on PC and Xbox One. \"With the Wastelanders update, Fallout 76 has ta...", "url": "https://www.youtube.com/watch?v=U-uDLErALu0", "urlToImage": null, "publishedAt": "2020-04-25T19:51:32Z", "content": "Fallout 76: Wastelanders reviewed by David Jagneaux on PlayStation 4 Pro. Also available on PC and Xbox One.\r\n\"With the Wastelanders update, Fallout 76 has taken a solid step in the right direction after its dire launch. New human NPCs bring a healthy dose of… [+633 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "", "title": "Former Apple designer drops Watch trivia on its fifth anniversary - Engadget", "description": "Imran Chaudhri, Apple’s design lead for hardware from 1995 to 2016, dropped some details about Apple Watch’s history on its fifth anniversary.  While Chaudhri is no longer with the tech giant, he shared a photo of the Watch team on launch day, as well as a re…", "url": "https://www.engadget.com/former-apple-designer-drops-watch-trivia-on-its-fifth-anniversary-144849444.html", "urlToImage": null, "publishedAt": "2020-04-25T18:39:26Z", "content": "Imran Chaudhri, Apple’s design lead for hardware from 1995 to 2016, dropped some details about Apple Watch’s history on its fifth anniversary. While Chaudhri is no longer with the tech giant, he shared a photo of the Watch team on launch day, as well as a rep… [+906 chars]"}, {"source": {"id": null, "name": "Itv.com"}, "author": null, "title": "Coronavirus lockdown means charities are missing out on millions of pounds of fundraising - ITV News", "description": "Tomorrow London should've been packed with tens of thousands of runners.\n\nBut coronavirus has done more than hamper their hopes of completing the course...\n\nIt's crippling charities.\n\nLast year the London Marathon alone raised more than £60 million.", "url": "https://www.itv.com/news/2020-04-25/coronavirus-lockdown-means-charities-are-missing-out-on-millions-of-pounds-of-fundraising/", "urlToImage": null, "publishedAt": "2020-04-25T17:21:00Z", "content": null}, {"source": {"id": "the-next-web", "name": "The Next Web"}, "author": "The Conversation", "title": "Chemical recycling could be the solution to plastic pollution - The Next Web", "description": "The world is drowning in plastic. About 60% of the more than 8,700 million metric tonnes of plastic ever made is no longer in use, instead sat mostly in landfill or released to the ...", "url": "https://thenextweb.com/syndication/2020/04/25/chemical-recycling-could-be-the-solution-to-plastic-pollution/", "urlToImage": null, "publishedAt": "2020-04-25T17:20:31Z", "content": "The world is drowning in plastic. About 60% of the more than 8,700 million metric tonnes of plastic ever made is no longer in use, instead sat mostly in landfill or released to the environment. That equals over 400kg of plastic waste for every one of the 7.6 … [+5031 chars]"}, {"source": {"id": null, "name": "Entertainmentdaily.co.uk"}, "author": "Entertainment Daily", "title": "Gogglebox's Pete: Prince William and Mark Wright 'punching above their weight' - Entertainment Daily", "description": "Viewers were amused by Pete's observation", "url": "https://www.entertainmentdaily.co.uk/tv/gogglebox-pete-prince-william-and-mark-wright-punching-above-their-weight/", "urlToImage": null, "publishedAt": "2020-04-25T16:42:55Z", "content": "Gogglebox viewers saw the funny side as Pete Sandiford compared the Duke and Duchess of Cambridge to Michelle Keegan and Mark Wright claiming both men were \"punching above their weight\".\r\nThe couch potato critic shared his thoughts as he watched a clip of the… [+2157 chars]"}, {"source": {"id": null, "name": "Androidpolice.com"}, "author": "https://www.facebook.com/corbin.davenport.50", "title": "The ultimate guide for installing the Google Play Store on Amazon Fire tablets - Android Police", "description": "Amazon's Fire tablets are incredibly popular, mostly because they're incredibly cheap. However, none of them come with access to the Google Play Store,", "url": "https://www.androidpolice.com/2020/04/25/install-play-store-amazon-fire-tablet/", "urlToImage": null, "publishedAt": "2020-04-25T16:07:19Z", "content": "This story was originally published 2020/03/18 4:41pm PDTon Mar 18, 2020 and last updated 2020/04/25 8:48am PDTApr 25, 2020. \r\nAmazon's Fire tablets are incredibly popular, mostly because they're incredibly cheap. However, none of them come with access to the… [+13115 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Davey Winder", "title": "Working from home? How to stay in touch and stay secure - The Guardian", "description": "Covid-19 has forced millions into the unfamiliar world of the home office, where new security threats loom. Here’s how to protect yourself and colleagues", "url": "https://www.theguardian.com/technology/2020/apr/25/working-from-home-how-to-stay-in-touch-and-stay-secure", "urlToImage": null, "publishedAt": "2020-04-25T16:00:00Z", "content": "Businesses are used to being prepared for a disaster and most will have had a well-rehearsed continuity plan in place in case one struck. But even the best plan couldnt have effectively anticipated the wholesale overnight shift to home working that Covid-19 h… [+7011 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Matthew Forde", "title": "Sony slip-ups: ahead of the PS5, we look back at the PlayStation tech that just didn't work - TechRadar India", "description": "They can't all be winners", "url": "https://www.techradar.com/news/sony-slip-ups-ahead-of-the-ps5-we-look-back-at-the-playstation-tech-that-just-didnt-work", "urlToImage": null, "publishedAt": "2020-04-25T16:00:00Z", "content": "As we motor towards the next generation of consoles, Sony currently holds all of the cards and will be looking to build upon the monumental success it found during the current generation. Its sometimes easy to forget just how well the PlayStation 4 has sold, … [+6393 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "OnePlus 8 Pro vs Samsung Galaxy S20 Plus: Who wins? - India Gone Viral", "description": "The OnePlus 8 Pro and Samsung Galaxy S20 Plus are key smartphones for these two industry players. On the one hand, OnePlus is making a firm play for the flagship market, throwing its best technology i", "url": "https://indiagoneviral.com/technology/2020/04/25/oneplus-8-pro-vs-samsung-galaxy-s20-plus-who-wins/42191/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-25T14:06:28Z", "content": "The OnePlus 8 Pro and Samsung Galaxy S20 Plus are key smartphones for these two industry players. On the one hand, OnePlus is making a firm play for the flagship market, throwing its best technology into its 8 Pro model, with a somewhat controversially higher… [+14740 chars]"}, {"source": {"id": null, "name": "Eurogamer.net"}, "author": "Wesley Yin-Poole", "title": "Video game cheating is back in the headlines - Eurogamer.net", "description": null, "url": "https://www.eurogamer.net/articles/2020-04-25-video-game-cheating-is-back-in-the-headlines", "urlToImage": null, "publishedAt": "2020-04-25T14:04:00Z", "content": "Video game cheating has been around for as long as video games. But the eternal issue has once again hit the headlines - and developers are struggling to cope.\r\nCall of Duty: Modern Warfare, Destiny 2, PlayerUnknown's Battlegrounds and Valorant have all been … [+7112 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Tom Bedford", "title": "Samsung Galaxy Tab S7: what we want to see - TechRadar India", "description": "Samsung's new top-end tablet", "url": "https://www.techradar.com/news/samsung-galaxy-tab-s7", "urlToImage": null, "publishedAt": "2020-04-25T14:00:00Z", "content": "The Samsung Galaxy Tab S7 is expected to be released by the end of 2020, giving Samsung another shot at toppling Apple's reign as the most popular tablet manufacturer.\r\nSucceeding the Galaxy Tab S6 from 2019, the Samsung Galaxy Tab S7 will be Samsung's top-en… [+7671 chars]"}, {"source": {"id": null, "name": "Techspot.com"}, "author": "Isaiah Mayersen", "title": "Nvidia is \"amped\" up for a big reveal on May 14 - TechSpot", "description": "The keynote -- delivered, presumably, to an empty room -- will be led by Nvidia CEO Jensen Huang, pictured above. It will cover the “latest innovations in AI, high-performance computing, data science, autonomous machines, healthcare and graphics.” Every field…", "url": "https://www.techspot.com/news/84984-nvidia-amped-up-big-reveal-may-14.html", "urlToImage": null, "publishedAt": "2020-04-25T13:48:09Z", "content": "Forward-looking: Nvidia will commence the leading keynote of their annual Graphics Technology Conference (GTC) on May 14. A get amped byline suggests the inclusion of the long-rumored Ampere architecture, which will power a new generation of GPUs. \r\nThe keyno… [+1362 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nLizzie Roberts", "title": "Contact tracing: how has it worked for other countries, and could it really help ease UK lockdown? - The Telegraph", "description": "From teams of 'corona detectives' to Army cadets making thousands of calls a day, countries are tracking the spread of Covid-19", "url": "https://www.telegraph.co.uk/news/2020/04/25/what-contact-tracing-how-work-countries-uk-lockdown/", "urlToImage": null, "publishedAt": "2020-04-25T13:41:28Z", "content": "Countries around the world are rushing to launch contact tracing apps to identify who an infected person has had contact with, as part of efforts to slow the spread of the coronavirus. \r\nThe UK Government has announced the infrastructure was being put in plac… [+1754 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Steventon listed railway bridge saved from demolition - BBC News", "description": "The 19th Century bridge was threatened due to the upgrade of the Great Western Mainline.", "url": "https://www.bbc.co.uk/news/uk-england-oxfordshire-52425866", "urlToImage": null, "publishedAt": "2020-04-25T13:34:08Z", "content": "Image copyrightSteve DanielsImage caption\r\n Steventon Bridge is thought to have been built in 1839 by Isambard Kingdom Brunel\r\nA Grade ll listed railway bridge has been saved from demolition after a campaign by villagers.\r\nThe span, at Steventon, Oxfordshire,… [+1395 chars]"}, {"source": {"id": null, "name": "Nintendolife.com"}, "author": "Nintendo Life", "title": "Random: Accurate Portrayal Of Famous Statues Send Animal Crossing Fans Wild - Nintendo Life", "description": "\"i need the animal crossing **** statue\"", "url": "http://www.nintendolife.com/news/2020/04/random_accurate_portrayal_of_famous_statues_send_animal_crossing_fans_wild", "urlToImage": null, "publishedAt": "2020-04-25T13:05:00Z", "content": "The latest update for Animal Crossing: New Horizons has reduced the interest on all savings accounts, nerfed bug spawn rates, and now the Redd's statues appear to be causing a stir on social media.\r\nFamous statues like Michaelangelo's 'David' and the Greek sc… [+2411 chars]"}, {"source": {"id": null, "name": "Eurogamer.net"}, "author": "Wesley Yin-Poole", "title": "The curious case of Call of Duty: Warzone crossplay - Eurogamer.net", "description": null, "url": "https://www.eurogamer.net/articles/2020-04-25-the-curious-case-of-call-of-duty-warzone-crossplay", "urlToImage": null, "publishedAt": "2020-04-25T12:52:00Z", "content": "Last week, Eurogamer revealed how Call of Duty players on console were disabling crossplay in order to escape cheaters on PC. But it turns out not all console players have this option.\r\nMuch was made of Call of Duty's new crossplay feature when it was confirm… [+4114 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Simon Parkin", "title": "Streets of Rage 4 review – the return of the beat 'em up - The Guardian", "description": "This lovingly created sequel offers all the action and fun of a 90s arcade game", "url": "https://www.theguardian.com/games/2020/apr/25/streets-of-rage-4-review-the-return-of-the-beat-em-up", "urlToImage": null, "publishedAt": "2020-04-25T12:04:06Z", "content": "In the Netflix animated series Hi Score Girl, a romantic comedy set in early-90s Japan, Haruo Yaguchi, a low-achieving high-school loner is whiling away his time in the local video game arcades when he meets Akira Ono, a popular wunderkind from a wealthy fami… [+4209 chars]"}, {"source": {"id": null, "name": "Whatculture.com"}, "author": "Chris Littlechild", "title": "10 Ridiculous Excuses For Failed Video Games - WhatCulture", "description": "From Lawbreakers to Duke Nukem Forever, check out these games' feeble excuses for their failures!", "url": "https://whatculture.com/gaming/10-ridiculous-excuses-for-failed-video-games", "urlToImage": null, "publishedAt": "2020-04-25T11:11:46Z", "content": "The video\r\ngame industry can be a harsh mistress. In recent years, developers have been\r\nincreasingly inclined towards remasters and remakes, banking on gamers\r\nnostalgia with heavy-hitters like Final Fantasy VII Remake. Why are they doing\r\nthis? Well, the al… [+1913 chars]"}, {"source": {"id": null, "name": "Mspoweruser.com"}, "author": null, "title": "Bleeding Edge trailer uses discord quotes after universally poor reviews - MSPoweruser - MSPoweruser", "description": "Microsoft has released a new Bleeding Edge trailer to advertise their recently released multiplayer arena game. The Bleeding Edge trailer, which is meant to show the critical success of the title, has one issue: all of the game’s “positive quotes” are from un…", "url": "https://mspoweruser.com/bleeding-edge-trailer-uses-discord-quotes-after-universally-poor-reviews/", "urlToImage": null, "publishedAt": "2020-04-25T11:01:23Z", "content": "Microsoft has released a new Bleeding Edge trailer to advertise their recently released multiplayer arena game.\r\nThe Bleeding Edge trailer, which is meant to show the critical success of the title, has one issue: all of the game’s “positive quotes” are from u… [+1539 chars]"}, {"source": {"id": null, "name": "Nintendolife.com"}, "author": "Nintendo Life", "title": "Community: Tried Super Mario Maker 2's World Maker Yet? Share Your Codes Here - Nintendo Life", "description": "Share and play creations from all over the world", "url": "http://www.nintendolife.com/news/2020/04/community_tried_super_mario_maker_2s_world_maker_yet_share_your_codes_here", "urlToImage": null, "publishedAt": "2020-04-25T11:00:00Z", "content": "As some have mentioned, the biggest failure of this SMM2 update and maybe of SMM2 in general is the terrible menus. It's a tragedy.\r\nHaving started a world or two, I had NO idea how to continue and found out how by shear chance arsing around in the menus.\r\nWi… [+1139 chars]"}, {"source": {"id": null, "name": "Wccftech.com"}, "author": "Imran Hussain", "title": "Facebook Launches Messenger Rooms as Competitor to Zoom and Houseparty - Wccftech", "description": "Facebook has launched a new product called Messenger Rooms, which competes against the likes of Zoom and Hangouts. With Messenger Rooms, users can quickly make a Room, with or without a Facebook account, and invite up to 50 people in a video call with unlimit…", "url": "https://wccftech.com/facebook-launches-messenger-rooms-as-competitor-to-zoom-and-houseparty/", "urlToImage": null, "publishedAt": "2020-04-25T10:42:55Z", "content": "Facebook has launched a new product called Messenger Rooms, which competes against the likes of Zoom and Hangouts. With Messenger Rooms, users can quickly make a Room, with or without a Facebook account, and invite up to 50 people in a video call with unlimit… [+3981 chars]"}, {"source": {"id": null, "name": "Rockpapershotgun.com"}, "author": null, "title": "A demonic face-off from Doom's past is sealed inside Doom Eternal's soundtrack - Rock Paper Shotgun", "description": "A never-ending demonic battle sealed within the very waveforms of an audio track? That's pretty damn metal, Doom Eternal.", "url": "https://www.rockpapershotgun.com/2020/04/25/a-demonic-face-off-from-dooms-past-is-sealed-inside-doom-eternals-soundtrack/", "urlToImage": null, "publishedAt": "2020-04-25T10:37:00Z", "content": "There’s more than a bit of metal in Doom Eternal. The rhythmic bass blasts of super-shotguns, tinny chaingun power solos, verses punctuated by gory breaks and technical fingerwork. It’s only natural that Doom’s soundtrack contains a little bit of hell in kind… [+1898 chars]"}, {"source": {"id": null, "name": "Wired.co.uk"}, "author": "Tim Barber", "title": "The most exciting new watches from Watches & Wonders - Wired.co.uk", "description": "Including the skinniest mechanical watch ever made at just 2mm tall", "url": "https://www.wired.co.uk/article/2020-watches-wonders-watch-fair", "urlToImage": null, "publishedAt": "2020-04-25T10:17:27Z", "content": "With the world on lockdown, the Watches &amp; Wonders watch fair what used to be known more opaguely as the SIHH, comprising haut de gamme brands such as Cartier, Vacheron Constantin and Jaeger-LeCoultre, now given a zingy reboot for 2020 has moved online. \r\n… [+7020 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Matt Hanson", "title": "Smartphones are a bad deal – let's hope laptops don't go the same way - TechRadar", "description": "Opinion: forced obsolescence is a menace", "url": "https://www.techradar.com/news/smartphones-are-a-bad-deal-lets-hope-laptops-dont-go-the-same-way", "urlToImage": null, "publishedAt": "2020-04-25T10:00:00Z", "content": "Imagine buying a new laptop, only to find that three years later Microsoft/Apple stopped offering software updates for it, effectively forcing you to upgrade in order to ensure you had a machine that was secure and ran smoothly.\r\nAnd imagine that, during thos… [+5094 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Jeff Parsons", "title": "Apple Magic Keyboard review: the ultimate iPad Pro accessory - Metro.co.uk", "description": "This iPad Pro peripheral finally bridges the gap between tablet and laptop", "url": "https://metro.co.uk/2020/04/25/apple-magic-keyboard-review-crucial-ipad-pro-accessory-12588777/", "urlToImage": null, "publishedAt": "2020-04-25T09:53:53Z", "content": "The Magic Keyboard turns the iPad Pro into a floating display (Apple)\r\nFor the last few iPad generations Apple has been pushing to turn the tablet into more of a productivity device akin to your laptop.\r\nHardware additions like the Apple Pencil and Smart Keyb… [+5263 chars]"}, {"source": {"id": null, "name": "Pushsquare.com"}, "author": "Push Square", "title": "Community: What Will PS5 Look Like? Show Us Your Own Designs - Push Square", "description": "Send us your PS5 ideas", "url": "http://www.pushsquare.com/news/2020/04/community_what_will_ps5_look_like_show_us_your_own_designs", "urlToImage": null, "publishedAt": "2020-04-25T09:30:00Z", "content": "What will the PlayStation 5 look like? At this stage, no one outside of Sony knows the true answer. The company is keeping the design of its new console a closely guarded secret. We have seen the DualSense PS5 controller, of course, but the box itself remains… [+1698 chars]"}, {"source": {"id": null, "name": "Dailyrecord.co.uk"}, "author": "Mark McDougall", "title": "Celtic and Rangers stars get FIFA 20 boost as duo are rewarded with high-rated cards - Daily Record", "description": "Ianis Hagi and Moi Elyounoussi have both been given big boosts by the EA game.", "url": "https://www.dailyrecord.co.uk/sport/football/football-news/celtic-rangers-stars-fifa-20-21924906", "urlToImage": null, "publishedAt": "2020-04-25T09:16:10Z", "content": "When it comes to FIFA Ultimate Team, there's rarely a time where players of the game will create a squad built with Scottish Premiership players. \r\n It wouldn't really be possible to go up against the best players on the game who have the top-rated cards but … [+824 chars]"}, {"source": {"id": null, "name": "Eurogamer.net"}, "author": "Wesley Yin-Poole", "title": "Final Fantasy 7 Remake save editor makes Red XIII briefly playable - Eurogamer.net", "description": null, "url": "https://www.eurogamer.net/articles/2020-04-25-final-fantasy-7-remake-save-editor-makes-red-xiii-briefly-playable", "urlToImage": null, "publishedAt": "2020-04-25T08:48:00Z", "content": "Many Final Fantasy 7 fans were disappointed to learn key character Red XIII is not playable in the Final Fantasy 7 Remake, despite being one of the stars of the original game. But it turns out he is playable - briefly - via save editing.\r\nFinal Fantasy 7's ic… [+1581 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Aaron Brown", "title": "Google Chrome rival brings a feature social media fans will adore in latest update - Express", "description": "OPERA has rolled out support for a handy new feature that should appeal to social media obsessives. Here's everything you need to know.", "url": "https://www.express.co.uk/life-style/science-technology/1273390/Google-Chrome-Rival-Opera-Social-Media-Instagram-Fans-Update-New-Feature", "urlToImage": null, "publishedAt": "2020-04-25T07:03:29Z", "content": null}, {"source": {"id": null, "name": "Digitalcameraworld.com"}, "author": "Louise Carey", "title": "iPhone 12: What we know so far about September 2020 iPhone release - Digital Camera World", "description": "The iPhone 12 is set to be announced in September, but what are we expecting from the latest iPhone generation?", "url": "https://www.digitalcameraworld.com/news/iphone-12-what-we-know-so-far-about-september-2020-iphone-release", "urlToImage": null, "publishedAt": "2020-04-25T07:02:00Z", "content": "With only a matter of months to go until Apple's traditional September iPhone launch event, the internet is already abuzz with rumors and speculation on what the iPhone 12 release is going to look like. With the 2019 iPhone 11 release leaving some feeling und… [+6096 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Aaron Brown", "title": "WhatsApp update DOUBLES the maximum number of people in a video call - Express", "description": "WHATSAPP has expanded the maximum number of people who can take part in a video call at the same time - doubling the previous limit of four simultaneous callers. Just as before, these video calls will be end-to-end encrypted.", "url": "https://www.express.co.uk/life-style/science-technology/1273575/WhatsApp-Maximum-Number-People-Video-Call-Double-Limit-Update-iPhone-Android", "urlToImage": null, "publishedAt": "2020-04-25T06:42:31Z", "content": null}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Aaron Brown", "title": "Time to ditch WhatsApp and Houseparty? Google just made a huge change to your video calls - Express", "description": "GOOGLE has rolled out a colossal change to its video chat application, Google Duo, that promises to dramatically boost the video quality - even when making calls on sluggish home internet connections. Coupled with a number of new features added to the app, it…", "url": "https://www.express.co.uk/life-style/science-technology/1273369/Ditch-WhatsApp-Houseparty-Video-Calls-Google-Duo-Quality-Stream-Slow-Internet", "urlToImage": null, "publishedAt": "2020-04-25T06:36:39Z", "content": null}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Dion Dassanayake", "title": "Windows 10 update could DELETE your files and bricks PCs in fresh blow to Microsoft users - Express", "description": "WINDOWS 10 users have been dealt yet another download blow, with a new Microsoft update capable of deleting user files and bricking your PC.", "url": "https://www.express.co.uk/life-style/science-technology/1273596/Windows-10-update-deletes-files-bricks-PCs-Microsoft", "urlToImage": null, "publishedAt": "2020-04-25T06:06:53Z", "content": "And another posted: \"My system automatically updated on the 19th of April. I lost some important word files of my university. And a folder.\r\n\"I have looked on the temporary folders and I have tried to uninstall the update but they do not appear\".\r\nWindows Lat… [+612 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Aaron Brown", "title": "Netflix solves a huge headache for Android users, but iPhone loses out on awesome update - Express", "description": "NETFLIX has solved one of the biggest pains when watching shows or movies on your Android smartphone or tablet. But despite many iPhone and iPad owners suffering the same headache ...there's no sign of a fix. Here's everything you need to know about the new f…", "url": "https://www.express.co.uk/life-style/science-technology/1273343/Netflix-Update-Solve-Headache-Android-No-iPhone-Users", "urlToImage": null, "publishedAt": "2020-04-25T06:06:34Z", "content": "Of course, it's still possible that you could drop your phone and somehow accidentally manage to hit the unlock button two times in quick succession, followed by the pause button – but that's much less likely than the single-tap needed to wreak havoc beforeha… [+613 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "", "title": "Should I buy a Nintendo Switch for my kids in lockdown? - The Guardian", "description": "Our two 10-year-olds are asking for new games – but I’m wondering if there’s a less costly alternative", "url": "https://www.theguardian.com/money/2020/apr/25/buy-nintendo-switch-kids-lockdown-games", "urlToImage": null, "publishedAt": "2020-04-25T06:04:02Z", "content": "Every week a Guardian Money reader submits a question, and its up to you to help him or her out a selection of the best answers will appear in next Saturdays paper.\r\nFive weeks into lockdown and our two 10-year-olds are badgering us to buy some new electronic… [+301 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "David Snelling", "title": "Samsung reveals another blockbuster 4K TV update for your television - Express", "description": "SAMSUNG is back with even more updates for your TV and here's what's now available on your 4K television.", "url": "https://www.express.co.uk/life-style/science-technology/1273517/Samsung-4K-TV-update-Apple-Music-app", "urlToImage": null, "publishedAt": "2020-04-25T06:01:07Z", "content": "“Our goal has always been to deliver the best entertainment experiences to consumers – and as people spend more time at home, we are more committed to that mission than ever,” said Salek Brodsky, Vice President of Strategic Partnerships and Business Developme… [+665 chars]"}, {"source": {"id": null, "name": "Pistonheads.com"}, "author": "Mike Duff", "title": "Rolls-Royce Silver Seraph | The Brave Pill - Pistonheads.com", "description": "In terms of miles covered, could this be the highest Roller?", "url": "https://www.pistonheads.com/news/general/rolls-royce-silver-seraph--the-brave-pill/42296", "urlToImage": null, "publishedAt": "2020-04-25T05:03:51Z", "content": "There is no shortage of Rolls-Royces with low mileages out there, but that doesn't mean they are better prospects than the ones that have lived life a little. And here's one that has lived life a lot - a Silver Seraph that has managed to rack up the impressiv… [+7030 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Gary Jones", "title": "Games with Gold May 2020: Great news for Xbox Live free games fans - Express", "description": "MICROSOFT will announce its plans for Games with Gold this week and gamers have also been given more free Xbox One downloads.", "url": "https://www.express.co.uk/entertainment/gaming/1273675/Games-with-Gold-May-2020-new-Xbox-Live-free-games", "urlToImage": null, "publishedAt": "2020-04-25T03:27:32Z", "content": null}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Desire Athow", "title": "This AMD Ryzen notebook deal is probably the best we've ever seen - TechRadar", "description": "Lenovo and AMD provide a glimpse into the future", "url": "https://www.techradar.com/news/this-amd-ryzen-laptop-is-the-probably-the-best-notebook-deal-ever", "urlToImage": null, "publishedAt": "2020-04-25T03:00:00Z", "content": "We reviewers are used to obsessing over incremental technology changes, but every now and then a supernova appears on our radar - something that can single handedly change the status quo.\r\nThe AMD Ryzen 4000 family is one such supernova and promises to bring … [+1829 chars]"}, {"source": {"id": null, "name": "Gamingintel.com"}, "author": null, "title": "Modern Warfare & Warzone Gets Update, Gunsmith Customs, and More Next Week - Gaming INTEL", "description": "There's a new update coming to Modern Warfare and Call of Duty Warzone next week, so Infinity Ward has provided a glimpse of what to expect.", "url": "https://gamingintel.com/modern-warfare-warzone-update-gunsmith-customs-next-week/", "urlToImage": null, "publishedAt": "2020-04-25T02:03:04Z", "content": "Last Updated onApril 25, 2020 at 2:51 am\r\nIf Infinity Ward’s April 24 community update is anything to by, Modern Warfare is on the verge of getting a brand new patch. Modern Warfare update 1.20 will bring a new anti-cheat system to Warzone, in addition to a h… [+1919 chars]"}, {"source": {"id": null, "name": "Futuregamereleases.com"}, "author": "Dejan Kacurov", "title": "Pokemon Go Free Promo Code That you Can Claim Until April 26 - Future Game Releases", "description": "Trainers, Niantic and Pokemon Go are generous again and they've shared a new free promo code, which can be used to claim free items. Niantic shared the 13-characters code on their official Twitter acc", "url": "https://www.futuregamereleases.com/2020/04/pokemon-go-free-promo-code-that-you-can-claim-until-april-26/", "urlToImage": null, "publishedAt": "2020-04-25T01:02:29Z", "content": "Trainers, Niantic and Pokemon Go are generous again and they’ve shared a new free promo code, which can be used to claim free items.\r\nNiantic shared the 13-characters code on their official Twitter account. This code can be claimed online or in-app (android u… [+419 chars]"}, {"source": {"id": null, "name": "Ubergizmo.com"}, "author": "Tyler Lee", "title": "Samsung’s Smartwatches Get A New Blood Pressure Monitoring App - Ubergizmo", "description": "Our smartwatches are getting better at what they do, where they can monitor more than just our daily activities like our steps taken, calories burnt, and so on. For example, the Apple Watch comes with an ECG monitoring tool that can alert the wearer if there …", "url": "https://www.ubergizmo.com/2020/04/samsung-smartwatch-blood-pressure-monitor/", "urlToImage": null, "publishedAt": "2020-04-25T00:42:49Z", "content": "Our smartwatches are getting better at what they do, where they can monitor more than just our daily activities like our steps taken, calories burnt, and so on. For example, the Apple Watch comes with an ECG monitoring tool that can alert the wearer if there … [+1254 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Anthony Spadafora", "title": "Ubuntu 20.04 adds VPN and support for a key Windows 10 feature - TechRadar", "description": "Latest Ubuntu release includes WireGuard and exFAT support", "url": "https://www.techradar.com/news/ubuntu-2004-adds-vpn-and-support-for-a-key-windows-10-feature", "urlToImage": null, "publishedAt": "2020-04-24T21:40:00Z", "content": "Canonical has released the latest version of its Ubuntu Linux distribution which offers a number of exciting new features designed to improve performance and security.\r\nUbuntu 20.04, aka Focal Fossa, is based on the Linux 5.4 kernel and this long-term-support… [+1714 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Jonathan Chadwick For Mailonline", "title": "Colour paint technology cools buildings by reflecting the sun - Daily Mail", "description": "New colour paint designed to cool buildings by reflecting the sun could become an eco-friendly alternative to air conditioners, US materials scientists report.", "url": "https://www.dailymail.co.uk/sciencetech/article-8254793/Colour-paint-technology-cools-buildings-reflecting-sun.html", "urlToImage": null, "publishedAt": "2020-04-24T20:46:33Z", "content": "A new form of doubled-layered coloured paint designed to cool buildings by reflecting the sun could become an eco-friendly alternative to air conditioners.\r\nUS materials scientists say their array of coloured multi-layered paints can dramatically cool sun-bla… [+4159 chars]"}, {"source": {"id": null, "name": "Digitalspy.com"}, "author": "Chris Edwards", "title": "Nintendo addresses major security breach - digitalspy.com", "description": "There have been reported incidents of unauthorised access to user accounts.", "url": "https://www.digitalspy.com/tech/a32270793/nintendo-security-breach/", "urlToImage": null, "publishedAt": "2020-04-24T20:38:00Z", "content": "Nintendo has addressed a major security breach as it encourages users to take new security steps. \r\nIn a statement on its official website, the gaming company said it is continuing to investigate recent incidents of unauthorised access to Nintendo Accounts, b… [+1827 chars]"}, {"source": {"id": null, "name": "Rockpapershotgun.com"}, "author": null, "title": "This Minecraft map attempts to simulate social distancing during a pandemic - Rock Paper Shotgun", "description": "Blockdown Simulator has you take on the role of a nurse or a spectator as you cure villagers of a zombie pandemic.", "url": "https://www.rockpapershotgun.com/2020/04/24/this-minecraft-map-attempts-to-simulate-social-distancing-during-a-pandemic/", "urlToImage": null, "publishedAt": "2020-04-24T19:24:00Z", "content": "Are all you kids out there still playing Minecraft? Let’s hope so, because some folks have made a Minecraft map to teach you younguns about how social distancing and healthcare services work together to beat a pandemic. It sounds a bit corny off the cuff but … [+2478 chars]"}, {"source": {"id": null, "name": "Pushsquare.com"}, "author": "Push Square", "title": "Talking Point: What Free May 2020 PS Plus Games Do You Want? - Push Square", "description": "When will May 2020's PlayStation Plus lineup be announced?", "url": "http://www.pushsquare.com/news/2020/04/talking_point_what_free_may_2020_ps_plus_games_do_you_want", "urlToImage": null, "publishedAt": "2020-04-24T18:00:00Z", "content": "Whats the May 2020 PlayStation Plus lineup? And when will the May 2020 PS Plus games be announced? Sony's service has quietly been on a very good run, with Uncharted 4: A Thief's End and DiRT Rally 2.0 both very good additions in April. The Japanese giant has… [+1798 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Carly Page", "title": "The Dell XPS 15 2020 may have been redesigned to take on the MacBook Pro - TechRadar", "description": "Incoming model will boast smaller bezels and upward-firing speakers", "url": "https://www.techradar.com/news/the-dell-xps-15-2020-may-have-been-redesigned-to-take-on-the-macbook-pro", "urlToImage": null, "publishedAt": "2020-04-24T17:31:00Z", "content": "Dell looks poised to release an all-new version of its XPS 15 laptop that will take a number of design clues from the recently-revamped Dell XPS 13\r\n.\r\nThats according to leaked images posted on the Korea Energy Agency Efficiency Standardization Certification… [+2119 chars]"}, {"source": {"id": null, "name": "Trueachievements.com"}, "author": "Heidi Nicholas", "title": "Sci-fi adventure Deliver Us The Moon joins Xbox Game Pass and Game Pass for PC today - TrueAchievements", "description": "Deliver Us The Moon is a sci-fi action adventure title which draws inspiration from movies such as Interstellar, and which joins the Xbox Game Pass and Xbox Game Pass for PC services today as a day one addition.", "url": "https://www.trueachievements.com/n41593/deliver-us-the-moon", "urlToImage": null, "publishedAt": "2020-04-24T17:19:36Z", "content": "The Xbox team has been busy lately: just yesterday, they surprise-dropped the announcement that Red Dead Redemption 2 will join Xbox Game Pass in May. Before that, they announced new titles for Xbox Game Pass, along with several new titles for Xbox Game Pass … [+1728 chars]"}, {"source": {"id": null, "name": "Inews.co.uk"}, "author": "Alex Nelson", "title": "Travis Scott Fortnite event: what time live concerts are, how to get the new skin and Astronomical challenges explained - inews", "description": "Astronomical is 'a one of a kind musical journey featuring Travis Scott'", "url": "https://inews.co.uk/culture/gaming/travis-scott-fortnite-event-concert-live-when-time-uk-new-skin-astronomical-challenges-update-explained-2544889", "urlToImage": null, "publishedAt": "2020-04-24T17:11:27Z", "content": "Astronomical is 'a one of a kind musical journey featuring Travis Scott'\r\nSaturday, 25th April 2020, 8:48 am\r\nUpdated Saturday, 25th April 2020, 1:43 pm\r\nThe latest crossover event to come to Fortnite has been revealed, and includes another huge live concert … [+3117 chars]"}, {"source": {"id": null, "name": "Gamasutra.com"}, "author": "Bryant Francis", "title": "Obituary: Hellblade mental health consultant Jenny Esson - Gamasutra", "description": "Jenny Esson, one of the mental health professionals who contributed to the development of  Hellblade: Senua's Sacrifice  has passed away at age 45 from COVID-19.", "url": "https://www.gamasutra.com/view/news/361807/Obituary_Hellblade_mental_health_consultant_Jenny_Esson.php", "urlToImage": null, "publishedAt": "2020-04-24T17:10:39Z", "content": "Jenny Esson, one of the medical professionals who consulted on the development of Ninja Theory's Hellblade: Senua's Sacrifice, has passed away from COVID-19 at age 45. The studio noted her passing via Twitter.\r\nEsson worked for Cambridgeshire and Peterborough… [+698 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nJames Gurney", "title": "Seven of the best new men’s timepieces from Watches & Wonders - Telegraph.co.uk", "description": "On 25 April, a new online platform will unveil a host of watch models, which will be available in 2020", "url": "https://www.telegraph.co.uk/luxury/watches/seven-best-new-mens-timepieces-watches-wonders/", "urlToImage": null, "publishedAt": "2020-04-24T16:20:00Z", "content": "A certain less is more applies to many watches being launched, as brands opt to play safe for the most part but as that quite often means better, its almost a relief. Take Jaeger-LeCoultres Master Control Calendar (or, somewhat more enticingly, Quantième à Da… [+425 chars]"}, {"source": {"id": null, "name": "Theregister.co.uk"}, "author": "Matthew Hughes", "title": "Android 11 Developer Preview 3 allows your mobe to become a router via USB Ethernet – if you can get a decent signal - The Register", "description": "Plus: Multitasking and other functions rejigged, but no promises they'll stick", "url": "https://www.theregister.co.uk/2020/04/24/android_11_dp3/", "urlToImage": null, "publishedAt": "2020-04-24T14:29:00Z", "content": "Google's third developer preview (DP3) of the Android 11 operating system is an enticing look at the future of the platform, where new features and UI tweaks abound.\r\nBut before we get into the meat of things, a bit of a throat-clearing. In the past, features… [+2358 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Kevin Pocock", "title": "Sony’s WF-1000XM3 noise-cancelling headphones – £77 off, with Alexa BUILT IN - The Sun", "description": "", "url": "http://www.thesun.co.uk/tech/11472205/sony-wf-1000xm3-noise-cancelling-headphones-bluetooth-deal-save/", "urlToImage": null, "publishedAt": "2020-04-24T13:39:03Z", "content": "OUT for exercise or at home enjoying some downtime, the right pair of headphones are a real bonus.\r\nThe best often require investment, and the Sony WF-1000XM3 set is one of them.\r\n The charging case should offer 3 additional full charges\r\nSonys premium WF-100… [+2068 chars]"}, {"source": {"id": null, "name": "Nintendolife.com"}, "author": "Nintendo Life", "title": "Random: Nintendo Says Streets Of Rage 4 Is Out On Switch, But It Definitely Isn't - Nintendo Life", "description": "Here we go again", "url": "http://www.nintendolife.com/news/2020/04/random_nintendo_says_streets_of_rage_4_is_out_on_switch_but_it_definitely_isnt", "urlToImage": null, "publishedAt": "2020-04-24T13:00:00Z", "content": "It would appear that Nintendo is still confused over the official release date of Streets of Rage 4 on Switch, following up on its initial erroneous eShop listing with a new, incorrect news post.\r\nYou may remember that at the start of the month, the Nintendo … [+1226 chars]"}, {"source": {"id": null, "name": "Eurogamer.net"}, "author": "Wesley Yin-Poole", "title": "WWE 2K21 canned after disastrous WWE 2K20 - Eurogamer.net", "description": null, "url": "https://www.eurogamer.net/articles/2020-04-24-wwe-2k21-canned-after-disastrous-wwe-2k20", "urlToImage": null, "publishedAt": "2020-04-24T10:28:00Z", "content": "WWE 2K21 is canned, WWE has confirmed.\r\nDuring WWE's financial call overnight, interim chief financial officer Frank Riddick said: \"There's not going to be a launch of the game this year.\"\r\nThe news comes after last year's disastrous launch of WWE 2K20, which… [+830 chars]"}, {"source": {"id": null, "name": "Rockpapershotgun.com"}, "author": null, "title": "XCOM: Chimera Squad is out now, and it's half-price - Rock Paper Shotgun", "description": "It’s time to put down your world-saving guns and pick up your alien-policemen batons, because XCOM: Chimera Squad is out.", "url": "https://www.rockpapershotgun.com/2020/04/24/xcom-chimera-squad-is-out-now-and-its-half-price/", "urlToImage": null, "publishedAt": "2020-04-24T10:17:00Z", "content": "It’s time to put down your world-saving guns and pick up your alien-policing batons, because XCOM: Chimera Squad is out. XCOPS takes a big sidewards leap away from the main series, boiling down turn-based combat into single-room encounters. Developers Firaxis… [+2356 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Jeff Parsons", "title": "Beware the WhatsApp 'free beer' scam to get your personal data - Metro.co.uk", "description": "The hoax is currently circulating on WhatsApp", "url": "https://metro.co.uk/2020/04/24/beware-whatsapp-free-beer-text-just-scam-get-private-information-12603287/", "urlToImage": null, "publishedAt": "2020-04-24T09:29:18Z", "content": "The hoax is spreading through WhatsApp (Picture: Getty)\r\nA WhatsApp message promising what everyone could do with right now a free beer is nothing more than a dangerous hoax.\r\nIf you get the message, which is seemingly from Dutch beer company Heineken, ignore… [+1983 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "GameCentral", "title": "Play Call Of Duty: Modern Warfare multiplayer for free this weekend - Metro.co.uk", "description": "Five maps from the main multiplayer mode of Modern Warfare will be free to play for everyone from today until Monday.", "url": "https://metro.co.uk/2020/04/24/play-call-duty-modern-warfare-multiplayer-maps-free-weekend-via-warzone-12603582/", "urlToImage": null, "publishedAt": "2020-04-24T09:29:08Z", "content": "Call Of Duty: Modern Warfare another free trial (pic: Activision)\r\nFive maps from the main multiplayer mode of Modern Warfare will be free to play for everyone from today until Monday.\r\nCall Of Duty: Warzone may be free-to-play but the main multiplayer mode o… [+1680 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Cindy Tran for Daily Mail Australia", "title": "Peeling carrots wrong your whole life! Video showing the correct way takes the internet by storm - Daily Mail", "description": "A British man has discovered a simple way to peel carrots in just seconds - and it turns out thousands of home cooks have all been doing it wrong their whole lives.", "url": "https://www.dailymail.co.uk/femail/article-8252137/Peeling-carrots-wrong-life-Video-showing-correct-way-takes-internet-storm.html", "urlToImage": null, "publishedAt": "2020-04-24T09:06:00Z", "content": "Most people peel their carrots from the base to the point in one direction away from their hand, but a video demonstration has emerged showing a much faster and efficient way of using the vegetable peeler.\r\nThe footage, posted on Reddit by an anonymous user, … [+2015 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "https://www.facebook.com/TechRadar", "title": "iPhone SE review (2020): Apple finally has a cheap iPhone to review - TechRadar", "description": "The 2020 iPhone SE is lightweight, cheap and future-proofed - well done, Apple", "url": "https://www.techradar.com/uk/reviews/iphone-se", "urlToImage": null, "publishedAt": "2020-04-24T07:30:00Z", "content": "Two-minute review\r\nThe iPhone SE 2020 is built around one goal: to create a new iPhone for less money than ever, and it achieves that well. For just $399 / £419 / AU$749 you can have a brand-new handset from Apple its one of the best iPhones ever created and … [+23328 chars]"}, {"source": {"id": null, "name": "Canaries.co.uk"}, "author": "Norwich City", "title": "New date for The Killers concert - News - Canaries.co.uk", "description": "Norwich City Football Club can confirm the rescheduling and a new date for the concert with The Killers at Carrow Road.", "url": "https://www.canaries.co.uk/News/2020/april/new-date-for-the-killers-concert/", "urlToImage": null, "publishedAt": "2020-04-24T06:38:52Z", "content": "Norwich City Football Club can confirm the rescheduling and a new date for the concert with The Killers at Carrow Road.\r\nThe concert was initially scheduled for June 2020, but owing to the current COVID-19 pandemic it has now been rearranged to take place on … [+710 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Ammar Kalia, Ellen E Jones, Phil Harrison, Paul Howlett, Graeme Virtue", "title": "TV tonight: celebrating the Hubble telescope - The Guardian", "description": "As our eye in the sky reaches its 30th year, a fascinating special tells its story; Anneka Rice and Laurence Llewelyn-Bowen join Joe Lycett. Here’s what to watch this evening", "url": "https://www.theguardian.com/tv-and-radio/2020/apr/24/tv-tonight-celebrating-the-hubble-telescope", "urlToImage": null, "publishedAt": "2020-04-24T05:01:06Z", "content": "Hubble: The Wonders of Space Revealed\r\n9pm, BBC Two\r\nIn orbit since April 1990 and having travelled more than 6.5bn kilometers around Earth, the Hubble telescope has done more than perhaps any other scientific experiment to reveal the extent of our universe. … [+2409 chars]"}, {"source": {"id": null, "name": "Nintendolife.com"}, "author": "Nintendo Life", "title": "Random: Lord Of The Rings Actor Elijah Wood Visits Animal Crossing Player's Island To Sell His Turnips - Nintendo Life", "description": "Direct from Driftwood", "url": "http://www.nintendolife.com/news/2020/04/random_lord_of_the_rings_actor_elijah_wood_visits_animal_crossing_players_island_to_sell_his_turnips", "urlToImage": null, "publishedAt": "2020-04-24T02:30:00Z", "content": null}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Dion Dassanayake", "title": "Fortnite Travis Scott event COUNTDOWN: Start time, leaks, concert location, live stream - Express", "description": "FORTNITE Travis Scott event has taken place in Battle Royale, with some fans dubbing the Astronomical concert the 'best' live event ever. However, if you missed out you can tune into other shows. Here's all you need to know about the dates and times, location…", "url": "https://www.express.co.uk/entertainment/gaming/1272575/Fortnite-Travis-Scott-event-COUNTDOWN-dates-times-location-live-stream", "urlToImage": null, "publishedAt": "2020-04-23T23:52:00Z", "content": null}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "With humans vulnerable: How about a digital helper? - BBC News", "description": "Robots and digital assistants have proved useful during the Covid-19 pandemic but are still limited.", "url": "https://www.bbc.co.uk/news/business-52290562", "urlToImage": null, "publishedAt": "2020-04-23T23:15:10Z", "content": "Image copyrightCloudmindsImage caption\r\n The XR-1 at a hospital in China\r\nSince February, California-based manufacturer CloudMinds has shipped more than 100 robots to China.\r\nMany of those have gone to hospitals, where the XR-1 provides information to patient… [+5071 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: 'Our wedding is cancelled but we still have to pay' - BBC News", "description": "Venues are forcing couples to pay big cancellation fees for weddings delayed by the lockdown.", "url": "https://www.bbc.co.uk/news/business-52400441", "urlToImage": null, "publishedAt": "2020-04-23T23:11:57Z", "content": "Media caption'We've saved so hard for so long for it, it's beyond belief almost'\r\nBrides and grooms say they are being charged thousands of pounds in cancellation and postponement fees for weddings that can't go ahead because of the coronavirus lockdown. \r\nWh… [+7995 chars]"}]}