{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Final Fantasy 7 Remake Part 2 Confirmed To Already Be In Development - Screen Rant", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiS2h0dHBzOi8vc2NyZWVucmFudC5jb20vZmluYWwtZmFudGFzeS03LXJlbWFrZS1wYXJ0LTItY29uZmlybWVkLWRldmVsb3BtZW50L9IBT2h0dHBzOi8vc2NyZWVucmFudC5jb20vZmluYWwtZmFudGFzeS03LXJlbWFrZS1wYXJ0LTItY29uZmlybWVkLWRldmVsb3BtZW50L2FtcC8?oc=5", "urlToImage": null, "publishedAt": "2020-04-27T04:50:09Z", "content": null}, {"source": {"id": null, "name": "Nintendolife.com"}, "author": "Nintendo Life", "title": "Animal Crossing: New Horizons: Islands - Get Inspired By The Best Islands We've Seen So Far - Nintendo Life", "description": "Putting our meagre island efforts to shame", "url": "http://www.nintendolife.com/guides/animal-crossing-new-horizons-islands-get-inspired-by-the-best-islands-weve-seen-so-far", "urlToImage": null, "publishedAt": "2020-04-27T04:31:00Z", "content": "Since Animal Crossing: New Horizons launched a few weeks ago, a large community of gamers have been sharing incredible custom designs created for the game. However, perhaps even more impressive than that are the incredible landscaping projects players are und… [+5481 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Desire Athow", "title": "Mighty CPU rival to Intel and AMD set to shake up the market - TechRadar", "description": "French company SiPearl enters the fray", "url": "https://www.techradar.com/news/mighty-and-surprising-cpu-rival-to-intel-and-amd-to-come-next-year", "urlToImage": null, "publishedAt": "2020-04-27T03:00:00Z", "content": "The announcement of Amazons Graviton2\r\n may well have made AMD and Intel a little nervous - Amazon is, after all, a customer of both. Now, the two companies have even greater reason to be worried.\r\nParisian company SiPearl recently announced it had signed a m… [+1069 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nLizzie Roberts", "title": "Contact tracing: how has it worked for other countries, and could it really help ease UK lockdown? - The Telegraph", "description": "From teams of 'corona detectives' to Army cadets making thousands of calls a day, countries are tracking the spread of Covid-19", "url": "https://www.telegraph.co.uk/news/2020/04/26/contact-tracing-what-how-work-countries-help-uk-lockdown/", "urlToImage": null, "publishedAt": "2020-04-27T01:43:39Z", "content": "Countries around the world are rushing to launch contact tracing apps to identify who an infected person has had contact with, as part of efforts to slow the spread of the coronavirus. \r\nThe UK Government has announced the infrastructure was being put in plac… [+1754 chars]"}, {"source": {"id": "financial-times", "name": "Financial Times"}, "author": null, "title": "Race to build tools to trace Covid-19 cases for return to work - Financial Times", "description": "Tools could track movement of office workers to within a few centimetres", "url": "https://www.ft.com/content/caeb250b-8d8b-4eaa-969c-62a8b58464aa", "urlToImage": null, "publishedAt": "2020-04-26T21:58:18Z", "content": "Companies including PwC, the global consultancy, are racing to build surveillance tools that will monitor the spread of coronavirus inside offices and workplaces. \r\nThe companies, which also include smaller US start-ups Locix and Microshare, want to give empl… [+4511 chars]"}, {"source": {"id": null, "name": "Comicbook.com"}, "author": "Aaron Perine", "title": "Ninja's Wife Jessica Blevins Accuses Tfue of Starting Drama for Money - ComicBook.com", "description": "Ninja’s wife, Jessica Blevins is accusing Tfue of starting drama for money after yesterday’s strange scene during Mr. Beast’s Rock, Paper Scissors stream for charity. The YouTube star was holding a star-studded event for charity featuring some of the biggest …", "url": "https://comicbook.com/gaming/news/ninja-wife-tfue-jessica-blevins-accuses-starting-drama-money/", "urlToImage": null, "publishedAt": "2020-04-26T21:15:23Z", "content": "Ninja’s wife, Jessica Blevins is accusing Tfueof starting drama for money after yesterday’s strange scene during Mr. Beast’s Rock, Paper Scissors stream for charity. The YouTube star was holding a star-studded event for charity featuring some of the biggest i… [+2797 chars]"}, {"source": {"id": null, "name": "Bleepingcomputer.com"}, "author": "Lawrence Abrams", "title": "Hackers exploit zero-day in Sophos XG Firewall, fix released - BleepingComputer", "description": "Sophos has fixed a zero-day SQL injection vulnerability in their XG Firewall after receiving reports that hackers actively exploited it in attacks.", "url": "https://www.bleepingcomputer.com/news/security/hackers-exploit-zero-day-in-sophos-xg-firewall-fix-released/", "urlToImage": null, "publishedAt": "2020-04-26T19:43:44Z", "content": "Sophos has fixed a zero-day SQL injection vulnerability in their XG Firewall after receiving reports that hackers actively exploited it in attacks.\r\nSophos states that they received a report on April 22nd that there was a suspicious field value being displaye… [+2841 chars]"}, {"source": {"id": null, "name": "Dexerto.com"}, "author": "Theo Salaun", "title": "CoD players apparently wrongfully banned from Modern Warfare & Warzone - Dexerto", "description": "Infinity Ward has banned over 70,000 accounts for cheating in Call of Duty, but mounting evidence suggests that many innocent players may also be getting unfairly banned from the game.", "url": "https://www.dexerto.com/call-of-duty/cod-players-apparently-wrongfully-banned-from-modern-warfare-warzone-1358410", "urlToImage": null, "publishedAt": "2020-04-26T19:14:49Z", "content": "Over the past couple of weeks, Infinity Ward has banned over 70,000 accounts globally for cheating in Call of Duty: Modern Warfare and Warzone. Now, mounting evidence suggests that many players may be caught up and getting unfairly suspended from the game.\r\nA… [+3009 chars]"}, {"source": {"id": null, "name": "Pcgamesn.com"}, "author": "Ian Boudreau", "title": "Gaming while trucking: check out this PC setup in a semi - PCGamesN", "description": "Space is at a premium in the back of a semi, but trucker gamers make it work", "url": "https://www.pcgamesn.com/semi-truck-battlestation", "urlToImage": null, "publishedAt": "2020-04-26T18:19:33Z", "content": "It’s no longer strictly necessary for your gaming PC to be a gigantic box tethered to a desk, and that’s great news for over the road truckers who want to keep up with their hobby while on a long haul route. One such trucker has been adapting his gaming rig t… [+2705 chars]"}, {"source": {"id": null, "name": "Pushsquare.com"}, "author": "Push Square", "title": "Feature: Days Gone - Why Sony Bend's PS4 Open Worlder Is Essential a Year Later - Push Square", "description": "The art of support", "url": "http://www.pushsquare.com/news/2020/04/feature_days_gone_-_why_sony_bends_ps4_open_worlder_is_essential_a_year_later", "urlToImage": null, "publishedAt": "2020-04-26T17:00:00Z", "content": "Days Gone and Death Stranding are proof that 2019 was a divisive year for PlayStation 4 exclusives. The two blockbuster releases divided opinion between professional critics and fans playing the game, and in the case of the former, led to more of a positive b… [+3674 chars]"}, {"source": {"id": null, "name": "Nintendolife.com"}, "author": "Nintendo Life", "title": "MotoGP 20 Review (Switch eShop) - Nintendo Life", "description": "Hello, Moto", "url": "http://www.nintendolife.com/reviews/switch-eshop/motogp_20", "urlToImage": null, "publishedAt": "2020-04-26T17:00:00Z", "content": "With over 25 years of experience in the racing game development scene, its safe to say Italian studio Milestone has cemented its place as one of its most prevalent developers. Outside of the official F1 and WRC games, its established a foothold in almost ever… [+4910 chars]"}, {"source": {"id": null, "name": "Eurogamer.net"}, "author": "Vikki Blake", "title": "Sega wants to give you Total War: Shogun 2 for free as a thank you for staying at home - Eurogamer.net", "description": null, "url": "https://www.eurogamer.net/articles/2020-04-26-sega-wants-to-give-you-total-war-shogun-2-for-free-as-a-thankyou-for-staying-at-home", "urlToImage": null, "publishedAt": "2020-04-26T16:47:00Z", "content": "In a bid to keep us safe inside and flattening the curve of the COVID-19 pandemic, Sega is giving away Total War: Shogun 2 from tomorrow, Monday 27th April, right up until Friday 1st May, 2020, inclusively. \r\nThe freebie - which will be available via Steam - … [+1067 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Mahin Kesore", "title": "Ahead of the game: the weird Nintendo tech that time forgot - TechRadar India", "description": "But we didn't forget", "url": "https://www.techradar.com/news/ahead-of-the-game-the-weird-nintendo-tech-that-time-forgot", "urlToImage": null, "publishedAt": "2020-04-26T16:00:00Z", "content": "Unlike other big companies dominating the gaming market, Nintendo came from humble beginnings. Starting out as a card factory and toy maker, the company has always tried new, interesting and unique things when it comes to gaming innovation. \r\nWithout Nintendo… [+7681 chars]"}, {"source": {"id": null, "name": "Gamesindustry.biz"}, "author": null, "title": "Animal Crossing: New Horizons returns to No.1 in the UK - GamesIndustry.biz", "description": "Switch boxed game sales surge as stock arrives on virtual shelves", "url": "https://www.gamesindustry.biz/articles/2020-04-26-animal-crossing-new-horizons-returns-to-no-1-in-the-uk", "urlToImage": null, "publishedAt": "2020-04-26T15:54:18Z", "content": "Share this article\r\nCompanies in this article\r\nGfK\r\nNintendo Switch boxed games jumped in sales week-on-week as more stock became available to retailers.\r\nThe No.1 game of the week was Animal Crossing: New Horizons, making its return to the top for the first … [+2322 chars]"}, {"source": {"id": null, "name": "Eurogamer.net"}, "author": "Vikki Blake", "title": "Apex Legends' next LTE Battle Armor drops you into the action with armour and a P2020 already equipped - Eurogamer.net", "description": null, "url": "https://www.eurogamer.net/articles/2020-04-26-apex-legends-next-lte-battle-armor-drops-you-into-the-action-with-armour-and-a-p2020-already-equipped", "urlToImage": null, "publishedAt": "2020-04-26T15:49:00Z", "content": "A new time-limited mode, Battle Armor, is coming to Apex Legends.\r\nRunning from the weekly reset on Tuesday, 28th April, until season 5's arrival on 12th May, Battle Armor will offer only one type of armo(u)r. Players will drop into the match with it already … [+1758 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Gabe Gurwin", "title": "Free Alien Game Available Today To Celebrate Alien Day - GameSpot", "description": "Alien: Blackout is a sequel to Alien: Isolation and is completely free on iOS and Android.", "url": "https://www.gamespot.com/articles/free-alien-game-available-today-to-celebrate-alien/1100-6476505/", "urlToImage": null, "publishedAt": "2020-04-26T14:13:00Z", "content": "April 26 is Alien Day, a fan holiday created to honor the legendary science-fiction horror franchise, and D3 Go's mobile game Alien: Blackout is free to help you celebrate. Available for both iOS and Android, it's a strategic and tense adventure that differs … [+1232 chars]"}, {"source": {"id": null, "name": "Notebookcheck.net"}, "author": "Benjamin Herzig", "title": "Microsoft Surface: Security concerns responsible for the lack of Thunderbolt & upgradable RAM (allegedly) - Notebookcheck.net", "description": "The lack of Thunderbolt 3 on Microsoft's Surface Laptops has been a problem for years. Such expensive products are just expected to support this standard. Now a video surfaced where an alleged  Microsoft spokesperson names the reason for the lack of Thunderbo…", "url": "https://www.notebookcheck.net/Microsoft-Surface-Security-concerns-responsible-for-the-lack-of-Thunderbolt-upgradable-RAM-allegedly.463006.0.html", "urlToImage": null, "publishedAt": "2020-04-26T14:06:55Z", "content": "Microsoft has engineered some very exciting devices under the Surface brand in the last years. From the original hybrid tablet line Surface Pro to the Surface Book and the Surface Laptop: All of these Microsoft Surface devices have delivered quality designs w… [+1502 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The Evolution of Xbox Controller From Xbox To Xbox Series X - GamingBolt", "description": "The late 90s were a harrowing time. Fresh off the success of the PlayStation One, Sony were already making plans for the PlayStation 2 to also dominate the m...", "url": "https://www.youtube.com/watch?v=-xwBL3-WMJY", "urlToImage": null, "publishedAt": "2020-04-26T13:30:00Z", "content": "The late 90s were a harrowing time. Fresh off the success of the PlayStation One, Sony were already making plans for the PlayStation 2 to also dominate the market. The Nintendo 64 was at the end of its life cycle with the company shifting away from cartridges… [+500 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "James Peckham", "title": "The iPhone SE is great, but it just makes me want an iPhone SE Plus that bit more - TechRadar", "description": "Opinion: I don’t want a 4.7-inch phone in 2020", "url": "https://www.techradar.com/news/the-iphone-se-is-great-but-it-just-makes-me-want-an-iphone-se-plus-that-bit-more", "urlToImage": null, "publishedAt": "2020-04-26T13:00:00Z", "content": "Ive spent a lot of the last few weeks reporting on the iPhone SE from Apple, and while its a comfort to see the company embrace its cheapest iPhone ever, theres one thing I'm desperate for; a bigger screen.\r\nThe new iPhone SE sports the same 4.7-inch screen s… [+3434 chars]"}, {"source": {"id": null, "name": "Eurogamer.net"}, "author": "John Linneman", "title": "DF Retro takes on the epic Final Fantasy 7 saga - Eurogamer.net", "description": null, "url": "https://www.eurogamer.net/articles/digitalfoundry-2020-final-fantasy-7-retro", "urlToImage": null, "publishedAt": "2020-04-26T13:00:00Z", "content": "The recent release of Final Fantasy 7 Remake is the end of a long, long story - and the beginning of a new one. One of the most significant releases in the original PlayStation's library, FF7 redefined the JRPG with its combination of pre-rendered backgrounds… [+5015 chars]"}, {"source": {"id": null, "name": "Nintendolife.com"}, "author": "Nintendo Life", "title": "Retro-Inspired Racer 80's Overdrive Speeds Onto The Switch eShop Early Next Month - Nintendo Life", "description": "Clear up 7th May", "url": "http://www.nintendolife.com/news/2020/04/retro-inspired_racer_80s_overdrive_speeds_onto_the_switch_eshop_early_next_month", "urlToImage": null, "publishedAt": "2020-04-26T12:45:00Z", "content": "@Giygas_95 Fully agreed here! I'd even go so far as to say, that I don't care for a Switch version. This and games like OutRun really look impressive on the 3DS, with a great sense of speed. If you remove that, well, all you are left with an okay retro-arcade… [+1504 chars]"}, {"source": {"id": null, "name": "Eurogamer.net"}, "author": "Vikki Blake", "title": "Oh no - Nintendo has nerfed money-making bugs in Animal Crossing: New Horizons - Eurogamer.net", "description": null, "url": "https://www.eurogamer.net/articles/2020-04-26-oh-no-nintendo-has-nerfed-money-making-bugs-in-animal-crossing-new-horizons", "urlToImage": null, "publishedAt": "2020-04-26T12:41:00Z", "content": "Nintendo has been tinkering with the spawn rates of a number of our favourite money-making bugs, including Emperor and Peacock butterflies, Atlas moths, scorpions, and tarantulas.\r\nAs detailed by data miner @_Ninji (thanks, Polygon) - who has been correct abo… [+1724 chars]"}, {"source": {"id": null, "name": "Eurogamer.net"}, "author": "Vikki Blake", "title": "Help bring Wolfenstein: The Board Game to life with this Kickstarter campaign - Eurogamer.net", "description": null, "url": "https://www.eurogamer.net/articles/2020-04-26-help-bring-wolfenstein-the-board-game-to-life-with-this-kickstarter-campaign", "urlToImage": null, "publishedAt": "2020-04-26T12:01:00Z", "content": "A Kickstarter campaign to bring a Wolfenstein board game to life has generated over ten times its original goal.\r\nThe fundraiser for Wolfenstein: The Board Game - the campaign for which went live on 14th April, 2020, and has \" beta\" approval of both MachineGa… [+1739 chars]"}, {"source": {"id": null, "name": "Rockpapershotgun.com"}, "author": null, "title": "Riot looking for \"long-term solutions\" after devs report sexist harassment in Valorant - Rock Paper Shotgun", "description": "As Riot employees - including Valorant's own executive producer - report toxic abuse in-game, Riot promise \"long-term solutions\" against bad actors", "url": "https://www.rockpapershotgun.com/2020/04/26/riot-looking-for-long-term-solutions-after-devs-report-sexist-harassment-in-valorant/", "urlToImage": null, "publishedAt": "2020-04-26T11:59:00Z", "content": "A tough stance on cheaters, bots and key-resellers. In-depth training modes. For a traditionally inaccessible genre, Valorant seems to be trying its hardest to be as welcoming as possible – and now, that means making sure people can play nice on their battlef… [+2973 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Darren Allan", "title": "Windows 10 now has ads for Edge browser in its search box – is Microsoft going too far in pestering users? - TechRadar", "description": "Following adverts being run on Outlook.com, and the Start menu", "url": "https://www.techradar.com/news/windows-10-now-has-ads-for-edge-browser-in-its-search-box-is-microsoft-going-too-far-in-pestering-users", "urlToImage": null, "publishedAt": "2020-04-26T11:10:00Z", "content": "Windows 10 is now showing adverts within the search box which are attempting to persuade people to switch to Microsoft Edge, in yet another move to promote the revamped browser which runs the risk of starting to irritate people given how prevalent these ads a… [+2115 chars]"}, {"source": {"id": null, "name": "Motor1.com"}, "author": "Adrian Padeanu", "title": "Is This Really The New BMW 2 Series Coupe Without Camouflage? - Motor1 ", "description": "It appears to be a hot M Performance version with a surprisingly small-ish grille.", "url": "https://www.motor1.com/news/414821/bmw-2-series-spy-no-camo/", "urlToImage": null, "publishedAt": "2020-04-26T11:01:59Z", "content": "Our lazy Sunday is suddenly more interesting as a couple of intriguing spy shots have emerged on Instagram courtesy of wilcoblok. Its unclear at this moment where the images come from, but they appear to be showing the next-generation BMW 2 Series Coupe free … [+2255 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "TechRadar Team", "title": "7 PS4 games worth buying before the PSN Spring Sale ends - TechRadar", "description": "Our favorite deals from the latest PS4 sale", "url": "https://www.techradar.com/news/7-ps4-games-worth-buying-before-the-psn-spring-sale-ends", "urlToImage": null, "publishedAt": "2020-04-26T11:00:00Z", "content": "If you're a PS4 player stuck indoors during these very boring times, you've probably noticed that Sony has been running a Spring sale for the past few weeks. As tempting as it is to look at your pile of shame and decide not to buy something, there are a few d… [+4809 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "BBC News", "title": "Coronavirus: Minecraft virtual nightclub raises money for NHS - BBC News", "description": "With the nation urged to stay at home, a night out in a virtual club proves a big draw for three friends.", "url": "https://www.bbc.co.uk/news/av/uk-england-birmingham-52419775/coronavirus-minecraft-virtual-nightclub-raises-money-for-nhs", "urlToImage": null, "publishedAt": "2020-04-26T10:55:44Z", "content": null}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "David Nield", "title": "Facebook takes on Zoom with 50-way video calls in Messenger Rooms - TechRadar", "description": "Do you have that many friends?", "url": "https://www.techradar.com/news/facebook-takes-on-zoom-with-50-way-video-calls-in-messenger-rooms", "urlToImage": null, "publishedAt": "2020-04-26T10:30:00Z", "content": "Video calling software is hugely popular at the moment, for obvious reasons, with Zoom the main beneficiary. Now Facebook wants more of the video calling market, and has introduced a new tool called Messenger Rooms.\r\nAs Facebook explains in a blog post, Messe… [+1509 chars]"}, {"source": {"id": null, "name": "Diyphotography.net"}, "author": "https://www.facebook.com/johnaldredphoto/", "title": "DxOMark tests show problems with Samsung S20 Ultra cameras that software updates won't fix - DIYphotography", "description": "DxOMark recently tested the cameras in the new Samsung Galaxy S20 Ultra. Overall it did quite well, scoring 122, although they uncovered some fatal flaws that Samsung likely won’t be able to fix with mere software updates. They say it has the worst low-light …", "url": "https://www.diyphotography.net/dxomark-tests-show-problems-with-samsung-s20-ultra-cameras-that-software-updates-wont-fix/", "urlToImage": null, "publishedAt": "2020-04-26T10:21:48Z", "content": "DxOMark recently tested the cameras in the new Samsung Galaxy S20 Ultra. Overall it did quite well, scoring 122, although they uncovered some fatal flaws that Samsung likely won’t be able to fix with mere software updates. They say it has the worst low-light … [+2247 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "David Lumb", "title": "Motorola Edge Plus vs Samsung Galaxy S20 Plus vs iPhone 11 Pro Max - TechRadar India", "description": "Top smartphones, top prices", "url": "https://www.techradar.com/news/motorola-edge-plus-vs-samsung-galaxy-s20-plus-vs-iphone-11-pro-max", "urlToImage": null, "publishedAt": "2020-04-26T10:00:00Z", "content": "While rumors led us to expect a proper flagship from Motorola, we didnt anticipate that the Motorola Edge Plus would be so full-featured and impressive.\r\nThe Motorola Edge Plus is Motos first flagship smartphone in nearly half a decade, and with that it deser… [+8216 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Liam Martin", "title": "PS5 vs Xbox Series X: 'Exciting' Microsoft plans spell BIG trouble for PlayStation - Express", "description": "XBOX fans have every right to feel confident that the Series X will be a big improvement over the PS5.", "url": "https://www.express.co.uk/entertainment/gaming/1273827/Xbox-Series-X-PS5-Microsoft-PlayStation-next-gen-Phil-Spencer", "urlToImage": null, "publishedAt": "2020-04-26T09:57:00Z", "content": null}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Dion Dassanayake", "title": "PS4 exclusive heading to Xbox One and Nintendo Switch in May - Express", "description": "PS4 fans have been dealt a games blow with a former PlayStation exclusive heading to the Xbox One and Nintendo Switch next month.", "url": "https://www.express.co.uk/entertainment/gaming/1273558/PS4-exclusive-heading-to-Xbox-One-Nintendo-Switch-next-month", "urlToImage": null, "publishedAt": "2020-04-26T09:55:00Z", "content": "PS4 games list has been dealt a blow with an exclusive making the jump to the rival Xbox One and Nintendo Switch consoles next month. The PS4's incredible selection of exclusive games is arguably one of the biggest reasons Sony's current console has been such… [+1809 chars]"}, {"source": {"id": null, "name": "Notebookcheck.net"}, "author": "Sanjiv Sathiah", "title": "Former Apple designer reveals original sketches, other tidbits about genesis of Apple Watch - Notebookcheck.net", "description": "Apple Watch is by a long way the world’s most popular smartwatch and it is now five years old. To mark the occasion, one of the former lead designers for the Watch has taken to Twitter to reveal some behind the scenes details never before revealed.", "url": "https://www.notebookcheck.net/Former-Apple-designer-reveals-original-sketches-other-tidbits-about-genesis-of-Apple-Watch.462935.0.html", "urlToImage": null, "publishedAt": "2020-04-26T09:54:54Z", "content": "Smartwatches have been around for a number of years with companies like Sony leading the way. Sony, incredibly, even owns the name smartwatch among its trademarks although it now seems to have given up on making them anymore. It wasnt until the Apple Watch la… [+1177 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Aaron Brown", "title": "Time to ditch WhatsApp and Houseparty? Google just made a huge change to your video calls - Express.co.uk", "description": "GOOGLE has rolled out a colossal change to its video chat application, Google Duo, that promises to dramatically boost the video quality - even when making calls on sluggish home internet connections. Coupled with a number of new features added to the app, it…", "url": "https://www.express.co.uk/life-style/science-technology/1273369/Ditch-WhatsApp-Houseparty-Video-Calls-Google-Duo-Quality-Streaming-Slow-Internet-WiFi", "urlToImage": null, "publishedAt": "2020-04-26T09:43:00Z", "content": null}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Mark Wilson", "title": "Why a DJI Mavic Air 2 launch during a global lockdown wouldn't be as silly as it sounds - TechRadar", "description": "Drones don't have to be grounded by the pandemic", "url": "https://www.techradar.com/news/why-the-dji-mavic-air-2-launching-during-a-global-lockdown-isnt-as-silly-as-it-sounds", "urlToImage": null, "publishedAt": "2020-04-26T09:00:00Z", "content": "The DJI Mavic Air 2 is almost ready for take-off, according the latest leaks and rumors. But why might DJI be releasing a drone during a global pandemic that is keeping many of us at home, let alone able to head out with a new drone? The idea isn't quite as c… [+5713 chars]"}, {"source": {"id": null, "name": "Dexerto.com"}, "author": "Joe Craven", "title": "Awesome CoD cosplay perfectly recreates Black Ops 4's Ruin - Dexerto", "description": "The professional cosplayer shared their awesome interpretation of Donnie 'Ruin' Walsh on April 25.", "url": "https://www.dexerto.com/call-of-duty/awesome-cod-cosplay-perfectly-recreates-black-ops-4s-ruin-1358181", "urlToImage": null, "publishedAt": "2020-04-26T08:48:08Z", "content": "A professional cosplayer known as 'demateraliz' has shared his incredible interpretation of Donnie 'Ruin' Walsh, the gravity-slamming specialist from Black Ops 3 and 4. \r\nCall of Duty is not typically associated with excellent cosplaying, but the most recent … [+1459 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Aaron Brown", "title": "OnePlus 8 Pro review: OnePlus seriously raises the bar ...and the price - Express", "description": "ONEPLUS unveiled its all-singing, all-dancing OnePlus 8 Pro during an online-only event on April 14, 2020. How does the new flagship smartphone - the priciest one yet from the six-year-old company - stack up against rivals from more established players, like …", "url": "https://www.express.co.uk/life-style/science-technology/1273973/OnePlus-8-Pro-Review-UK-Price-Specs", "urlToImage": null, "publishedAt": "2020-04-26T08:36:57Z", "content": null}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Zak Doffman", "title": "Huawei Surprises Millions Of Users With Stunning Google Alternative - Forbes", "description": "Good news for Huawei users—not good news for Google.", "url": "https://www.forbes.com/sites/zakdoffman/2020/04/26/huawei-surprises-millions-of-users-with-stunning-google-alternative/", "urlToImage": null, "publishedAt": "2020-04-26T06:19:25Z", "content": "Sergei Karpukhin/TASS\r\nThe Google stakes for Huawei have never been higher. The company is clear that 2020 will be its toughest year yet. Its own New Years message described it as a battle for survival, and its first-quarter growth saw growth of just 1.4% com… [+4636 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Dion Dassanayake", "title": "Google’s latest Android update might stop you using your smartphone - Express.co.uk", "description": "ANDROID fans have just received a new update from Google which might actually help them to stop using their phones when they head to bed.", "url": "https://www.express.co.uk/life-style/science-technology/1273599/Google-latest-Android-update-stop-you-using-smartphone", "urlToImage": null, "publishedAt": "2020-04-26T06:01:00Z", "content": "Android users have seen Google push out a new update that brings with it a timely and helpful feature. Android is one of the most used pieces of software in the world, with the Google mobile OS installed on over 2.5billion devices. Such a huge userbase means … [+1666 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Dion Dassanayake", "title": "Time to ditch WhatsApp? Rival chat app gets vital feature fans have been waiting for - Express", "description": "WHATSAPP fans have been given a big reason to crossover after a chat app rival got a major feature first.", "url": "https://www.express.co.uk/life-style/science-technology/1273605/WhatsApp-rival-vital-chat-app-feature", "urlToImage": null, "publishedAt": "2020-04-26T05:02:24Z", "content": "The Viber self destructing message feature, which was previously only available in secret chats, can now be used in all one-on-one conversations.\r\nThe new Viber feature lets users set a timer ranging from a few seconds to a few days until the message gets del… [+452 chars]"}, {"source": {"id": null, "name": "Pistonheads.com"}, "author": "Matt Bird", "title": "BMW 340i (F30) manual | Spotted - Pistonheads.com", "description": "Craving the six-cylinder, manual drivetrain modest BMW saloons no longer get? Here's just the thing...", "url": "https://www.pistonheads.com/news/general/bmw-340i-f30-manual--spotted/42295", "urlToImage": null, "publishedAt": "2020-04-26T05:01:31Z", "content": "As a car buying nation, we British tend to be quite overt in our spec choices. Even with the smallest engines, we tend to plump for the big wheels, sportier trims and fancier options. Look at how popular the M Sport, S Line, AMG Line and R-Design models are o… [+3525 chars]"}, {"source": {"id": null, "name": "Autocar.co.uk"}, "author": null, "title": "Bringing up the rear: Top 10 rear-wheel steering cars - Autocar", "description": "Rear-wheel steering systems are once again in the spotlight, but the idea isn’t new. We pick 10 pioneers of the corner-taming technology", "url": "https://www.autocar.co.uk/car-news/features/bringing-rear-top-10-rear-wheel-steering-cars", "urlToImage": null, "publishedAt": "2020-04-26T05:00:00Z", "content": "It shouldnt come as a great surprise that one of the most hotly debated automotive chassis technologies originated in Japan, a nation whose residents appear to be born with a fascination for high-tech gadgets and gizmos.\r\nActive rear-wheel steering was introd… [+1138 chars]"}, {"source": {"id": null, "name": "Whatculture.com"}, "author": "James Weeds", "title": "WWE 2K New Video Game - What Can We Expect & How WWE Games Can Recover - WhatCulture", "description": "Who else jumped for joy at the recent confirmation of 2K21’s cancellation?", "url": "https://whatculture.com/gaming/wwe-2k-new-video-game-what-can-we-expect-how-wwe-games-can-recover", "urlToImage": null, "publishedAt": "2020-04-26T03:58:20Z", "content": "2K Games\r\nConfirming the cancellation of this years instalment in the WWE 2K series, 2K games are set to share details on the future of the franchise this Monday with the possible unveil of an alternative wrestling game.\r\nAfter a dreadful launch of WWE 2K20, … [+1149 chars]"}, {"source": {"id": null, "name": "Heavy.com"}, "author": "Jack Fennimore", "title": "Pokemon GO Investigating Illusions Step-by-Step Guide - Heavy.com", "description": "Here's a step-by-step guide for the Pokemon GO Investigating Illusions Special Research quest to coincide with Community Day April 2020.", "url": "https://heavy.com/games/2020/04/pokemon-go-investigating-illusions-community-day", "urlToImage": null, "publishedAt": "2020-04-26T03:58:00Z", "content": "Niantic\r\nCommunity Day: Play at Home Edition for Pokemon GO is going live in certain parts of the world right now.\r\nThat means players are starting to get their hands on the Special Research quest “Investigating Illusions.” You can access this quest through a… [+2345 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Desire Athow", "title": "This 4TB PCIe SSD can make your Windows laptop feel more like a MacBook Pro - TechRadar", "description": "Assuming you have a compatible laptop, that is", "url": "https://www.techradar.com/news/this-4tb-pcie-ssd-can-make-your-windows-laptop-feel-more-like-a-macbook-pro", "urlToImage": null, "publishedAt": "2020-04-26T03:00:00Z", "content": "The Apple MacBook Pro 16 still holds bragging rights when it comes to the maximum storage capacity available in a traditional portable laptop. \r\nApple uses a proprietary approach, plugging memory chips directly into the motherboard to reach a whopping 8TB of … [+1494 chars]"}, {"source": {"id": null, "name": "Nintendolife.com"}, "author": "Nintendo Life", "title": "Ty The Tasmanian Tiger 5 Could Happen, But Would Require \"A Much Bigger Budget\" - Nintendo Life", "description": "And development team", "url": "http://www.nintendolife.com/news/2020/04/ty_the_tasmanian_tiger_5_could_happen_but_would_require_a_much_bigger_budget", "urlToImage": null, "publishedAt": "2020-04-26T02:00:00Z", "content": "As we already know, Krome Studios would like to portTy The Tasmanian Tiger2 and 3 to the Nintendo Switch provided the original sells enough, but what are the chances of a brand new entry in the Aussie-made 3D platformer series happening?\r\nAccording to the cre… [+1075 chars]"}, {"source": {"id": null, "name": "Androidpit.com"}, "author": "Daniel Iglesias", "title": "The best new apps on the Google Play Store this week - AndroidPIT", "description": "This week, we're back again with five new Android apps released on the Google Play Store. There's something for everyone this week.", "url": "https://www.androidpit.com/apps-of-the-week-25-04-2020", "urlToImage": null, "publishedAt": "2020-04-25T21:00:00Z", "content": "As every week, with the help of our community, we offer you a list of applications that have just appeared on the Google Play Store. We hope that this will allow you to discover new apps and have fun. Unlike last week, there are plenty of games this week incl… [+3725 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Debbie White", "title": "China now ‘trying to steal US research’ on coronavirus even after its role in unleashing the pandemic - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11480928/china-steal-us-research-coronavirus-pandemic/", "urlToImage": null, "publishedAt": "2020-04-25T20:00:25Z", "content": "CHINA has been accused of trying to steal coronavirus research from US labs, hospitals and pharmaceutical firms, an investigation reveals.\r\nAnd it appears the regimes game plan is to beat the rest of the world in producing the first vaccine against the bug - … [+7115 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Fallout 76: Wastelanders Review - IGN", "description": "Fallout 76: Wastelanders reviewed by David Jagneaux on PlayStation 4 Pro. Also available on PC and Xbox One. \"With the Wastelanders update, Fallout 76 has ta...", "url": "https://www.youtube.com/watch?v=U-uDLErALu0", "urlToImage": null, "publishedAt": "2020-04-25T19:51:32Z", "content": "Fallout 76: Wastelanders reviewed by David Jagneaux on PlayStation 4 Pro. Also available on PC and Xbox One.\r\n\"With the Wastelanders update, Fallout 76 has taken a solid step in the right direction after its dire launch. New human NPCs bring a healthy dose of… [+633 chars]"}, {"source": {"id": null, "name": "Entertainmentdaily.co.uk"}, "author": "Entertainment Daily", "title": "Gogglebox's Pete: Prince William and Mark Wright 'punching above their weight' - Entertainment Daily", "description": "Viewers were amused by Pete's observation", "url": "https://www.entertainmentdaily.co.uk/tv/gogglebox-pete-prince-william-and-mark-wright-punching-above-their-weight/", "urlToImage": null, "publishedAt": "2020-04-25T16:42:55Z", "content": "Gogglebox viewers saw the funny side as Pete Sandiford compared the Duke and Duchess of Cambridge to Michelle Keegan and Mark Wright claiming both men were \"punching above their weight\".\r\nThe couch potato critic shared his thoughts as he watched a clip of the… [+2157 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "Samsung reveals another blockbuster 4K TV update for your television - India Gone Viral", "description": "Express. Home of the Daily and Sunday Express. SAMSUNG is back with even more updates for your TV and here's what's now available on your 4K television. PUBLISHED: PUBLISHED: 07:00, Sat, Apr 25, 2020", "url": "https://indiagoneviral.com/technology/2020/04/25/samsung-reveals-another-blockbuster-4k-tv-update-for-your-television/42259/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-25T16:05:05Z", "content": "Our goal has always been to deliver the best entertainment experiences to consumers and as people spend more time at home, we are more committed to that mission than ever, said Salek Brodsky, Vice President of Strategic Partnerships and Business Development f… [+659 chars]"}, {"source": {"id": null, "name": "Neowin.net"}, "author": "https://www.facebook.com/rich.woods.56", "title": "OnePlus 8 Pro review: A killer flagship - Neowin", "description": "The OnePlus 8 Pro is probably the best Android phone that you can buy right now, packing a 120Hz QHD OLED display, impressive camera improvements, and finally, 30W wireless charging,", "url": "https://www.neowin.net/news/oneplus-8-pro-review-a-killer-flagship/", "urlToImage": null, "publishedAt": "2020-04-25T16:02:00Z", "content": "When OnePlus came onto the scene in 2014 with the One, it promised a Flagship Killer. It delivered too, with a $349 Android device with top-end specs, an innovative design with different materials like bamboo, and fan-favorite Cyanogen building out the OS. Th… [+13724 chars]"}, {"source": {"id": null, "name": "Eurogamer.net"}, "author": "Wesley Yin-Poole", "title": "This stunning Minecraft city was created by a team of professional builders - Eurogamer.net", "description": null, "url": "https://www.eurogamer.net/articles/2020-04-25-this-stunning-minecraft-city-was-created-by-a-team-of-professional-builders", "urlToImage": null, "publishedAt": "2020-04-25T15:31:00Z", "content": "The Minecraft community is known for its incredible creations - but this stunning city was built by the pros.\r\nCity of Orario is an incredibly detailed 1500x1500 recreation of The Labyrinth City of Orario from the DanMachi anime. Its centrepiece is a massive … [+1151 chars]"}, {"source": {"id": null, "name": "Kotaku.com"}, "author": null, "title": "Battlefield V Will Get One Final Update in June - Kotaku UK", "description": "After the update players will earn Battlefield Currency or Company Coin for every week, which will let players unlock gear they might have missed.", "url": "https://kotaku.com/battlefield-v-will-get-one-final-update-in-june-1843066143", "urlToImage": null, "publishedAt": "2020-04-25T14:51:00Z", "content": "Battlefield developers Dice announced earlier this week that one final update is coming to Battlefield V in June, though they will continue to combat cheaters even after this last update.\r\nReleased in November 2018, Battlefield V took the popular series back … [+840 chars]"}, {"source": {"id": null, "name": "Eurogamer.net"}, "author": "Wesley Yin-Poole", "title": "Video game cheating is back in the headlines - Eurogamer.net", "description": null, "url": "https://www.eurogamer.net/articles/2020-04-25-video-game-cheating-is-back-in-the-headlines", "urlToImage": null, "publishedAt": "2020-04-25T14:04:00Z", "content": "Video game cheating has been around for as long as video games. But the eternal issue has once again hit the headlines - and developers are struggling to cope.\r\nCall of Duty: Modern Warfare, Destiny 2, PlayerUnknown's Battlegrounds and Valorant have all been … [+7112 chars]"}, {"source": {"id": null, "name": "Imore.com"}, "author": "Stephen Warwick", "title": "Contact tracing: A guide to one possible pandemic solution - iMore", "description": "What is contact tracing? How does it work? And should I be concerned about my privacy? We answer all of this and more in our deep dive into one possible coronavirus pandemic solution.", "url": "https://www.imore.com/contact-tracing-guide-one-possible-pandemic-solution", "urlToImage": null, "publishedAt": "2020-04-25T13:59:22Z", "content": "With the coronavirus pandemic perhaps showing signs of letting up in some countries throughout Europe and beyond, you might have heard a good deal of conversation around contact tracing. Particularly, in the context of reducing lockdown and stay at home measu… [+11686 chars]"}, {"source": {"id": null, "name": "Eurogamer.net"}, "author": "Wesley Yin-Poole", "title": "The curious case of Call of Duty: Warzone crossplay - Eurogamer.net", "description": null, "url": "https://www.eurogamer.net/articles/2020-04-25-the-curious-case-of-call-of-duty-warzone-crossplay", "urlToImage": null, "publishedAt": "2020-04-25T12:52:00Z", "content": "Last week, Eurogamer revealed how Call of Duty players on console were disabling crossplay in order to escape cheaters on PC. But it turns out not all console players have this option.\r\nMuch was made of Call of Duty's new crossplay feature when it was confirm… [+4114 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Simon Parkin", "title": "Streets of Rage 4 review – the return of the beat 'em up - The Guardian", "description": "This lovingly created sequel offers all the action and fun of a 90s arcade game", "url": "https://www.theguardian.com/games/2020/apr/25/streets-of-rage-4-review-the-return-of-the-beat-em-up", "urlToImage": null, "publishedAt": "2020-04-25T12:04:06Z", "content": "In the Netflix animated series Hi Score Girl, a romantic comedy set in early-90s Japan, Haruo Yaguchi, a low-achieving high-school loner is whiling away his time in the local video game arcades when he meets Akira Ono, a popular wunderkind from a wealthy fami… [+4209 chars]"}, {"source": {"id": null, "name": "Rockpapershotgun.com"}, "author": null, "title": "A demonic face-off from Doom's past is sealed inside Doom Eternal's soundtrack - Rock Paper Shotgun", "description": "A never-ending demonic battle sealed within the very waveforms of an audio track? That's pretty damn metal, Doom Eternal.", "url": "https://www.rockpapershotgun.com/2020/04/25/a-demonic-face-off-from-dooms-past-is-sealed-inside-doom-eternals-soundtrack/", "urlToImage": null, "publishedAt": "2020-04-25T10:37:00Z", "content": "There’s more than a bit of metal in Doom Eternal. The rhythmic bass blasts of super-shotguns, tinny chaingun power solos, verses punctuated by gory breaks and technical fingerwork. It’s only natural that Doom’s soundtrack contains a little bit of hell in kind… [+1898 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Matt Hanson", "title": "Smartphones are a bad deal – let's hope laptops don't go the same way - TechRadar", "description": "Opinion: forced obsolescence is a menace", "url": "https://www.techradar.com/news/smartphones-are-a-bad-deal-lets-hope-laptops-dont-go-the-same-way", "urlToImage": null, "publishedAt": "2020-04-25T10:00:00Z", "content": "Imagine buying a new laptop, only to find that three years later Microsoft/Apple stopped offering software updates for it, effectively forcing you to upgrade in order to ensure you had a machine that was secure and ran smoothly.\r\nAnd imagine that, during thos… [+5094 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Jeff Parsons", "title": "Apple Magic Keyboard review: the ultimate iPad Pro accessory - Metro.co.uk", "description": "This iPad Pro peripheral finally bridges the gap between tablet and laptop", "url": "https://metro.co.uk/2020/04/25/apple-magic-keyboard-review-crucial-ipad-pro-accessory-12588777/", "urlToImage": null, "publishedAt": "2020-04-25T09:53:53Z", "content": "The Magic Keyboard turns the iPad Pro into a floating display (Apple)\r\nFor the last few iPad generations Apple has been pushing to turn the tablet into more of a productivity device akin to your laptop.\r\nHardware additions like the Apple Pencil and Smart Keyb… [+5263 chars]"}, {"source": {"id": null, "name": "Fossbytes.com"}, "author": "Sarvottam Kumar", "title": "After Ubuntu 20.04 Release, Ubuntu 20.10 Is Codenamed 'Groovy Gorilla' - Fossbytes", "description": "A day after Ubuntu 20.04 release, the Ubuntu development team is gearing up to make the next Ubuntu 20.10 groovier with Gorilla. 'Groovy Gorilla' is now the codename chosen for Ubuntu 20.10 which will release on October 22, 2020.", "url": "https://fossbytes.com/ubuntu-20-10-groovy-gorilla-codename/", "urlToImage": null, "publishedAt": "2020-04-25T09:35:00Z", "content": "A day after the Ubuntu 20.04 release, the Ubuntu development team is gearing up to make the next Ubuntu 20.10 groovier with “Gorilla.”\r\nFollowing the traditional method of codenaming each version, ‘Groovy Gorilla’ is now the codename for the Ubuntu 20.10. Wel… [+1750 chars]"}, {"source": {"id": null, "name": "Trueachievements.com"}, "author": "Heidi Nicholas", "title": "Sci-fi adventure Deliver Us The Moon joins Xbox Game Pass and Game Pass for PC today - TrueAchievements", "description": "Deliver Us The Moon is a sci-fi action adventure title which draws inspiration from movies such as Interstellar, and which joins the Xbox Game Pass and Xbox Game Pass for PC services today as a day one addition.", "url": "https://www.trueachievements.com/n41593/deliver-us-the-moon", "urlToImage": null, "publishedAt": "2020-04-25T07:59:53Z", "content": "The Xbox team has been busy lately: just yesterday, they surprise-dropped the announcement that Red Dead Redemption 2 will join Xbox Game Pass in May. Before that, they announced new titles for Xbox Game Pass, along with several new titles for Xbox Game Pass … [+1728 chars]"}, {"source": {"id": null, "name": "Digitalcameraworld.com"}, "author": "Louise Carey", "title": "iPhone 12: What we know so far about September 2020 iPhone release - Digital Camera World", "description": "The iPhone 12 is set to be announced in September, but what are we expecting from the latest iPhone generation?", "url": "https://www.digitalcameraworld.com/news/iphone-12-what-we-know-so-far-about-september-2020-iphone-release", "urlToImage": null, "publishedAt": "2020-04-25T07:02:00Z", "content": "With only a matter of months to go until Apple's traditional September iPhone launch event, the internet is already abuzz with rumors and speculation on what the iPhone 12 release is going to look like. With the 2019 iPhone 11 release leaving some feeling und… [+6096 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Dion Dassanayake", "title": "Windows 10 update could DELETE your files and bricks PCs in fresh blow to Microsoft users - Express", "description": "WINDOWS 10 users have been dealt yet another download blow, with a new Microsoft update capable of deleting user files and bricking your PC.", "url": "https://www.express.co.uk/life-style/science-technology/1273596/Windows-10-update-deletes-files-bricks-PCs-Microsoft", "urlToImage": null, "publishedAt": "2020-04-25T06:06:53Z", "content": "And another posted: \"My system automatically updated on the 19th of April. I lost some important word files of my university. And a folder.\r\n\"I have looked on the temporary folders and I have tried to uninstall the update but they do not appear\".\r\nWindows Lat… [+612 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Aaron Brown", "title": "Netflix solves a huge headache for Android users, but iPhone loses out on awesome update - Express", "description": "NETFLIX has solved one of the biggest pains when watching shows or movies on your Android smartphone or tablet. But despite many iPhone and iPad owners suffering the same headache ...there's no sign of a fix. Here's everything you need to know about the new f…", "url": "https://www.express.co.uk/life-style/science-technology/1273343/Netflix-Update-Solve-Headache-Android-No-iPhone-Users", "urlToImage": null, "publishedAt": "2020-04-25T06:06:34Z", "content": "Of course, it's still possible that you could drop your phone and somehow accidentally manage to hit the unlock button two times in quick succession, followed by the pause button – but that's much less likely than the single-tap needed to wreak havoc beforeha… [+613 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "", "title": "Should I buy a Nintendo Switch for my kids in lockdown? - The Guardian", "description": "Our two 10-year-olds are asking for new games – but I’m wondering if there’s a less costly alternative", "url": "https://www.theguardian.com/money/2020/apr/25/buy-nintendo-switch-kids-lockdown-games", "urlToImage": null, "publishedAt": "2020-04-25T06:04:02Z", "content": "Every week a Guardian Money reader submits a question, and its up to you to help him or her out a selection of the best answers will appear in next Saturdays paper.\r\nFive weeks into lockdown and our two 10-year-olds are badgering us to buy some new electronic… [+301 chars]"}, {"source": {"id": null, "name": "Pistonheads.com"}, "author": "Mike Duff", "title": "Rolls-Royce Silver Seraph | The Brave Pill - Pistonheads.com", "description": "In terms of miles covered, could this be the highest Roller?", "url": "https://www.pistonheads.com/news/general/rolls-royce-silver-seraph--the-brave-pill/42296", "urlToImage": null, "publishedAt": "2020-04-25T05:03:51Z", "content": "There is no shortage of Rolls-Royces with low mileages out there, but that doesn't mean they are better prospects than the ones that have lived life a little. And here's one that has lived life a lot - a Silver Seraph that has managed to rack up the impressiv… [+7030 chars]"}, {"source": {"id": null, "name": "Inews.co.uk"}, "author": "Alex Nelson", "title": "Travis Scott Fortnite event: what time live concerts are, how to get the new skin and Astronomical challenges explained - inews", "description": "Astronomical is 'a one of a kind musical journey featuring Travis Scott'", "url": "https://inews.co.uk/culture/gaming/travis-scott-fortnite-event-concert-live-when-time-uk-new-skin-astronomical-challenges-update-explained-2544889", "urlToImage": null, "publishedAt": "2020-04-24T17:11:27Z", "content": "Astronomical is 'a one of a kind musical journey featuring Travis Scott'\r\nSaturday, 25th April 2020, 8:48 am\r\nUpdated Saturday, 25th April 2020, 1:43 pm\r\nThe latest crossover event to come to Fortnite has been revealed, and includes another huge live concert … [+3117 chars]"}]}