{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Theguardian.com"}, "author": "Jim Waterson", "title": "Radio 4's Aasmah Mir quits amid rumours of Times Radio role - The Guardian", "description": "Saturday Live presenter may be in line for position at rival station, according to insiders", "url": "https://www.theguardian.com/media/2020/apr/25/radio-4-aasmah-mir-quits-amid-rumours-of-times-radio-role", "urlToImage": null, "publishedAt": "2020-04-25T15:57:58Z", "content": "The broadcaster Aasmah Mir has quit the BBC and is understood to be joining Times Radio, as the new station prepares to launch in a bid to challenge Radio 4s dominance.\r\nMir confirmed this weekends edition of Saturday Live on BBC Radio 4, which she co-hosts w… [+3680 chars]"}, {"source": {"id": null, "name": "Eurogamer.net"}, "author": "Wesley Yin-Poole", "title": "This stunning Minecraft city was created by a team of professional builders - Eurogamer.net", "description": null, "url": "https://www.eurogamer.net/articles/2020-04-25-this-stunning-minecraft-city-was-created-by-a-team-of-professional-builders", "urlToImage": null, "publishedAt": "2020-04-25T15:31:00Z", "content": "The Minecraft community is known for its incredible creations - but this stunning city was built by the pros.\r\nCity of Orario is an incredibly detailed 1500x1500 recreation of The Labyrinth City of Orario from the DanMachi anime. Its centrepiece is a massive … [+1151 chars]"}, {"source": {"id": null, "name": "Liverpoolecho.co.uk"}, "author": "Jonathan Humphries", "title": "More misery for Liverpool as coronavirus deaths pass 300 after day of hope - Liverpool Echo", "description": "Full breakdown as Merseyside regions pass several grim milestones", "url": "https://www.liverpoolecho.co.uk/news/liverpool-news/more-misery-liverpool-coronavirus-deaths-18150578", "urlToImage": null, "publishedAt": "2020-04-25T15:08:55Z", "content": "The number of deaths from coronavirus in Liverpool's hospitals has exceeded 300 for the first time - marking a setback the day after deaths dropped markedly.\r\nWhile Friday saw one death noted across the city's hospital trusts, Saturday's figures showed 24 add… [+3045 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "OnePlus 8 Pro vs Samsung Galaxy S20 Plus: Who wins? - India Gone Viral", "description": "The OnePlus 8 Pro and Samsung Galaxy S20 Plus are key smartphones for these two industry players. On the one hand, OnePlus is making a firm play for the flagship market, throwing its best technology i", "url": "https://indiagoneviral.com/technology/2020/04/25/oneplus-8-pro-vs-samsung-galaxy-s20-plus-who-wins/42191/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-25T14:06:28Z", "content": "The OnePlus 8 Pro and Samsung Galaxy S20 Plus are key smartphones for these two industry players. On the one hand, OnePlus is making a firm play for the flagship market, throwing its best technology into its 8 Pro model, with a somewhat controversially higher… [+14740 chars]"}, {"source": {"id": null, "name": "Eurogamer.net"}, "author": "Wesley Yin-Poole", "title": "Video game cheating is back in the headlines - Eurogamer.net", "description": null, "url": "https://www.eurogamer.net/articles/2020-04-25-video-game-cheating-is-back-in-the-headlines", "urlToImage": null, "publishedAt": "2020-04-25T14:04:00Z", "content": "Video game cheating has been around for as long as video games. But the eternal issue has once again hit the headlines - and developers are struggling to cope.\r\nCall of Duty: Modern Warfare, Destiny 2, PlayerUnknown's Battlegrounds and Valorant have all been … [+7112 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Steventon listed railway bridge saved from demolition - BBC News", "description": "The 19th Century bridge was threatened due to the upgrade of the Great Western Mainline.", "url": "https://www.bbc.co.uk/news/uk-england-oxfordshire-52425866", "urlToImage": null, "publishedAt": "2020-04-25T13:34:08Z", "content": "Image copyrightSteve DanielsImage caption\r\n Steventon Bridge is thought to have been built in 1839 by Isambard Kingdom Brunel\r\nA Grade ll listed railway bridge has been saved from demolition after a campaign by villagers.\r\nThe span, at Steventon, Oxfordshire,… [+1395 chars]"}, {"source": {"id": null, "name": "Eurogamer.net"}, "author": "Wesley Yin-Poole", "title": "The curious case of Call of Duty: Warzone crossplay - Eurogamer.net", "description": null, "url": "https://www.eurogamer.net/articles/2020-04-25-the-curious-case-of-call-of-duty-warzone-crossplay", "urlToImage": null, "publishedAt": "2020-04-25T12:52:00Z", "content": "Last week, Eurogamer revealed how Call of Duty players on console were disabling crossplay in order to escape cheaters on PC. But it turns out not all console players have this option.\r\nMuch was made of Call of Duty's new crossplay feature when it was confirm… [+4114 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Simon Parkin", "title": "Streets of Rage 4 review – the return of the beat 'em up - The Guardian", "description": "This lovingly created sequel offers all the action and fun of a 90s arcade game", "url": "https://www.theguardian.com/games/2020/apr/25/streets-of-rage-4-review-the-return-of-the-beat-em-up", "urlToImage": null, "publishedAt": "2020-04-25T12:04:06Z", "content": "In the Netflix animated series Hi Score Girl, a romantic comedy set in early-90s Japan, Haruo Yaguchi, a low-achieving high-school loner is whiling away his time in the local video game arcades when he meets Akira Ono, a popular wunderkind from a wealthy fami… [+4209 chars]"}, {"source": {"id": null, "name": "Whatculture.com"}, "author": "Chris Littlechild", "title": "10 Ridiculous Excuses For Failed Video Games - WhatCulture", "description": "From Lawbreakers to Duke Nukem Forever, check out these games' feeble excuses for their failures!", "url": "https://whatculture.com/gaming/10-ridiculous-excuses-for-failed-video-games", "urlToImage": null, "publishedAt": "2020-04-25T11:11:46Z", "content": "The video\r\ngame industry can be a harsh mistress. In recent years, developers have been\r\nincreasingly inclined towards remasters and remakes, banking on gamers\r\nnostalgia with heavy-hitters like Final Fantasy VII Remake. Why are they doing\r\nthis? Well, the al… [+1913 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "13 Changes We Need To See in Animal Crossing New Horizons - ANIMAL CROSSING NEW HORIZONS GAMEPLAY - Eurogamer", "description": "We love Animal Crossing: New Horizons here at Eurogamer, but there are some changes we'd like to see to the game. Our own Animal Crossing: New Horizons gamep...", "url": "https://www.youtube.com/watch?v=5B4uDpzf9Dc", "urlToImage": null, "publishedAt": "2020-04-25T11:00:02Z", "content": null}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By James Gant For Mailonline", "title": "Is there any science behind two-metre social distancing rule…? Government adviser says not - Daily Mail", "description": "Robert Dingwall (pictured) from the New and Emerging Respiratory Virus Threats Advisory Group (Nervtag) said the rule being used in Britain is not supported by scientific evidence.", "url": "https://www.dailymail.co.uk/news/article-8256109/Social-distancing-two-metres-apart-based-figure-says-government-adviser.html", "urlToImage": null, "publishedAt": "2020-04-25T10:28:33Z", "content": "Social distancing orders to keep two metres apart to stop the spread of coronavirus is based on a made up figure, a government adviser has warned.\r\nRobert Dingwall from the New and Emerging Respiratory Virus Threats Advisory Group (Nervtag) said the rule was … [+3466 chars]"}, {"source": {"id": null, "name": "Dexerto.com"}, "author": "Andy Williams", "title": "Calls for Alinity to be banned on Twitch following livestream accident - Dexerto", "description": "Twitch star Alinity Divine has found herself in the public spotlight yet again, after a slip-up on steam.", "url": "https://www.dexerto.com/entertainment/calls-for-alinity-to-be-banned-on-twitch-following-livestream-accident-1357732", "urlToImage": null, "publishedAt": "2020-04-25T10:05:07Z", "content": "Twitch streamer Natalia ‘Alinity’ Mogollon has found herself at the center of controversy again, as calls for her to be banned from the platform have spread on social media after her April 24 livestream.\r\nThis follows her previous high-profile controversy, wh… [+2675 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Matt Hanson", "title": "Smartphones are a bad deal – let's hope laptops don't go the same way - TechRadar", "description": "Opinion: forced obsolescence is a menace", "url": "https://www.techradar.com/news/smartphones-are-a-bad-deal-lets-hope-laptops-dont-go-the-same-way", "urlToImage": null, "publishedAt": "2020-04-25T10:00:00Z", "content": "Imagine buying a new laptop, only to find that three years later Microsoft/Apple stopped offering software updates for it, effectively forcing you to upgrade in order to ensure you had a machine that was secure and ran smoothly.\r\nAnd imagine that, during thos… [+5094 chars]"}, {"source": {"id": null, "name": "Dailyrecord.co.uk"}, "author": "Mark McDougall", "title": "Celtic and Rangers stars get FIFA 20 boost as duo are rewarded with high-rated cards - Daily Record", "description": "Ianis Hagi and Moi Elyounoussi have both been given big boosts by the EA game.", "url": "https://www.dailyrecord.co.uk/sport/football/football-news/celtic-rangers-stars-fifa-20-21924906", "urlToImage": null, "publishedAt": "2020-04-25T09:16:10Z", "content": "When it comes to FIFA Ultimate Team, there's rarely a time where players of the game will create a squad built with Scottish Premiership players. \r\n It wouldn't really be possible to go up against the best players on the game who have the top-rated cards but … [+824 chars]"}, {"source": {"id": null, "name": "Androidcentral.com"}, "author": "Stephen Warwick", "title": "EU states 'being completely held hostage by Google and Apple' says official - Android Central", "description": "Apple and Google have rebuffed calls from France and Germany to support their contact tracing apps, which use centralized data containing user information.", "url": "https://www.androidcentral.com/eu-states-being-completely-held-hostage-google-and-apple-says-official", "urlToImage": null, "publishedAt": "2020-04-25T09:10:59Z", "content": "An EU official has said that Apple and Google are holding EU states hostage after they rebuffed further calls to support contact tracing solutions offered by France and Germany.\r\nAs Reuters reports:\r\nA standoff between the two largest nations in the European … [+2171 chars]"}, {"source": {"id": null, "name": "Nintendolife.com"}, "author": "Nintendo Life", "title": "Talking Point: What Are You Playing This Weekend? (April 25th) - Nintendo Life", "description": "Here are our picks, but what are yours?", "url": "http://www.nintendolife.com/news/2020/04/talking_point_what_are_you_playing_this_weekend_april_25th", "urlToImage": null, "publishedAt": "2020-04-25T09:00:00Z", "content": "Yet another week has passed by, this time with the return of Crazy Redd in Animal Crossing, a welcome Switch eShop update and concerning reports of Nintendo Account hacks - make sure to secure yours! - but it's finally time to wind down for a couple of days.\r… [+3349 chars]"}, {"source": {"id": null, "name": "Eurogamer.net"}, "author": "Wesley Yin-Poole", "title": "Final Fantasy 7 Remake save editor makes Red XIII briefly playable - Eurogamer.net", "description": null, "url": "https://www.eurogamer.net/articles/2020-04-25-final-fantasy-7-remake-save-editor-makes-red-xiii-briefly-playable", "urlToImage": null, "publishedAt": "2020-04-25T08:48:00Z", "content": "Many Final Fantasy 7 fans were disappointed to learn key character Red XIII is not playable in the Final Fantasy 7 Remake, despite being one of the stars of the original game. But it turns out he is playable - briefly - via save editing.\r\nFinal Fantasy 7's ic… [+1581 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Aaron Brown", "title": "Google Chrome rival brings a feature social media fans will adore in latest update - Express", "description": "OPERA has rolled out support for a handy new feature that should appeal to social media obsessives. Here's everything you need to know.", "url": "https://www.express.co.uk/life-style/science-technology/1273390/Google-Chrome-Rival-Opera-Social-Media-Instagram-Fans-Update-New-Feature", "urlToImage": null, "publishedAt": "2020-04-25T07:03:29Z", "content": null}, {"source": {"id": null, "name": "Digitalcameraworld.com"}, "author": "Louise Carey", "title": "iPhone 12: What we know so far about September 2020 iPhone release - Digital Camera World", "description": "The iPhone 12 is set to be announced in September, but what are we expecting from the latest iPhone generation?", "url": "https://www.digitalcameraworld.com/news/iphone-12-what-we-know-so-far-about-september-2020-iphone-release", "urlToImage": null, "publishedAt": "2020-04-25T07:02:00Z", "content": "With only a matter of months to go until Apple's traditional September iPhone launch event, the internet is already abuzz with rumors and speculation on what the iPhone 12 release is going to look like. With the 2019 iPhone 11 release leaving some feeling und… [+6204 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Aaron Brown", "title": "WhatsApp update DOUBLES the maximum number of people in a video call - Express", "description": "WHATSAPP has expanded the maximum number of people who can take part in a video call at the same time - doubling the previous limit of four simultaneous callers. Just as before, these video calls will be end-to-end encrypted.", "url": "https://www.express.co.uk/life-style/science-technology/1273575/WhatsApp-Maximum-Number-People-Video-Call-Double-Limit-Update-iPhone-Android", "urlToImage": null, "publishedAt": "2020-04-25T06:42:31Z", "content": null}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Dion Dassanayake", "title": "Windows 10 update could DELETE your files and bricks PCs in fresh blow to Microsoft users - Express", "description": "WINDOWS 10 users have been dealt yet another download blow, with a new Microsoft update capable of deleting user files and bricking your PC.", "url": "https://www.express.co.uk/life-style/science-technology/1273596/Windows-10-update-deletes-files-bricks-PCs-Microsoft", "urlToImage": null, "publishedAt": "2020-04-25T06:06:53Z", "content": "And another posted: \"My system automatically updated on the 19th of April. I lost some important word files of my university. And a folder.\r\n\"I have looked on the temporary folders and I have tried to uninstall the update but they do not appear\".\r\nWindows Lat… [+612 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Aaron Brown", "title": "Netflix solves a huge headache for Android users, but iPhone loses out on awesome update - Express", "description": "NETFLIX has solved one of the biggest pains when watching shows or movies on your Android smartphone or tablet. But despite many iPhone and iPad owners suffering the same headache ...there's no sign of a fix. Here's everything you need to know about the new f…", "url": "https://www.express.co.uk/life-style/science-technology/1273343/Netflix-Update-Solve-Headache-Android-No-iPhone-Users", "urlToImage": null, "publishedAt": "2020-04-25T06:06:34Z", "content": "Of course, it's still possible that you could drop your phone and somehow accidentally manage to hit the unlock button two times in quick succession, followed by the pause button – but that's much less likely than the single-tap needed to wreak havoc beforeha… [+613 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "", "title": "Should I buy a Nintendo Switch for my kids in lockdown? - The Guardian", "description": "Our two 10-year-olds are asking for new games – but I’m wondering if there’s a less costly alternative", "url": "https://www.theguardian.com/money/2020/apr/25/buy-nintendo-switch-kids-lockdown-games", "urlToImage": null, "publishedAt": "2020-04-25T06:04:02Z", "content": "Every week a Guardian Money reader submits a question, and its up to you to help him or her out a selection of the best answers will appear in next Saturdays paper.\r\nFive weeks into lockdown and our two 10-year-olds are badgering us to buy some new electronic… [+301 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "David Snelling", "title": "Samsung reveals another blockbuster 4K TV update for your television - Express", "description": "SAMSUNG is back with even more updates for your TV and here's what's now available on your 4K television.", "url": "https://www.express.co.uk/life-style/science-technology/1273517/Samsung-4K-TV-update-Apple-Music-app", "urlToImage": null, "publishedAt": "2020-04-25T06:01:07Z", "content": "“Our goal has always been to deliver the best entertainment experiences to consumers – and as people spend more time at home, we are more committed to that mission than ever,” said Salek Brodsky, Vice President of Strategic Partnerships and Business Developme… [+665 chars]"}, {"source": {"id": null, "name": "Pistonheads.com"}, "author": "Mike Duff", "title": "Rolls-Royce Silver Seraph | The Brave Pill - Pistonheads.com", "description": "In terms of miles covered, could this be the highest Roller?", "url": "https://www.pistonheads.com/news/general/rolls-royce-silver-seraph--the-brave-pill/42296", "urlToImage": null, "publishedAt": "2020-04-25T05:03:51Z", "content": "There is no shortage of Rolls-Royces with low mileages out there, but that doesn't mean they are better prospects than the ones that have lived life a little. And here's one that has lived life a lot - a Silver Seraph that has managed to rack up the impressiv… [+7030 chars]"}, {"source": {"id": null, "name": "Futuregamereleases.com"}, "author": "Dejan Kacurov", "title": "Pokemon Go Free Promo Code That you Can Claim Until April 26 - Future Game Releases", "description": "Trainers, Niantic and Pokemon Go are generous again and they've shared a new free promo code, which can be used to claim free items. Niantic shared the 13-characters code on their official Twitter acc", "url": "https://www.futuregamereleases.com/2020/04/pokemon-go-free-promo-code-that-you-can-claim-until-april-26/", "urlToImage": null, "publishedAt": "2020-04-25T01:02:29Z", "content": "Trainers, Niantic and Pokemon Go are generous again and they’ve shared a new free promo code, which can be used to claim free items.\r\nNiantic shared the 13-characters code on their official Twitter account. This code can be claimed online or in-app (android u… [+419 chars]"}, {"source": {"id": null, "name": "Ubergizmo.com"}, "author": "Tyler Lee", "title": "Samsung’s Smartwatches Get A New Blood Pressure Monitoring App - Ubergizmo", "description": "Our smartwatches are getting better at what they do, where they can monitor more than just our daily activities like our steps taken, calories burnt, and so on. For example, the Apple Watch comes with an ECG monitoring tool that can alert the wearer if there …", "url": "https://www.ubergizmo.com/2020/04/samsung-smartwatch-blood-pressure-monitor/", "urlToImage": null, "publishedAt": "2020-04-25T00:42:49Z", "content": "Our smartwatches are getting better at what they do, where they can monitor more than just our daily activities like our steps taken, calories burnt, and so on. For example, the Apple Watch comes with an ECG monitoring tool that can alert the wearer if there … [+1254 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "GameCentral", "title": "Reason and irrationality in the choice of console purchases - Metro.co.uk", "description": "A reader is surprised to find people choosing between PS5 and Xbox Series X already, and examines the psychology of their decisions.", "url": "https://metro.co.uk/2020/04/25/undivided-loyalties-reason-irrationality-choice-console-purchases-readers-feature-12607795/", "urlToImage": null, "publishedAt": "2020-04-25T00:36:33Z", "content": "How do you choose yours? (pic: Sony)\r\nA reader is surprised to find people choosing between PS5 and Xbox Series X already, and examines the psychology of their decisions.\r\nMy favourite games are made by Nintendo, the flagship Mario and Zelda titles in particu… [+4815 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Anthony Spadafora", "title": "Ubuntu 20.04 adds VPN and support for a key Windows 10 feature - TechRadar", "description": "Latest Ubuntu release includes WireGuard and exFAT support", "url": "https://www.techradar.com/news/ubuntu-2004-adds-vpn-and-support-for-a-key-windows-10-feature", "urlToImage": null, "publishedAt": "2020-04-24T21:40:00Z", "content": "Canonical has released the latest version of its Ubuntu Linux distribution which offers a number of exciting new features designed to improve performance and security.\r\nUbuntu 20.04, aka Focal Fossa, is based on the Linux 5.4 kernel and this long-term-support… [+1714 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Jonathan Chadwick For Mailonline", "title": "Colour paint technology cools buildings by reflecting the sun - Daily Mail", "description": "New colour paint designed to cool buildings by reflecting the sun could become an eco-friendly alternative to air conditioners, US materials scientists report.", "url": "https://www.dailymail.co.uk/sciencetech/article-8254793/Colour-paint-technology-cools-buildings-reflecting-sun.html", "urlToImage": null, "publishedAt": "2020-04-24T20:46:33Z", "content": "A new form of doubled-layered coloured paint designed to cool buildings by reflecting the sun could become an eco-friendly alternative to air conditioners.\r\nUS materials scientists say their array of coloured multi-layered paints can dramatically cool sun-bla… [+4159 chars]"}, {"source": {"id": null, "name": "Digitalspy.com"}, "author": "Chris Edwards", "title": "Nintendo addresses major security breach - digitalspy.com", "description": "There have been reported incidents of unauthorised access to user accounts.", "url": "https://www.digitalspy.com/tech/a32270793/nintendo-security-breach/", "urlToImage": null, "publishedAt": "2020-04-24T20:38:00Z", "content": "Nintendo has addressed a major security breach as it encourages users to take new security steps. \r\nIn a statement on its official website, the gaming company said it is continuing to investigate recent incidents of unauthorised access to Nintendo Accounts, b… [+1827 chars]"}, {"source": {"id": null, "name": "Playstationlifestyle.net"}, "author": null, "title": "Tequila Works CEO Impressed by DualSense Controller, Including Reportedly ‘Biometric Data Detection, Fingerprint Recognition’ - PlayStation LifeStyle", "description": "The Tequila Works CEO Raúl Rubio seems impressed by the DualSense controller features, particularly with regards to the sensory-centric upgrades. The interview may have also leaked unknown features like DualSense biometrics and fingerprint recognition.", "url": "https://www.playstationlifestyle.net/2020/04/24/tequila-works-ceo-dualsense-controller-features/", "urlToImage": null, "publishedAt": "2020-04-24T19:30:00Z", "content": "Tequila Works CEO Raúl Rubio has voiced his impressions with regards to next-gen hardware. The CEO most notably seems thrilled about PlayStation 5s recently unveiled DualSense controller. As far as Rubio is concerned, features such as haptic feedback and the … [+1969 chars]"}, {"source": {"id": null, "name": "Rockpapershotgun.com"}, "author": null, "title": "This Minecraft map attempts to simulate social distancing during a pandemic - Rock Paper Shotgun", "description": "Blockdown Simulator has you take on the role of a nurse or a spectator as you cure villagers of a zombie pandemic.", "url": "https://www.rockpapershotgun.com/2020/04/24/this-minecraft-map-attempts-to-simulate-social-distancing-during-a-pandemic/", "urlToImage": null, "publishedAt": "2020-04-24T19:24:00Z", "content": "Are all you kids out there still playing Minecraft? Let’s hope so, because some folks have made a Minecraft map to teach you younguns about how social distancing and healthcare services work together to beat a pandemic. It sounds a bit corny off the cuff but … [+2478 chars]"}, {"source": {"id": null, "name": "Pushsquare.com"}, "author": "Push Square", "title": "Talking Point: What Free May 2020 PS Plus Games Do You Want? - Push Square", "description": "When will May 2020's PlayStation Plus lineup be announced?", "url": "http://www.pushsquare.com/news/2020/04/talking_point_what_free_may_2020_ps_plus_games_do_you_want", "urlToImage": null, "publishedAt": "2020-04-24T18:00:00Z", "content": "Whats the May 2020 PlayStation Plus lineup? And when will the May 2020 PS Plus games be announced? Sony's service has quietly been on a very good run, with Uncharted 4: A Thief's End and DiRT Rally 2.0 both very good additions in April. The Japanese giant has… [+1798 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Carly Page", "title": "The Dell XPS 15 2020 may have been redesigned to take on the MacBook Pro - TechRadar", "description": "Incoming model will boast smaller bezels and upward-firing speakers", "url": "https://www.techradar.com/news/the-dell-xps-15-2020-may-have-been-redesigned-to-take-on-the-macbook-pro", "urlToImage": null, "publishedAt": "2020-04-24T17:31:00Z", "content": "Dell looks poised to release an all-new version of its XPS 15 laptop that will take a number of design clues from the recently-revamped Dell XPS 13\r\n.\r\nThats according to leaked images posted on the Korea Energy Agency Efficiency Standardization Certification… [+2119 chars]"}, {"source": {"id": null, "name": "Trueachievements.com"}, "author": "Heidi Nicholas", "title": "Sci-fi adventure Deliver Us The Moon joins Xbox Game Pass and Game Pass for PC today - TrueAchievements", "description": "Deliver Us The Moon is a sci-fi action adventure title which draws inspiration from movies such as Interstellar, and which joins the Xbox Game Pass and Xbox Game Pass for PC services today as a day one addition.", "url": "https://www.trueachievements.com/n41593/deliver-us-the-moon", "urlToImage": null, "publishedAt": "2020-04-24T17:19:36Z", "content": "The Xbox team has been busy lately: just yesterday, they surprise-dropped the announcement that Red Dead Redemption 2 will join Xbox Game Pass in May. Before that, they announced new titles for Xbox Game Pass, along with several new titles for Xbox Game Pass … [+1728 chars]"}, {"source": {"id": null, "name": "Inews.co.uk"}, "author": "Alex Nelson", "title": "Travis Scott Fortnite event: what time live concerts are, how to get the new skin and Astronomical challenges explained - inews", "description": "Astronomical is 'a one of a kind musical journey featuring Travis Scott'", "url": "https://inews.co.uk/culture/gaming/travis-scott-fortnite-event-concert-live-when-time-uk-new-skin-astronomical-challenges-update-explained-2544889", "urlToImage": null, "publishedAt": "2020-04-24T17:11:27Z", "content": "Astronomical is 'a one of a kind musical journey featuring Travis Scott'\r\nSaturday, 25th April 2020, 8:48 am\r\nUpdated Saturday, 25th April 2020, 1:43 pm\r\nThe latest crossover event to come to Fortnite has been revealed, and includes another huge live concert … [+3117 chars]"}, {"source": {"id": null, "name": "Gamasutra.com"}, "author": "Bryant Francis", "title": "Obituary: Hellblade mental health consultant Jenny Esson - Gamasutra", "description": "Jenny Esson, one of the mental health professionals who contributed to the development of  Hellblade: Senua's Sacrifice  has passed away at age 45 from COVID-19.", "url": "https://www.gamasutra.com/view/news/361807/Obituary_Hellblade_mental_health_consultant_Jenny_Esson.php", "urlToImage": null, "publishedAt": "2020-04-24T17:10:39Z", "content": "Jenny Esson, one of the medical professionals who consulted on the development of Ninja Theory's Hellblade: Senua's Sacrifice, has passed away from COVID-19 at age 45. The studio noted her passing via Twitter.\r\nEsson worked for Cambridgeshire and Peterborough… [+698 chars]"}, {"source": {"id": null, "name": "Eurogamer.net"}, "author": "Will Judd", "title": "Best graphics card 2020: every major Nvidia and AMD GPU tested - Eurogamer.net", "description": "After testing every major Nvidia and AMD graphics card on the market, we present our top recommendations for 1080p, 1440p and 4K PC builds.", "url": "https://www.eurogamer.net/articles/digitalfoundry-best-graphics-card-every-amd-nvidia-tested-7001", "urlToImage": null, "publishedAt": "2020-04-24T16:31:00Z", "content": "The DF guide to the fastest and best value video cards on the market.\r\nReplacing your graphics card is the number one upgrade you can make for your PC and the most profound in terms of improving gaming performance, so it makes sense to spend some time researc… [+17794 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nJames Gurney", "title": "Seven of the best new men’s timepieces from Watches & Wonders - Telegraph.co.uk", "description": "On 25 April, a new online platform will unveil a host of watch models, which will be available in 2020", "url": "https://www.telegraph.co.uk/luxury/watches/seven-best-new-mens-timepieces-watches-wonders/", "urlToImage": null, "publishedAt": "2020-04-24T16:20:00Z", "content": "A certain less is more applies to many watches being launched, as brands opt to play safe for the most part but as that quite often means better, its almost a relief. Take Jaeger-LeCoultres Master Control Calendar (or, somewhat more enticingly, Quantième à Da… [+425 chars]"}, {"source": {"id": null, "name": "Whathifi.com"}, "author": "Becky Scarrott", "title": "Save £170 on award-winning Astell & Kern SR15 hi-res music player - What Hi-Fi?", "description": "The excellent Astell & Kern A&norma SR15 is now on sale", "url": "https://www.whathifi.com/news/award-winning-astell-and-kern-hi-res-music-player-slashed-in-price-at-amazon", "urlToImage": null, "publishedAt": "2020-04-24T15:09:00Z", "content": "It's a familiar story: a shiny new kid appears on the block and the old guard receives a heavy discount. However, while a successor to the Astell &amp; Kern A&amp;norma SR15 has been announced, in the form of the A&amp;norma SR25, that revered old guard, the … [+1483 chars]"}, {"source": {"id": null, "name": "Pushsquare.com"}, "author": "Push Square", "title": "Grab Pac-Man Championship Edition 2 for Free on PS4 - Push Square", "description": "Through until 10th May", "url": "http://www.pushsquare.com/news/2020/04/grab_pac-man_championship_edition_2_for_free_on_ps4", "urlToImage": null, "publishedAt": "2020-04-24T14:30:00Z", "content": "For the past couple of days, Pac-Man Championship Edition 2 has been listed for free on various storefronts before promptly being pulled. Now we know why. Publisher Bandai Namco is indeed allowing everyone with a PlayStation 4 to pick up a free digital copy o… [+910 chars]"}, {"source": {"id": null, "name": "Theregister.co.uk"}, "author": "Matthew Hughes", "title": "Android 11 Developer Preview 3 allows your mobe to become a router via USB Ethernet – if you can get a decent signal - The Register", "description": "Plus: Multitasking and other functions rejigged, but no promises they'll stick", "url": "https://www.theregister.co.uk/2020/04/24/android_11_dp3/", "urlToImage": null, "publishedAt": "2020-04-24T14:29:00Z", "content": "Google's third developer preview (DP3) of the Android 11 operating system is an enticing look at the future of the platform, where new features and UI tweaks abound.\r\nBut before we get into the meat of things, a bit of a throat-clearing. In the past, features… [+2358 chars]"}, {"source": {"id": null, "name": "Eurogamer.net"}, "author": "Emma Kent", "title": "PUBG adding bots to public matches on console - Eurogamer.net", "description": null, "url": "https://www.eurogamer.net/articles/2020-04-24-pubgs-adding-bots-to-public-matches-on-console", "urlToImage": null, "publishedAt": "2020-04-24T13:54:00Z", "content": "It's almost inevitable: once a multiplayer game's been out for some time, veteran players tend to pull ahead to a point where newer players just can't keep up. The situation is the same for PUBG, which has now developed a player base so proficient that new jo… [+3625 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Kevin Pocock", "title": "Sony’s WF-1000XM3 noise-cancelling headphones – £77 off, with Alexa BUILT IN - The Sun", "description": "", "url": "http://www.thesun.co.uk/tech/11472205/sony-wf-1000xm3-noise-cancelling-headphones-bluetooth-deal-save/", "urlToImage": null, "publishedAt": "2020-04-24T13:39:03Z", "content": "OUT for exercise or at home enjoying some downtime, the right pair of headphones are a real bonus.\r\nThe best often require investment, and the Sony WF-1000XM3 set is one of them.\r\n The charging case should offer 3 additional full charges\r\nSonys premium WF-100… [+2068 chars]"}, {"source": {"id": null, "name": "Nintendolife.com"}, "author": "Nintendo Life", "title": "Random: Nintendo Says Streets Of Rage 4 Is Out On Switch, But It Definitely Isn't - Nintendo Life", "description": "Here we go again", "url": "http://www.nintendolife.com/news/2020/04/random_nintendo_says_streets_of_rage_4_is_out_on_switch_but_it_definitely_isnt", "urlToImage": null, "publishedAt": "2020-04-24T13:00:00Z", "content": "It would appear that Nintendo is still confused over the official release date of Streets of Rage 4 on Switch, following up on its initial erroneous eShop listing with a new, incorrect news post.\r\nYou may remember that at the start of the month, the Nintendo … [+1226 chars]"}, {"source": {"id": null, "name": "Gamesradar.com"}, "author": "Benjamin Abbott", "title": "Nintendo Switch deal stock alert: Lite bundles now available with Animal Crossing, Mario Kart and more - GamesRadar+ UK", "description": "Avoid the price gougers and find out where Nintendo Switch Lite is in stock before they vanish", "url": "https://www.gamesradar.com/uk/where-to-find-nintendo-switch-lite-UK-offers/", "urlToImage": null, "publishedAt": "2020-04-24T11:43:00Z", "content": "This is not a drill, Nintendo Switch deals are back in stock for the cheaper, handheld-only Lite model. Better yet, you can buy it on its own, or in a Switch bundle with a decent game and save a few quid while you're at it.\r\nThat's big news: due to the curren… [+6484 chars]"}, {"source": {"id": null, "name": "Rockpapershotgun.com"}, "author": null, "title": "Try Call Of Duty: Modern Warfare's multiplayer for free this this weekend through Warzone - Rock Paper Shotgun", "description": "From today until Monday, you'll be able to play five maps from Call Of Duty: Modern Warfare's multiplayer for free on a playlist inside Warzone.", "url": "https://www.rockpapershotgun.com/2020/04/24/try-call-of-duty-modern-warfares-multiplayer-for-free-this-this-weekend-through-warzone/", "urlToImage": null, "publishedAt": "2020-04-24T11:32:00Z", "content": "From today until Monday, you’ll be able to play some of Call Of Duty: Modern Warfare‘s multiplayer for free. This trial is actually taking place inside CoD: Warzone, their free-to-play battle royale game, with five Modern Warfare team deathmatch maps going on… [+1346 chars]"}, {"source": {"id": null, "name": "Eurogamer.net"}, "author": "Wesley Yin-Poole", "title": "WWE 2K21 canned after disastrous WWE 2K20 - Eurogamer.net", "description": null, "url": "https://www.eurogamer.net/articles/2020-04-24-wwe-2k21-canned-after-disastrous-wwe-2k20", "urlToImage": null, "publishedAt": "2020-04-24T10:28:00Z", "content": "WWE 2K21 is canned, WWE has confirmed.\r\nDuring WWE's financial call overnight, interim chief financial officer Frank Riddick said: \"There's not going to be a launch of the game this year.\"\r\nThe news comes after last year's disastrous launch of WWE 2K20, which… [+830 chars]"}, {"source": {"id": null, "name": "Rockpapershotgun.com"}, "author": null, "title": "XCOM: Chimera Squad is out now, and it's half-price - Rock Paper Shotgun", "description": "It’s time to put down your world-saving guns and pick up your alien-policemen batons, because XCOM: Chimera Squad is out.", "url": "https://www.rockpapershotgun.com/2020/04/24/xcom-chimera-squad-is-out-now-and-its-half-price/", "urlToImage": null, "publishedAt": "2020-04-24T10:17:00Z", "content": "It’s time to put down your world-saving guns and pick up your alien-policing batons, because XCOM: Chimera Squad is out. XCOPS takes a big sidewards leap away from the main series, boiling down turn-based combat into single-room encounters. Developers Firaxis… [+2356 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Jeff Parsons", "title": "Beware the WhatsApp 'free beer' scam to get your personal data - Metro.co.uk", "description": "The hoax is currently circulating on WhatsApp", "url": "https://metro.co.uk/2020/04/24/beware-whatsapp-free-beer-text-just-scam-get-private-information-12603287/", "urlToImage": null, "publishedAt": "2020-04-24T09:29:18Z", "content": "The hoax is spreading through WhatsApp (Picture: Getty)\r\nA WhatsApp message promising what everyone could do with right now a free beer is nothing more than a dangerous hoax.\r\nIf you get the message, which is seemingly from Dutch beer company Heineken, ignore… [+1983 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "GameCentral", "title": "Play Call Of Duty: Modern Warfare multiplayer for free this weekend - Metro.co.uk", "description": "Five maps from the main multiplayer mode of Modern Warfare will be free to play for everyone from today until Monday.", "url": "https://metro.co.uk/2020/04/24/play-call-duty-modern-warfare-multiplayer-maps-free-weekend-via-warzone-12603582/", "urlToImage": null, "publishedAt": "2020-04-24T09:29:08Z", "content": "Call Of Duty: Modern Warfare another free trial (pic: Activision)\r\nFive maps from the main multiplayer mode of Modern Warfare will be free to play for everyone from today until Monday.\r\nCall Of Duty: Warzone may be free-to-play but the main multiplayer mode o… [+1680 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Cindy Tran for Daily Mail Australia", "title": "Peeling carrots wrong your whole life! Video showing the correct way takes the internet by storm - Daily Mail", "description": "A British man has discovered a simple way to peel carrots in just seconds - and it turns out thousands of home cooks have all been doing it wrong their whole lives.", "url": "https://www.dailymail.co.uk/femail/article-8252137/Peeling-carrots-wrong-life-Video-showing-correct-way-takes-internet-storm.html", "urlToImage": null, "publishedAt": "2020-04-24T09:06:00Z", "content": "Most people peel their carrots from the base to the point in one direction away from their hand, but a video demonstration has emerged showing a much faster and efficient way of using the vegetable peeler.\r\nThe footage, posted on Reddit by an anonymous user, … [+2015 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "GameCentral", "title": "Elijah Wood visits fan's Animal Crossing game, picks her fruit - Metro.co.uk", "description": "Frodo Baggins himself has turned out to be a keen Animal Crossing: New Horizons player, after taking a trip to a fan's island to sell his turnips.", "url": "https://metro.co.uk/2020/04/24/elijah-wood-turns-fans-animal-crossing-new-horizons-game-takes-fruit-12603310/", "urlToImage": null, "publishedAt": "2020-04-24T08:50:30Z", "content": "The moment Elijah Wood arrived in Animal Crossing (pic: jessa)\r\nFrodo Baggins himself has turned out to be a keen Animal Crossing: New Horizons player, after taking a trip to a fans island to sell his turnips.\r\nSince Animal Crossing: New Horizons is now offic… [+2245 chars]"}, {"source": {"id": null, "name": "Kotaku.com"}, "author": null, "title": "You Can Finally Apologise for Being Crap in Overwatch - Kotaku UK", "description": "Blizzard is going to add a voice line feature that speaks to me on a very personal level: the ability to apologise.", "url": "https://kotaku.com/you-can-finally-apologize-for-being-trash-in-overwatch-1843029325", "urlToImage": null, "publishedAt": "2020-04-24T08:00:00Z", "content": "Who doesnt love voice lines in Overwatch? They let you say hello. They can help your teammates stay abreast of your ultimate percentage. If you play DPS, you can use them to spam messages about how you need healing until everybody elses ears seal closed like … [+2085 chars]"}, {"source": {"id": null, "name": "Canaries.co.uk"}, "author": "Norwich City", "title": "New date for The Killers concert - News - Canaries.co.uk", "description": "Norwich City Football Club can confirm the rescheduling and a new date for the concert with The Killers at Carrow Road.", "url": "https://www.canaries.co.uk/News/2020/april/new-date-for-the-killers-concert/", "urlToImage": null, "publishedAt": "2020-04-24T06:38:52Z", "content": "Norwich City Football Club can confirm the rescheduling and a new date for the concert with The Killers at Carrow Road.\r\nThe concert was initially scheduled for June 2020, but owing to the current COVID-19 pandemic it has now been rearranged to take place on … [+710 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "David Snelling", "title": "Apple Watch turns FIVE: The biggest 5 upgrades that have changed this smartwatch - Express", "description": "THE Apple Watch is celebrating a big birthday today as this wearable officially turns five. Here are some of the ways that it has changed over the last five years.", "url": "https://www.express.co.uk/life-style/science-technology/1273252/Apple-Watch-update-news-features-upgrade-five", "urlToImage": null, "publishedAt": "2020-04-24T06:14:59Z", "content": null}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Ammar Kalia, Ellen E Jones, Phil Harrison, Paul Howlett, Graeme Virtue", "title": "TV tonight: celebrating the Hubble telescope - The Guardian", "description": "As our eye in the sky reaches its 30th year, a fascinating special tells its story; Anneka Rice and Laurence Llewelyn-Bowen join Joe Lycett. Here’s what to watch this evening", "url": "https://www.theguardian.com/tv-and-radio/2020/apr/24/tv-tonight-celebrating-the-hubble-telescope", "urlToImage": null, "publishedAt": "2020-04-24T05:01:06Z", "content": "Hubble: The Wonders of Space Revealed\r\n9pm, BBC Two\r\nIn orbit since April 1990 and having travelled more than 6.5bn kilometers around Earth, the Hubble telescope has done more than perhaps any other scientific experiment to reveal the extent of our universe. … [+2409 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Alice Cachia For Mailonline", "title": "House out of the Swinging Sixties complete with untouched interiors on sale for £1.3m in Highgate - Daily Mail", "description": "The four-bedroom north London home was built in the 60s and is in the much-sought after leafy Highgate. It is stockpiled full of opulent Modernist decor and sculptures fitting of the Swinging Sixties.", "url": "https://www.dailymail.co.uk/news/article-8250835/House-Swinging-Sixties-complete-untouched-interiors-sale-1-3m-Highgate.html", "urlToImage": null, "publishedAt": "2020-04-24T03:07:45Z", "content": "A time capsule home straight out of the Swinging Sixties has gone on the market for the first time - and it's complete with virtually untouched interiors.    \r\nThe four-bedroom north London home was built in the 60s and is in the much-sought after leafy Highg… [+5098 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "With humans vulnerable: How about a digital helper? - BBC News", "description": "Robots and digital assistants have proved useful during the Covid-19 pandemic but are still limited.", "url": "https://www.bbc.co.uk/news/business-52290562", "urlToImage": null, "publishedAt": "2020-04-23T23:15:10Z", "content": "Image copyrightCloudmindsImage caption\r\n The XR-1 at a hospital in China\r\nSince February, California-based manufacturer CloudMinds has shipped more than 100 robots to China.\r\nMany of those have gone to hospitals, where the XR-1 provides information to patient… [+5071 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: 'Our wedding is cancelled but we still have to pay' - BBC News", "description": "Venues are forcing couples to pay big cancellation fees for weddings delayed by the lockdown.", "url": "https://www.bbc.com/news/business-52400441", "urlToImage": null, "publishedAt": "2020-04-23T23:12:17Z", "content": "Media caption'We've saved so hard for so long for it, it's beyond belief almost'\r\nBrides and grooms say they are being charged thousands of pounds in cancellation and postponement fees for weddings that can't go ahead because of the coronavirus lockdown. \r\nWh… [+7995 chars]"}, {"source": {"id": null, "name": "Thetimes.co.uk"}, "author": "Tom Knowles, Technology Correspondent", "title": "You've had your chips, Apple to tell Intel - The Times", "description": "Apple may start releasing Mac computers that come with its own chips again from next year, ditching Intel’s processor after 16 years, according to insiders.The iPhone maker is reportedly creating", "url": "https://www.thetimes.co.uk/article/youve-had-your-chips-apple-to-tell-intel-0hjs5wwbj", "urlToImage": null, "publishedAt": "2020-04-23T23:01:00Z", "content": "Apple may start releasing Mac computers that come with its own chips again from next year, ditching Intels processor after 16 years, according to insiders.\r\nThe iPhone maker is reportedly creating processors for laptops and desktop computers, based on the chi… [+522 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "https://www.facebook.com/TechRadar", "title": "Hands on: Motorola Edge Plus review - TechRadar", "description": "Motorola returns to the big leagues", "url": "https://www.techradar.com/reviews/motorola-edge-plus", "urlToImage": null, "publishedAt": "2020-04-23T21:19:00Z", "content": "2020 has been a big year for Motorola already: first its own foldable phone, the throwback Motorola Razr\r\n, and now we have the Motorola Edge Plus a full-fledged flagship with specs and features to match.\r\nAs the more premium smartphone sibling of the Motorol… [+11716 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jay Peters", "title": "Apple’s new Magic Keyboard for the iPad Pro is covered under AppleCare Plus - The Verge", "description": "If you have AppleCare Plus for your iPad Pro, Apple’s new Magic Keyboard for the iPad Pro is covered by that policy. The AppleCare Plus service fee for the Magic Keyboard is $29. That policy covers an Apple Pencil, too.", "url": "https://www.theverge.com/2020/4/23/21232811/apple-magic-keyboard-ipad-pro-applecare-plus-covered", "urlToImage": null, "publishedAt": "2020-04-23T17:25:46Z", "content": "It has a $29 service fee\r\nPhoto by Vjeran Pavic / The Verge\r\nApples new Magic Keyboard for the iPad Pro is a pretty expensive accessory the 11-inch version costs $299, while the 12.9-inch version costs $349 but if you have AppleCare Plus coverage for your iPa… [+1476 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Jeet T Arya", "title": "Did Apple underclock the A13 Bionic processor in the iPhone SE? - Techradar", "description": "Benchmarks scores show a slower performance", "url": "https://www.techradar.com/news/did-apple-underclock-the-a13-bionic-processor-in-the-iphone-se", "urlToImage": null, "publishedAt": "2020-04-23T17:22:00Z", "content": "The iPhone 11 Pro Max and the iPhone SE are powered by the same A13 Bionic chipset, so you might expect that things would be the same in terms of performance.\r\nOur own iPhone SE review showed that the new handset didn't hit the heights of the iPhone 11 Pro Ma… [+2497 chars]"}, {"source": {"id": null, "name": "Chromeunboxed.com"}, "author": "https://chromeunboxed.com/author/robbypayne/", "title": "PWAs installed from the Play Store have a few tricks up their sleeve that add to their native feel - Chrome Unboxed", "description": "We spent a bit of time last week talking about the arrival of two apps in the Play Store for Chromebooks that have been there for a while, but are now in a new form: the PWA (progressive web app). On a Chromebook, if you head to the Play Store and attempt to …", "url": "https://chromeunboxed.com/chrome-os-chromebooks-pwa-google-play-store-install/", "urlToImage": null, "publishedAt": "2020-04-23T17:00:04Z", "content": "We spent a bit of time last week talking about the arrival of two apps in the Play Store for Chromebooks that have been there for a while, but are now in a new form: the PWA (progressive web app). On a Chromebook, if you head to the Play Store and attempt to … [+4024 chars]"}, {"source": {"id": null, "name": "Eurogamer.net"}, "author": null, "title": "Asus TUF A15 laptop review: AMD's Ryzen 4000 is a groundbreaking mobile CPU - Eurogamer.net", "description": null, "url": "https://www.eurogamer.net/articles/digitalfoundry-2020-ryzen-4000-asus-tuf-a15-gaming-laptop-review", "urlToImage": null, "publishedAt": "2020-04-23T16:40:00Z", "content": "With its Ryzen 3000 desktop line, AMD delivered more cores, more performance and more value - closing the gap with Intel in benchmarks and gaming and essentially delivering a great product at a great price point. Ryzen 4000 does much the same thing, but with … [+12816 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Gary Jones", "title": "Fortnite Astronomical Event time: Secure a Travis Scott Concert server spot this way - Express", "description": "THE Fortnite Astronomical event time for the Travis Scott Concert has been confirmed, and Epic Games has also provided further guidance on the best way to getting into the server.", "url": "https://www.express.co.uk/entertainment/gaming/1272650/Fortnite-Astronomical-Event-time-Travis-Scott-Concert-server", "urlToImage": null, "publishedAt": "2020-04-23T16:10:00Z", "content": null}, {"source": {"id": null, "name": "Fortniteinsider.com"}, "author": null, "title": "Fortnite Challenges Week 10: Midas' Mission Part 2 Available 23rd April - Fortnite Insider", "description": "Here are all of the Fortnite challenges that have just been released for the second part of Midas’ Mission.  Every week in Fortnite Battle Royale, ten new challenges are released and are available to complete on Thursdays. We are now in Week 10 of this season…", "url": "https://fortniteinsider.com/fortnite-challenges-week-10-midas-mission-part-2-available-23rd-april/", "urlToImage": null, "publishedAt": "2020-04-23T15:04:00Z", "content": "Here are all of the Fortnite challenges that have just been released for the second part of Midas’ Mission. \r\nEvery week in Fortnite Battle Royale, ten new challenges are released and are available to complete on Thursdays. We are now in Week 10 of this seaso… [+1576 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "David Snelling", "title": "Some BT, Virgin Media and Sky customers just received the broadband news they wanted - Express", "description": "BT, VIRGIN Media, Sky and many other broadband customers have just received some good news as it's revealed that UK download speeds are finally getting faster.", "url": "https://www.express.co.uk/life-style/science-technology/1272146/BT-broadband-Virgin-Media-sky-best-speeds-internet-downloads", "urlToImage": null, "publishedAt": "2020-04-22T05:43:35Z", "content": null}]}