{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Forbes.com"}, "author": "Zak Doffman", "title": "Huawei Surprises Millions Of Users With Stunning Google Alternative - Forbes", "description": "Good news for Huawei users—not good news for Google.", "url": "https://www.forbes.com/sites/zakdoffman/2020/04/26/huawei-surprises-millions-of-users-with-stunning-google-alternative/", "urlToImage": null, "publishedAt": "2020-04-26T06:19:25Z", "content": "Sergei Karpukhin/TASS\r\nThe Google stakes for Huawei have never been higher. The company is clear that 2020 will be its toughest year yet. Its own New Years message described it as a battle for survival, and its first-quarter growth saw growth of just 1.4% com… [+4636 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Dion Dassanayake", "title": "Google’s latest Android update might stop you using your smartphone - Express.co.uk", "description": "ANDROID fans have just received a new update from Google which might actually help them to stop using their phones when they head to bed.", "url": "https://www.express.co.uk/life-style/science-technology/1273599/Google-latest-Android-update-stop-you-using-smartphone", "urlToImage": null, "publishedAt": "2020-04-26T06:01:00Z", "content": "Android users have seen Google push out a new update that brings with it a timely and helpful feature. Android is one of the most used pieces of software in the world, with the Google mobile OS installed on over 2.5billion devices. Such a huge userbase means … [+1666 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Dion Dassanayake", "title": "Time to ditch WhatsApp? Rival chat app gets vital feature fans have been waiting for - Express", "description": "WHATSAPP fans have been given a big reason to crossover after a chat app rival got a major feature first.", "url": "https://www.express.co.uk/life-style/science-technology/1273605/WhatsApp-rival-vital-chat-app-feature", "urlToImage": null, "publishedAt": "2020-04-26T05:02:24Z", "content": "The Viber self destructing message feature, which was previously only available in secret chats, can now be used in all one-on-one conversations.\r\nThe new Viber feature lets users set a timer ranging from a few seconds to a few days until the message gets del… [+452 chars]"}, {"source": {"id": null, "name": "Autocar.co.uk"}, "author": null, "title": "Bringing up the rear: Top 10 rear-wheel steering cars - Autocar", "description": "Rear-wheel steering systems are once again in the spotlight, but the idea isn’t new. We pick 10 pioneers of the corner-taming technology", "url": "https://www.autocar.co.uk/car-news/features/bringing-rear-top-10-rear-wheel-steering-cars", "urlToImage": null, "publishedAt": "2020-04-26T05:00:00Z", "content": "It shouldnt come as a great surprise that one of the most hotly debated automotive chassis technologies originated in Japan, a nation whose residents appear to be born with a fascination for high-tech gadgets and gizmos.\r\nActive rear-wheel steering was introd… [+1138 chars]"}, {"source": {"id": null, "name": "Whatculture.com"}, "author": "James Weeds", "title": "WWE 2K New Video Game - What Can We Expect & How WWE Games Can Recover - WhatCulture", "description": "Who else jumped for joy at the recent confirmation of 2K21’s cancellation?", "url": "https://whatculture.com/gaming/wwe-2k-new-video-game-what-can-we-expect-how-wwe-games-can-recover", "urlToImage": null, "publishedAt": "2020-04-26T03:58:20Z", "content": "2K Games\r\nConfirming the cancellation of this years instalment in the WWE 2K series, 2K games are set to share details on the future of the franchise this Monday with the possible unveil of an alternative wrestling game.\r\nAfter a dreadful launch of WWE 2K20, … [+1149 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Desire Athow", "title": "This 4TB PCIe SSD can make your Windows laptop feel more like a MacBook Pro - TechRadar", "description": "Assuming you have a compatible laptop, that is", "url": "https://www.techradar.com/news/this-4tb-pcie-ssd-can-make-your-windows-laptop-feel-more-like-a-macbook-pro", "urlToImage": null, "publishedAt": "2020-04-26T03:00:00Z", "content": "The Apple MacBook Pro 16 still holds bragging rights when it comes to the maximum storage capacity available in a traditional portable laptop. \r\nApple uses a proprietary approach, plugging memory chips directly into the motherboard to reach a whopping 8TB of … [+1494 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "GameCentral", "title": "Square Enix are going to regret ever starting Final Fantasy 7 Remake - Metro.co.uk", "description": "A reader offers a spoiler-filled exploration of Final Fantasy 7 Remake’s ending and why he thinks it bodes poorly for future sequels.", "url": "https://metro.co.uk/2020/04/26/square-enix-going-regret-ever-starting-final-fantasy-7-remake-readers-feature-12607826/", "urlToImage": null, "publishedAt": "2020-04-26T00:29:32Z", "content": "Final Fantasy 7 Remake no end in sight (pic: Square Enix)\r\nA reader offers a spoiler-filled exploration of Final Fantasy 7 Remakes ending and why he thinks it bodes poorly for future sequels.\r\nBy now I imagine most people that have an interest in Final Fantas… [+4353 chars]"}, {"source": {"id": null, "name": "Androidpit.com"}, "author": "Daniel Iglesias", "title": "The best new apps on the Google Play Store this week - AndroidPIT", "description": "This week, we're back again with five new Android apps released on the Google Play Store. There's something for everyone this week.", "url": "https://www.androidpit.com/apps-of-the-week-25-04-2020", "urlToImage": null, "publishedAt": "2020-04-25T21:00:00Z", "content": "As every week, with the help of our community, we offer you a list of applications that have just appeared on the Google Play Store. We hope that this will allow you to discover new apps and have fun. Unlike last week, there are plenty of games this week incl… [+3725 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Debbie White", "title": "China now ‘trying to steal US research’ on coronavirus even after its role in unleashing the pandemic - The Sun", "description": "", "url": "http://www.thesun.co.uk/news/11480928/china-steal-us-research-coronavirus-pandemic/", "urlToImage": null, "publishedAt": "2020-04-25T20:00:25Z", "content": "CHINA has been accused of trying to steal coronavirus research from US labs, hospitals and pharmaceutical firms, an investigation reveals.\r\nAnd it appears the regimes game plan is to beat the rest of the world in producing the first vaccine against the bug - … [+7115 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Fallout 76: Wastelanders Review - IGN", "description": "Fallout 76: Wastelanders reviewed by David Jagneaux on PlayStation 4 Pro. Also available on PC and Xbox One. \"With the Wastelanders update, Fallout 76 has ta...", "url": "https://www.youtube.com/watch?v=U-uDLErALu0", "urlToImage": null, "publishedAt": "2020-04-25T19:51:32Z", "content": "Fallout 76: Wastelanders reviewed by David Jagneaux on PlayStation 4 Pro. Also available on PC and Xbox One.\r\n\"With the Wastelanders update, Fallout 76 has taken a solid step in the right direction after its dire launch. New human NPCs bring a healthy dose of… [+633 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Steve Watts", "title": "Red Dead Redemption 2 Comes To Xbox Game Pass Soon, But A Big Game Is Leaving - GameSpot", "description": "The games subscription service adds one of 2018's biggest games, the outlaw action game set in the Old West.", "url": "https://www.gamespot.com/articles/red-dead-redemption-2-comes-to-xbox-game-pass-soon/1100-6476411/", "urlToImage": null, "publishedAt": "2020-04-25T18:44:00Z", "content": "Xbox Game Pass for Xbox One is getting another big game from Rockstar. Red Dead Redemption 2 will join the subscription service on May 7, Microsoft has announced. However, with the massive blockbuster's arrival comes the loss of an even bigger game--one that … [+2127 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "", "title": "Former Apple designer drops Watch trivia on its fifth anniversary - Engadget", "description": "Imran Chaudhri, Apple’s design lead for hardware from 1995 to 2016, dropped some details about Apple Watch’s history on its fifth anniversary.  While Chaudhri is no longer with the tech giant, he shared a photo of the Watch team on launch day, as well as a re…", "url": "https://www.engadget.com/former-apple-designer-drops-watch-trivia-on-its-fifth-anniversary-144849444.html", "urlToImage": null, "publishedAt": "2020-04-25T18:39:26Z", "content": "Imran Chaudhri, Apple’s design lead for hardware from 1995 to 2016, dropped some details about Apple Watch’s history on its fifth anniversary. While Chaudhri is no longer with the tech giant, he shared a photo of the Watch team on launch day, as well as a rep… [+906 chars]"}, {"source": {"id": null, "name": "Notebookcheck.net"}, "author": "Deirdre O Donnell", "title": "A new leak hints at the launch of a 2020 Samsung Galaxy Watch - Notebookcheck.net", "description": "Samsung has reportedly had a new product certified with the MIIT regulator in China. Based on its model number, it is likely to be a full-screened wearable. Therefore, a successor for the Galaxy Watch Active 2 may be in the offing.", "url": "https://www.notebookcheck.net/A-new-leak-hints-at-the-launch-of-a-2020-Samsung-Galaxy-Watch.462930.0.html", "urlToImage": null, "publishedAt": "2020-04-25T18:13:26Z", "content": "Samsung has allegedly certified a novel device with the MIIT. In fact, there are 2 model numbers in evidence in the documentation in question (SM-R840 and R850). However, they are so similar that it is likely they are 2 variants of the same product, perhaps w… [+780 chars]"}, {"source": {"id": null, "name": "Nintendolife.com"}, "author": "Nintendo Life", "title": "The Pokémon Company Apologises For Featuring Dewgong In The Fourth Episode Of Twilight Wings - Nintendo Life", "description": "As it's not available in Sword and Shield", "url": "http://www.nintendolife.com/news/2020/04/the_pokemon_company_apologises_for_featuring_dewgong_in_the_fourth_episode_of_twilight_wings", "urlToImage": null, "publishedAt": "2020-04-25T17:30:00Z", "content": "@PcTV\r\nIt is true, I may have exaggerated, however, the overreaction is not a joke, of course, not always, so I mentioned \"sometimes\", that they seriously do a drama for something that is seriously not worth doing (example, madness by Blythe from Smash bros, … [+601 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Darren Allan", "title": "AMD Cezanne leak hints at next-gen laptop CPUs with RDNA 2 graphics that go for Intel’s jugular - TechRadar", "description": "Zen 3 APUs with RDNA 2-powered integrated graphics, rumor has it", "url": "https://www.techradar.com/news/amd-cezanne-leak-hints-at-next-gen-laptop-cpus-with-rdna-2-graphics-that-go-for-intels-jugular", "urlToImage": null, "publishedAt": "2020-04-25T17:05:52Z", "content": "AMD Ryzen 4000 (codenamed Renoir) mobile chips are still very much fresh on the scene and making a huge impact in terms of competitiveness in the laptop world but weve already seen a leak for next-gen APUs apparently codenamed Cezanne (a name which has been d… [+2934 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Louise Griffin", "title": "MrBeast pledges $250,000 for coronavirus livestream with David Dobrik - Metro.co.uk", "description": "We're in.", "url": "https://metro.co.uk/2020/04/25/mrbeast-pledges-250000-charity-joins-forces-david-dobrik-tana-mongeau-jeffree-star-live-stream-12609456/", "urlToImage": null, "publishedAt": "2020-04-25T17:04:55Z", "content": "MrBeast will be joined by 32 of his fellow internet stars (Picture: Getty MrBeast)\r\nYouTuber MrBeast has pledged to donate $250,000 (£200,000) to charity amid the coronavirus pandemic but, as always, it doesnt come without a challenge.\r\nThe internet star is j… [+2728 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: Cerne Abbas Giant given face mask makeover - BBC News", "description": "The ancient Cerne Abbas Giant is updated with an apparent reference to the coronavirus pandemic.", "url": "https://www.bbc.co.uk/news/uk-england-dorset-52427165", "urlToImage": null, "publishedAt": "2020-04-25T17:00:23Z", "content": "Image copyrightKevin KnightImage caption\r\n The ancient figure is thought to have been unofficially altered on Friday\r\nA famous hillside chalk figure has been adorned with a face mask.\r\nThe Cerne Abbas Giant is thought to have been given the unauthorised addit… [+1734 chars]"}, {"source": {"id": null, "name": "Entertainmentdaily.co.uk"}, "author": "Entertainment Daily", "title": "Gogglebox's Pete: Prince William and Mark Wright 'punching above their weight' - Entertainment Daily", "description": "Viewers were amused by Pete's observation", "url": "https://www.entertainmentdaily.co.uk/tv/gogglebox-pete-prince-william-and-mark-wright-punching-above-their-weight/", "urlToImage": null, "publishedAt": "2020-04-25T16:42:55Z", "content": "Gogglebox viewers saw the funny side as Pete Sandiford compared the Duke and Duchess of Cambridge to Michelle Keegan and Mark Wright claiming both men were \"punching above their weight\".\r\nThe couch potato critic shared his thoughts as he watched a clip of the… [+2157 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Davey Winder", "title": "Working from home? How to stay in touch and stay secure - The Guardian", "description": "Covid-19 has forced millions into the unfamiliar world of the home office, where new security threats loom. Here’s how to protect yourself and colleagues", "url": "https://www.theguardian.com/technology/2020/apr/25/working-from-home-how-to-stay-in-touch-and-stay-secure", "urlToImage": null, "publishedAt": "2020-04-25T16:00:00Z", "content": "Businesses are used to being prepared for a disaster and most will have had a well-rehearsed continuity plan in place in case one struck. But even the best plan couldnt have effectively anticipated the wholesale overnight shift to home working that Covid-19 h… [+7011 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Matthew Forde", "title": "Sony slip-ups: ahead of the PS5, we look back at the PlayStation tech that just didn't work - TechRadar India", "description": "They can't all be winners", "url": "https://www.techradar.com/news/sony-slip-ups-ahead-of-the-ps5-we-look-back-at-the-playstation-tech-that-just-didnt-work", "urlToImage": null, "publishedAt": "2020-04-25T16:00:00Z", "content": "As we motor towards the next generation of consoles, Sony currently holds all of the cards and will be looking to build upon the monumental success it found during the current generation. Its sometimes easy to forget just how well the PlayStation 4 has sold, … [+6393 chars]"}, {"source": {"id": null, "name": "9to5google.com"}, "author": null, "title": "OxygenOS 10.5.5 update for OnePlus 8, Pro fixes curved screen sensitivity, more - 9to5Google", "description": "OnePlus has released the OxygenOS 10.5.5 update for the OnePlus 8 and 8 Pro to fix a handful of issues relating to the camera and screen.", "url": "https://9to5google.com/2020/04/25/oxygenos-10-5-5-oneplus-8-pro-update/", "urlToImage": null, "publishedAt": "2020-04-25T15:40:20Z", "content": "The OnePlus 8 series goes on sale widely next week, but for early adopters, there’s an important update rolling out. OxygenOS 10.5.5 delivers some camera, display, and battery fixes. Here’s what you need to know.\r\nOxygenOS 10.5.5 is the second update to arriv… [+1412 chars]"}, {"source": {"id": null, "name": "Eurogamer.net"}, "author": "Wesley Yin-Poole", "title": "This stunning Minecraft city was created by a team of professional builders - Eurogamer.net", "description": null, "url": "https://www.eurogamer.net/articles/2020-04-25-this-stunning-minecraft-city-was-created-by-a-team-of-professional-builders", "urlToImage": null, "publishedAt": "2020-04-25T15:31:00Z", "content": "The Minecraft community is known for its incredible creations - but this stunning city was built by the pros.\r\nCity of Orario is an incredibly detailed 1500x1500 recreation of The Labyrinth City of Orario from the DanMachi anime. Its centrepiece is a massive … [+1151 chars]"}, {"source": {"id": null, "name": "Eurogamer.net"}, "author": "Wesley Yin-Poole", "title": "Video game cheating is back in the headlines - Eurogamer.net", "description": null, "url": "https://www.eurogamer.net/articles/2020-04-25-video-game-cheating-is-back-in-the-headlines", "urlToImage": null, "publishedAt": "2020-04-25T14:04:00Z", "content": "Video game cheating has been around for as long as video games. But the eternal issue has once again hit the headlines - and developers are struggling to cope.\r\nCall of Duty: Modern Warfare, Destiny 2, PlayerUnknown's Battlegrounds and Valorant have all been … [+7112 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Tom Bedford", "title": "Samsung Galaxy Tab S7: what we want to see - TechRadar", "description": "Samsung's new top-end tablet", "url": "https://www.techradar.com/news/samsung-galaxy-tab-s7", "urlToImage": null, "publishedAt": "2020-04-25T14:00:00Z", "content": "The Samsung Galaxy Tab S7 is expected to be released by the end of 2020, giving Samsung another shot at toppling Apple's reign as the most popular tablet manufacturer.\r\nSucceeding the Galaxy Tab S6 from 2019, the Samsung Galaxy Tab S7 will be Samsung's top-en… [+7671 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nLizzie Roberts", "title": "Contact tracing: how has it worked for other countries, and could it really help ease UK lockdown? - The Telegraph", "description": "From teams of 'corona detectives' to Army cadets making thousands of calls a day, countries are tracking the spread of Covid-19", "url": "https://www.telegraph.co.uk/news/2020/04/25/what-contact-tracing-how-work-countries-uk-lockdown/", "urlToImage": null, "publishedAt": "2020-04-25T13:41:28Z", "content": "Countries around the world are rushing to launch contact tracing apps to identify who an infected person has had contact with, as part of efforts to slow the spread of the coronavirus. \r\nThe UK Government has announced the infrastructure was being put in plac… [+1754 chars]"}, {"source": {"id": null, "name": "Nintendolife.com"}, "author": "Nintendo Life", "title": "Random: Accurate Portrayal Of Famous Statues Send Animal Crossing Fans Wild - Nintendo Life", "description": "\"i need the animal crossing **** statue\"", "url": "http://www.nintendolife.com/news/2020/04/random_accurate_portrayal_of_famous_statues_send_animal_crossing_fans_wild", "urlToImage": null, "publishedAt": "2020-04-25T13:05:00Z", "content": "The latest update for Animal Crossing: New Horizons has reduced the interest on all savings accounts, nerfed bug spawn rates, and now the Redd's statues appear to be causing a stir on social media.\r\nFamous statues like Michaelangelo's 'David' and the Greek sc… [+2411 chars]"}, {"source": {"id": null, "name": "Eurogamer.net"}, "author": "Wesley Yin-Poole", "title": "The curious case of Call of Duty: Warzone crossplay - Eurogamer.net", "description": null, "url": "https://www.eurogamer.net/articles/2020-04-25-the-curious-case-of-call-of-duty-warzone-crossplay", "urlToImage": null, "publishedAt": "2020-04-25T12:52:00Z", "content": "Last week, Eurogamer revealed how Call of Duty players on console were disabling crossplay in order to escape cheaters on PC. But it turns out not all console players have this option.\r\nMuch was made of Call of Duty's new crossplay feature when it was confirm… [+4114 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "Simon Parkin", "title": "Streets of Rage 4 review – the return of the beat 'em up - The Guardian", "description": "This lovingly created sequel offers all the action and fun of a 90s arcade game", "url": "https://www.theguardian.com/games/2020/apr/25/streets-of-rage-4-review-the-return-of-the-beat-em-up", "urlToImage": null, "publishedAt": "2020-04-25T12:04:06Z", "content": "In the Netflix animated series Hi Score Girl, a romantic comedy set in early-90s Japan, Haruo Yaguchi, a low-achieving high-school loner is whiling away his time in the local video game arcades when he meets Akira Ono, a popular wunderkind from a wealthy fami… [+4209 chars]"}, {"source": {"id": null, "name": "Rockpapershotgun.com"}, "author": null, "title": "A demonic face-off from Doom's past is sealed inside Doom Eternal's soundtrack - Rock Paper Shotgun", "description": "A never-ending demonic battle sealed within the very waveforms of an audio track? That's pretty damn metal, Doom Eternal.", "url": "https://www.rockpapershotgun.com/2020/04/25/a-demonic-face-off-from-dooms-past-is-sealed-inside-doom-eternals-soundtrack/", "urlToImage": null, "publishedAt": "2020-04-25T10:37:00Z", "content": "There’s more than a bit of metal in Doom Eternal. The rhythmic bass blasts of super-shotguns, tinny chaingun power solos, verses punctuated by gory breaks and technical fingerwork. It’s only natural that Doom’s soundtrack contains a little bit of hell in kind… [+1898 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Jeff Parsons", "title": "Apple Magic Keyboard review: the ultimate iPad Pro accessory - Metro.co.uk", "description": "This iPad Pro peripheral finally bridges the gap between tablet and laptop", "url": "https://metro.co.uk/2020/04/25/apple-magic-keyboard-review-crucial-ipad-pro-accessory-12588777/", "urlToImage": null, "publishedAt": "2020-04-25T09:53:53Z", "content": "The Magic Keyboard turns the iPad Pro into a floating display (Apple)\r\nFor the last few iPad generations Apple has been pushing to turn the tablet into more of a productivity device akin to your laptop.\r\nHardware additions like the Apple Pencil and Smart Keyb… [+5263 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Aaron Brown", "title": "Google Chrome rival brings a feature social media fans will adore in latest update - Express", "description": "OPERA has rolled out support for a handy new feature that should appeal to social media obsessives. Here's everything you need to know.", "url": "https://www.express.co.uk/life-style/science-technology/1273390/Google-Chrome-Rival-Opera-Social-Media-Instagram-Fans-Update-New-Feature", "urlToImage": null, "publishedAt": "2020-04-25T07:03:29Z", "content": null}, {"source": {"id": null, "name": "Digitalcameraworld.com"}, "author": "Louise Carey", "title": "iPhone 12: What we know so far about September 2020 iPhone release - Digital Camera World", "description": "The iPhone 12 is set to be announced in September, but what are we expecting from the latest iPhone generation?", "url": "https://www.digitalcameraworld.com/news/iphone-12-what-we-know-so-far-about-september-2020-iphone-release", "urlToImage": null, "publishedAt": "2020-04-25T07:02:00Z", "content": "With only a matter of months to go until Apple's traditional September iPhone launch event, the internet is already abuzz with rumors and speculation on what the iPhone 12 release is going to look like. With the 2019 iPhone 11 release leaving some feeling und… [+6096 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Aaron Brown", "title": "WhatsApp update DOUBLES the maximum number of people in a video call - Express", "description": "WHATSAPP has expanded the maximum number of people who can take part in a video call at the same time - doubling the previous limit of four simultaneous callers. Just as before, these video calls will be end-to-end encrypted.", "url": "https://www.express.co.uk/life-style/science-technology/1273575/WhatsApp-Maximum-Number-People-Video-Call-Double-Limit-Update-iPhone-Android", "urlToImage": null, "publishedAt": "2020-04-25T06:42:31Z", "content": null}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Dion Dassanayake", "title": "Windows 10 update could DELETE your files and bricks PCs in fresh blow to Microsoft users - Express", "description": "WINDOWS 10 users have been dealt yet another download blow, with a new Microsoft update capable of deleting user files and bricking your PC.", "url": "https://www.express.co.uk/life-style/science-technology/1273596/Windows-10-update-deletes-files-bricks-PCs-Microsoft", "urlToImage": null, "publishedAt": "2020-04-25T06:06:53Z", "content": "And another posted: \"My system automatically updated on the 19th of April. I lost some important word files of my university. And a folder.\r\n\"I have looked on the temporary folders and I have tried to uninstall the update but they do not appear\".\r\nWindows Lat… [+612 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Aaron Brown", "title": "Netflix solves a huge headache for Android users, but iPhone loses out on awesome update - Express", "description": "NETFLIX has solved one of the biggest pains when watching shows or movies on your Android smartphone or tablet. But despite many iPhone and iPad owners suffering the same headache ...there's no sign of a fix. Here's everything you need to know about the new f…", "url": "https://www.express.co.uk/life-style/science-technology/1273343/Netflix-Update-Solve-Headache-Android-No-iPhone-Users", "urlToImage": null, "publishedAt": "2020-04-25T06:06:34Z", "content": "Of course, it's still possible that you could drop your phone and somehow accidentally manage to hit the unlock button two times in quick succession, followed by the pause button – but that's much less likely than the single-tap needed to wreak havoc beforeha… [+613 chars]"}, {"source": {"id": null, "name": "Theguardian.com"}, "author": "", "title": "Should I buy a Nintendo Switch for my kids in lockdown? - The Guardian", "description": "Our two 10-year-olds are asking for new games – but I’m wondering if there’s a less costly alternative", "url": "https://www.theguardian.com/money/2020/apr/25/buy-nintendo-switch-kids-lockdown-games", "urlToImage": null, "publishedAt": "2020-04-25T06:04:02Z", "content": "Every week a Guardian Money reader submits a question, and its up to you to help him or her out a selection of the best answers will appear in next Saturdays paper.\r\nFive weeks into lockdown and our two 10-year-olds are badgering us to buy some new electronic… [+301 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "David Snelling", "title": "Samsung reveals another blockbuster 4K TV update for your television - Express", "description": "SAMSUNG is back with even more updates for your TV and here's what's now available on your 4K television.", "url": "https://www.express.co.uk/life-style/science-technology/1273517/Samsung-4K-TV-update-Apple-Music-app", "urlToImage": null, "publishedAt": "2020-04-25T06:01:07Z", "content": "“Our goal has always been to deliver the best entertainment experiences to consumers – and as people spend more time at home, we are more committed to that mission than ever,” said Salek Brodsky, Vice President of Strategic Partnerships and Business Developme… [+665 chars]"}, {"source": {"id": null, "name": "Pistonheads.com"}, "author": "Mike Duff", "title": "Rolls-Royce Silver Seraph | The Brave Pill - Pistonheads.com", "description": "In terms of miles covered, could this be the highest Roller?", "url": "https://www.pistonheads.com/news/general/rolls-royce-silver-seraph--the-brave-pill/42296", "urlToImage": null, "publishedAt": "2020-04-25T05:03:51Z", "content": "There is no shortage of Rolls-Royces with low mileages out there, but that doesn't mean they are better prospects than the ones that have lived life a little. And here's one that has lived life a lot - a Silver Seraph that has managed to rack up the impressiv… [+7030 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Gary Jones", "title": "Games with Gold May 2020: Great news for Xbox Live free games fans - Express", "description": "MICROSOFT will announce its plans for Games with Gold this week and gamers have also been given more free Xbox One downloads.", "url": "https://www.express.co.uk/entertainment/gaming/1273675/Games-with-Gold-May-2020-new-Xbox-Live-free-games", "urlToImage": null, "publishedAt": "2020-04-25T03:27:32Z", "content": null}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Desire Athow", "title": "This AMD Ryzen notebook deal is probably the best we've ever seen - TechRadar", "description": "Lenovo and AMD provide a glimpse into the future", "url": "https://www.techradar.com/news/this-amd-ryzen-laptop-is-the-probably-the-best-notebook-deal-ever", "urlToImage": null, "publishedAt": "2020-04-25T03:00:00Z", "content": "We reviewers are used to obsessing over incremental technology changes, but every now and then a supernova appears on our radar - something that can single handedly change the status quo.\r\nThe AMD Ryzen 4000 family is one such supernova and promises to bring … [+1829 chars]"}, {"source": {"id": null, "name": "Gamingintel.com"}, "author": null, "title": "Modern Warfare & Warzone Gets Update, Gunsmith Customs, and More Next Week - Gaming INTEL", "description": "There's a new update coming to Modern Warfare and Call of Duty Warzone next week, so Infinity Ward has provided a glimpse of what to expect.", "url": "https://gamingintel.com/modern-warfare-warzone-update-gunsmith-customs-next-week/", "urlToImage": null, "publishedAt": "2020-04-25T02:03:04Z", "content": "Last Updated onApril 25, 2020 at 2:51 am\r\nIf Infinity Ward’s April 24 community update is anything to by, Modern Warfare is on the verge of getting a brand new patch. Modern Warfare update 1.20 will bring a new anti-cheat system to Warzone, in addition to a h… [+1919 chars]"}, {"source": {"id": null, "name": "Futuregamereleases.com"}, "author": "Dejan Kacurov", "title": "Pokemon Go Free Promo Code That you Can Claim Until April 26 - Future Game Releases", "description": "Trainers, Niantic and Pokemon Go are generous again and they've shared a new free promo code, which can be used to claim free items. Niantic shared the 13-characters code on their official Twitter acc", "url": "https://www.futuregamereleases.com/2020/04/pokemon-go-free-promo-code-that-you-can-claim-until-april-26/", "urlToImage": null, "publishedAt": "2020-04-25T01:02:29Z", "content": "Trainers, Niantic and Pokemon Go are generous again and they’ve shared a new free promo code, which can be used to claim free items.\r\nNiantic shared the 13-characters code on their official Twitter account. This code can be claimed online or in-app (android u… [+419 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Anthony Spadafora", "title": "Ubuntu 20.04 adds VPN and support for a key Windows 10 feature - TechRadar", "description": "Latest Ubuntu release includes WireGuard and exFAT support", "url": "https://www.techradar.com/news/ubuntu-2004-adds-vpn-and-support-for-a-key-windows-10-feature", "urlToImage": null, "publishedAt": "2020-04-24T21:40:00Z", "content": "Canonical has released the latest version of its Ubuntu Linux distribution which offers a number of exciting new features designed to improve performance and security.\r\nUbuntu 20.04, aka Focal Fossa, is based on the Linux 5.4 kernel and this long-term-support… [+1714 chars]"}, {"source": {"id": null, "name": "Androidpolice.com"}, "author": null, "title": "OnePlus reportedly issues massive layoffs in largest European markets - Android Police", "description": "OnePlus has reportedly made severe staffing cuts in its European operations. While the tech brand has experienced massive growth in other markets over the", "url": "https://www.androidpolice.com/2020/04/25/oneplus-reportedly-issued-massive-layoffs-in-largest-european-markets/", "urlToImage": null, "publishedAt": "2020-04-24T21:06:06Z", "content": "This story was originally published 2020/04/24 1:52pm PDTon Apr 24, 2020 and last updated 2020/04/25 12:38pm PDTApr 25, 2020. \r\nOnePlus has reportedly made severe staffing cuts in its European operations. While the tech brand has experienced massive growth in… [+3233 chars]"}, {"source": {"id": null, "name": "Dailymail.co.uk"}, "author": "By Jonathan Chadwick For Mailonline", "title": "Colour paint technology cools buildings by reflecting the sun - Daily Mail", "description": "New colour paint designed to cool buildings by reflecting the sun could become an eco-friendly alternative to air conditioners, US materials scientists report.", "url": "https://www.dailymail.co.uk/sciencetech/article-8254793/Colour-paint-technology-cools-buildings-reflecting-sun.html", "urlToImage": null, "publishedAt": "2020-04-24T20:46:33Z", "content": "A new form of doubled-layered coloured paint designed to cool buildings by reflecting the sun could become an eco-friendly alternative to air conditioners.\r\nUS materials scientists say their array of coloured multi-layered paints can dramatically cool sun-bla… [+4159 chars]"}, {"source": {"id": null, "name": "Digitalspy.com"}, "author": "Chris Edwards", "title": "Nintendo addresses major security breach - digitalspy.com", "description": "There have been reported incidents of unauthorised access to user accounts.", "url": "https://www.digitalspy.com/tech/a32270793/nintendo-security-breach/", "urlToImage": null, "publishedAt": "2020-04-24T20:38:00Z", "content": "Nintendo has addressed a major security breach as it encourages users to take new security steps. \r\nIn a statement on its official website, the gaming company said it is continuing to investigate recent incidents of unauthorised access to Nintendo Accounts, b… [+1827 chars]"}, {"source": {"id": null, "name": "Rockpapershotgun.com"}, "author": null, "title": "This Minecraft map attempts to simulate social distancing during a pandemic - Rock Paper Shotgun", "description": "Blockdown Simulator has you take on the role of a nurse or a spectator as you cure villagers of a zombie pandemic.", "url": "https://www.rockpapershotgun.com/2020/04/24/this-minecraft-map-attempts-to-simulate-social-distancing-during-a-pandemic/", "urlToImage": null, "publishedAt": "2020-04-24T19:24:00Z", "content": "Are all you kids out there still playing Minecraft? Let’s hope so, because some folks have made a Minecraft map to teach you younguns about how social distancing and healthcare services work together to beat a pandemic. It sounds a bit corny off the cuff but … [+2478 chars]"}, {"source": {"id": null, "name": "Pushsquare.com"}, "author": "Push Square", "title": "Talking Point: What Free May 2020 PS Plus Games Do You Want? - Push Square", "description": "When will May 2020's PlayStation Plus lineup be announced?", "url": "http://www.pushsquare.com/news/2020/04/talking_point_what_free_may_2020_ps_plus_games_do_you_want", "urlToImage": null, "publishedAt": "2020-04-24T18:00:00Z", "content": "Whats the May 2020 PlayStation Plus lineup? And when will the May 2020 PS Plus games be announced? Sony's service has quietly been on a very good run, with Uncharted 4: A Thief's End and DiRT Rally 2.0 both very good additions in April. The Japanese giant has… [+1798 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Carly Page", "title": "The Dell XPS 15 2020 may have been redesigned to take on the MacBook Pro - TechRadar", "description": "Incoming model will boast smaller bezels and upward-firing speakers", "url": "https://www.techradar.com/news/the-dell-xps-15-2020-may-have-been-redesigned-to-take-on-the-macbook-pro", "urlToImage": null, "publishedAt": "2020-04-24T17:31:00Z", "content": "Dell looks poised to release an all-new version of its XPS 15 laptop that will take a number of design clues from the recently-revamped Dell XPS 13\r\n.\r\nThats according to leaked images posted on the Korea Energy Agency Efficiency Standardization Certification… [+2119 chars]"}, {"source": {"id": null, "name": "Inews.co.uk"}, "author": "Alex Nelson", "title": "Travis Scott Fortnite event: what time live concerts are, how to get the new skin and Astronomical challenges explained - inews", "description": "Astronomical is 'a one of a kind musical journey featuring Travis Scott'", "url": "https://inews.co.uk/culture/gaming/travis-scott-fortnite-event-concert-live-when-time-uk-new-skin-astronomical-challenges-update-explained-2544889", "urlToImage": null, "publishedAt": "2020-04-24T17:11:27Z", "content": "Astronomical is 'a one of a kind musical journey featuring Travis Scott'\r\nSaturday, 25th April 2020, 8:48 am\r\nUpdated Saturday, 25th April 2020, 1:43 pm\r\nThe latest crossover event to come to Fortnite has been revealed, and includes another huge live concert … [+3117 chars]"}, {"source": {"id": null, "name": "Gamasutra.com"}, "author": "Bryant Francis", "title": "Obituary: Hellblade mental health consultant Jenny Esson - Gamasutra", "description": "Jenny Esson, one of the mental health professionals who contributed to the development of  Hellblade: Senua's Sacrifice  has passed away at age 45 from COVID-19.", "url": "https://www.gamasutra.com/view/news/361807/Obituary_Hellblade_mental_health_consultant_Jenny_Esson.php", "urlToImage": null, "publishedAt": "2020-04-24T17:10:39Z", "content": "Jenny Esson, one of the medical professionals who consulted on the development of Ninja Theory's Hellblade: Senua's Sacrifice, has passed away from COVID-19 at age 45. The studio noted her passing via Twitter.\r\nEsson worked for Cambridgeshire and Peterborough… [+698 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Adam Marshall", "title": "Samsung smartphone sale: save hundreds on S20, Z Flip, Note 10, S10 Lite and more - TechRadar", "description": "Up to £195 off - but this flash sale ends on Monday", "url": "https://www.techradar.com/uk/news/samsung-smartphone-sale-save-hundreds-on-s20-z-flip-note-10-s10-lite-and-more", "urlToImage": null, "publishedAt": "2020-04-24T16:30:00Z", "content": "If you've been sat looking at your battered old smartphone and thinking it's high time for an upgrade, then your ticket may just have come in. All Samsung phone deals have been slashed by 15% this weekend only - with the Samsung S20, Note 10 and even the Gala… [+4136 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nJames Gurney", "title": "Seven of the best new men’s timepieces from Watches & Wonders - Telegraph.co.uk", "description": "On 25 April, a new online platform will unveil a host of watch models, which will be available in 2020", "url": "https://www.telegraph.co.uk/luxury/watches/seven-best-new-mens-timepieces-watches-wonders/", "urlToImage": null, "publishedAt": "2020-04-24T16:20:00Z", "content": "A certain less is more applies to many watches being launched, as brands opt to play safe for the most part but as that quite often means better, its almost a relief. Take Jaeger-LeCoultres Master Control Calendar (or, somewhat more enticingly, Quantième à Da… [+425 chars]"}, {"source": {"id": null, "name": "Whathifi.com"}, "author": "Becky Scarrott", "title": "Save £170 on award-winning Astell & Kern SR15 hi-res music player - What Hi-Fi?", "description": "The excellent Astell & Kern A&norma SR15 is now on sale", "url": "https://www.whathifi.com/news/award-winning-astell-and-kern-hi-res-music-player-slashed-in-price-at-amazon", "urlToImage": null, "publishedAt": "2020-04-24T15:09:00Z", "content": "It's a familiar story: a shiny new kid appears on the block and the old guard receives a heavy discount. However, while a successor to the Astell &amp; Kern A&amp;norma SR15 has been announced, in the form of the A&amp;norma SR25, that revered old guard, the … [+1483 chars]"}, {"source": {"id": null, "name": "Theregister.co.uk"}, "author": "Matthew Hughes", "title": "Android 11 Developer Preview 3 allows your mobe to become a router via USB Ethernet – if you can get a decent signal - The Register", "description": "Plus: Multitasking and other functions rejigged, but no promises they'll stick", "url": "https://www.theregister.co.uk/2020/04/24/android_11_dp3/", "urlToImage": null, "publishedAt": "2020-04-24T14:29:00Z", "content": "Google's third developer preview (DP3) of the Android 11 operating system is an enticing look at the future of the platform, where new features and UI tweaks abound.\r\nBut before we get into the meat of things, a bit of a throat-clearing. In the past, features… [+2358 chars]"}, {"source": {"id": null, "name": "Eurogamer.net"}, "author": "Emma Kent", "title": "PUBG adding bots to public matches on console - Eurogamer.net", "description": null, "url": "https://www.eurogamer.net/articles/2020-04-24-pubgs-adding-bots-to-public-matches-on-console", "urlToImage": null, "publishedAt": "2020-04-24T13:54:00Z", "content": "It's almost inevitable: once a multiplayer game's been out for some time, veteran players tend to pull ahead to a point where newer players just can't keep up. The situation is the same for PUBG, which has now developed a player base so proficient that new jo… [+3625 chars]"}, {"source": {"id": null, "name": "Thesun.co.uk"}, "author": "Kevin Pocock", "title": "Sony’s WF-1000XM3 noise-cancelling headphones – £77 off, with Alexa BUILT IN - The Sun", "description": "", "url": "http://www.thesun.co.uk/tech/11472205/sony-wf-1000xm3-noise-cancelling-headphones-bluetooth-deal-save/", "urlToImage": null, "publishedAt": "2020-04-24T13:39:03Z", "content": "OUT for exercise or at home enjoying some downtime, the right pair of headphones are a real bonus.\r\nThe best often require investment, and the Sony WF-1000XM3 set is one of them.\r\n The charging case should offer 3 additional full charges\r\nSonys premium WF-100… [+2068 chars]"}, {"source": {"id": null, "name": "Nintendolife.com"}, "author": "Nintendo Life", "title": "Random: Nintendo Says Streets Of Rage 4 Is Out On Switch, But It Definitely Isn't - Nintendo Life", "description": "Here we go again", "url": "http://www.nintendolife.com/news/2020/04/random_nintendo_says_streets_of_rage_4_is_out_on_switch_but_it_definitely_isnt", "urlToImage": null, "publishedAt": "2020-04-24T13:00:00Z", "content": "It would appear that Nintendo is still confused over the official release date of Streets of Rage 4 on Switch, following up on its initial erroneous eShop listing with a new, incorrect news post.\r\nYou may remember that at the start of the month, the Nintendo … [+1226 chars]"}, {"source": {"id": null, "name": "Pushsquare.com"}, "author": "Push Square", "title": "Next-Gen Game Reveals Are Imminent, But Sony Silent on PS5 Plans - Push Square", "description": "Microsoft says game reveals are coming", "url": "http://www.pushsquare.com/news/2020/04/next-gen_game_reveals_are_imminent_but_sony_silent_on_ps5_plans", "urlToImage": null, "publishedAt": "2020-04-24T13:00:00Z", "content": "Weve already got a glimpse of a couple of PlayStation 5 games courtesy of Godfall and Quantum Error, but with coronavirus scuppering its plans, Sony has been largely tight-lipped about its next-gen plans. Despite not showing much more than the Japanese giant,… [+1062 chars]"}, {"source": {"id": null, "name": "Techspot.com"}, "author": "Rob Thubron", "title": "Malwarebytes steps into the VPN space with WireGuard-based service - TechSpot", "description": "Available now for Windows 7 and higher—Mac, Android, iOS, and Chrome OS are coming soon—Malwarebytes Privacy costs $59.99 per year. You can also get it bundled with a 1-year license of Malwarebytes Premium for $89.99, saving buyers $49.99. Both options&hellip;", "url": "https://www.techspot.com/news/84974-malwarebytes-steps-vpn-space-wireguard-based-service.html", "urlToImage": null, "publishedAt": "2020-04-24T12:37:00Z", "content": "In brief: Malwarebytes is joining the list of antivirus companies that also offer a VPN. Called Malwarebytes Privacy, the service uses a newer and faster protocol: WireGuard. \r\nAvailable now for Windows 7 and higherMac, Android, iOS, and Chrome OS are coming … [+1527 chars]"}, {"source": {"id": null, "name": "Darko.audio"}, "author": "John H. Darko", "title": "10 more thoughts on the Chord 2go + Hugo 2 - Darko.Audio", "description": "A deeper dive on the bolt-on network streamer.", "url": "https://darko.audio/2020/04/10-more-thoughts-on-the-chord-2go-hugo-2/", "urlToImage": null, "publishedAt": "2020-04-24T12:10:14Z", "content": "What’s the best network streamer for the Chord Electronics Hugo 2 DAC / headphone amplifier? With the introduction of the 2go, it took Chord themselves to strip away any choice paralysis. The 2go is a bolt-on module that turns the Hugo 2 into a wired/wireless… [+6703 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Dieter Bohn", "title": "Making macOS run well on ARM processors isn’t the hard part - The Verge", "description": "We finally have a report confirming Apple is actively working on ARM processors for Macs. But as Dieter Bohn explains, just getting macOS and Apple’s own apps running  on it isn’t enough. Processor transitions are hard!", "url": "https://www.theverge.com/2020/4/24/21233661/macos-arm-processor-transition-apps-developers-catalyst-wwdc", "urlToImage": null, "publishedAt": "2020-04-24T11:21:16Z", "content": "Less surprise will mean more delight\r\nPhoto by Nilay Patel / The Verge\r\nMark Gurman at Bloomberg has the confirmation weve all be waiting for: Apple will reportedly use a 12-core 5nm ARM processor in a 2021 Mac. Theres plenty of time to work out the details, … [+11995 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Matt Hanson", "title": "Nvidia and AMD gear up for next-gen 7nm GPU war - TechRadar", "description": "Companies go on a shopping spree", "url": "https://www.techradar.com/news/nvidia-and-amd-gear-up-for-next-gen-7nm-gpu-war", "urlToImage": null, "publishedAt": "2020-04-24T11:02:00Z", "content": "It looks like Nvidia and AMD are gearing up to produce next-gen 7nm graphics cards, with both companies reportedly snapping up any spare 7nm capacity TSMC (Taiwan Semiconductor Manufacturing Company) has.\r\nLots of tech companies use TSMC to build their chips,… [+1866 chars]"}, {"source": {"id": null, "name": "Pocket-lint.com"}, "author": "Pocket-lint", "title": "Zoom vs Microsoft Teams vs Google Meet: What's the best video conferencing service? - Pocket-lint", "description": "Video conferencing software and apps are an essential means of communication for all sorts of people and businesses.", "url": "https://www.pocket-lint.com/apps/news/151947-zoom-vs-microsoft-teams-vs-google-meet-what-s-the-difference", "urlToImage": null, "publishedAt": "2020-04-24T10:48:44Z", "content": "Video conferencing software and apps are an essential means of communication for all sorts of people and businesses.\r\nWhether you're in a long-distance relationship, taking an online class, or working from home, you need a way to connect over video conferenci… [+7023 chars]"}, {"source": {"id": null, "name": "Eurogamer.net"}, "author": "Wesley Yin-Poole", "title": "WWE 2K21 canned after disastrous WWE 2K20 - Eurogamer.net", "description": null, "url": "https://www.eurogamer.net/articles/2020-04-24-wwe-2k21-canned-after-disastrous-wwe-2k20", "urlToImage": null, "publishedAt": "2020-04-24T10:28:00Z", "content": "WWE 2K21 is canned, WWE has confirmed.\r\nDuring WWE's financial call overnight, interim chief financial officer Frank Riddick said: \"There's not going to be a launch of the game this year.\"\r\nThe news comes after last year's disastrous launch of WWE 2K20, which… [+830 chars]"}, {"source": {"id": null, "name": "Rockpapershotgun.com"}, "author": null, "title": "XCOM: Chimera Squad is out now, and it's half-price - Rock Paper Shotgun", "description": "It’s time to put down your world-saving guns and pick up your alien-policemen batons, because XCOM: Chimera Squad is out.", "url": "https://www.rockpapershotgun.com/2020/04/24/xcom-chimera-squad-is-out-now-and-its-half-price/", "urlToImage": null, "publishedAt": "2020-04-24T10:17:00Z", "content": "It’s time to put down your world-saving guns and pick up your alien-policing batons, because XCOM: Chimera Squad is out. XCOPS takes a big sidewards leap away from the main series, boiling down turn-based combat into single-room encounters. Developers Firaxis… [+2356 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Jeff Parsons", "title": "Beware the WhatsApp 'free beer' scam to get your personal data - Metro.co.uk", "description": "The hoax is currently circulating on WhatsApp", "url": "https://metro.co.uk/2020/04/24/beware-whatsapp-free-beer-text-just-scam-get-private-information-12603287/", "urlToImage": null, "publishedAt": "2020-04-24T09:29:18Z", "content": "The hoax is spreading through WhatsApp (Picture: Getty)\r\nA WhatsApp message promising what everyone could do with right now a free beer is nothing more than a dangerous hoax.\r\nIf you get the message, which is seemingly from Dutch beer company Heineken, ignore… [+1983 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "GameCentral", "title": "Play Call Of Duty: Modern Warfare multiplayer for free this weekend - Metro.co.uk", "description": "Five maps from the main multiplayer mode of Modern Warfare will be free to play for everyone from today until Monday.", "url": "https://metro.co.uk/2020/04/24/play-call-duty-modern-warfare-multiplayer-maps-free-weekend-via-warzone-12603582/", "urlToImage": null, "publishedAt": "2020-04-24T09:29:08Z", "content": "Call Of Duty: Modern Warfare another free trial (pic: Activision)\r\nFive maps from the main multiplayer mode of Modern Warfare will be free to play for everyone from today until Monday.\r\nCall Of Duty: Warzone may be free-to-play but the main multiplayer mode o… [+1680 chars]"}, {"source": {"id": null, "name": "Kotaku.com"}, "author": null, "title": "You Can Finally Apologise for Being Crap in Overwatch - Kotaku UK", "description": "Blizzard is going to add a voice line feature that speaks to me on a very personal level: the ability to apologise.", "url": "https://kotaku.com/you-can-finally-apologize-for-being-trash-in-overwatch-1843029325", "urlToImage": null, "publishedAt": "2020-04-24T08:00:00Z", "content": "Who doesnt love voice lines in Overwatch? They let you say hello. They can help your teammates stay abreast of your ultimate percentage. If you play DPS, you can use them to spam messages about how you need healing until everybody elses ears seal closed like … [+2085 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "https://www.facebook.com/TechRadar", "title": "iPhone SE review (2020): Apple finally has a cheap iPhone to review - TechRadar India", "description": "The 2020 iPhone SE is lightweight, cheap and future-proofed - well done, Apple", "url": "https://www.techradar.com/reviews/iphone-se", "urlToImage": null, "publishedAt": "2020-04-24T07:30:00Z", "content": "Two-minute review\r\nThe iPhone SE 2020 is built around one goal: to create a new iPhone for less money than ever, and it achieves that well. For just $399 / £419 / AU$749 you can have a brand-new handset from Apple its one of the best iPhones ever created and … [+23328 chars]"}]}