{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "HTC Desire 20 Pro spotted on Geekbench, likely to come with 6GB RAM - Hindustan Times", "description": "The tipster also notes that the phone is codenamed ‘Bayamo’ and it will sport a 3.5mm headphone jack.", "url": "https://www.hindustantimes.com/tech/htc-desire-20-pro-spotted-on-geekbench-likely-to-come-with-6gb-ram/story-sBOS2j6L8ZFliDiAi2UZLM.html", "urlToImage": null, "publishedAt": "2020-04-26T05:15:05Z", "content": "HTC launched its flagship the HTC U12+ back in May 2018. Now, two years later, it seems that the company is gearing to launch a new flagship smartphone.\r\nAccording to a report by tipster LlabTooFeR, HTC is planning to launch an HTC Desire 10 Pro successor soo… [+1063 chars]"}, {"source": {"id": null, "name": "Gadgetsnow.com"}, "author": "Gadgets Now Bureau", "title": "Dangerous iPhone message, Zoom’s new features, New Google Meet and Duo features and other top tech news of the week - Gadgets Now", "description": "This week, Facebook and Google both took on video calling app Zoom by launching a new services. Facebook launched Messenger Room while new Meet and Duo features were introduced by Google Zoom also announced new features to bolster its security. There were rep…", "url": "https://www.gadgetsnow.com/slideshows/dangerous-iphone-message-zooms-new-features-new-google-meet-and-duo-features-and-other-top-tech-news-of-the-week/photolist/75383748.cms", "urlToImage": null, "publishedAt": "2020-04-26T04:50:00Z", "content": "If you use an Apple device, here’s an important ‘warning’. A new text bomb is crashing iPhones, Apple Watch, iPad or Mac. This string of characters includes Italian flag emoji and some Sindhi characters.\r\nAccording to a report by 9to5Mac, users have reported … [+634 chars]"}, {"source": {"id": null, "name": "Siasat.com"}, "author": "Safoora", "title": "iPhone users! This message can crash Apple devices in seconds - The Siasat Daily", "description": "NEW DELHI: Here’s an important ‘warning’ if you use an Apple devices. There's a text message that has been circulating on secure messaging platform Telegram as well as a number of forums that particularly affects Apple devices running on iOS. This string of c…", "url": "https://www.siasat.com/iphone-users-message-can-crash-apple-devices-seconds-1879653/", "urlToImage": null, "publishedAt": "2020-04-26T04:45:20Z", "content": "NEW DELHI: Heres an important warning if you use an Apple devices.\r\nThere’s a text message that has been circulating on secure messaging platform Telegram as well as a number of forums that particularly affects Apple devices running on iOS.\r\nThis string of ch… [+525 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Desire Athow", "title": "This 4TB PCIe SSD can make your Windows laptop feel more like a MacBook Pro - Techradar", "description": "Assuming you have a compatible laptop, that is", "url": "https://www.techradar.com/news/this-4tb-pcie-ssd-can-make-your-windows-laptop-feel-more-like-a-macbook-pro", "urlToImage": null, "publishedAt": "2020-04-26T03:00:00Z", "content": "The Apple MacBook Pro 16 still holds bragging rights when it comes to the maximum storage capacity available in a traditional portable laptop. \r\nApple uses a proprietary approach, plugging memory chips directly into the motherboard to reach a whopping 8TB of … [+1494 chars]"}, {"source": {"id": null, "name": "Gsmarena.com"}, "author": "Ivan", "title": "Xiaomi Mi 10 5G in for review - GSMArena.com news - GSMArena.com", "description": "Xiaomi's more-affordable has arrived.", "url": "https://www.gsmarena.com/xiaomi_mi_10_5g_in_for_review-news-42855.php", "urlToImage": null, "publishedAt": "2020-04-26T00:22:01Z", "content": "Now that we've covered the Xiaomi Mi 10 Pro in detail in our review, it's time to take a look at its more affordable counterpart - the Mi 10.\r\nFirst, an unboxing. The Xiaomi Mi 10 5G comes bundled with a 30W charger, USB-C cable, a silicone case, and a USB-C … [+1172 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Ewan Spence", "title": "Apple Leak Reveals Radical New MacBook - Forbes", "description": "Apple's first ARM powered MacBook is expected to launch next year, as Tim Cook moves away from Intel's grasp.", "url": "https://www.forbes.com/sites/ewanspence/2020/04/25/apple-macbook-pro-arm-intel-new-leak-rumor-specs-release-date/", "urlToImage": null, "publishedAt": "2020-04-25T23:36:11Z", "content": "Apple may be preparing to update the 13-inch and 16-inch MacBook Pro machines to Intels tenth-generation processors, but its longstanding project to bring ARM power to its MacOS platform gathers pace, with reports today that a release in 2021 is on the cards.… [+6658 chars]"}, {"source": {"id": null, "name": "Androidauthority.com"}, "author": null, "title": "We asked, you told us: The OnePlus 8 Pro outshines the Galaxy S20 Plus - Android Authority", "description": "10,000 of you voted, and there's a clear winner: the OnePlus 8 Pro beats out the Galaxy S20 Plus.", "url": "https://www.androidauthority.com/oneplus-8-pro-vs-samsung-galaxy-s20-plus-poll-results-1111262/", "urlToImage": null, "publishedAt": "2020-04-25T23:31:06Z", "content": "OnePlus has been creeping up its prices every year since the OnePlus One. This year was the same case, but no one expected the company to do what it did: create a true rival to the Samsung Galaxy S20. A real IP rating, a solid camera system, and damn-good sof… [+2730 chars]"}, {"source": {"id": null, "name": "Androidpolice.com"}, "author": "https://www.facebook.com/corbin.davenport.50", "title": "OnePlus 6/6T receive OxygenOS 10.3.3 following end of Open Beta program - Android Police", "description": "OnePlus just announced the end of the OxygenOS Open Beta program for the 6 and 6T, but the company promised that regular stable updates would continue.", "url": "https://www.androidpolice.com/2020/04/25/oneplus-6-6t-receive-oxygenos-10-3-3-following-end-of-open-beta-program/", "urlToImage": null, "publishedAt": "2020-04-25T22:31:20Z", "content": "OnePlus just announced the end of the OxygenOS Open Beta program for the 6 and 6T, but the company promised that regular stable updates would continue. Sure enough, both phones are now receiving a new system update, containing a handful of bug fixes and secur… [+1307 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "BMW 8 Series Gran Coupe Debuts In Malaysia, India Launch Next Month - India Gone Viral", "description": "BMW 8 Series Gran Coupe M Sport is powered by a 3.0-litre six-cylinder turbo engine producing 335 horsepower and 500 Nm BMW 8 Series Gran Coupe has gone on sale in Malaysia priced at RM968,800 (Rs. 1.", "url": "https://indiagoneviral.com/technology/2020/04/26/bmw-8-series-gran-coupe-debuts-in-malaysia-india-launch-next-month/42487/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-25T22:02:42Z", "content": "BMW 8 Series Gran Coupe has gone on sale in Malaysia priced at RM968,800 (Rs. 1.69 crore approx) OTR without insurance. Retailed in single-spec 840i M Sport, it comes equipped with a 3.0-litre turbo six-cylinder petrol developing 335 horsepower between 5,000 … [+2252 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Souhardya Biswas", "title": "Fan Comes Up With Potential Buffs And Rework Concepts For Apex Legends - Essentially Sports", "description": "Popular Apex Legends data miner and content creator, iLootGames has shared some of these ideas which were provided to him by an Apex fan named wicked_fool.", "url": "https://www.essentiallysports.com/fan-comes-up-with-potential-buffs-and-rework-concepts-for-apex-legends-esports-news-2020/", "urlToImage": null, "publishedAt": "2020-04-25T21:17:00Z", "content": "Apex Legends Season 5 is set to begin on May 12, which will also mark the end of Season 4. Respawn will also add a new Battle Armor LTM, which will have four phases from April 28 through May 12. Meanwhile, players have spotted few in-game teasers, and more ar… [+3086 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "", "title": "iPhone SE can take portrait photos of non-humans using an app - Engadget", "description": "Halide's updated camera apps let you snap iPhone SE portrait photos of anything, not just people.", "url": "https://www.engadget.com/halide-camera-iphone-se-portaits-of-non-humans-195324723.html", "urlToImage": null, "publishedAt": "2020-04-25T20:12:09Z", "content": "The iPhone SE offers many things for the money, but a powerful portrait mode isn’t one of them. Much like the iPhone XR, you’re stuck taking portrait photos of people if you use the default camera app — a problem at a time when you’re supposed to avoid most h… [+756 chars]"}, {"source": {"id": null, "name": "Gizchina.com"}, "author": null, "title": "Xiaomi’s Himo Z16 foldable electric bike pictures surface online - Gizchina.com", "description": "Xiaomi's upcoming Himo Z16 electrick bike is on crowdfunding at YouPin platform. Today a couple of pictures emerged in the web revealing key details.", "url": "https://www.gizchina.com/2020/04/25/xiaomi-himo-z16-electric-bike/", "urlToImage": null, "publishedAt": "2020-04-25T19:29:13Z", "content": "Xiaomi is well known for its massive amount of products. The company is one of the most important smartphone makers in the world, however, in China, the company also offers a myriad of other products for different segments. While some of these products come t… [+1453 chars]"}, {"source": {"id": null, "name": "Business-standard.com"}, "author": "Mike Isaac & Sheera Frenkel | NYT", "title": "Zooms sudden popularity sets off scramble in rivals - Business Standard", "description": "Facebook, Google and other behemoths are training their sights on Silicon Valley's company of the moment", "url": "https://www.business-standard.com/article/international/zoom-s-sudden-popularity-sets-off-scramble-in-rivals-120042600008_1.html", "urlToImage": null, "publishedAt": "2020-04-25T19:28:16Z", "content": "As people turned in droves to the video chatting app Zoom in recent weeks, the buzz caught Facebook’s attention. Inside the social network, that immediately set off a scramble.\r\nMark Zuckerberg, Facebook’s chief executive, ordered employees to ramp up and foc… [+4014 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Stephen Shankland", "title": "Microsoft tells Chrome users to switch to its Edge browser on Outlook - CNET", "description": "Microsoft's web browser and email service are \"better together,\" the company argues.", "url": "https://www.cnet.com/news/microsoft-tells-chrome-users-to-switch-to-its-edge-browser-on-outlook/", "urlToImage": null, "publishedAt": "2020-04-25T19:18:49Z", "content": "Illustration by Stephen Shankland/CNET\r\nFor years, Google has placed prominent pop-up ads on its web properties suggesting people switch to Google's Chrome browser, saying they'll get better performance, features and security. Now Microsoft is trying the same… [+1886 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Discord’s Mobile Voice Overlay is no longer a Samsung Galaxy exclusive - XDA Developers", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiWmh0dHBzOi8vd3d3LnhkYS1kZXZlbG9wZXJzLmNvbS9kaXNjb3JkLW1vYmlsZS12b2ljZS1vdmVybGF5LWF2YWlsYWJsZS1hbGwtYW5kcm9pZC1kZXZpY2VzL9IBXmh0dHBzOi8vd3d3LnhkYS1kZXZlbG9wZXJzLmNvbS9kaXNjb3JkLW1vYmlsZS12b2ljZS1vdmVybGF5LWF2YWlsYWJsZS1hbGwtYW5kcm9pZC1kZXZpY2VzL2FtcC8?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T19:16:00Z", "content": null}, {"source": {"id": null, "name": "Gizchina.com"}, "author": "https://web.facebook.com/udinmwen.efosa", "title": "Redmi K30i to come with a 120Hz display - Gizchina.com", "description": "Redmi K30i to come with a 120Hz display. This device will also come with a Snapdragon 765G SoC, 4500 mAh and it will be cheap", "url": "https://www.gizchina.com/2020/04/25/redmi-k30i-to-come-with-a-120hz-display/", "urlToImage": null, "publishedAt": "2020-04-25T19:07:30Z", "content": "Redmi is expected to launch a new member of the Redmi K30 series in the near future. As of now, this series has four smartphones. They include Redmi K30, Redmi K30 5G, Redmi K30 Pro, and Redmi K30 Pro Zoom models. However, Redmi is not done and it is planning… [+1481 chars]"}, {"source": {"id": null, "name": "Androidpolice.com"}, "author": "https://www.facebook.com/corbin.davenport.50", "title": "Android 11 DP3 adds new sensitivity options for gesture navigation - Android Police", "description": "Google was changing Android 10's full-screen gesture navigation all the way up to release, and you could definitely make the argument that there were", "url": "https://www.androidpolice.com/2020/04/25/android-11-dp3-adds-new-sensitivity-options-for-gesture-navigation/", "urlToImage": null, "publishedAt": "2020-04-25T18:49:39Z", "content": "Google was changing Android 10's full-screen gesture navigation all the way up to release, and you could definitely make the argument that there were still unresolved issues I still frequently go back when I'm trying to open an app's side menu. Thankfully, th… [+740 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "Nintendo admits 1.6 lakh user accounts have been hacked - Hindustan Times", "description": "Nintendo has sincerely apologised for the incident and has said that it is disabling the ability to log into a Nintendo account through a Nintendo Network ID", "url": "https://www.hindustantimes.com/tech/nintendo-admits-1-6-lakh-user-accounts-have-been-hacked/story-d7xFzCSFMCxxCL0BUcEepK.html", "urlToImage": null, "publishedAt": "2020-04-25T18:44:29Z", "content": "Japanese video game company Nintendo has admitted that over 160,000 user accounts were compromised recently where hackers took the login IDs and passwords and the company is notifying those who were affected.\r\nNintendo which “sincerely apologized” for the inc… [+1873 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "", "title": "WhatsApp claims spyware firm launched attacks with US servers - Engadget", "description": "WhatsApp has accused NSO Group of launching its surveillance attacks from US servers despite claims to the contrary.", "url": "https://www.engadget.com/whatsapp-says-nso-group-launched-attacks-from-us-155827515.html", "urlToImage": null, "publishedAt": "2020-04-25T18:39:41Z", "content": "Facebook just escalated its lawsuit over surveillance firm NSO Group’s WhatsApp call exploit attacks. The WhatsApp team has filed accusations that NSO relied on US-based servers to stage its spyware attacks using Pegasus software. NSO reportedly used the Los … [+725 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "PUBG Mobile Lite 0.17.0 Beta update: Payload mode, Falcon and more incoming - Hindustan Times", "description": "You can install it on your Android and Apple devices both to test it", "url": "https://www.hindustantimes.com/tech/pubg-mobile-lite-0-17-0-beta-update-payload-mode-falcon-and-more-incoming/story-ptP78mKcP6vfGtoTpe5D8I.html", "urlToImage": null, "publishedAt": "2020-04-25T17:15:12Z", "content": "For PUBG Mobile Lite users, Tencent has started rolling out the 0.17.0 Beta update. This update brings in the much-awaited Payload mode to the game along with some new features. \r\nThe most noticeable change that the latest update brings in is the Payload mode… [+1080 chars]"}, {"source": {"id": null, "name": "9to5google.com"}, "author": null, "title": "How to record videos and take pictures w/ Google’s 3D animals - 9to5Google", "description": "Google's 3D animals are a fun viral trend, and they have a nice trick that allows users an easy way to take pictures and record videos. Here's how.", "url": "https://9to5google.com/2020/04/25/google-3d-animal-videos-pictures/", "urlToImage": null, "publishedAt": "2020-04-25T17:02:50Z", "content": "Google’s 3D animals have become a viral trend, but many people have been recording videos and taking pictures with them simply by taking screenshots or screen recordings. What you might not have realized, though, is that this feature has a built-in option for… [+3105 chars]"}, {"source": {"id": null, "name": "Neowin.net"}, "author": "https://www.facebook.com/rich.woods.56", "title": "OnePlus 8 Pro review: A killer flagship - Neowin", "description": "The OnePlus 8 Pro is probably the best Android phone that you can buy right now, packing a 120Hz QHD OLED display, impressive camera improvements, and finally, 30W wireless charging,", "url": "https://www.neowin.net/news/oneplus-8-pro-review-a-killer-flagship/", "urlToImage": null, "publishedAt": "2020-04-25T16:02:00Z", "content": "When OnePlus came onto the scene in 2014 with the One, it promised a Flagship Killer. It delivered too, with a $349 Android device with top-end specs, an innovative design with different materials like bamboo, and fan-favorite Cyanogen building out the OS. Th… [+13724 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Apple Watch turns 5: Did you know this is not the first watch Apple has designed? - Hindustan Times", "description": "That and four other cool things you did not know about the Apple Watch", "url": "https://www.hindustantimes.com/tech/apple-watch-turns-5-did-you-know-this-is-not-the-first-watch-apple-has-designed/story-TaLd5mAFahahxirkVPkLaN.html", "urlToImage": null, "publishedAt": "2020-04-25T15:57:39Z", "content": "Apple launched the first Apple Watch five years ago this week. The Apple Watch was Tim Cook’s first high profile product launch after he took over from Steve Jobs. For Jobs, the Apple iPad was the last big product that he launched. \r\nOver the last five years,… [+4241 chars]"}, {"source": {"id": null, "name": "Thenewsminute.com"}, "author": null, "title": "WhatsApp may soon start showing ads to users - The News Minute", "description": "Facebook-owned instant messaging platform WhatsApp is likely to start showing ads soon, reports suggest.", "url": "https://www.thenewsminute.com/article/whatsapp-may-soon-start-showing-ads-users-123346", "urlToImage": null, "publishedAt": "2020-04-25T14:21:34Z", "content": "As per reports, users are likely to see ads once Facebook completes its effort to link all its social media platforms.Facebook-owned instant messaging platform WhatsApp is likely to start showing ads soon, reports suggest.\r\nWhen Facebook acquired WhatsApp in … [+1427 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Is OnePlus 8 Worth Rs. 7000 More Than OnePlus 7T? - Gadgets 360", "description": "OnePlus 8 vs OnePlus 7T specs reveal an interesting story. While the OnePlus 8 is a lot more expensive than the OnePlus 7T, the improvements don't appear to ...", "url": "https://www.youtube.com/watch?v=otmS9y10glA", "urlToImage": null, "publishedAt": "2020-04-25T13:31:28Z", "content": null}, {"source": {"id": null, "name": "News18.com"}, "author": "https://www.facebook.com/Firstshopp1/", "title": "Privacy of Covid-19 Contact Tracing Apps Has Silicon Valley, Europe Divided - firstshopp", "description": "A policewoman wears a mask to protect herself against the spread of the new coronavirus at the garden of the Eiffel Tower in Paris on April 6, 2020. (AP Photo/Michel Euler) Led by France and Germany, many countries are using smartphone technology to trace Cov…", "url": "https://www.news18.com/news/tech/privacy-of-covid-19-contact-tracing-apps-has-silicon-valley-europe-divided-2592573.html", "urlToImage": null, "publishedAt": "2020-04-25T13:29:28Z", "content": "A standoff between the two largest nations in the European Union and Silicon Valley escalated on Friday as Apple and Google rebuffed demands by France and Germany to back their approach to using smartphone technology to trace coronavirus infections.\r\nCountrie… [+3246 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "You can now use Apple Music on your Samsung Smart TVs - Hindustan Times", "description": "If you have a Samsung Smart TV model between 2018 and 2020, you can stream Apple Music on it", "url": "https://www.hindustantimes.com/tech/you-can-now-use-apple-music-on-your-samsung-smart-tvs/story-DqBenQxwj8BJeMrWSgLGJM.html", "urlToImage": null, "publishedAt": "2020-04-25T13:26:00Z", "content": "Samsung has become the first TV manufacturer to get the Apple Music app on its platform. If you own one of their smart TVs, bought between 2018 and 2020, you will get the Apple Music app for free and you can start streaming music on it. Samsung has said that … [+1199 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Don't trust the next mail you get from HR, it might be a scam - Hindustan Times", "description": "Hackers have found an ingenious way of getting to you, through mails from HR. So better pay attention to all those mails from the HR department.", "url": "https://www.hindustantimes.com/tech/don-t-trust-the-next-mail-you-get-from-hr-department-it-can-be-a-scam-to-steal-your-office-login-id-and-password-says-cofence-researchers/story-6SFvOChaplPfgGilaLuuoL.html", "urlToImage": null, "publishedAt": "2020-04-25T12:39:55Z", "content": "We all get mails from the HR department at least once every day, and mostly we tend to ignore them. But scammers are trying to make the most out of it these days. As found by the research and security firm Cofence, scammers are trying to steal your office cre… [+1671 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Paul Tassi", "title": "Pokémon Go Abra Community Day: How To Get A Shiny, Powerful Alakazam At Home - Forbes", "description": "How to get yourself a shiny, powerful Alakazam in Pokemon GO's Abra Community Day, stay at home edition.", "url": "https://www.forbes.com/sites/paultassi/2020/04/25/pokmon-go-abra-community-day-how-to-get-a-shiny-powerful-alakazam-at-home/", "urlToImage": null, "publishedAt": "2020-04-25T12:16:12Z", "content": "Alakazam\r\nNiantic\r\nNiantic is continuing to try to adapt Pokémon GO, the game youre supposed to play by going outside and hanging out with your friends, into a temporarily, solo, stay-at-home adventure as lockdowns remain in place. That continues with todays … [+2194 chars]"}, {"source": {"id": null, "name": "News18.com"}, "author": "News18", "title": "iPhone vs OnePlus: Which Would You Buy? Data Shows Apple Gaining on Rivals in India - News18", "description": "Apple registered a sharp growth of over 128 percent to reach 33 percent market share in premium devices category above Rs 30,000, but Samsung still leads market.", "url": "https://www.news18.com/news/tech/iphone-vs-oneplus-which-would-you-buy-data-shows-apple-gaining-on-rivals-in-india-2591999.html", "urlToImage": null, "publishedAt": "2020-04-25T11:50:57Z", "content": "The great Apple growth story continued in the first quarter of 2020 as the Cupertino-based iPhone maker grew 126 per cent in the premium segment (Rs 30,000 and above), reaching its share to 33 per cent as compared to 18 per cent a year ago signaling a worriso… [+1916 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Lynn La", "title": "iPhone SE vs. iPhone 8 comparison: Which $400 iPhone should you get? - CNET", "description": "Some retailers are still selling the iPhone 8 despite Apple discontinuing the device. But you should just get the new iPhone SE instead.", "url": "https://www.cnet.com/news/iphone-se-vs-iphone-8-spec-comparison-which-400-iphone-should-you-get/", "urlToImage": null, "publishedAt": "2020-04-25T11:28:26Z", "content": "In a bid to lure budget-minded iPhone fans, Apple debuted its new iPhone SE for 2020 on April 15 for $399 (£419, AU$749). It's a sequel to its 2016 iPhone of the same name. The new iPhone SE's specs are similar to the iPhone 8 from three years ago, which is l… [+8211 chars]"}, {"source": {"id": null, "name": "Ghacks.net"}, "author": null, "title": "Android 11 may revoke app permissions automatically - Ghacks Technology News", "description": "Android 11 devices may revoke application permissions automatically if they are configured that way by the owner of the device.", "url": "https://www.ghacks.net/2020/04/25/android-11-may-revoke-app-permissions-automatically/", "urlToImage": null, "publishedAt": "2020-04-25T11:17:37Z", "content": "Google released the third developer preview of the upcoming Android 11 operating system. The preview includes a number of changes and also some new features that developers and those interested in previewing new versions may check out right now.\r\nOne of the c… [+2019 chars]"}, {"source": {"id": null, "name": "91mobiles.com"}, "author": null, "title": "Realme X50M: 4 reasons why this phone should launch in India soon - 91mobiles", "description": "Realme X50 has been launched in China with specifications like Snapdragon 765G 5G chipset and 120Hz display priced at around Rs 21,000", "url": "https://www.91mobiles.com/hub/realme-x50m-could-launch-in-india-soon-reasons/", "urlToImage": null, "publishedAt": "2020-04-25T11:03:21Z", "content": "Realme X50M is the perfect smartphone to slot in between the Realme X2 and Realme X2 Pro in India\r\nRealme X50M is the third X50-series phone, after Realme X50 and X50 Pro, that has been launched in China. It’s a mid-range offering from the brand with 5G conne… [+3408 chars]"}, {"source": {"id": null, "name": "Windowslatest.com"}, "author": null, "title": "Microsoft is looking into issues of Windows 10 KB4549951 - WindowsLatest", "description": "Windows 10 KB4549951, which was released on April 14 with security fixes, is reportedly plagued with serious issues for some users. The update is only available for consumers with Windows 10 version 1903 and 1909, and the patch contains security fixes. Initia…", "url": "https://www.windowslatest.com/2020/04/25/microsoft-comments-on-windows-10-kb4549951-issues/", "urlToImage": null, "publishedAt": "2020-04-25T10:37:00Z", "content": "Windows 10 KB4549951, which was released on April 14 with security fixes, is reportedly plagued with serious issues for some users. The update is only available for consumers with Windows 10 version 1903 and 1909, and the patch contains security fixes.\r\nIniti… [+2196 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "India TV Tech Desk", "title": "Vivo Y50 with punch-hole camera launched: Price, Specifications and more - India TV News", "description": "Vivo Y50 comes with a single punch-hole camera, 5,000mAh battery, Snapdragon 665 processor and more. Here's all you need to know.", "url": "https://www.indiatvnews.com/technology/news-vivo-y50-snapdragon-665-launched-price-specifications-611173", "urlToImage": null, "publishedAt": "2020-04-25T10:06:48Z", "content": "Vivo Y50 comes with a quad-camera setup at the back.\r\nVivo has launched yet another smartphone in its home country, China. The all-new Vivo Y50 is an addition to the companys mid-range Y family. The key highlights of the new smartphone include a single punch-… [+1314 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Huawei MatePad with 10.4-inch display, 7250mAh battery launched - Hindustan Times", "description": "Huawei has launched a new tablet in China. Check full price, specifications, and features of the new device.", "url": "https://www.hindustantimes.com/tech/huawei-matepad-with-10-4-inch-display-7250mah-battery-launched/story-iY6Ql8vdpmBgygdeuqGZkK.html", "urlToImage": null, "publishedAt": "2020-04-25T09:43:57Z", "content": "Huawei has launched a new tablet PC with stylus support. Called MatePad, the new device is said to be a cheaper version of MatePad Pro which launched in China last year. \r\nHuawei MatePad comes with 10.4-inch display featuring an IPS panel and 2,000 x 1,200 pi… [+948 chars]"}, {"source": {"id": null, "name": "Fossbytes.com"}, "author": "Sarvottam Kumar", "title": "After Ubuntu 20.04 Release, Ubuntu 20.10 Is Codenamed 'Groovy Gorilla' - Fossbytes", "description": "A day after Ubuntu 20.04 release, the Ubuntu development team is gearing up to make the next Ubuntu 20.10 groovier with Gorilla. 'Groovy Gorilla' is now the codename chosen for Ubuntu 20.10 which will release on October 22, 2020.", "url": "https://fossbytes.com/ubuntu-20-10-groovy-gorilla-codename/", "urlToImage": null, "publishedAt": "2020-04-25T09:35:00Z", "content": "A day after the Ubuntu 20.04 release, the Ubuntu development team is gearing up to make the next Ubuntu 20.10 groovier with “Gorilla.”\r\nFollowing the traditional method of codenaming each version, ‘Groovy Gorilla’ is now the codename for the Ubuntu 20.10. Wel… [+1750 chars]"}, {"source": {"id": null, "name": "Siasat.com"}, "author": "Tanveer", "title": "An astrologer’s take on COVID-19 and the future - The Siasat Daily", "description": "New Delhi: Renowned astrology researcher, Mahesh Bang, speaks to IANSlife on his prediction on whats in store for the future and also some of the reasons why COVID 19 struck. It has been over a month since the entire world is battling the COVID-19 pandemic. W…", "url": "https://www.siasat.com/astrologers-take-covid-19-and-future-1879361/", "urlToImage": null, "publishedAt": "2020-04-25T09:03:47Z", "content": "New Delhi: Renowned astrology researcher, Mahesh Bang, speaks to IANSlife on his prediction on whats in store for the future and also some of the reasons why COVID 19 struck.\r\nIt has been over a month since the entire world is battling the COVID-19 pandemic. … [+3851 chars]"}, {"source": {"id": null, "name": "Fossbytes.com"}, "author": "Charanjeet Singh", "title": "MIUI 12 Always-On Display Features Now Available For MIUI 11 Users - Fossbytes", "description": "Before the April 27th launch, Xiaomi has been teasing several big features coming with MIUI 12. Now, Xiaomi Theme's account on Weibo has announced that the MIUI 12's new always-on display (AOD) features are available for MIUI 11 users to test right now.", "url": "https://fossbytes.com/miui-12-always-on-display-features-now-available-for-miui-11-users/", "urlToImage": null, "publishedAt": "2020-04-25T09:00:00Z", "content": "Before the April 27th launch, Xiaomi has been teasing several big features coming with the MIUI 12 update. Previously, it revealed changes coming to Always-On Display, such as support for MAML format, new stickers, and over 1000 animations.\r\nNow, Xiaomi Theme… [+1361 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "IANS", "title": "Xiaomi's Mi Pay app gets 24K Gold trading option: Here's how it works - India TV News", "description": "Gold purchased on the Xiaomi Mi Pay app can be saved in a vault and the user can maintain it digitally. Alternatively, the consumer can also opt to get the gold delivered at their doorsteps.", "url": "https://www.indiatvnews.com/technology/news-xiaomi-s-mi-pay-app-gets-24k-gold-trading-option-611136", "urlToImage": null, "publishedAt": "2020-04-25T08:15:32Z", "content": "Mi Pay app is competing against Google Pay, PayTM and PhonePe\r\nXiaomis Mi Pay app has received a new update with a gold trading option in India. Just like Google Pay and PayTM, Mi Pay will now allow users to buy and sell gold in real-time. Xiaomi has partnere… [+1437 chars]"}, {"source": {"id": null, "name": "Gizmochina.com"}, "author": null, "title": "LG Velvet Specs are out ahead of official launch - gizmochina", "description": "There have been multiple rumours over the past few months regarding LG ditching its G series. The South Korean electronics giant confirmed it by revealing new ‘Velvet’ branding, which was later followed by a teaser video exposing the entire design to the publ…", "url": "https://www.gizmochina.com/2020/04/25/lg-velvet-specs-are-out-ahead-of-official-launch/", "urlToImage": null, "publishedAt": "2020-04-25T07:24:00Z", "content": "There have been multiple rumours over the past few months regarding LG ditching its G series. The South Korean electronics giant confirmed it by revealing new Velvet branding, which was later followed by a teaser video exposing the entire design to the public… [+1772 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Desire Athow", "title": "This AMD Ryzen notebook deal is probably the best we've ever seen - Techradar", "description": "Lenovo and AMD provide a glimpse into the future", "url": "https://www.techradar.com/news/this-amd-ryzen-laptop-is-the-probably-the-best-notebook-deal-ever", "urlToImage": null, "publishedAt": "2020-04-25T03:00:00Z", "content": "We reviewers are used to obsessing over incremental technology changes, but every now and then a supernova appears on our radar - something that can single handedly change the status quo.\r\nThe AMD Ryzen 4000 family is one such supernova and promises to bring … [+1829 chars]"}, {"source": {"id": null, "name": "Venturebeat.com"}, "author": "Jeff Grubb", "title": "How Xbox Game Pass freed The Coalition to make Gears Tactics for PC - VentureBeat", "description": "Gears Tactics is the next big first-party Microsoft launch for Xbox Game Pass. Developer The Coalition made the game in part because of Game Pass.", "url": "https://venturebeat.com/2020/04/24/gears-tactics-xbox-game-pass/", "urlToImage": null, "publishedAt": "2020-04-24T23:33:30Z", "content": "Gears Tactics is launching April 28 for Windows 10, Xbox Game Pass for PC, and Steam. On How Games Make Money this week, host Jeff Grubb sits down to talk with The Coalition operations director Mike Crump and Xbox marketing general manager Ben Decker about th… [+4308 chars]"}, {"source": {"id": null, "name": "Gsmarena.com"}, "author": "Vlad", "title": "LG Velvet specs leak - GSMArena.com news - GSMArena.com", "description": "The phone will get official on May 7.", "url": "https://www.gsmarena.com/lg_velvet_specs_leak-news-42863.php", "urlToImage": null, "publishedAt": "2020-04-24T22:00:02Z", "content": "LG's most exciting smartphone in quite a while (at least design-wise) is getting official on May 7. The Velvet should be the first in a line of upper mid-range devices that are meant to replace the now-defunct G series.\r\nLG has been teasing bits and pieces ab… [+1355 chars]"}, {"source": {"id": null, "name": "Businessinsider.in"}, "author": "Lisa Eadicicco", "title": "A Microsoft Word update finally puts an end to the ongoing debate about whether you should put 1 or 2 spaces a - Business Insider India", "description": "Microsoft Word will begin flagging two spaces after a period as an error, a long-running debate that's been met with both excitement and criticism.The company", "url": "https://www.businessinsider.in/tech/news/a-microsoft-word-update-finally-puts-an-end-to-the-ongoing-debate-about-whether-you-should-put-1-or-2-spaces-after-a-period/articleshow/75365060.cms", "urlToImage": null, "publishedAt": "2020-04-24T21:14:00Z", "content": "Microsoft is putting its foot down in the age-old debate about whether it's correct to put one or two spaces after a period. \r\nMicrosoft Word's Editor function is getting a new feature that flags two spaces after a period as an error, according to The Verge. … [+1172 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The Best Free Alternatives to Zoom - Lifehacker", "description": "While the popularity of the video conferencing service Zoom has skyrocketed since the outbreak of the coronavirus, recent news of its many security and priva...", "url": "https://www.youtube.com/watch?v=g7SIqs8dos4", "urlToImage": null, "publishedAt": "2020-04-24T19:48:38Z", "content": "While the popularity of the video conferencing service Zoom has skyrocketed since the outbreak of the coronavirus, recent news of its many security and privacy issues might have you feeling nervous about using it. In the video above, I share three free altern… [+1048 chars]"}, {"source": {"id": null, "name": "Gizmochina.com"}, "author": null, "title": "Honor 30 vs Huawei Nova 7 vs OnePlus 8: Specs Comparison - gizmochina", "description": "A comparison between flagship killers: Honor 30, Huawei Nova 7 and OnePlus 8.", "url": "https://www.gizmochina.com/2020/04/24/honor-30-vs-huawei-nova-7-vs-oneplus-8-specs-comparison/", "urlToImage": null, "publishedAt": "2020-04-24T19:40:00Z", "content": "The price of the top-tier flagships increased a lot during the last year. But at the same time, the number of flagship killers increased as well. The mainstream smartphone manufacturers are now releasing their main flagship lineups in more than one variant, a… [+5879 chars]"}, {"source": {"id": null, "name": "Investing.com"}, "author": null, "title": "Zoom Turns Lower as Facebook Rolls out Free Video Calling - Investing.com", "description": "Zoom Turns Lower as Facebook Rolls out Free Video Calling", "url": "https://www.investing.com/news/stock-market-news/zoom-turns-lower-as-facebook-free-video-calling-2150712", "urlToImage": null, "publishedAt": "2020-04-24T19:04:00Z", "content": "By Yasin Ebrahim \r\nInvesing.com - Zoom has been riding a wave of popularity, led by a surge in demand for video chat amid lockdown measures worldwide, and its growth has not gone unnoticed as Facebook (NASDAQ:FB) launched its group video chat feature \"Messeng… [+686 chars]"}, {"source": {"id": null, "name": "Dualshockers.com"}, "author": "Nick Tricome", "title": "The PS5 DualSense and Xbox Series X Controllers Show Evolution Over Revolution - DualShockers", "description": "The PS5 DualSense controller looks like a departure, but under the hood, like Xbox, it’s a series of small evolutions over what we have now.", "url": "https://www.dualshockers.com/ps5-xbox-series-x-controller-comparison-dualsense-sony-microsoft/", "urlToImage": null, "publishedAt": "2020-04-24T18:44:11Z", "content": null}, {"source": {"id": null, "name": "Notebookcheck.net"}, "author": "Alex Alderson", "title": "Xiaomi rolls out another Android 9.0 Pie update to the Mi Note 10 and Mi Note 10 Pro just days before it makes MIUI 12 available - Notebookcheck.net", "description": "With MIUI 12 rumoured to be available from MIUI 12, Xiaomi has decided to push another Android 9.0 Pie-based update to the Mi Note 10 and Mi Note 10 Pro. While Xiaomi has pledged to update the CC9 Pro to Android 10 by the end of this month, the arrival of the…", "url": "https://www.notebookcheck.net/Xiaomi-rolls-out-another-Android-9-0-Pie-update-to-the-Mi-Note-10-and-Mi-Note-10-Pro-just-days-before-it-makes-MIUI-12-available.462633.0.html", "urlToImage": null, "publishedAt": "2020-04-24T17:44:08Z", "content": "While Xiaomi has promised to update the CC9 Pro to Android 10 this month,  it looks unlikely that its Global or EU Mi Note 10 series siblings will receive the same treatment. As we previously reported, Global handsets started receiving their latest Android 9.… [+686 chars]"}, {"source": {"id": null, "name": "Windowscentral.com"}, "author": "Sean Endicott", "title": "Become anyone in your Zoom and Skype calls with this AI tool - Windows Central", "description": "A new AI tool allows you to create living avatars of any image that you can use in video calls. You can calibrate your face to anything from the Mona Lisa to randomly generated faces.", "url": "https://www.windowscentral.com/become-anyone-your-zoom-and-skype-calls-ai-tool", "urlToImage": null, "publishedAt": "2020-04-24T17:42:17Z", "content": "An incredible tool called Avatarify popped up on social media today. It allows you to convert images into moveable avatars of your face that you can use in video calls. The program integrates your facial movements into the image, making it appear as if the im… [+1611 chars]"}, {"source": {"id": null, "name": "Gizchina.com"}, "author": null, "title": "OnePlus Z surfaces in leaked live-photos - Gizchina.com", "description": "The OnePlus Z mid-range is yet to be released by the company. Today, alleged live shots reveal the handset in all its glory.", "url": "https://www.gizchina.com/2020/04/24/oneplus-z-surfaces-in-leaked-live-photos/", "urlToImage": null, "publishedAt": "2020-04-24T16:22:11Z", "content": "This year, rumors were pointing to the arrival of three OnePlus smartphones. However, just two of them were released in the last week – OnePlus 8 and OnePlus 8 Pro. Apparently, the constant problems raised by the COVID-19 pandemic had delayed the construction… [+1718 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The Apple Watch: 5 years later - Engadget", "description": "When Apple released its first wearable five years ago, many publications, including ours, were pretty skeptical. And with good reason, the first-gen watch wa...", "url": "https://www.youtube.com/watch?v=prYst35-x_k", "urlToImage": null, "publishedAt": "2020-04-24T16:00:29Z", "content": null}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "How to download and send Ramadan WhatsApp Stickers - Hindustan Times", "description": "Here we talk about Ramadan-based stickers, how they can be downloaded as packs from the Google Play Store. Follow these steps.", "url": "https://www.hindustantimes.com/tech/how-to-download-and-send-ramadan-whatsapp-stickers/story-wdDqKUcUgBuQIm7WYst9oI.html", "urlToImage": null, "publishedAt": "2020-04-24T15:48:17Z", "content": "Although majority of us are at homes during the Covid-19 lockdown, some of us are celebrating the auspicious Ramadan festival. And WhatsApp Stickers can be the perfect way to wish each other. We are not talking about any other stickers but Ramadan-based stick… [+1418 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "IANS", "title": "Huawei smartphones receive VoWiFi calling support in India: Here's how it works - India TV News", "description": "Huawei has introduced Voice over WiFi (VoWiFi) calling support for its smartphones users in India so that network issues at their home or workplace do not disrupt their communications.", "url": "https://www.indiatvnews.com/technology/news-huawei-smartphones-receive-support-for-vowifi-calling-in-india-610981", "urlToImage": null, "publishedAt": "2020-04-24T15:40:34Z", "content": "Huawei recently launched the P40 series globally.\r\nWorld's second-largest smartphone company Huawei has introduced Voice over WiFi (VoWiFi) calling support for its smartphones users in India so that network issues at their home or workplace do not disrupt the… [+2217 chars]"}, {"source": {"id": null, "name": "Telecomtalk.info"}, "author": "Shrijan Soni", "title": "iQoo 3 Receives Price Cut in India, Base Variant Now Available at Rs 34,990 - TelecomTALK", "description": "iQoo has slashed the prices of iQoo 3 smartphones to make it the best cost-effective 5G device of India", "url": "https://telecomtalk.info/iqoo-3-price-drop-india/263589/", "urlToImage": null, "publishedAt": "2020-04-24T15:04:05Z", "content": "Highlights\r\n<ul><li> iQoo 3 12GB+256GB 5G variant has not received price cut</li><li>iQoo 3 smartphone will start from Rs 34,990 after the latest price cut</li><li>iQoo 3 will receive Android 11 update this year</li></ul>\r\nThe spin-off brand of Vivo, iQoo has… [+2050 chars]"}, {"source": {"id": null, "name": "Gizchina.com"}, "author": "https://web.facebook.com/udinmwen.efosa", "title": "Meizu 17 officially confirmed to use a Snapdragon 865 SoC, UFS 3.1 memory - Gizchina.com", "description": "Meizu 17 officially confirmed to use a Snapdragon 865 SoC, UFS 3.1 memory. This smartphone will be officially released on May 8", "url": "https://www.gizchina.com/2020/04/24/meizu-17-officially-confirmed-to-use-a-snapdragon-865-soc-ufs-3-1-memory/", "urlToImage": null, "publishedAt": "2020-04-24T14:49:30Z", "content": "Meizu Technology will hold a press conference on May 8th where it will release its latest smartphone. Although we already know much of the specs of this device via speculations, the company is now officially confirming some of these specs. Today, Meizu took t… [+1676 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "7 Tips & Tricks To Master The Magic Keyboard! - AppleInsider", "description": "Magic Keyboard is the ultimate accessory for iPad Pro! Here are several tips and tricks to help you get even more from Apple's keyboard and trackpad. Learn m...", "url": "https://www.youtube.com/watch?v=zBM_EOwQ7Kw", "urlToImage": null, "publishedAt": "2020-04-24T14:24:33Z", "content": null}, {"source": {"id": null, "name": "Searchengineland.com"}, "author": "https://www.facebook.com/barryschwartz", "title": "New free version of Google Shopping rolling out now - Search Engine Land", "description": "It is now rolling out and should be fully live in the US by early next week.", "url": "https://searchengineland.com/new-free-version-of-google-shopping-rolling-out-now-333589", "urlToImage": null, "publishedAt": "2020-04-24T13:52:00Z", "content": "Google’s new free version of Google Shopping is now rolling out. A Google spokesperson has confirmed with Search Engine Land that this has begun to roll out. This does not mean it is fully rolled out and all U.S. searchers will see it immediately, but by earl… [+741 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Christopher Groux", "title": "'Borderlands 3' Claw & Order Guide - Echo Log Locations & Walkthrough - Newsweek", "description": "\"Borderlands 3\" has a new quest called Claw and Order. In this guide, we'll show the locations for every Echo Log you need to find.", "url": "https://www.newsweek.com/borderlands-3-claw-order-guide-echo-log-locations-walkthrough-1500009", "urlToImage": null, "publishedAt": "2020-04-24T13:20:10Z", "content": "Borderlands 3 Revenge of the Cartels event is officially live, and that means there are new quests for players to enjoy. One such mission, called Claw and Order, seems to be giving players trouble. In this guide we'll reveal the locations of all three Echo Lo… [+1711 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Microsoft Surface Earbuds could finally ship next month - India Today", "description": "Microsoft is reportedly planning to release the Surface Earbuds next month.", "url": "https://www.indiatoday.in/technology/news/story/microsoft-surface-earbuds-could-finally-ship-next-month-1670682-2020-04-24", "urlToImage": null, "publishedAt": "2020-04-24T12:47:32Z", "content": "Microsoft's take on Apple AirPods is releasing into the European markets next month. The Microsoft Surface Earbuds will be available to purchase in Germany, followed by a global release, at a price of EUR 199 (approximately Rs 16,500), according to a new repo… [+2127 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Auto Desk", "title": "Mustang's electric SUV avatar suffers delivery delay due to Covid-19: Reports - Hindustan Times", "description": "Ford had unveiled Mustang Mach-E in a glitzy ceremony in the US in November of 2019..The SUV with an electric heart claims to be quicker than a Porsche Macan..Ford hopes to challenge the dominance of Tesla in markets like Norway, US and China.", "url": "https://auto.hindustantimes.com/auto/cars/mustang-s-electric-suv-avatar-suffers-delivery-delay-due-to-covid-19-reports-41587730739248.html", "urlToImage": null, "publishedAt": "2020-04-24T12:34:55Z", "content": "Ford made waves around the world when it showcased the electric SUV version of the world's best-selling sports car for decades. While some felt that the new vehicle was a disgrace to the lineage and legacy of Mustang, the Mustang Mach-E was a sure-shot show o… [+1834 chars]"}, {"source": {"id": null, "name": "Catchnews.com"}, "author": null, "title": "Facebook data breach leads to personal data of over 267 million users being sold on dark web: Reports - Catch News", "description": "Facebook an American social media and technology company based in Menlo Park, California is in trouble once again and this time it is for a data breach that has resulted in the personal data of over 267 million users being sold on the dark web.", "url": "http://www.catchnews.com/tech-news/facebook-data-breach-leads-to-personal-data-of-over-267-million-users-being-sold-on-dark-web-reports-189319.html", "urlToImage": null, "publishedAt": "2020-04-24T12:21:23Z", "content": "Facebook an American social media and technology company based in Menlo Park, California is in trouble once again and this time it is for a data breach that has resulted in the personal data of over 267 million users being sold on the dark web.\r\nAs stated by … [+1305 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "Is shrubs breeding possible in Animal Crossing New Horizons? Here’s every bush type! - India Gone Viral", "description": "Lots of Animal Crossing New Horizons players want to know if shrubs breeding is possible following the game's latest update.Animal Crossing New Horizons has received update 1.2 and this patch has atte", "url": "https://indiagoneviral.com/technology/2020/04/24/is-shrubs-breeding-possible-in-animal-crossing-new-horizons-heres-every-bush-type/40751/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-24T12:14:38Z", "content": "Lots of Animal Crossing New Horizons players want to know if shrubs breeding is possible following the game’s latest update.\r\nAnimal Crossing New Horizons has received update 1.2 and this patch has attempted to fix the broken bell economy. However, in more im… [+2485 chars]"}, {"source": {"id": null, "name": "Gsmarena.com"}, "author": "Yordan", "title": "Kuo: Apple to launch 3rd gen AirPods in Q1 2021 - GSMArena.com news - GSMArena.com", "description": "New AirPods Pro should be expected a year later - Q1 2022.", "url": "https://www.gsmarena.com/kuo_apple_to_launch_3rd_gen_airpods_in_q1_2021-news-42852.php", "urlToImage": null, "publishedAt": "2020-04-24T12:02:01Z", "content": "Apple is planning to start mass production of new AirPods at the end of 2020. This was revealed by the analyst Ming-Chi Kuo where he revealed the earphones will arrive in Q1 2021.\r\nThe note to investors, quoted by Apple Insider, also revealed the second-gen A… [+686 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Danish Ansari", "title": "PUBG Mobile Lite 0.17.0 update release date, whats new on beta and download link - Republic World - Republic World", "description": "A PUBG Mobile Lite beta version 0.17.0 is available for players to test the new features available in the game. Scroll on for new features and download link", "url": "https://www.republicworld.com/technology-news/gaming/pubg-mobile-lite-update-release-date.html", "urlToImage": null, "publishedAt": "2020-04-24T11:23:32Z", "content": "PUBG Mobile Lite has finally introduced the much-awaited Payload mode with the 0.17.0 Beta update. The latest version of the game was recently released by the company and comes with some significant improvements and new features. It also has a few modificatio… [+2243 chars]"}, {"source": {"id": null, "name": "Gizchina.com"}, "author": null, "title": "Xiaomi Redmi K30i Render Images Leaked, Reveals Two Fewer Cameras Than K30 - Gizchina.com", "description": "Xiaomi is expected to soon announce the Redmi K30i smartphone which is supposed to be an affordable mid-range 5G smartphone from the brand.", "url": "https://www.gizchina.com/2020/04/24/xiaomi-redmi-k30i-render-images-leaked-reveals-two-fewer-cameras-than-k30/", "urlToImage": null, "publishedAt": "2020-04-24T11:00:12Z", "content": "Xiaomi‘s sub-brand Redmi is currently working on its next mid-range flagship smartphone dubbed Redmi K30i. A couple of days ago, we reported that the phone will come with 48MP primary sensor. Well, the device has now been part of yet another leak revealing so… [+1515 chars]"}, {"source": {"id": null, "name": "Pocket-lint.com"}, "author": "Pocket-lint", "title": "Zoom vs Microsoft Teams vs Google Meet: What's the best video conferencing service? - Pocket-lint", "description": "Video conferencing software and apps are an essential means of communication for all sorts of people and businesses.", "url": "https://www.pocket-lint.com/apps/news/151947-zoom-vs-microsoft-teams-vs-google-meet-what-s-the-difference", "urlToImage": null, "publishedAt": "2020-04-24T10:48:44Z", "content": "Video conferencing software and apps are an essential means of communication for all sorts of people and businesses.\r\nWhether you're in a long-distance relationship, taking an online class, or working from home, you need a way to connect over video conferenci… [+7023 chars]"}, {"source": {"id": null, "name": "Gizchina.com"}, "author": "https://www.facebook.com/abdulqayyum.ajmeri.5", "title": "Realme X3 SuperZoom spotted on Bluetooth SIG - Gizchina.com", "description": "Additionally, it is also rumoured that a plain Realme X3, a toned-down version, could also debut alongside the Realme X3 SuperZoom.", "url": "https://www.gizchina.com/2020/04/24/realme-x3-superzoom-spotted-on-bluetooth-sig/", "urlToImage": null, "publishedAt": "2020-04-24T10:03:47Z", "content": "An unreleased Realme smartphone has just scored Bluetooth SIG certification. And there’s good evidence that it is the Realme X3 as earlier certifications have pointed it out. The launch is expected to be in early May.\r\nSmartphones these days are prone to leak… [+1387 chars]"}, {"source": {"id": null, "name": "Nokiapoweruser.com"}, "author": null, "title": "Official Nokia Security+OS update tracker updated again (April 20) with April Security update details for all devices - Nokiapoweruser", "description": "The official Security+OS update tracker page for Nokia smartphones has been again updated on April 20, 2020, by Nokia Mobile (HMD) with details about the availability or unavailability of the April…", "url": "https://nokiapoweruser.com/official-nokia-securityos-update-tracker-updated-again-april-20-with-april-security-update-details-for-all-devices/", "urlToImage": null, "publishedAt": "2020-04-24T09:43:33Z", "content": "The official Security+OS update tracker page for Nokia smartphones has been again updated on April 20, 2020, by Nokia Mobile (HMD) with details about the availability or unavailability of the April Security update 2020 for all Nokia smartphones. As you may be… [+1198 chars]"}]}