{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Apple, Google Boost Privacy Protections for Covid Contact-Tracing Tool - Bloomberg Technology", "description": "Apr.25 -- Apple Inc. and Google said they are putting stronger privacy protections in their upcoming contact-tracing tool for Covid-19. Bloomberg's Mark Gurm...", "url": "https://www.youtube.com/watch?v=woKQVFKc4Tw", "urlToImage": null, "publishedAt": "2020-04-25T12:35:09Z", "content": null}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "India TV Tech Desk", "title": "Xiaomi might launch Redmi Note 9 on April 30, posts teaser online - India TV News", "description": "According to a teaser image posted by the company on its official Twitter handle, it will be launching a new Redmi Note 9-series phone via an online stream on April 30.", "url": "https://www.indiatvnews.com/technology/news-xiaomi-might-launch-redmi-note-9-on-april-30-611201", "urlToImage": null, "publishedAt": "2020-04-25T12:09:31Z", "content": "Redmi Note 9 teasers posted by Xiaomi on Twitter.\r\nXiaomi Redmi Note series is one of the most popular smartphone series in various markets, including China and India. Now the company is looking to launch a new variant, expanding the Redmi Note 9 family of sm… [+1842 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Christopher Groux", "title": "'Apex Legends' Battle Armor Event & Season 5 Start Date Revealed - Newsweek", "description": "\"Apex Legends\" Battle Armor event starts next week, and it leads right up to the release of Season 5.", "url": "https://www.newsweek.com/apex-legends-battle-armor-event-season-5-start-date-reveal-1500203", "urlToImage": null, "publishedAt": "2020-04-25T12:02:03Z", "content": "Apex Legends will host one more event before the start of Season 5. The Battle Armor event was revealed by Respawn Friday afternoon via an official blog post, and it focuses on a new mode with dedicated armor drops.\r\nPiggybacking off the popularity of the Evo… [+1984 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Gordon Kelly", "title": "Google Just Gave Millions Of Users A Reason To Quit Windows 10 - Forbes", "description": "Google has revealed an unfixable problem which may force you to pick between Windows 10 and Chrome.", "url": "https://www.forbes.com/sites/gordonkelly/2020/04/23/google-chrome-critical-security-exploit-windows-10-upgrade-warning-update-chrome-browser/", "urlToImage": null, "publishedAt": "2020-04-25T11:16:38Z", "content": "04/25 Update below. This post was originally published on April 23\r\nGoogle is always improving Chrome and it recently issued a brilliant (if long overdue) upgrade. Unfortunately, now Google has detailed a serious new problem in Chrome which cannot be fixed, a… [+3970 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Darren Allan", "title": "AMD Cezanne leak hints at next-gen laptop CPUs with RDNA 2 graphics that go for Intel’s jugular - TechRadar India", "description": "Zen 3 APUs with RDNA 2-powered integrated graphics, rumor has it", "url": "https://www.techradar.com/news/amd-cezanne-leak-hints-at-next-gen-laptop-cpus-with-rdna-2-graphics-that-go-for-intels-jugular", "urlToImage": null, "publishedAt": "2020-04-25T10:54:00Z", "content": "AMD Ryzen 4000 (codenamed Renoir) mobile chips are still very much fresh on the scene and making a huge impact in terms of competitiveness in the laptop world but weve already seen a leak for next-gen APUs apparently codenamed Cezanne (a name which has been d… [+2934 chars]"}, {"source": {"id": null, "name": "Androidauthority.com"}, "author": null, "title": "OnePlus 8 Pro vs Samsung Galaxy S20 Plus: Who wins? - Android Authority", "description": "Can the OnePlus 8 Pro offer a better flagship experience than the well established Samsung Galaxy S20 Plus?", "url": "https://www.androidauthority.com/oneplus-8-pro-vs-samsung-galaxy-s20-plus-1110147/", "urlToImage": null, "publishedAt": "2020-04-25T10:02:04Z", "content": null}, {"source": {"id": null, "name": "Gsmarena.com"}, "author": "George", "title": "Xiaomi hypes up the Mi 10 Youth display - Samsung-made OLED, 4,300,000:1 contrast - GSMArena.com news - GSMArena.com", "description": "Other bits revealed in a couple of official Weibo posts include a 180Hz touch sampling rate, DC dimming and HDR10+ support.", "url": "https://www.gsmarena.com/xiaomi_the_mi_10_youth_display_samsung-news-42869.php", "urlToImage": null, "publishedAt": "2020-04-25T09:35:02Z", "content": "The Xiaomi Mi 10 Youth 5G is set to be announced in a couple of days, and we've already seen a TENAA listing detailing most specs as well as some official teasers highlighting its camera system. The teasing game continues on Weibo, where Xiaomi's now showcase… [+1011 chars]"}, {"source": {"id": null, "name": "Financialexpress.com"}, "author": "FE Online", "title": "It’s official, WhatsApp will let you video call ‘privately’ with up to 8 people starting next week - The Financial Express", "description": "WhatsApp currently lets you video and voice call with up to four people.", "url": "https://www.financialexpress.com/industry/technology/its-official-whatsapp-will-soon-let-you-video-call-privately-with-up-to-8-people/1939448/", "urlToImage": null, "publishedAt": "2020-04-25T09:21:25Z", "content": "Facebook has confirmed that WhatsApp will soon let you video and voice call with up to eight people simultaneously, which is double the existing number of participants. The popular instant messaging platform currently lets you video and voice call with up to … [+2289 chars]"}, {"source": {"id": null, "name": "Notebookcheck.net"}, "author": "Daniel R Deakin", "title": "AMD Ryzen 3 3300X starts cementing its position as a budget CPU champion by beating the Intel Core i3-10300 in Time Spy benchmark - Notebookcheck.net", "description": "An AMD Ryzen 3 3300X and an Intel Core i3-10300 have been spotted in a comparison on 3DMark’s Time Spy benchmark. In another blow for Team Blue, it appears that the new budget Matisse chip from AMD has the edge on the upcoming Comet Lake processor. The Ryzen …", "url": "https://www.notebookcheck.net/AMD-Ryzen-3-3300X-starts-cementing-its-position-as-a-budget-CPU-champion-by-beating-the-Intel-Core-i3-10300-in-Time-Spy-benchmark.462912.0.html", "urlToImage": null, "publishedAt": "2020-04-25T08:03:15Z", "content": "We already had some first benchmark results for both the AMD Ryzen 3 3300X and the Ryzen 3 3100, where both of the recently announced processors managed to thoroughly challenge Intels aging Kaby Lake Core i7-7700K desktop processor. However, it seems the Ryze… [+1184 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Mike Moore", "title": "Beware - that email from HR might be a cyber scam - TechRadar India", "description": "Criminals look to exploit new working from home trend", "url": "https://www.techradar.com/news/beware-that-email-from-hr-might-be-a-cyber-scam", "urlToImage": null, "publishedAt": "2020-04-25T06:29:00Z", "content": "Remote workers are being targeted by a wide-ranging new online scam looking to steal business logins.\r\nResearchers at security firm Cofense have uncovered a phishing campaign masquerading as emails from HR departments.\r\nThe scam targets employees who are stil… [+1879 chars]"}, {"source": {"id": null, "name": "Tomsguide.com"}, "author": "Roland Moore-Colyer", "title": "Xbox Series X's crazy fast load times revealed — and PS5 should be worried - Tom's Guide", "description": "Xbox Series X super-fast SSD loads Gears 5 four times faster than Xbox One", "url": "https://www.tomsguide.com/news/xbox-series-xs-crazy-fast-load-times-revealed-and-ps5-should-be-worried", "urlToImage": null, "publishedAt": "2020-04-25T06:25:00Z", "content": "Microsofts Xbox Series X will load games much, much faster than the Xbox One, even if a games code isnt tweaked for the next-generation console. \r\nGears 5 loads four times faster on the Xbox Series X than it does on the Xbox One, according to Mike Rayner, tec… [+2197 chars]"}, {"source": {"id": null, "name": "Gsmarena.com"}, "author": "Ricky", "title": "OnePlus downsizes its workforce in UK, France, and Germany by up to 80%, report says - GSMArena.com news - GSMArena.com", "description": "The company confirms the layoffs are unrelated to COVID-19.", "url": "https://www.gsmarena.com/oneplus_downsizes_its_workforce_in_uk_france_and_germany_by_up_to_80_report_says-news-42867.php", "urlToImage": null, "publishedAt": "2020-04-25T06:00:01Z", "content": "OnePlus is now in a post-launch phase as the company is in the process of fulfilling pre-orders of its latest duo of smartphones: the OnePlus 8 and 8 Pro. As reported by Engadget which cites a number of sources \u0093close to the matter\u0094, OnePlus has downsized its… [+2494 chars]"}, {"source": {"id": null, "name": "91mobiles.com"}, "author": null, "title": "LG Velvet specifications leak out ahead of May 7th launch - 91mobiles", "description": "LG Velvet key specifications including processor, cameras and battery details have leaked out ahead of the May 7th launch event.", "url": "https://www.91mobiles.com/hub/lg-velvet-specifications-leak-processor-camera-may-7-launch/", "urlToImage": null, "publishedAt": "2020-04-25T04:41:15Z", "content": "LG Velvet specifications will include the Snapdragon 765 5G processor \r\nLG Velvet specifications have appeared online ahead of the smartphone’s launch on May 7th. The upcoming phone from LG has been turning some heads thanks to its unique design language, esp… [+1673 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "NVIDIA RTX Voice Benchmark on GTX vs. RTX GPUs, Gaming Performance, & Voice Quality - Gamers Nexus", "description": "This benchmark tests NVIDIA RTX Voice for gaming performance impact, mostly to determine if RT hardware is even being used. 2080 Super, 2060, and GTX 1080 in...", "url": "https://www.youtube.com/watch?v=f_obMmLXlP4", "urlToImage": null, "publishedAt": "2020-04-25T04:03:07Z", "content": null}, {"source": {"id": null, "name": "Gadgetsnow.com"}, "author": "Gadgets Now Bureau", "title": "Text bomb: This message may crash your iPhone, iPad, Apple Watch, Mac - Gadgets Now", "description": "If you use an Apple device, here’s an important ‘warning’. A new text bomb is crashing iPhones, Apple Watch, iPad or Mac. This string of characters includes Italian flag emoji and some Sindhi characters. According to a report by 9to5Mac, users have reported r…", "url": "https://www.gadgetsnow.com/tech-news/text-bomb-this-message-may-crash-your-iphone-ipad-apple-watch-mac/articleshow/75368309.cms", "urlToImage": null, "publishedAt": "2020-04-25T03:51:46Z", "content": null}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Matt Espineli", "title": "FF7 Remake Elemental Materia Guide: Where To Find This Essential Materia Orb - GameSpot", "description": "Here's how to get the only two Elemental Materia orbs available in FF7 Remake for PS4.", "url": "https://www.gamespot.com/articles/ff7-remake-elemental-materia-guide-where-to-find-t/1100-6476502/", "urlToImage": null, "publishedAt": "2020-04-25T03:26:00Z", "content": "In Final Fantasy 7 Remake, the Elemental Materia is one of the best Materia orbs you can get, as it can imbue either your weapons with elemental power and your armor with elemental defense. However, this Materia can be incredibly easy to miss if you're just g… [+2738 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Oscar Gonzalez", "title": "Travis Scott event in Fortnite: How to watch the encore and find the Giant Astro Heads - CNET", "description": "The rapper dropped new tracks in a jaw-dropping concert. Catch the next show at midnight.", "url": "https://www.cnet.com/news/travis-scott-event-in-fortnite-how-to-watch-the-encore-and-find-the-giant-astro-heads/", "urlToImage": null, "publishedAt": "2020-04-25T01:02:37Z", "content": "Play some Fortnite and listen to a new track from Travis Scott.\r\nEpic Games\r\nFortnite events aren't only for players to check out new content from developer Epic Games. The popular battle royale game has also played host to multiple premieres and collaboratio… [+3718 chars]"}, {"source": {"id": null, "name": "Androidpolice.com"}, "author": "https://www.facebook.com/corbin.davenport.50", "title": "OnePlus pulls buggy OxygenOS Open Beta 12 for OP7, 7 Pro shortly after release (Update: Statement) - Android Police", "description": "OxygenOS' Open Beta releases are usually very stable, but since they are beta-quality, sometimes there are critical bugs. OnePlus started to roll out Open", "url": "https://www.androidpolice.com/2020/04/24/oneplus-pulls-buggy-oxygenos-open-beta-12-for-op7-7-pro-shortly-after-release/", "urlToImage": null, "publishedAt": "2020-04-25T00:27:33Z", "content": "This story was originally published 2020/04/20 10:42am PDTon Apr 20, 2020 and last updated 2020/04/24 5:11pm PDTApr 24, 2020. \r\nOxygenOS' Open Beta releases are usually very stable, but since they are beta-quality, sometimes there are critical bugs. OnePlus s… [+3336 chars]"}, {"source": {"id": null, "name": "Androidcentral.com"}, "author": "Muhammad Jarir Kanji", "title": "Live Caption for phone calls may be coming to Android very soon - Android Central", "description": "One of the biggest limitations to Google's Live Caption feature will finally be addressed by Android 11, as it lets you now transcribe phone calls in real-time.", "url": "https://www.androidcentral.com/live-caption-phone-calls-may-be-coming-android-very-soon", "urlToImage": null, "publishedAt": "2020-04-24T22:22:05Z", "content": "When it launched with Android 10 last year, Live Caption was one of the most exciting new features to come out of the Mountain View giant's labs. Since then, it's been extremely popular with users, and Google has been hard at work expanding its availability. … [+1735 chars]"}, {"source": {"id": null, "name": "Gsmarena.com"}, "author": "Vlad", "title": "LG Velvet specs leak - GSMArena.com news - GSMArena.com", "description": "The phone will get official on May 7.", "url": "https://www.gsmarena.com/lg_velvet_specs_leak-news-42863.php", "urlToImage": null, "publishedAt": "2020-04-24T22:00:02Z", "content": "LG's most exciting smartphone in quite a while (at least design-wise) is getting official on May 7. The Velvet should be the first in a line of upper mid-range devices that are meant to replace the now-defunct G series.\r\nLG has been teasing bits and pieces ab… [+1355 chars]"}, {"source": {"id": null, "name": "Businessinsider.in"}, "author": "Lisa Eadicicco", "title": "A Microsoft Word update finally puts an end to the ongoing debate about whether you should put 1 or 2 spaces a - Business Insider India", "description": "Microsoft Word will begin flagging two spaces after a period as an error, a long-running debate that's been met with both excitement and criticism.The company", "url": "https://www.businessinsider.in/tech/news/a-microsoft-word-update-finally-puts-an-end-to-the-ongoing-debate-about-whether-you-should-put-1-or-2-spaces-after-a-period/articleshow/75365060.cms", "urlToImage": null, "publishedAt": "2020-04-24T21:14:00Z", "content": "Microsoft is putting its foot down in the age-old debate about whether it's correct to put one or two spaces after a period. \r\nMicrosoft Word's Editor function is getting a new feature that flags two spaces after a period as an error, according to The Verge. … [+1172 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Chris Pereira", "title": "4 Upcoming Animal Crossing: New Horizons Events Announced - GameSpot", "description": "Updates are coming to Animal Crossing: New Horizons, and here's what events will take place over the next two months.", "url": "https://www.gamespot.com/articles/4-upcoming-animal-crossing-new-horizons-events-ann/1100-6476292/", "urlToImage": null, "publishedAt": "2020-04-24T20:45:00Z", "content": "Update: Nature Day is now live in Animal Crossing: New Horizons, bringing two new merchants to your island. Find the rest of the scheduled events below or find out how Nature Day works in our guide.\r\nNintendo has outlined some of what players can expect from … [+2279 chars]"}, {"source": {"id": null, "name": "Windowslatest.com"}, "author": null, "title": "Microsoft is investigating Windows 10 KB4549951 issues - WindowsLatest", "description": "Windows 10 KB4549951, which was released on April 14 with security fixes, is reportedly plagued with serious issues for some users. The update is only available for consumers with Windows 10 version 1903 and 1909, and the patch contains security fixes. Initia…", "url": "https://www.windowslatest.com/2020/04/25/microsoft-comments-on-windows-10-kb4549951-issues/", "urlToImage": null, "publishedAt": "2020-04-24T20:38:00Z", "content": "Windows 10 KB4549951, which was released on April 14 with security fixes, is reportedly plagued with serious issues for some users. The update is only available for consumers with Windows 10 version 1903 and 1909, and the patch contains security fixes.\r\nIniti… [+2196 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The Best Free Alternatives to Zoom - Lifehacker", "description": "While the popularity of the video conferencing service Zoom has skyrocketed since the outbreak of the coronavirus, recent news of its many security and priva...", "url": "https://www.youtube.com/watch?v=g7SIqs8dos4", "urlToImage": null, "publishedAt": "2020-04-24T19:48:38Z", "content": "While the popularity of the video conferencing service Zoom has skyrocketed since the outbreak of the coronavirus, recent news of its many security and privacy issues might have you feeling nervous about using it. In the video above, I share three free altern… [+1048 chars]"}, {"source": {"id": null, "name": "Gizchina.com"}, "author": null, "title": "How to install Google Phone App in all Android smartphones - Gizchina.com", "description": "Google Phone App is now working on several Android smartphone. Here you learn how to install it in your non-Pixel smartphone.", "url": "https://www.gizchina.com/2020/04/24/how-to-install-google-phone-app-in-all-android-smartphones/", "urlToImage": null, "publishedAt": "2020-04-24T19:39:11Z", "content": "With the Pixel smartphones, Google wants to ensure that its customers will have the purest, and in their vision, ideal experience with Android. Besides the pure vanilla interface, the company also has developed some apps that are exclusive for its devices. We… [+3089 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "WhatsApp might start showing you ads soon - Hindustan Times", "description": "Users may see these ads on the platform after Facebook completes its multi-year effort to link all its social media platforms.", "url": "https://www.hindustantimes.com/tech/here-s-when-whatsapp-may-start-showing-you-ads/story-gv8bTx1RnxRhcaklVjU6MJ.html", "urlToImage": null, "publishedAt": "2020-04-24T19:33:56Z", "content": "Facebook has not abandoned its plans to serve ads on its instant messaging service WhatsApp, the media reported. Users may see these ads on the platform after Facebook completes its multi-year effort to link all its social media platforms, according to a repo… [+1263 chars]"}, {"source": {"id": null, "name": "Gsmarena.com"}, "author": "Michail", "title": "Our Xiaomi Mi 10 Pro video review is out - GSMArena.com news - GSMArena.com", "description": "Does Xiaomi's most expensive flagship deliver? Check out what Will has to say in our Mi 10 Pro video review.", "url": "https://www.gsmarena.com/our_xiaomi_mi_10_pro_video_review_is_out-news-42860.php", "urlToImage": null, "publishedAt": "2020-04-24T18:14:33Z", "content": "Our Xiaomi Mi 10 Pro written review has been out for a few days and now we present you with the video breakdown. This is without a doubt the best flagship Xiaomi has released so far, matching any top of the line offering from other premium smartphone makers. … [+545 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Carly Page", "title": "The Dell XPS 15 2020 may have been redesigned to take on the MacBook Pro - TechRadar India", "description": "Incoming model will boast smaller bezels and upward-firing speakers", "url": "https://www.techradar.com/news/the-dell-xps-15-2020-may-have-been-redesigned-to-take-on-the-macbook-pro", "urlToImage": null, "publishedAt": "2020-04-24T17:31:00Z", "content": "Dell looks poised to release an all-new version of its XPS 15 laptop that will take a number of design clues from the recently-revamped Dell XPS 13\r\n.\r\nThats according to leaked images posted on the Korea Energy Agency Efficiency Standardization Certification… [+2119 chars]"}, {"source": {"id": null, "name": "Gizchina.com"}, "author": null, "title": "OnePlus Z surfaces in leaked live-photos - Gizchina.com", "description": "The OnePlus Z mid-range is yet to be released by the company. Today, alleged live shots reveal the handset in all its glory.", "url": "https://www.gizchina.com/2020/04/24/oneplus-z-surfaces-in-leaked-live-photos/", "urlToImage": null, "publishedAt": "2020-04-24T16:22:11Z", "content": "This year, rumors were pointing to the arrival of three OnePlus smartphones. However, just two of them were released in the last week – OnePlus 8 and OnePlus 8 Pro. Apparently, the constant problems raised by the COVID-19 pandemic had delayed the construction… [+1718 chars]"}, {"source": {"id": null, "name": "Dotesports.com"}, "author": "Pedro Peres", "title": "Apex Legends reportedly could get a new limited-time mode tomorrow - Dot Esports", "description": "ILootGames shared that a pistol mode may make its debut tomorrow.", "url": "https://dotesports.com/apex-legends/news/apex-legends-reportedly-could-get-a-new-limited-time-mode-tomorrow", "urlToImage": null, "publishedAt": "2020-04-24T16:04:33Z", "content": "Apex Legends might be getting a new limited-time mode tomorrow, according to well-known data miner iLootGames. The LTM will make players spawn with a pistol and a body shield, with better-quality variants as the event progresses.\r\nThe new mode will be called … [+1556 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The Apple Watch: 5 years later - Engadget", "description": "When Apple released its first wearable five years ago, many publications, including ours, were pretty skeptical. And with good reason, the first-gen watch wa...", "url": "https://www.youtube.com/watch?v=prYst35-x_k", "urlToImage": null, "publishedAt": "2020-04-24T16:00:29Z", "content": null}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Christian de Looper", "title": "7 Of The Best Amazon Alexa Speakers - Forbes", "description": "Looking for a great speaker with arguably the smartest digital assistant, Alexa? Here are 7 of the best Amazon Alexa speakers out there.", "url": "https://www.forbes.com/sites/forbes-personal-shopper/2020/04/24/7-of-the-best-amazon-alexa-speakers/", "urlToImage": null, "publishedAt": "2020-04-24T16:00:00Z", "content": "Alexa is arguably the smartest digital assistant, and while Google Assistant also has a lot going for it, Alexa is the go-to for many users who dont have Android phones. There are a ton of Alexa speakers on the market, and while they all have the smart featur… [+4164 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "How to download and send Ramadan WhatsApp Stickers - Hindustan Times", "description": "Here we talk about Ramadan-based stickers, how they can be downloaded as packs from the Google Play Store. Follow these steps.", "url": "https://www.hindustantimes.com/tech/how-to-download-and-send-ramadan-whatsapp-stickers/story-wdDqKUcUgBuQIm7WYst9oI.html", "urlToImage": null, "publishedAt": "2020-04-24T15:48:17Z", "content": "Although majority of us are at homes during the Covid-19 lockdown, some of us are celebrating the auspicious Ramadan festival. And WhatsApp Stickers can be the perfect way to wish each other. We are not talking about any other stickers but Ramadan-based stick… [+1418 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "IANS", "title": "Huawei smartphones receive VoWiFi calling support in India: Here's how it works - India TV News", "description": "Huawei has introduced Voice over WiFi (VoWiFi) calling support for its smartphones users in India so that network issues at their home or workplace do not disrupt their communications.", "url": "https://www.indiatvnews.com/technology/news-huawei-smartphones-receive-support-for-vowifi-calling-in-india-610981", "urlToImage": null, "publishedAt": "2020-04-24T15:40:34Z", "content": "Huawei recently launched the P40 series globally.\r\nWorld's second-largest smartphone company Huawei has introduced Voice over WiFi (VoWiFi) calling support for its smartphones users in India so that network issues at their home or workplace do not disrupt the… [+2217 chars]"}, {"source": {"id": null, "name": "Gizchina.com"}, "author": null, "title": "iQOO 3 4G and 5G variants price slashed in India - Gizchina.com", "description": "In light of the recent release of iQOO Neo 3 in China, the Indian branch of iQOO is slashing the price of both 4G and 5G variants of the iQOO 3.", "url": "https://www.gizchina.com/2020/04/24/iqoo-3-4g-and-5g-variants-get-a-price-cut-in-india/", "urlToImage": null, "publishedAt": "2020-04-24T14:56:55Z", "content": "Earlier this year, Vivo announced that it has cut the ties from its sub-brand iQOO. This way, the company would be able to act as a separate company and the first step would be launching a powerful Global campaign taking India as a key market. The company ann… [+1202 chars]"}, {"source": {"id": null, "name": "Tomsguide.com"}, "author": "Richard Priday", "title": "OnePlus 8 Pro displays are turning green - here's why - Tom's Guide", "description": "Some OnePlus 8 Pro displays have an unusual green tint, but OnePlus is responding", "url": "https://www.tomsguide.com/news/oneplus-8-pro-fail-displays-are-turning-everything-green", "urlToImage": null, "publishedAt": "2020-04-24T14:42:25Z", "content": "The OnePlus 8 Pro\r\n is currently suffering from an unusual display problem. OnePlus is working on an update to solve it, but for now, dark images will look oddly green on at least some handsets.\r\nAs reported on the OnePlus forums\r\n (via TechRadar\r\n), owners o… [+3467 chars]"}, {"source": {"id": null, "name": "Searchengineland.com"}, "author": "https://www.facebook.com/barryschwartz", "title": "New free version of Google Shopping rolling out now - Search Engine Land", "description": "It is now rolling out and should be fully live in the US by early next week.", "url": "https://searchengineland.com/new-free-version-of-google-shopping-rolling-out-now-333589", "urlToImage": null, "publishedAt": "2020-04-24T13:52:00Z", "content": "Google’s new free version of Google Shopping is now rolling out. A Google spokesperson has confirmed with Search Engine Land that this has begun to roll out. This does not mean it is fully rolled out and all U.S. searchers will see it immediately, but by earl… [+741 chars]"}, {"source": {"id": null, "name": "Gsmarena.com"}, "author": "Michail", "title": "Here WeGo Maps comes to Huawei App Gallery - GSMArena.com news - GSMArena.com", "description": "Full turn-by-turn navigation available in over 100 countries.", "url": "https://www.gsmarena.com/here_wego_maps_comes_to_huawei_app_gallery-news-42854.php", "urlToImage": null, "publishedAt": "2020-04-24T13:51:02Z", "content": "Since losing its access to Google Mobile Services (GMS) nearly a year ago, Huawei has been looking for ways to expand its app portfolio through the App Gallery store. Now, it got a serious addition with Here WeGo Maps (formerly Here Maps) which is now availab… [+807 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Christopher Groux", "title": "'Call of Duty: Modern Warfare' Free Multiplayer This Weekend, When It Starts and How to Download - Newsweek", "description": "Just like last time, players can download all they need for the 'Modern Warfare' weekend by installing the 'Call of Duty: Warzone' standalone application for free.", "url": "https://www.newsweek.com/call-modern-warfare-free-multiplayer-weekend-april-24-time-download-1500016", "urlToImage": null, "publishedAt": "2020-04-24T13:42:18Z", "content": "Call of Duty: Modern Warfare is hosting another free multiplayer weekend that starts this Friday and lasts through Monday. In this brief rundown of the key details, we outline the times, maps and download instructions you need to know.\r\nCall of Duty: Modern W… [+2527 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Christopher Groux", "title": "'Borderlands 3' Claw & Order Guide - Echo Log Locations & Walkthrough - Newsweek", "description": "\"Borderlands 3\" has a new quest called Claw and Order. In this guide, we'll show the locations for every Echo Log you need to find.", "url": "https://www.newsweek.com/borderlands-3-claw-order-guide-echo-log-locations-walkthrough-1500009", "urlToImage": null, "publishedAt": "2020-04-24T13:20:10Z", "content": "Borderlands 3 Revenge of the Cartels event is officially live, and that means there are new quests for players to enjoy. One such mission, called Claw and Order, seems to be giving players trouble. In this guide we'll reveal the locations of all three Echo Lo… [+1711 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jon Porter", "title": "Telegram adding secure group video calls this year - The Verge", "description": "Messaging app Telegram is developing a group video calling service that’s due to be launched later this year. It announced the plans alongside the news that the service now boasts 400 million monthly active users.", "url": "https://www.theverge.com/2020/4/24/21234254/telegram-messaging-app-group-video-calling-security-usability", "urlToImage": null, "publishedAt": "2020-04-24T13:10:11Z", "content": "The messaging service now has 400 million monthly active users\r\nIllustration by Alex Castro / The Verge\r\nMessaging app Telegram is developing a group video calling service thats due to be launched later this year, the company announced today. It says that cur… [+1733 chars]"}, {"source": {"id": null, "name": "Gizmochina.com"}, "author": null, "title": "MIUI 12 AOD+ is now live for MIUI 11 users, Here's how to enable It - gizmochina", "description": "Two days back, Xiaomi revealed AOD+ (Always-on Display) ahead of MIUI 12 announcement scheduled for April 27. Now, the feature is already live for MIUI 11 users via the latest versions of MIUI Themes and MIUI Always-on display. Interested users of Xiaomi and …", "url": "https://www.gizmochina.com/2020/04/24/miui-12-aod-is-now-live-for-miui-11-heres-how-to-enable-it/", "urlToImage": null, "publishedAt": "2020-04-24T13:07:00Z", "content": "Two days back, Xiaomi revealed AOD+ (Always-on Display) ahead of MIUI 12 announcement scheduled for April 27. Now, the feature is already live for MIUI 11 users via the latest versions of MIUI Themes and MIUI Always-on display. Interested users of Xiaomi and … [+1391 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Microsoft Surface Earbuds could finally ship next month - India Today", "description": "Microsoft is reportedly planning to release the Surface Earbuds next month.", "url": "https://www.indiatoday.in/technology/news/story/microsoft-surface-earbuds-could-finally-ship-next-month-1670682-2020-04-24", "urlToImage": null, "publishedAt": "2020-04-24T12:47:32Z", "content": "Microsoft's take on Apple AirPods is releasing into the European markets next month. The Microsoft Surface Earbuds will be available to purchase in Germany, followed by a global release, at a price of EUR 199 (approximately Rs 16,500), according to a new repo… [+2127 chars]"}, {"source": {"id": null, "name": "Techspot.com"}, "author": "Rob Thubron", "title": "Malwarebytes steps into the VPN space with WireGuard-based service - TechSpot", "description": "Available now for Windows 7 and higher—Mac, Android, iOS, and Chrome OS are coming soon—Malwarebytes Privacy costs $59.99 per year. You can also get it bundled with a 1-year license of Malwarebytes Premium for $89.99, saving buyers $49.99. Both options&hellip;", "url": "https://www.techspot.com/news/84974-malwarebytes-steps-vpn-space-wireguard-based-service.html", "urlToImage": null, "publishedAt": "2020-04-24T12:37:00Z", "content": "In brief: Malwarebytes is joining the list of antivirus companies that also offer a VPN. Called Malwarebytes Privacy, the service uses a newer and faster protocol: WireGuard. \r\nAvailable now for Windows 7 and higherMac, Android, iOS, and Chrome OS are coming … [+1527 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Auto Desk", "title": "Mustang's electric SUV avatar suffers delivery delay due to Covid-19: Reports - Hindustan Times", "description": "Ford had unveiled Mustang Mach-E in a glitzy ceremony in the US in November of 2019..The SUV with an electric heart claims to be quicker than a Porsche Macan..Ford hopes to challenge the dominance of Tesla in markets like Norway, US and China.", "url": "https://auto.hindustantimes.com/auto/cars/mustang-s-electric-suv-avatar-suffers-delivery-delay-due-to-covid-19-reports-41587730739248.html", "urlToImage": null, "publishedAt": "2020-04-24T12:34:55Z", "content": "Ford made waves around the world when it showcased the electric SUV version of the world's best-selling sports car for decades. While some felt that the new vehicle was a disgrace to the lineage and legacy of Mustang, the Mustang Mach-E was a sure-shot show o… [+1834 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "Google Duo vs Zoom: Which video calling app should you choose - India Gone Viral", "description": "Google has been aggressively updating its Duo video calling app with new features since past few days. From improving the audio and video quality to increasing the number of participants, it can be ca", "url": "https://indiagoneviral.com/technology/2020/04/24/google-duo-vs-zoom-which-video-calling-app-should-you-choose/40755/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-24T12:14:28Z", "content": "Google has been aggressively updating its Duo video calling app with new features since past few days. From improving the audio and video quality to increasing the number of participants, it can be called as a part of Googles strategy to get more users onboar… [+2918 chars]"}, {"source": {"id": null, "name": "Gsmarena.com"}, "author": "Yordan", "title": "Kuo: Apple to launch 3rd gen AirPods in Q1 2021 - GSMArena.com news - GSMArena.com", "description": "New AirPods Pro should be expected a year later - Q1 2022.", "url": "https://www.gsmarena.com/kuo_apple_to_launch_3rd_gen_airpods_in_q1_2021-news-42852.php", "urlToImage": null, "publishedAt": "2020-04-24T12:02:01Z", "content": "Apple is planning to start mass production of new AirPods at the end of 2020. This was revealed by the analyst Ming-Chi Kuo where he revealed the earphones will arrive in Q1 2021.\r\nThe note to investors, quoted by Apple Insider, also revealed the second-gen A… [+686 chars]"}, {"source": {"id": null, "name": "Sammobile.com"}, "author": "SamMobile", "title": "One way Galaxy Note 20 might not fall behind some competing flagships - SamMobile", "description": "Qualcomm has no intention to manufacture a Snapdragon 865+ variant this year, according to a recent report citing the head ...", "url": "https://www.sammobile.com/news/one-way-galaxy-note-20-might-not-fall-behind-competing-flagships/", "urlToImage": null, "publishedAt": "2020-04-24T11:24:34Z", "content": "Qualcomm has no intention to manufacture a Snapdragon 865+ variant this year, according to a recent report citing the head of Meizu Technology Marketing, Wan Zhiqiang. And although this may be disappointing news for tech enthusiasts, it could actually work in… [+1396 chars]"}, {"source": {"id": null, "name": "Gizchina.com"}, "author": null, "title": "All OnePlus 8 Models Are Out Of Stock: Popularity Exceeded Expectations - Gizchina.com", "description": "The OnePlus 8 and its Pro variant are considered to be new-gen flagships smartphones. But their current popularity have exceeded all expectations.", "url": "https://www.gizchina.com/2020/04/24/all-oneplus-8-models-are-out-stock-popularity-exceeded-expectations/", "urlToImage": null, "publishedAt": "2020-04-24T11:23:53Z", "content": "Just recently, the new-gen OnePlus 8 series flagship smartphones have been announced at a price of 3,999 yuan ($565). After the first sale, the entire network’s sales in one minute exceeded 100 million yuan ($14.12 million). In recent days, OnePlus Technology… [+1388 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Danish Ansari", "title": "PUBG Mobile Lite 0.17.0 update release date, whats new on beta and download link - Republic World - Republic World", "description": "A PUBG Mobile Lite beta version 0.17.0 is available for players to test the new features available in the game. Scroll on for new features and download link", "url": "https://www.republicworld.com/technology-news/gaming/pubg-mobile-lite-update-release-date.html", "urlToImage": null, "publishedAt": "2020-04-24T11:23:32Z", "content": "PUBG Mobile Lite has finally introduced the much-awaited Payload mode with the 0.17.0 Beta update. The latest version of the game was recently released by the company and comes with some significant improvements and new features. It also has a few modificatio… [+2243 chars]"}, {"source": {"id": null, "name": "Gsmarena.com"}, "author": "Michail", "title": "Realme X3 SuperZoom clears Bluetooth SIG certification - GSMArena.com news - GSMArena.com", "description": "This is the fourth certification for the upcoming Realme phone.", "url": "https://www.gsmarena.com/realme_x3_superzoom_clears_bluetooth_sig_certification-news-42851.php", "urlToImage": null, "publishedAt": "2020-04-24T11:13:02Z", "content": "Realme\u0092s X3 has been in our rumor mill since the beginning of the month. We\u0092re expecting a vanilla X3 as well as an X3 SuperZoom which was spotted in several listings earlier this month. Now we have yet another sighting of the X3 SuperZoom which was spotted i… [+670 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Facebook data of over 267 million users leaked on Dark Web: Report - Hindustan Times", "description": "The database leaked on dark  web contains details of nearly 309 Facebook users.", "url": "https://www.hindustantimes.com/tech/facebook-data-of-over-267-million-users-leaked-on-dark-web-report/story-g3anJputolgCaKUAQUQKgK.html", "urlToImage": null, "publishedAt": "2020-04-24T09:59:05Z", "content": "Facebook is in trouble again and this time around it is for a data breach that has led to the personal data of over 267 million users being sold on the dark web.\r\nAccording to a report by the cybersecurity firm Sophos, which is based on the findings of anothe… [+1217 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "IANS", "title": "Here's how Google manages to confine people on YouTube - India TV News", "description": "Researchers have cracked how the successive recommendations generated by Google-owned Youtube's algorithm sometimes 'confine' us in a bubble of similar content.", "url": "https://www.indiatvnews.com/technology/news-researchers-have-cracked-how-the-successive-recommendations-generated-by-google-owned-youtube-s-algorithm-sometimes-confito-confine-people-on-youtube-610890", "urlToImage": null, "publishedAt": "2020-04-24T09:44:26Z", "content": "How do people end up 'confined' on YouTube.\r\nResearchers have cracked how the successive recommendations generated by Google-owned Youtube's algorithm sometimes \"confine\" us in a bubble of similar content. The researchers at the Centre Marc Bloch-Franco-Germa… [+1578 chars]"}, {"source": {"id": null, "name": "Nokiapoweruser.com"}, "author": null, "title": "Official Nokia Security+OS update tracker updated again (April 20) with April Security update details for all devices - Nokiapoweruser", "description": "The official Security+OS update tracker page for Nokia smartphones has been again updated on April 20, 2020, by Nokia Mobile (HMD) with details about the availability or unavailability of the April…", "url": "https://nokiapoweruser.com/official-nokia-securityos-update-tracker-updated-again-april-20-with-april-security-update-details-for-all-devices/", "urlToImage": null, "publishedAt": "2020-04-24T09:43:33Z", "content": "The official Security+OS update tracker page for Nokia smartphones has been again updated on April 20, 2020, by Nokia Mobile (HMD) with details about the availability or unavailability of the April Security update 2020 for all Nokia smartphones. As you may be… [+1198 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Skype brings new feature to take on Zoom - Times of India", "description": "Microsoft-owned video calling platform Skype has rolled out a new update that will allow users to choose their own backgrounds. The same feature is of", "url": "https://timesofindia.indiatimes.com/gadgets-news/skype-brings-new-feature-to-take-on-zoom/articleshow/75342325.cms", "urlToImage": null, "publishedAt": "2020-04-24T09:19:47Z", "content": null}, {"source": {"id": null, "name": "Gsmarena.com"}, "author": "Yordan", "title": "Xiaomi Mi A3 once again is receiving Android 10 update - GSMArena.com news - GSMArena.com", "description": "No, you\u0092re not having a deja vu - this is the fourth time.", "url": "https://www.gsmarena.com/xiaomi_mi_a3_once_again_receiving_android_10_update-news-42849.php", "urlToImage": null, "publishedAt": "2020-04-24T09:12:02Z", "content": "Nothing in the world is certain except death, taxes and Xiaomi Mi A series phones having troubles with major Android updates. According to users on Reddit, some Xiaomi Mi A3 units are receiving an Android 10 new update, which is different from the previous th… [+474 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "IANS", "title": "Google Assistant will now prompt you to say complete sentences for better results - India TV News", "description": "Google Assistant has received new changes for better user experience. Read on to know what is new", "url": "https://www.indiatvnews.com/technology/news-google-assistant-new-feature-see-what-they-is-it-610862", "urlToImage": null, "publishedAt": "2020-04-24T09:07:46Z", "content": "You can also adjust Google Assistant sensivity\r\nGoogle has introduced smarter ways to fine-tune Google Assistant to better tailor it for your environment and desired responsiveness at home. Now, when you set up Voice Match, Google Assistant will prompt you to… [+1768 chars]"}, {"source": {"id": null, "name": "Gizmochina.com"}, "author": "https://www.facebook.com/zionsanvin", "title": "Redmi K30i render leaked; Reveals punch-hole screen and triple rear cameras - gizmochina", "description": "A reliable tipster had recently claimed that Redmi is working on a new K30 series smartphone. The handset is dubbed as Redmi K30i and as the name suggests, it is expected to arrive as a “Lite” version of the Redmi K30 5G. A leaked render of the smartphone has…", "url": "https://www.gizmochina.com/2020/04/24/redmi-k30i-render-leaked-reveals-punch-hole-screen-and-triple-rear-cameras/", "urlToImage": null, "publishedAt": "2020-04-24T03:52:00Z", "content": "A reliable tipster had recently claimed that Redmi is working on a new K30 series smartphone. The handset is dubbed as Redmi K30i and as the name suggests, it is expected to arrive as a Lite version of the Redmi K30 5G. A leaked render of the smartphone has a… [+1502 chars]"}, {"source": {"id": null, "name": "Androidauthority.com"}, "author": null, "title": "The Realme X50m delivers 5G, 120Hz on the cheap - Android Authority", "description": "The Realme X50m 5G packs one hell of a punch for the price.", "url": "https://www.androidauthority.com/realme-x50m-5g-1110859/", "urlToImage": null, "publishedAt": "2020-04-24T01:31:48Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Travis Scott's Astroworld Concert Live on Fortnite with 100 Thieves | HYPEBEAST Exclusive - HYPEBEAST", "description": "JUMP STRAIGHT TO CONCERT AT: 36:34 NEW SONG AT: 44:23 Watch Travis Scott's Astroworld concert live on Fortnite with Ceice from 100 Thieves for a HYPEBEAST ex...", "url": "https://www.youtube.com/watch?v=XgeRLTx_qqc", "urlToImage": null, "publishedAt": "2020-04-24T00:00:53Z", "content": "JUMP STRAIGHT TO CONCERT AT: 36:34NEW SONG AT: 44:23\r\nWatch Travis Scott's Astroworld concert live on Fortnite with Ceice from 100 Thieves for a HYPEBEAST exclusive.\r\nFor up-to-date news and more: http://HYPEBEAST.com\r\nSubscribe to our channel: https://www.yo… [+241 chars]"}, {"source": {"id": null, "name": "Yourstory.com"}, "author": "Sohini Mitter", "title": "[App Fridays] Zoom rival Cisco WebEx becomes India’s #2 virtual meeting tool amid coronavirus - YourStory", "description": "Cisco WebEx, like most remote collaboration tools, has gained significantly from the coronavirus lockdown. Here’s how the app stacks up against its peers.", "url": "https://yourstory.com/2020/04/app-zoom-rival-cisco-webex-virtual-meeting-tool-coronavirus", "urlToImage": null, "publishedAt": "2020-04-23T23:52:46Z", "content": "With remote working becoming the new normal due to the coronavirus outbreak, cloud conferencing apps have witnessed exponential growth in the last one month. \r\nThere is ‘quarantine favourite’ Zoom, of course, which has become the default video conferencing to… [+4191 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Apple to Sell Computers With Its Own Chip Inside - Bloomberg Technology", "description": "Apr.23 -- Apple Inc. is planning to start selling Mac computers with its own main processors by next year. Bloomberg's Mark Gurman reports on \"Bloomberg Tech...", "url": "https://www.youtube.com/watch?v=mtFsXObLnPI", "urlToImage": null, "publishedAt": "2020-04-23T22:32:02Z", "content": null}, {"source": {"id": null, "name": "Macrumors.com"}, "author": "Juli Clover", "title": "Apple Now Has an Official TikTok Account, But No Videos Posted Yet - MacRumors", "description": "Apple appears to have created an official account on popular social networking app TikTok, which is a platform designed to allow users to share short...", "url": "https://www.macrumors.com/2020/04/23/apple-tiktok-account/", "urlToImage": null, "publishedAt": "2020-04-23T21:39:53Z", "content": "Apple appears to have created an official account on popular social networking app TikTok, which is a platform designed to allow users to share short videos.\r\nApple's account can be accessed through the username @apple on the TikTok website and within the Tik… [+1092 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Borderlands 3: Revenge of the Cartels - Official Trailer - IGN", "description": "Soak up some rays, rock those neon colors, and bust crime like it's the '80s in Revenge of the Cartels, the free seasonal event happening in Borderlands 3 fr...", "url": "https://www.youtube.com/watch?v=eWM5VdAykeM", "urlToImage": null, "publishedAt": "2020-04-23T21:00:25Z", "content": null}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Eddie Makuch", "title": "Xbox Series X Logo Trademarked: See The Stylish \"X\" Here - GameSpot", "description": "Take a look at what could be the logo for Microsoft's Xbox Series X.", "url": "https://www.gamespot.com/articles/xbox-series-x-logo-trademarked-see-the-stylish-x-h/1100-6476353/", "urlToImage": null, "publishedAt": "2020-04-23T20:34:00Z", "content": "Microsoft appears to be setting the stage for another Xbox Series X reveal. On April 16, the company filed a new trademark application for the next-generation console that, among other things, included what appears to be the console's logo.\r\nThe trademark app… [+2041 chars]"}, {"source": {"id": null, "name": "Gizchina.com"}, "author": null, "title": "Motorola Edge and Edge+ first photo samples surface in the web - Gizchina.com", "description": "Here are the first official photo samples taken with recently released Motorola Edge and Edge+. The company itself shared them.", "url": "https://www.gizchina.com/2020/04/23/motorola-edge-and-edge-are-in-for-the-first-photo-samples/", "urlToImage": null, "publishedAt": "2020-04-23T19:42:55Z", "content": "Motorola has finally taken the wraps of its flagship series with the release of Motorola Edge and Edge+. Both handsets come with a 6.7-inch AMOLED Endless Edge display with a 90Hz refresh rate. However, they differ in chipset, battery, and camera array. The E… [+1120 chars]"}, {"source": {"id": null, "name": "Nextplatform.com"}, "author": null, "title": "Locking Down Linux For The Enterprise - The Next Platform", "description": "Security has always been important for datacenter operators, but the days of putting a ring of protection around the datacenter and then walking away", "url": "https://www.nextplatform.com/2020/04/23/locking-down-linux-for-the-enterprise/", "urlToImage": null, "publishedAt": "2020-04-23T19:13:24Z", "content": "Security has always been important for datacenter operators, but the days of putting a ring of protection around the datacenter and then walking away satisfied in the knowledge that the data and applications therein were protected from outside forces are long… [+8627 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Jeet T Arya", "title": "Did Apple underclock the A13 Bionic processor in the iPhone SE? - Techradar", "description": "Benchmarks scores show a slower performance", "url": "https://www.techradar.com/news/did-apple-underclock-the-a13-bionic-processor-in-the-iphone-se", "urlToImage": null, "publishedAt": "2020-04-23T17:22:00Z", "content": "The iPhone 11 Pro Max and the iPhone SE are powered by the same A13 Bionic chipset, so you might expect that things would be the same in terms of performance.\r\nOur own iPhone SE review showed that the new handset didn't hit the heights of the iPhone 11 Pro Ma… [+2497 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Messenger Kids | Greg's Geek Fix - ABC Action News", "description": "Facebook has developed a kid-friendly messaging with important parental controls.", "url": "https://www.youtube.com/watch?v=LQwyzA_3C5I", "urlToImage": null, "publishedAt": "2020-04-23T16:04:07Z", "content": null}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Realme Buds Wireless Pro neckband surfaces on NCC site, design revealed - India Today", "description": "Realme Buds Wireless Pro is likely the successor of the Realme Buds Wireless that is quite popular in its price segment.", "url": "https://www.indiatoday.in/technology/news/story/realme-buds-wireless-pro-neckband-surfaces-on-ncc-site-design-revealed-1670258-2020-04-23", "urlToImage": null, "publishedAt": "2020-04-23T13:32:29Z", "content": "Realme is apparently working on a new pair of wireless earphones. According to a certification website, the company is developing Realme Buds Wireless Pro that could be a spruced-up version of The Realme Buds Wireless. Realme's expanding portfolio of devices … [+2221 chars]"}]}