{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Unboxing The New iPhone SE and First Impressions | Mashable - Mashable", "description": "Mashable Tech Reporter Brenda Stolyar got her hands on Apple's latest budget phone: the iPhone SE. Here are her first impressions. Mashable is your source fo...", "url": "https://www.youtube.com/watch?v=vkWGeH7fSlU", "urlToImage": null, "publishedAt": "2020-04-25T00:43:39Z", "content": "Mashable Tech Reporter Brenda Stolyar got her hands on Apple's latest budget phone: the iPhone SE. Here are her first impressions.\r\nMashable is your source for the latest in tech, culture, and entertainment.  Subscribe to Mashable: https://bit.ly/2DR64oMWatch… [+226 chars]"}, {"source": {"id": null, "name": "Androidpolice.com"}, "author": "https://www.facebook.com/corbin.davenport.50", "title": "OnePlus pulls buggy OxygenOS Open Beta 12 for OP7, 7 Pro shortly after release (Update: Statement) - Android Police", "description": "OxygenOS' Open Beta releases are usually very stable, but since they are beta-quality, sometimes there are critical bugs. OnePlus started to roll out Open", "url": "https://www.androidpolice.com/2020/04/24/oneplus-pulls-buggy-oxygenos-open-beta-12-for-op7-7-pro-shortly-after-release/", "urlToImage": null, "publishedAt": "2020-04-25T00:27:33Z", "content": "This story was originally published 2020/04/20 10:42am PDTon Apr 20, 2020 and last updated 2020/04/24 5:11pm PDTApr 24, 2020. \r\nOxygenOS' Open Beta releases are usually very stable, but since they are beta-quality, sometimes there are critical bugs. OnePlus s… [+3336 chars]"}, {"source": {"id": null, "name": "Venturebeat.com"}, "author": "Jeff Grubb", "title": "How Xbox Game Pass freed The Coalition to make Gears Tactics for PC - VentureBeat", "description": "Gears Tactics is the next big first-party Microsoft launch for Xbox Game Pass. Developer The Coalition made the game in part because of Game Pass.", "url": "https://venturebeat.com/2020/04/24/gears-tactics-xbox-game-pass/", "urlToImage": null, "publishedAt": "2020-04-24T23:33:30Z", "content": "Gears Tactics is launching April 28 for Windows 10, Xbox Game Pass for PC, and Steam. On How Games Make Money this week, host Jeff Grubb sits down to talk with The Coalition operations director Mike Crump and Xbox marketing general manager Ben Decker about th… [+4308 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Android 11 Developer Preview 3: All the changes we’ve found so far! - XDA Developers", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiRmh0dHBzOi8vd3d3LnhkYS1kZXZlbG9wZXJzLmNvbS9hbmRyb2lkLTExLWRldmVsb3Blci1wcmV2aWV3LTMtY2hhbmdlcy_SAUpodHRwczovL3d3dy54ZGEtZGV2ZWxvcGVycy5jb20vYW5kcm9pZC0xMS1kZXZlbG9wZXItcHJldmlldy0zLWNoYW5nZXMvYW1wLw?oc=5", "urlToImage": null, "publishedAt": "2020-04-24T22:52:00Z", "content": null}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Nick Statt", "title": "OnePlus lays off employees in Europe less than two weeks after OnePlus 8 launch - The Verge", "description": "OnePlus just launched its OnePlus 8 and OnePlus 8 Pro flagships less than two weeks ago, but the company is now downsizing its offices in parts of Europe. The offices hardest hit with the layoffs include the UK, France, and Germany, with OnePlus reportedly mo…", "url": "https://www.theverge.com/2020/4/24/21235215/oneplus-layoffs-europe-regional-downsizing-uk-france-germany", "urlToImage": null, "publishedAt": "2020-04-24T22:26:07Z", "content": "It appears unrelated to the coronavirus\r\nPhoto by Vjeran Pavic / The Verge\r\nOnePlus launched its latest flagship phones, the OnePlus 8 and OnePlus 8 Pro, less than two weeks ago, but the Chinese phone maker is now laying off employees in regional offices thro… [+1293 chars]"}, {"source": {"id": null, "name": "Siasat.com"}, "author": "Safoora", "title": "Facebook takes on Zoom with new Messenger Rooms’ - The Siasat Daily", "description": "SAN FRANCISCO: Alarmed at the popularity of Zoom in social distancing times that allows up to 100 people to join a video meeting from the comfort of their homes, Facebook on Friday announced Messenger Rooms that will allow group video calls of up to 50 people…", "url": "https://www.siasat.com/facebook-takes-zoom-new-messenger-rooms-1879148/", "urlToImage": null, "publishedAt": "2020-04-24T21:55:35Z", "content": "SAN FRANCISCO: Alarmed at the popularity of Zoom in social distancing times that allows up to 100 people to join a video meeting from the comfort of their homes, Facebook on Friday announced Messenger Rooms that will allow group video calls of up to 50 people… [+1808 chars]"}, {"source": {"id": null, "name": "Gsmarena.com"}, "author": "Prasad", "title": "Xiaomi Redmi Note 9 Series to launch globally on April 30 - GSMArena.com news - GSMArena.com", "description": "Should feature the existing Redmi Note 9 models and perhaps a new addition.", "url": "https://www.gsmarena.com/xiaomi_redmi_note_9_series_to_launch_globally_on_april_30-news-42862.php", "urlToImage": null, "publishedAt": "2020-04-24T20:00:01Z", "content": "Xiaomi has announced on its global social media channels that it will be launching the Redmi Note 9 Series. The launch will be through an online event, which will take place on April 30, 20:00 GMT.\r\nThe legend of #RedmiNoteSeries continues! \r\nGet ready to mee… [+992 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "WhatsApp might start showing you ads soon - Hindustan Times", "description": "Users may see these ads on the platform after Facebook completes its multi-year effort to link all its social media platforms.", "url": "https://www.hindustantimes.com/tech/here-s-when-whatsapp-may-start-showing-you-ads/story-gv8bTx1RnxRhcaklVjU6MJ.html", "urlToImage": null, "publishedAt": "2020-04-24T19:33:56Z", "content": "Facebook has not abandoned its plans to serve ads on its instant messaging service WhatsApp, the media reported. Users may see these ads on the platform after Facebook completes its multi-year effort to link all its social media platforms, according to a repo… [+1263 chars]"}, {"source": {"id": null, "name": "Notebookcheck.net"}, "author": "Alex Alderson", "title": "Xiaomi rolls out another Android 9.0 Pie update to the Mi Note 10 and Mi Note 10 Pro just days before it makes MIUI 12 available - Notebookcheck.net", "description": "With MIUI 12 rumoured to be available from MIUI 12, Xiaomi has decided to push another Android 9.0 Pie-based update to the Mi Note 10 and Mi Note 10 Pro. While Xiaomi has pledged to update the CC9 Pro to Android 10 by the end of this month, the arrival of the…", "url": "https://www.notebookcheck.net/Xiaomi-rolls-out-another-Android-9-0-Pie-update-to-the-Mi-Note-10-and-Mi-Note-10-Pro-just-days-before-it-makes-MIUI-12-available.462633.0.html", "urlToImage": null, "publishedAt": "2020-04-24T17:44:08Z", "content": "While Xiaomi has promised to update the CC9 Pro to Android 10 this month,  it looks unlikely that its Global or EU Mi Note 10 series siblings will receive the same treatment. As we previously reported, Global handsets started receiving their latest Android 9.… [+686 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Carly Page", "title": "The Dell XPS 15 2020 may have been redesigned to take on the MacBook Pro - TechRadar India", "description": "Incoming model will boast smaller bezels and upward-firing speakers", "url": "https://www.techradar.com/news/the-dell-xps-15-2020-may-have-been-redesigned-to-take-on-the-macbook-pro", "urlToImage": null, "publishedAt": "2020-04-24T17:31:00Z", "content": "Dell looks poised to release an all-new version of its XPS 15 laptop that will take a number of design clues from the recently-revamped Dell XPS 13\r\n.\r\nThats according to leaked images posted on the Korea Energy Agency Efficiency Standardization Certification… [+2119 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "2020 Battery Drain Test Comparison: OnePlus 8 vs Galaxy S20 Ultra vs iPhone 11 Pro Max - PhoneArena", "description": "In this battery drain test, we compare the battery life of the new OnePlus 8 against the Samsung Galaxy S20 Ultra, Galaxy S20 Plus, Galaxy S20, and then the ...", "url": "https://www.youtube.com/watch?v=QP9LxoBe6pE", "urlToImage": null, "publishedAt": "2020-04-24T17:10:14Z", "content": "In this battery drain test, we compare the battery life of the new OnePlus 8 against the Samsung Galaxy S20 Ultra, Galaxy S20 Plus, Galaxy S20, and then the iPhone 11 Pro Max, iPhone 11 Pro and the regular iPhone 11.\r\nWhich one will win? Watch it to find out.… [+849 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Prasid Banerjee", "title": "Apple, Google release new contact tracing API specs, security, accuracy measures - Livemint", "description": "The metadata associated with Bluetooth will be encrypted now.Data about who a user has been near is only retained on the device for 14 days, and deleted after that", "url": "https://www.livemint.com/technology/tech-news/apple-google-release-new-contact-tracing-api-specs-security-accuracy-measures-11587745717237.html", "urlToImage": null, "publishedAt": "2020-04-24T16:44:47Z", "content": "After announcing that they would work together to help governments contact-tracing efforts, Apple and Google released more technical details about their efforts. Amongst the changes made to the API they will provide to others, are stronger encryption standard… [+2889 chars]"}, {"source": {"id": null, "name": "Gizchina.com"}, "author": null, "title": "OnePlus Z surfaces in leaked live-photos - Gizchina.com", "description": "The OnePlus Z mid-range is yet to be released by the company. Today, alleged live shots reveal the handset in all its glory.", "url": "https://www.gizchina.com/2020/04/24/oneplus-z-surfaces-in-leaked-live-photos/", "urlToImage": null, "publishedAt": "2020-04-24T16:22:11Z", "content": "This year, rumors were pointing to the arrival of three OnePlus smartphones. However, just two of them were released in the last week – OnePlus 8 and OnePlus 8 Pro. Apparently, the constant problems raised by the COVID-19 pandemic had delayed the construction… [+1718 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The Apple Watch: 5 years later - Engadget", "description": "When Apple released its first wearable five years ago, many publications, including ours, were pretty skeptical. And with good reason, the first-gen watch wa...", "url": "https://www.youtube.com/watch?v=prYst35-x_k", "urlToImage": null, "publishedAt": "2020-04-24T16:00:29Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Kyocera DuraXV Extreme and Sonim XP3 are COVID-Proof Phones - PCMag", "description": "You shouldn't ingest or inject bleach or any household cleanser to cure yourself of COVID-19. But these rugged phones can take household soaps and even Cloro...", "url": "https://www.youtube.com/watch?v=mjNJEZPtAPY", "urlToImage": null, "publishedAt": "2020-04-24T16:00:28Z", "content": "You shouldn't ingest or inject bleach or any household cleanser to cure yourself of COVID-19. But these rugged phones can take household soaps and even Clorox with Bleach just fine.https://www.pcmag.com/news/these-phon...\r\nPCMag.com is your ultimate destinati… [+303 chars]"}, {"source": {"id": null, "name": "Androidpolice.com"}, "author": null, "title": "Google details Phone app’s new call recording functions - Android Police", "description": "Google has been working on call recording in its Phone app for some time now — we've first seen some evidence back in January, followed by some", "url": "https://www.androidpolice.com/2020/04/24/google-phone-app-call-recording-live-india/", "urlToImage": null, "publishedAt": "2020-04-24T15:59:44Z", "content": "This story was originally published 2020/04/16 6:39am PDTon Apr 16, 2020 and last updated 2020/04/24 8:47am PDTApr 24, 2020. \r\nGoogle has been working on call recording in its Phone app for some time now we've first seen some evidence back in January, followe… [+2258 chars]"}, {"source": {"id": null, "name": "Searchengineland.com"}, "author": "https://www.facebook.com/barryschwartz", "title": "New free version of Google Shopping rolling out now - Search Engine Land", "description": "It is now rolling out and should be fully live in the US by early next week.", "url": "https://searchengineland.com/new-free-version-of-google-shopping-rolling-out-now-333589", "urlToImage": null, "publishedAt": "2020-04-24T13:52:00Z", "content": "Google’s new free version of Google Shopping is now rolling out. A Google spokesperson has confirmed with Search Engine Land that this has begun to roll out. This does not mean it is fully rolled out and all U.S. searchers will see it immediately, but by earl… [+740 chars]"}, {"source": {"id": null, "name": "Gsmarena.com"}, "author": "Michail", "title": "Here WeGo Maps comes to Huawei App Gallery - GSMArena.com news - GSMArena.com", "description": "Full turn-by-turn navigation available in over 100 countries.", "url": "https://www.gsmarena.com/here_wego_maps_comes_to_huawei_app_gallery-news-42854.php", "urlToImage": null, "publishedAt": "2020-04-24T13:51:02Z", "content": "Since losing its access to Google Mobile Services (GMS) nearly a year ago, Huawei has been looking for ways to expand its app portfolio through the App Gallery store. Now, it got a serious addition with Here WeGo Maps (formerly Here Maps) which is now availab… [+807 chars]"}, {"source": {"id": "the-next-web", "name": "The Next Web"}, "author": "Callum Booth", "title": "The fancy-pants LG Velvet arrives on May 7 — here’s what we know - The Next Web", "description": "If I asked you to list smartphone brands, LG wouldn’t be near the top. But the company is trying to change all that, and its latest attempt? Its new smartphone, the LG Velvet. Now, the latest update is the company will unveil this handset on May 7, something …", "url": "https://thenextweb.com/plugged/2020/04/24/lg-velvet-phone-may-7-launch-specs/", "urlToImage": null, "publishedAt": "2020-04-24T13:45:06Z", "content": "If I asked you to list smartphone brands, LG wouldnt be near the top. But the company is trying to change all that, and its latest attempt? Its new smartphone, the LG Velvet.\r\nNow, the latest update is the company will unveil this handset on May 7, something … [+2558 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Christopher Groux", "title": "'Call of Duty: Modern Warfare' Free Multiplayer This Weekend, When It Starts and How to Download - Newsweek", "description": "Just like last time, players can download all they need for the 'Modern Warfare' weekend by installing the 'Call of Duty: Warzone' standalone application for free.", "url": "https://www.newsweek.com/call-modern-warfare-free-multiplayer-weekend-april-24-time-download-1500016", "urlToImage": null, "publishedAt": "2020-04-24T13:42:18Z", "content": "Call of Duty: Modern Warfare is hosting another free multiplayer weekend that starts this Friday and lasts through Monday. In this brief rundown of the key details, we outline the times, maps and download instructions you need to know.\r\nCall of Duty: Modern W… [+2527 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Christopher Groux", "title": "'Borderlands 3' Claw & Order Guide - Echo Log Locations & Walkthrough - Newsweek", "description": "\"Borderlands 3\" has a new quest called Claw and Order. In this guide, we'll show the locations for every Echo Log you need to find.", "url": "https://www.newsweek.com/borderlands-3-claw-order-guide-echo-log-locations-walkthrough-1500009", "urlToImage": null, "publishedAt": "2020-04-24T13:20:10Z", "content": "Borderlands 3 Revenge of the Cartels event is officially live, and that means there are new quests for players to enjoy. One such mission, called Claw and Order, seems to be giving players trouble. In this guide we'll reveal the locations of all three Echo Lo… [+1711 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jon Porter", "title": "Telegram adding secure group video calls this year - The Verge", "description": "Messaging app Telegram is developing a group video calling service that’s due to be launched later this year. It announced the plans alongside the news that the service now boasts 400 million monthly active users.", "url": "https://www.theverge.com/2020/4/24/21234254/telegram-messaging-app-group-video-calling-security-usability", "urlToImage": null, "publishedAt": "2020-04-24T13:10:11Z", "content": "The messaging service now has 400 million monthly active users\r\nIllustration by Alex Castro / The Verge\r\nMessaging app Telegram is developing a group video calling service thats due to be launched later this year, the company announced today. It says that cur… [+1733 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "India TV Tech Desk", "title": "New iOS bug in Sindhi characters will crash your iPhone: See what is it - India TV News", "description": "iPhone has a new character bug that is crashing iPhones due to a Sindhi character. Know details", "url": "https://www.indiatvnews.com/technology/news-apple-iphone-ios-bug-crashing-iphones-know-why-610933", "urlToImage": null, "publishedAt": "2020-04-24T13:03:41Z", "content": "Image Source : TWITTERThe iOS text string bug\r\nApple iPhones have had a history of text string bugs wherein a particular text string can cause an iPhone to crash. A new iOS bug has surfaced wherein a new string of text is making rounds and crashing the iPhone… [+1808 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Xiaomi Mi 10 Pro review - GSMArena Official", "description": "The Xiaomi Mi 10 Pro is a flagship phone with a flagship price if you get what we mean. This means high expectations and less room for compromise. But we're ...", "url": "https://www.youtube.com/watch?v=QcZxkAFityw", "urlToImage": null, "publishedAt": "2020-04-24T12:22:29Z", "content": "The Xiaomi Mi 10 Pro is a flagship phone with a flagship price if you get what we mean. This means high expectations and less room for compromise. But we're glad to see that the Mi 10 Pro delivers. Check out our review where we go through the phone's top feat… [+553 chars]"}, {"source": {"id": null, "name": "9to5google.com"}, "author": null, "title": "OnePlus 8 Pro display issues surface on some devices but a fix is inbound - 9to5Google", "description": "Even with one of the best displays o the market, some OnePlus 8 models are still managing to have some pronounced issues.", "url": "https://9to5google.com/2020/04/24/oneplus-8-pro-display-issues-surface-on-some-devices-but-a-fix-is-inbound/", "urlToImage": null, "publishedAt": "2020-04-24T12:19:26Z", "content": "Even with one of the best displays on the market, some OnePlus 8 models are still managing to have some pronounced issues.\r\nMuch like with the Galaxy S20 Ultra recently, the new 120Hz displays are having problems with crushed black, low brightness, and green … [+1503 chars]"}, {"source": {"id": null, "name": "Gizchina.com"}, "author": null, "title": "Google Assistant gets smarter with more precise voice recognition - Gizchina.com", "description": "Google Assistant gets smarter with more precise voice recognition. The recognition has been significantly improved with this new feature.", "url": "https://www.gizchina.com/2020/04/24/google-assistant-gets-smarter-with-more-precise-voice-recognition/", "urlToImage": null, "publishedAt": "2020-04-24T12:11:15Z", "content": "Connected speakers and other devices that integrate Googles voice assistant can teach Google to recognize your voice using the Voice Match feature. The recognition will be significantly improved thanks to greater precision via artificial intelligence.\r\nAs we … [+1698 chars]"}, {"source": {"id": null, "name": "Gsmarena.com"}, "author": "Yordan", "title": "Kuo: Apple to launch 3rd gen AirPods in Q1 2021 - GSMArena.com news - GSMArena.com", "description": "New AirPods Pro should be expected a year later - Q1 2022.", "url": "https://www.gsmarena.com/kuo_apple_to_launch_3rd_gen_airpods_in_q1_2021-news-42852.php", "urlToImage": null, "publishedAt": "2020-04-24T12:02:01Z", "content": "Apple is planning to start mass production of new AirPods at the end of 2020. This was revealed by the analyst Ming-Chi Kuo where he revealed the earphones will arrive in Q1 2021.\r\nThe note to investors, quoted by Apple Insider, also revealed the second-gen A… [+686 chars]"}, {"source": {"id": null, "name": "Sammobile.com"}, "author": "SamMobile", "title": "One way Galaxy Note 20 might not fall behind some competing flagships - SamMobile", "description": "Qualcomm has no intention to manufacture a Snapdragon 865+ variant this year, according to a recent report citing the head ...", "url": "https://www.sammobile.com/news/one-way-galaxy-note-20-might-not-fall-behind-competing-flagships/", "urlToImage": null, "publishedAt": "2020-04-24T11:24:34Z", "content": "Qualcomm has no intention to manufacture a Snapdragon 865+ variant this year, according to a recent report citing the head of Meizu Technology Marketing, Wan Zhiqiang. And although this may be disappointing news for tech enthusiasts, it could actually work in… [+1396 chars]"}, {"source": {"id": null, "name": "Gizchina.com"}, "author": null, "title": "All OnePlus 8 Models Are Out Of Stock: Popularity Exceeded Expectations - Gizchina.com", "description": "The OnePlus 8 and its Pro variant are considered to be new-gen flagships smartphones. But their current popularity have exceeded all expectations.", "url": "https://www.gizchina.com/2020/04/24/all-oneplus-8-models-are-out-stock-popularity-exceeded-expectations/", "urlToImage": null, "publishedAt": "2020-04-24T11:23:53Z", "content": "Just recently, the new-gen OnePlus 8 series flagship smartphones have been announced at a price of 3,999 yuan ($565). After the first sale, the entire network’s sales in one minute exceeded 100 million yuan ($14.12 million). In recent days, OnePlus Technology… [+1388 chars]"}, {"source": {"id": null, "name": "Gsmarena.com"}, "author": "Michail", "title": "Realme X3 SuperZoom clears Bluetooth SIG certification - GSMArena.com news - GSMArena.com", "description": "This is the fourth certification for the upcoming Realme phone.", "url": "https://www.gsmarena.com/realme_x3_superzoom_clears_bluetooth_sig_certification-news-42851.php", "urlToImage": null, "publishedAt": "2020-04-24T11:13:02Z", "content": "Realme\u0092s X3 has been in our rumor mill since the beginning of the month. We\u0092re expecting a vanilla X3 as well as an X3 SuperZoom which was spotted in several listings earlier this month. Now we have yet another sighting of the X3 SuperZoom which was spotted i… [+670 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Snapdragon 865-powered iQOO 3 price slashed by up to ₹4,000 in India - XDA Developers", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiS2h0dHBzOi8vd3d3LnhkYS1kZXZlbG9wZXJzLmNvbS9pcW9vLTMtc25hcGRyYWdvbi04NjUtNGctNWctcHJpY2UtY3V0LWluZGlhL9IBT2h0dHBzOi8vd3d3LnhkYS1kZXZlbG9wZXJzLmNvbS9pcW9vLTMtc25hcGRyYWdvbi04NjUtNGctNWctcHJpY2UtY3V0LWluZGlhL2FtcC8?oc=5", "urlToImage": null, "publishedAt": "2020-04-24T10:20:39Z", "content": null}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "India Today League PUBG Mobile Invitational: Team Hydra grab early lead on Day 2 with Chicken Dinner in Match 1 - India Today", "description": "Team Hydra had 4 gamers alive till the final stages of the match and walked away with chicken dinner with 34 points in the first match on Day 2.", "url": "https://www.indiatoday.in/sports/other-sports/story/india-today-league-itpubl-pubg-mobile-invitational-day-2-match-1-report-hydra-chicken-dinner-1670551-2020-04-24", "urlToImage": null, "publishedAt": "2020-04-24T10:09:22Z", "content": "Team Hydra claimed the Chicken Dinner in the first match of day 2 of the India Today PUBG Mobile League Invitational tournament on Friday with 14 kills ahead of VSG Crawlers and Orange Rock.\r\nHydra grabbed 34 points in the first game followed by VSG Crawlers … [+1769 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Danny Cyril D Cruze", "title": "Airtel's new ₹401 prepaid plan offers free one year of Disney Plus Hotstar - Livemint", "description": "The validity of the 3GB prepaid data plan offered by the company is just for 28 days.Airtel also offers a  ₹349 plan that provides 2GB data per day", "url": "https://www.livemint.com/companies/news/airtel-s-rs-401-prepaid-plan-offers-free-one-year-of-disney-plus-hotstar-11587719382359.html", "urlToImage": null, "publishedAt": "2020-04-24T09:50:38Z", "content": "Airtel has launched a new prepaid data pack for its users. The new data plan not only offers data but also gives the user subscription to one year of Disney Plus Hotstar VIP. The validity of the 3GB prepaid data plan offered by the company is just for 28 days… [+1602 chars]"}, {"source": {"id": null, "name": "Nokiapoweruser.com"}, "author": null, "title": "Official Nokia Security+OS update tracker updated again (April 20) with April Security update details for all devices - Nokiapoweruser", "description": "The official Security+OS update tracker page for Nokia smartphones has been again updated on April 20, 2020, by Nokia Mobile (HMD) with details about the availability or unavailability of the April…", "url": "https://nokiapoweruser.com/official-nokia-securityos-update-tracker-updated-again-april-20-with-april-security-update-details-for-all-devices/", "urlToImage": null, "publishedAt": "2020-04-24T09:43:33Z", "content": "The official Security+OS update tracker page for Nokia smartphones has been again updated on April 20, 2020, by Nokia Mobile (HMD) with details about the availability or unavailability of the April Security update 2020 for all Nokia smartphones. As you may be… [+1198 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Kunal Gaurav", "title": "Google Meet rolls out major features to take on Zoom video conferencing app - Republic World - Republic World", "description": "While video conferencing platform Zoom’s popularity skyrocketed amid COVID-19 lockdowns, Google Meet has started rolling out an updated version to take it on.", "url": "https://www.republicworld.com/technology-news/apps/google-meet-rolls-out-major-feature-to-take-on-zoom-video-conferencing.html", "urlToImage": null, "publishedAt": "2020-04-24T09:41:09Z", "content": "While video conferencing platform Zoom’s popularity skyrocketed amid COVID-19 lockdowns, Google Meet has started rolling out an updated version to compete with it. Though Zoom became extremely popular for videoconferencing during social distancing measures, i… [+2205 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Skype brings new feature to take on Zoom - Times of India", "description": "Microsoft-owned video calling platform Skype has rolled out a new update that will allow users to choose their own backgrounds. The same feature is of", "url": "https://timesofindia.indiatimes.com/gadgets-news/skype-brings-new-feature-to-take-on-zoom/articleshow/75342325.cms", "urlToImage": null, "publishedAt": "2020-04-24T09:19:47Z", "content": null}, {"source": {"id": null, "name": "Gsmarena.com"}, "author": "Yordan", "title": "Xiaomi Mi A3 once again is receiving Android 10 update - GSMArena.com news - GSMArena.com", "description": "No, you\u0092re not having a deja vu - this is the fourth time.", "url": "https://www.gsmarena.com/xiaomi_mi_a3_once_again_receiving_android_10_update-news-42849.php", "urlToImage": null, "publishedAt": "2020-04-24T09:12:02Z", "content": "Nothing in the world is certain except death, taxes and Xiaomi Mi A series phones having troubles with major Android updates. According to users on Reddit, some Xiaomi Mi A3 units are receiving an Android 10 new update, which is different from the previous th… [+474 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Barry Collins", "title": "Why You Shouldn’t Charge Your MacBook Pro From The Left-Hand Side - Forbes", "description": "A new piece of research claims that plugging in a MacBook Pro charger on the left-hand side of the device can cause the laptop to run hot, potentially affecting its performance", "url": "https://www.forbes.com/sites/barrycollins/2020/04/24/why-you-shouldnt-charge-your-macbook-pro-from-the-left-hand-side/", "urlToImage": null, "publishedAt": "2020-04-24T08:09:40Z", "content": "Charging the MacBook Pro from the left-hand side can cause temperature spikes, a report claims\r\nNurPhoto via Getty Images\r\nA new piece of research claims that plugging in a MacBook Pro charger on the left-hand side of the device can cause the laptop to run ho… [+1866 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Prasid Banerjee", "title": "Database reappears on dark web with 309 Facebook users' personal info for sale - Livemint", "description": "The database includes users’ phone numbers, email addresses, names, Facebook IDs and age, according to the researchers.While passwords weren’t exposed in the breach, security professionals have recommended users to change it", "url": "https://www.livemint.com/technology/tech-news/database-reappears-on-dark-web-with-309-facebook-users-personal-info-for-sale-11587710058031.html", "urlToImage": null, "publishedAt": "2020-04-24T06:36:50Z", "content": "Personal database of 267 million Facebook users which was being sold on the dark web for just 500 (about 41,000) has now expanded to 309 million, cyber risk assessment platform Cyble Inc said Friday.The database includes users phone numbers, email addresses, … [+1936 chars]"}, {"source": {"id": null, "name": "Ghacks.net"}, "author": null, "title": "Malwarebytes launches Malwarebytes Privacy VPN service - Ghacks Technology News", "description": "Malwarebytes, best known for the security product that is also called Malwarebytes, unveiled Malwarebytes Privacy on April 23, 2020 officially.", "url": "https://www.ghacks.net/2020/04/24/malwarebytes-launches-malwarebytes-privacy-vpn-service/", "urlToImage": null, "publishedAt": "2020-04-24T05:38:41Z", "content": "Malwarebytes, best known for the security product that is also called Malwarebytes, unveiledMalwarebytes Privacy on April 23, 2020 officially.\r\nMalwarebytes Privacy is a \"next-gen VPN\" according to the announcement on the company blog that \"helps protect your… [+2697 chars]"}, {"source": {"id": null, "name": "Gizmochina.com"}, "author": "https://www.facebook.com/zionsanvin", "title": "Redmi K30i render leaked; Reveals punch-hole screen and triple rear cameras - gizmochina", "description": "A reliable tipster had recently claimed that Redmi is working on a new K30 series smartphone. The handset is dubbed as Redmi K30i and as the name suggests, it is expected to arrive as a “Lite” version of the Redmi K30 5G. A leaked render of the smartphone has…", "url": "https://www.gizmochina.com/2020/04/24/redmi-k30i-render-leaked-reveals-punch-hole-screen-and-triple-rear-cameras/", "urlToImage": null, "publishedAt": "2020-04-24T03:52:00Z", "content": "A reliable tipster had recently claimed that Redmi is working on a new K30 series smartphone. The handset is dubbed as Redmi K30i and as the name suggests, it is expected to arrive as a Lite version of the Redmi K30 5G. A leaked render of the smartphone has a… [+1502 chars]"}, {"source": {"id": null, "name": "Androidauthority.com"}, "author": null, "title": "The Realme X50m delivers 5G, 120Hz on the cheap - Android Authority", "description": "The Realme X50m 5G packs one hell of a punch for the price.", "url": "https://www.androidauthority.com/realme-x50m-5g-1110859/", "urlToImage": null, "publishedAt": "2020-04-24T01:31:48Z", "content": null}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Gordon Kelly", "title": "Google Just Gave Millions Of Users A Reason To Quit Chrome, Windows 10 - Forbes", "description": "Google has revealed an unfixable problem which may force you to pick between Windows 10 and Chrome.", "url": "https://www.forbes.com/sites/gordonkelly/2020/04/23/google-chrome-critical-security-exploit-windows-10-upgrade-warning-update-chrome-browser/", "urlToImage": null, "publishedAt": "2020-04-24T00:36:00Z", "content": "Google is always improving Chrome and it recently issued a brilliant (if long overdue) upgrade. That said, there have also been some recent controversial changes, security problems and data concerns and now Google has detailed a serious new problem in Chrome … [+2782 chars]"}, {"source": {"id": null, "name": "Bleepingcomputer.com"}, "author": "Sergiu Gatlan", "title": "Windows 10 KB4549951 update fails to install, causes BSODs - BleepingComputer", "description": "The Windows 10 KB4549951 ​​​​​​​cumulative update is reportedly failing to install and is causing blue screens of death (BSOD) after installation reboots, among other issues, according to user reports.", "url": "https://www.bleepingcomputer.com/news/microsoft/windows-10-kb4549951-update-fails-to-install-causes-bsods/", "urlToImage": null, "publishedAt": "2020-04-23T23:11:05Z", "content": "The Windows 10 KB4549951 cumulative update is reportedly failing to install and is causing blue screens of death (BSOD) after installation reboots, among other issues, according to user reports.\r\nKB4549951 is a cumulative update with security fixes released a… [+6269 chars]"}, {"source": {"id": null, "name": "Gizmochina.com"}, "author": null, "title": "Microsoft's Surface Earbuds to finally launch more than six months after first unveiling - gizmochina", "description": "Last October, Microsoft showed us its very first earbuds, the Surface Buds. However, the earbuds didn’t go on sale after its release as they were delayed to Spring 2020. It has now been reported that the earbuds will launch next month and should be available …", "url": "https://www.gizmochina.com/2020/04/23/microsofts-surface-earbuds-to-finally-launch-more-than-six-months-after-first-unveiling/", "urlToImage": null, "publishedAt": "2020-04-23T23:10:00Z", "content": "Last October, Microsoft showed us its very first earbuds, the Surface Buds. However, the earbuds didn’t go on sale after its release as they were delayed to Spring 2020. It has now been reported that the earbuds will launch next month and should be available … [+1311 chars]"}, {"source": {"id": null, "name": "Macrumors.com"}, "author": "Juli Clover", "title": "Apple Now Has an Official TikTok Account, But No Videos Posted Yet - MacRumors", "description": "Apple appears to have created an official account on popular social networking app TikTok, which is a platform designed to allow users to share short...", "url": "https://www.macrumors.com/2020/04/23/apple-tiktok-account/", "urlToImage": null, "publishedAt": "2020-04-23T21:39:53Z", "content": "Apple appears to have created an official account on popular social networking app TikTok, which is a platform designed to allow users to share short videos.\r\nApple's account can be accessed through the username @apple on the TikTok website and within the Tik… [+1092 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Eddie Makuch", "title": "Xbox Series X Logo Trademarked: See The Stylish \"X\" Here - GameSpot", "description": "Take a look at what could be the logo for Microsoft's Xbox Series X.", "url": "https://www.gamespot.com/articles/xbox-series-x-logo-trademarked-see-the-stylish-x-h/1100-6476353/", "urlToImage": null, "publishedAt": "2020-04-23T20:34:00Z", "content": "Microsoft appears to be setting the stage for another Xbox Series X reveal. On April 16, the company filed a new trademark application for the next-generation console that, among other things, included what appears to be the console's logo.\r\nThe trademark app… [+2041 chars]"}, {"source": {"id": null, "name": "Insider.com"}, "author": "Rachel E. Greenspan", "title": "Elijah Wood slid into someone's Twitter DMs to sell his turnips on her Animal Crossing island - Insider - INSIDER", "description": "According to screenshots, actor Elijah Wood messaged a Twitter user on Thursday in the hopes of selling his turnips on her Animal Crossing island.", "url": "https://www.insider.com/elijah-wood-animal-crossing-island-turnips-twitter-2020-4", "urlToImage": null, "publishedAt": "2020-04-23T20:19:06Z", "content": "The best way to get a celebrity's attention online during the coronavirus pandemic may just be through tweeting about Animal Crossing. \r\nOne Twitter user was surprised on Thursday to receive a direct message from Elijah Wood — the actor known for his role as … [+1460 chars]"}, {"source": {"id": null, "name": "Gizchina.com"}, "author": null, "title": "Motorola Edge and Edge+ first photo samples surface in the web - Gizchina.com", "description": "Here are the first official photo samples taken with recently released Motorola Edge and Edge+. The company itself shared them.", "url": "https://www.gizchina.com/2020/04/23/motorola-edge-and-edge-are-in-for-the-first-photo-samples/", "urlToImage": null, "publishedAt": "2020-04-23T19:42:55Z", "content": "Motorola has finally taken the wraps of its flagship series with the release of Motorola Edge and Edge+. Both handsets come with a 6.7-inch AMOLED Endless Edge display with a 90Hz refresh rate. However, they differ in chipset, battery, and camera array. The E… [+1120 chars]"}, {"source": {"id": null, "name": "Zdnet.com"}, "author": "Steven J. Vaughan-Nichols", "title": "Ubuntu 20.04 arrives with Linux 5.4 kernel and WireGuard VPN - ZDNet", "description": "The latest long-term support version of Ubuntu Linux, Focal Fossa, is one good-looking cat with nice features for desktop, server, and cloud users.", "url": "https://www.zdnet.com/article/ubuntu-20-04-arrives-with-linux-5-4-kernel-and-wireguard-vpn/", "urlToImage": null, "publishedAt": "2020-04-23T18:51:00Z", "content": "As expected, Canonical has released the newest version of its Ubuntu Linux distribution, Ubuntu 20.04. This long-term-support (LTS) version is more than just the latest version of one of the most popular Linux distributions; it's a major update for desktop, s… [+10096 chars]"}, {"source": {"id": null, "name": "Gsmarena.com"}, "author": "Ivan", "title": "Indian TWS earbud market grows by 700%, led by Apple's AirPods - GSMArena.com news - GSMArena.com", "description": "Realme's Buds Air are the second best-selling earbud in India for 2019.", "url": "https://www.gsmarena.com/indian_tws_earbud_market_grows_by_700_led_by_apples_airpods-news-42840.php", "urlToImage": null, "publishedAt": "2020-04-23T18:44:02Z", "content": "The Indian truly wireless earbud market saw a tremendous 700% increase in 2019, which made it the fastest-growing market in wearables in the world.\r\nApple dominated with its second-generation AirPods and its AirPods Pro, the latter of which launched in the co… [+535 chars]"}, {"source": {"id": null, "name": "Crn.com"}, "author": "Kyle Alspach", "title": "Apple Solidifies Plans To Launch Its Own Chips For Macs: Report - CRN: Technology news for channel partners and solution providers", "description": "Apple-designed chips for the Mac could be arriving in 2021 with designs based on the next iPhone processor, the A14.", "url": "https://www.crn.com/news/mobility/apple-solidifies-plans-to-launch-its-own-chips-for-macs-report", "urlToImage": null, "publishedAt": "2020-04-23T18:35:23Z", "content": "Apple is poised to debut internally developed processors in its Mac line in 2021, with the chips coming as variations on the processor for the next iPhone, Bloomberg reported. \r\nAn Apple-designed, Arm-based chip is expected to launch in \"at least one Mac\" dur… [+2457 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Apple A13 Bionic may be underclocked in iPhone SE - Hindustan Times", "description": "According to a screenshot of AnTuTu benchmark test results, the Apple A13 Bionic processor in the iPhone SE (2020) seems underclocked.", "url": "https://www.hindustantimes.com/tech/apple-a13-bionic-may-be-underclocked-in-iphone-se-benchmark-proves-it-weaker-than-iphone-11/story-Qdju2Q0D0Y3LFHPFQUSNCO.html", "urlToImage": null, "publishedAt": "2020-04-23T17:57:58Z", "content": "When the new iPhone SE launched a few days ago, it instantly became a hit for its ‘affordable’ price. One of the key selling points of the device is the A13 Bionic processor that is also found in the most powerful iPhone till date, the iPhone 11 Pro Max. But … [+1275 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Souhardya Biswas", "title": "Massive Armor Changes Revealed In Forthcoming Apex Legends LTM - Essentially Sports", "description": "Now, Respawn seems to be planning on another venture by massively restructuring the armors in Apex Legends as revealed by popular data miner iLootGames.", "url": "https://www.essentiallysports.com/massive-armor-changes-revealed-in-forthcoming-apex-legends-lmt-esports-news-2020/", "urlToImage": null, "publishedAt": "2020-04-23T17:40:26Z", "content": "Apex Legends revolutionized the perception of battle royale games after its launch in February 2019. At the time, the idea of resurrecting fallen teammate(s) was unknown in the BR genre. Respawn successfully implemented a concept in-game, which then allowed p… [+2389 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Dave Thier", "title": "When And Where To Watch Fortnite’s Travis Scott Concert: Full Schedule, Show-Times, And Dates For Astronomical - Forbes", "description": "Here's when and where to watch the Travis Scott 'Astronomical' concert in 'Fortnite'. Check here for dates, full schedule, show-times and how to watch.", "url": "https://www.forbes.com/sites/davidthier/2020/04/23/when-and-where-to-watch-fortnites-travis-scott-concert-full-schedule-show-times-and-dates-for-astronomical/", "urlToImage": null, "publishedAt": "2020-04-23T14:04:49Z", "content": "Fortnite\r\ncredit: Epic Games\r\nIts a big one. Fortnite has had a concert once before, but the Marshmello concert happened at a time when you could, if you wanted to, go to a real concert. Not so this time around: Travis Scotts Astronomical concert comes with a… [+1780 chars]"}, {"source": {"id": "the-next-web", "name": "The Next Web"}, "author": "Ivan Mehta", "title": "Twitter is testing a feature to let you see quoted retweets - The Next Web", "description": "You've all seen \"sco pa tu mana\" and \"bomboclaat\" tweets on your timeline. Those templates are made for quote retweets. But, there's no way you can see all quoted ...", "url": "https://thenextweb.com/twitter/2020/04/23/twitter-is-testing-a-feature-to-let-you-see-quoted-retweets/", "urlToImage": null, "publishedAt": "2020-04-23T13:44:09Z", "content": "Youve all seen sco pa tu mana and bomboclaat tweets on your timeline. Those templates are made for quote retweets. But, theres no way you can see all quoted tweets from a single tweet right now. However, Twitter might be solving that problem soon.\r\nThe compan… [+1163 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Realme Buds Wireless Pro neckband surfaces on NCC site, design revealed - India Today", "description": "Realme Buds Wireless Pro is likely the successor of the Realme Buds Wireless that is quite popular in its price segment.", "url": "https://www.indiatoday.in/technology/news/story/realme-buds-wireless-pro-neckband-surfaces-on-ncc-site-design-revealed-1670258-2020-04-23", "urlToImage": null, "publishedAt": "2020-04-23T13:32:29Z", "content": "Realme is apparently working on a new pair of wireless earphones. According to a certification website, the company is developing Realme Buds Wireless Pro that could be a spruced-up version of The Realme Buds Wireless. Realme's expanding portfolio of devices … [+2221 chars]"}, {"source": {"id": null, "name": "Notebookcheck.net"}, "author": "Daniel R Deakin", "title": "AMD Ryzen 3 3300X calls time's up on the Intel Core i7-7700K by overpowering it in Geekbench's single-core and multi-core tests - Notebookcheck.net", "description": "The budget AMD Ryzen 3 3300X Matisse desktop processor has been tested on Geekbench 4 in combination with an ASRock X470 Gaming-ITX/ac motherboard. The new CPU has thrown up a single-core score and multi-core score that can beat the median scores for the thou…", "url": "https://www.notebookcheck.net/AMD-Ryzen-3-3300X-calls-time-s-up-on-the-Intel-Core-i7-7700K-by-overpowering-it-in-Geekbench-s-single-core-and-multi-core-tests.462311.0.html", "urlToImage": null, "publishedAt": "2020-04-23T12:24:22Z", "content": "We just reported about the AMD Ryzen 3 3100 CPU and its ability to keep up with the Kaby Lake Intel Core i7-7700K in a Geekbench 5 test, and now we have the AMD Ryzen 3 3300X taking on the i7-7700K in the older Geekbench 4 benchmark. The new Matisse chip tott… [+1258 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "ASUS rolls out an AOSP-based Android 10 beta for the ZenFone Max M2 - XDA Developers", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiWGh0dHBzOi8vd3d3LnhkYS1kZXZlbG9wZXJzLmNvbS9hc3VzLXJvbGxzLW91dC1hb3NwLWJhc2VkLWFuZHJvaWQtMTAtYmV0YS16ZW5mb25lLW1heC1tMi_SAVxodHRwczovL3d3dy54ZGEtZGV2ZWxvcGVycy5jb20vYXN1cy1yb2xscy1vdXQtYW9zcC1iYXNlZC1hbmRyb2lkLTEwLWJldGEtemVuZm9uZS1tYXgtbTIvYW1wLw?oc=5", "urlToImage": null, "publishedAt": "2020-04-23T11:38:31Z", "content": null}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Aparna Banerjea", "title": "WhatsApp trick: How to send message to an unsaved number - Livemint", "description": "There is a way to send a WhatsApp text to someone without actually saving their number on the phone, and it does not require a third-party app.WhatsApp has been in the news for its upcoming new features such as increasing the number of participants from four …", "url": "https://www.livemint.com/technology/apps/whatsapp-trick-how-to-send-message-to-an-unsaved-number-11587312477237.html", "urlToImage": null, "publishedAt": "2020-04-23T11:35:40Z", "content": "WhatsApp has more than two billion users globally and is practically, the most popular messaging application for everyone. However, the users do face a huge problem when they are trying to text an unknown person without necessarily having to save the number. … [+3967 chars]"}, {"source": {"id": null, "name": "Gsmarena.com"}, "author": "Ivan", "title": "Motorola shares stunning Edge and Edge+ camera samples - GSMArena.com news - GSMArena.com", "description": "The samples show multiple resolutions, cameras and camera modes.", "url": "https://www.gsmarena.com/motorola_shares_stunning_edge_and_edge_camera_samples-news-42828.php", "urlToImage": null, "publishedAt": "2020-04-23T10:57:02Z", "content": null}, {"source": {"id": null, "name": "Givemesport.com"}, "author": "Jake Doyle", "title": "Call of Duty: Mobile hosting tournament with $1 million prize money - GIVEMESPORT", "description": "Call of Duty: Mobile hosting tournament with $1 million prize money", "url": "https://www.givemesport.com/1564431-call-of-duty-mobile-hosting-tournament-with-1-million-prize-money", "urlToImage": null, "publishedAt": "2020-04-23T10:36:22Z", "content": "Activision have announced that they will be hosting a Call of Duty: Mobile tournament.\r\nThe prize money? A cool $1 million is on the line.\r\nIt will be named ‘The Call of Duty: Mobile World Championship 2020’ and is set to commence on April 30 as an online esp… [+1910 chars]"}, {"source": {"id": null, "name": "Thejakartapost.com"}, "author": "The Jakarta Post", "title": "Facebook rolls out Messenger Kids to 70 new countries - The Jakarta Post - Jakarta Post", "description": "Facebook on Wednesday rolled out its Messenger Kids application to 70 new countries, saying it can help children deal with the challenges of distance learning and isolation during the virus lockdowns.", "url": "https://www.thejakartapost.com/life/2020/04/23/facebook-rolls-out-messenger-kids-to-70-new-countries.html", "urlToImage": null, "publishedAt": "2020-04-23T10:04:00Z", "content": "Facebook on Wednesday rolled out its Messenger Kids application to 70 new countries, saying it can help children deal with the challenges of distance learning and isolation during the virus lockdowns.\r\nThe app, which is aimed at children under 13, will also b… [+2197 chars]"}, {"source": {"id": null, "name": "Inc42.com"}, "author": "Aman Rawat", "title": "Personal Data Of 267 Mn Facebook Users Up For Sale Online for INR 42K - Inc42 Media", "description": "In another incident of a breach, a database having personal data of over 267 Mn Facebook users was found to", "url": "https://inc42.com/buzz/personal-data-of-267-mn-facebook-users-up-for-sale-online-for-inr-42k/", "urlToImage": null, "publishedAt": "2020-04-23T10:02:09Z", "content": "In another incident of a breach, a database having personal data of over 267 Mn Facebook users was found to be sold online for around INR 42K. Threat intelligence platform Cyble, which recently exposed the sale of over 500K Zoom accounts, was the first to rep… [+2799 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Aaron Brown", "title": "WhatsApp is planning an awesome update that couldn't have come at a better time - Express", "description": "WHATSAPP has a new feature planned for its hugely-successful messaging service - and it's very topical. Here's everything you need to know about the upcoming update.", "url": "https://www.express.co.uk/life-style/science-technology/1271058/WhatsApp-Update-iPhone-iOS-Video-Call-Houseparty-Number-Of-People", "urlToImage": null, "publishedAt": "2020-04-23T08:45:00Z", "content": null}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "IANS", "title": "Microsoft developers are producing 30,000 security bugs: Here's why - India TV News", "description": "Microsoft developers are generating thousands of security bugs a month. Read on to know what it is about", "url": "https://www.indiatvnews.com/technology/news-microsoft-developers-find-30-000-security-issues-know-why-610482", "urlToImage": null, "publishedAt": "2020-04-23T08:17:56Z", "content": "Microsoft has collected over 13 million bugs since 2001\r\nAt Microsoft, 47,000 developers are generating nearly 30,000 bugs a month and these vulnerabilities get stored across over 100 AzureDevOps and GitHub repositories to quickly spot critical bugs and stay … [+1837 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "India TV Tech Desk", "title": "Fortnite for Android now available on Google Play Store: Here's how you can download - India TV News", "description": "After almost 18 months, Epic Games has finally released Fortnite on the Google Play Store for all Android users. Here's what you need to know.", "url": "https://www.indiatvnews.com/technology/news-fortnite-for-android-finally-comes-to-google-play-store-610130", "urlToImage": null, "publishedAt": "2020-04-23T07:15:00Z", "content": "Fortnite requires an additional download of 7.4GB\r\nFortnite is one of the most popular battle royale games. The game is available on multiple platforms including Android, iOS PS4, PC, Xbox and Nintendo Switch. For smartphones, the game was first introduced in… [+1432 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "IANS", "title": "HP introduces free remote helpdesk for PC users in India: Here's how it works - India TV News", "description": "HP Inc. on Thursday introduced limited-period free helpdesk support to PC users of all brands to address their operational issues in India.", "url": "https://www.indiatvnews.com/technology/news-hp-introduces-free-remote-helpdesk-for-pc-users-in-india-610450", "urlToImage": null, "publishedAt": "2020-04-23T07:11:15Z", "content": "HP users can now get free remote helpdesk support.\r\nPC and printing major HP Inc. on Thursday introduced limited-period free helpdesk support to PC users of all brands to address their operational issues in India. In the absence of regular support and service… [+1235 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Stephen Lambrechts", "title": "Samsung's Galaxy Z Flip just got its own special YouTube 'flex' mode - TechRadar", "description": "A not-so-weird flex from Samsung and Google", "url": "https://www.techradar.com/news/samsungs-galaxy-z-flip-just-got-its-own-special-youtube-flex-mode", "urlToImage": null, "publishedAt": "2020-04-23T05:43:00Z", "content": "While the folding smartphone concept is seen as a gimmick by many, it must be said that Samsung's Galaxy Z Flip has done a decent job of ensuring its bendy design is practical as well as functional the ability to video chat hands-free by placing the half-fold… [+1006 chars]"}, {"source": {"id": null, "name": "Wccftech.com"}, "author": "Hassan Mujtaba", "title": "AMD Ryzen 4000 Renoir Desktop 35W & 65W Desktop CPUs Spotted In The Wild – Quad Core Variants With 7nm Enhanced Vega GPU - Wccftech", "description": "AMD's Ryzen 4000 'Renoir' Desktop CPUs have been spotted once again in online listings. The latest details come from within 3DMark and UserBenchmark listings which were spotted by Momomo_US and Rogame. AMD Ryzen 4000 'Renoir' 7nm Desktop CPUs With Zen 2 Cores…", "url": "https://wccftech.com/amd-ryzen-4000-renoir-65w-35w-desktop-am4-cpus-spotted-zen-2-7nm-vega/", "urlToImage": null, "publishedAt": "2020-04-23T03:46:45Z", "content": "AMD's Ryzen 4000 'Renoir' Desktop CPUs have been spotted once again in online listings. The latest details come from within 3DMark and UserBenchmark listings which were spotted by Momomo_US and Rogame.\r\nAMD's Ryzen 4000 'Renoir' Desktop CPUs are highly antici… [+3325 chars]"}]}