{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Gsmarena.com"}, "author": "Ricky", "title": "OnePlus downsizes its workforce in UK, France, and Germany by up to 80%, report says - GSMArena.com news - GSMArena.com", "description": "The company confirms the layoffs are unrelated to COVID-19.", "url": "https://www.gsmarena.com/oneplus_downsizes_its_workforce_in_uk_france_and_germany_by_up_to_80_report_says-news-42867.php", "urlToImage": null, "publishedAt": "2020-04-25T06:00:01Z", "content": "OnePlus is now in a post-launch phase as the company is in the process of fulfilling pre-orders of its latest duo of smartphones: the OnePlus 8 and 8 Pro. As reported by Engadget which cites a number of sources \u0093close to the matter\u0094, OnePlus has downsized its… [+2494 chars]"}, {"source": {"id": null, "name": "Gsmarena.com"}, "author": "Vlad", "title": "Facebook makes it official: WhatsApp audio and video calls will soon have up to 8 participants - GSMArena.com news - GSMArena.com", "description": "The functionality had been spotted in beta versions of WhatsApp before.", "url": "https://www.gsmarena.com/facebook_makes_it_official_whatsapp_audio_and_video_calls_will_soon_go_up_to_8_participants-news-42866.php", "urlToImage": null, "publishedAt": "2020-04-25T04:00:01Z", "content": "The rumors were correct, Facebook is indeed upping the maximum limit of people allowed to participate in a group audio or video call on WhatsApp.\r\nThe current limit is 4, but this will \"soon\" double to 8 for everyone, the company revealed today. The new funct… [+760 chars]"}, {"source": {"id": null, "name": "Gadgetsnow.com"}, "author": "Gadgets Now Bureau", "title": "Text bomb: This message may crash your iPhone, iPad, Apple Watch, Mac - Gadgets Now", "description": "If you use an Apple device, here’s an important ‘warning’. A new text bomb is crashing iPhones, Apple Watch, iPad or Mac. This string of characters includes Italian flag emoji and some Sindhi characters. According to a report by 9to5Mac, users have reported r…", "url": "https://www.gadgetsnow.com/tech-news/text-bomb-this-message-may-crash-your-iphone-ipad-apple-watch-mac/articleshow/75368309.cms", "urlToImage": null, "publishedAt": "2020-04-25T03:51:46Z", "content": null}, {"source": {"id": null, "name": "Gadgetsnow.com"}, "author": "Gadgets Now Bureau", "title": "How Apple and Google will 'use' your phone to fight coronavirus: 15 things to know - Gadgets Now", "description": "These apps will be approved only if they are “administered in conjunction with public health authorities, meet our privacy requirements, and protect user data,” said Apple and Google.", "url": "https://www.gadgetsnow.com/slideshows/how-apple-and-google-will-use-your-phone-to-fight-coronavirus-15-things-to-know/Apps-will-undergo-rigorous-checks-before-they-are-approved/photolist/75368002.cms", "urlToImage": null, "publishedAt": "2020-04-25T03:23:00Z", "content": "Almost two weeks back two of the world’s biggest tech companies — Apple\r\n and Google\r\n — announced that they would work together to help in the fight against coronavirus\r\n pandemic. The two companies announced their plans of helping governments, health agenci… [+310 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Desire Athow", "title": "This AMD Ryzen notebook deal is probably the best we've ever seen - TechRadar", "description": "Lenovo and AMD provide a glimpse into the future", "url": "https://www.techradar.com/news/this-amd-ryzen-laptop-is-the-probably-the-best-notebook-deal-ever", "urlToImage": null, "publishedAt": "2020-04-25T03:00:00Z", "content": "We reviewers are used to obsessing over incremental technology changes, but every now and then a supernova appears on our radar - something that can single handedly change the status quo.\r\nThe AMD Ryzen 4000 family is one such supernova and promises to bring … [+1829 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Unboxing The New iPhone SE and First Impressions | Mashable - Mashable", "description": "Mashable Tech Reporter Brenda Stolyar got her hands on Apple's latest budget phone: the iPhone SE. Here are her first impressions. Mashable is your source fo...", "url": "https://www.youtube.com/watch?v=vkWGeH7fSlU", "urlToImage": null, "publishedAt": "2020-04-25T00:43:39Z", "content": "Mashable Tech Reporter Brenda Stolyar got her hands on Apple's latest budget phone: the iPhone SE. Here are her first impressions.\r\nMashable is your source for the latest in tech, culture, and entertainment.  Subscribe to Mashable: https://bit.ly/2DR64oMWatch… [+226 chars]"}, {"source": {"id": null, "name": "Androidpolice.com"}, "author": "https://www.facebook.com/corbin.davenport.50", "title": "OnePlus pulls buggy OxygenOS Open Beta 12 for OP7, 7 Pro shortly after release (Update: Statement) - Android Police", "description": "OxygenOS' Open Beta releases are usually very stable, but since they are beta-quality, sometimes there are critical bugs. OnePlus started to roll out Open", "url": "https://www.androidpolice.com/2020/04/24/oneplus-pulls-buggy-oxygenos-open-beta-12-for-op7-7-pro-shortly-after-release/", "urlToImage": null, "publishedAt": "2020-04-25T00:27:33Z", "content": "This story was originally published 2020/04/20 10:42am PDTon Apr 20, 2020 and last updated 2020/04/24 5:11pm PDTApr 24, 2020. \r\nOxygenOS' Open Beta releases are usually very stable, but since they are beta-quality, sometimes there are critical bugs. OnePlus s… [+3336 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Android 11 Developer Preview 3: All the changes we’ve found so far! - XDA Developers", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiRmh0dHBzOi8vd3d3LnhkYS1kZXZlbG9wZXJzLmNvbS9hbmRyb2lkLTExLWRldmVsb3Blci1wcmV2aWV3LTMtY2hhbmdlcy_SAUpodHRwczovL3d3dy54ZGEtZGV2ZWxvcGVycy5jb20vYW5kcm9pZC0xMS1kZXZlbG9wZXItcHJldmlldy0zLWNoYW5nZXMvYW1wLw?oc=5", "urlToImage": null, "publishedAt": "2020-04-24T22:52:00Z", "content": null}, {"source": {"id": null, "name": "Gsmarena.com"}, "author": "Vlad", "title": "LG Velvet specs leak - GSMArena.com news - GSMArena.com", "description": "The phone will get official on May 7.", "url": "https://www.gsmarena.com/lg_velvet_specs_leak-news-42863.php", "urlToImage": null, "publishedAt": "2020-04-24T22:00:02Z", "content": "LG's most exciting smartphone in quite a while (at least design-wise) is getting official on May 7. The Velvet should be the first in a line of upper mid-range devices that are meant to replace the now-defunct G series.\r\nLG has been teasing bits and pieces ab… [+1355 chars]"}, {"source": {"id": null, "name": "Windowslatest.com"}, "author": null, "title": "Microsoft is investigating Windows 10 KB4549951 issues - WindowsLatest", "description": "Windows 10 KB4549951, which was released on April 14 with security fixes, is reportedly plagued with serious issues for some users. The update is only available for consumers with Windows 10 version 1903 and 1909, and the patch contains security fixes. Initia…", "url": "https://www.windowslatest.com/2020/04/25/microsoft-comments-on-windows-10-kb4549951-issues/", "urlToImage": null, "publishedAt": "2020-04-24T20:38:00Z", "content": "Windows 10 KB4549951, which was released on April 14 with security fixes, is reportedly plagued with serious issues for some users. The update is only available for consumers with Windows 10 version 1903 and 1909, and the patch contains security fixes.\r\nIniti… [+2196 chars]"}, {"source": {"id": null, "name": "Gsmarena.com"}, "author": "Prasad", "title": "Xiaomi Redmi Note 9 Series to launch globally on April 30 - GSMArena.com news - GSMArena.com", "description": "Should feature the existing Redmi Note 9 models and perhaps a new addition.", "url": "https://www.gsmarena.com/xiaomi_redmi_note_9_series_to_launch_globally_on_april_30-news-42862.php", "urlToImage": null, "publishedAt": "2020-04-24T20:00:01Z", "content": "Xiaomi has announced on its global social media channels that it will be launching the Redmi Note 9 Series. The launch will be through an online event, which will take place on April 30, 20:00 GMT.\r\nThe legend of #RedmiNoteSeries continues! \r\nGet ready to mee… [+992 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "WhatsApp might start showing you ads soon - Hindustan Times", "description": "Users may see these ads on the platform after Facebook completes its multi-year effort to link all its social media platforms.", "url": "https://www.hindustantimes.com/tech/here-s-when-whatsapp-may-start-showing-you-ads/story-gv8bTx1RnxRhcaklVjU6MJ.html", "urlToImage": null, "publishedAt": "2020-04-24T19:33:56Z", "content": "Facebook has not abandoned its plans to serve ads on its instant messaging service WhatsApp, the media reported. Users may see these ads on the platform after Facebook completes its multi-year effort to link all its social media platforms, according to a repo… [+1263 chars]"}, {"source": {"id": null, "name": "Gsmarena.com"}, "author": "Michail", "title": "Our Xiaomi Mi 10 Pro video review is out - GSMArena.com news - GSMArena.com", "description": "Does Xiaomi's most expensive flagship deliver? Check out what Will has to say in our Mi 10 Pro video review.", "url": "https://www.gsmarena.com/our_xiaomi_mi_10_pro_video_review_is_out-news-42860.php", "urlToImage": null, "publishedAt": "2020-04-24T18:14:33Z", "content": "Our Xiaomi Mi 10 Pro written review has been out for a few days and now we present you with the video breakdown. This is without a doubt the best flagship Xiaomi has released so far, matching any top of the line offering from other premium smartphone makers. … [+545 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Carly Page", "title": "The Dell XPS 15 2020 may have been redesigned to take on the MacBook Pro - TechRadar India", "description": "Incoming model will boast smaller bezels and upward-firing speakers", "url": "https://www.techradar.com/news/the-dell-xps-15-2020-may-have-been-redesigned-to-take-on-the-macbook-pro", "urlToImage": null, "publishedAt": "2020-04-24T17:31:00Z", "content": "Dell looks poised to release an all-new version of its XPS 15 laptop that will take a number of design clues from the recently-revamped Dell XPS 13\r\n.\r\nThats according to leaked images posted on the Korea Energy Agency Efficiency Standardization Certification… [+2119 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "2020 Battery Drain Test Comparison: OnePlus 8 vs Galaxy S20 Ultra vs iPhone 11 Pro Max - PhoneArena", "description": "In this battery drain test, we compare the battery life of the new OnePlus 8 against the Samsung Galaxy S20 Ultra, Galaxy S20 Plus, Galaxy S20, and then the ...", "url": "https://www.youtube.com/watch?v=QP9LxoBe6pE", "urlToImage": null, "publishedAt": "2020-04-24T17:10:14Z", "content": "In this battery drain test, we compare the battery life of the new OnePlus 8 against the Samsung Galaxy S20 Ultra, Galaxy S20 Plus, Galaxy S20, and then the iPhone 11 Pro Max, iPhone 11 Pro and the regular iPhone 11.\r\nWhich one will win? Watch it to find out.… [+849 chars]"}, {"source": {"id": null, "name": "Gizchina.com"}, "author": null, "title": "OnePlus Z surfaces in leaked live-photos - Gizchina.com", "description": "The OnePlus Z mid-range is yet to be released by the company. Today, alleged live shots reveal the handset in all its glory.", "url": "https://www.gizchina.com/2020/04/24/oneplus-z-surfaces-in-leaked-live-photos/", "urlToImage": null, "publishedAt": "2020-04-24T16:22:11Z", "content": "This year, rumors were pointing to the arrival of three OnePlus smartphones. However, just two of them were released in the last week – OnePlus 8 and OnePlus 8 Pro. Apparently, the constant problems raised by the COVID-19 pandemic had delayed the construction… [+1718 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The Apple Watch: 5 years later - Engadget", "description": "When Apple released its first wearable five years ago, many publications, including ours, were pretty skeptical. And with good reason, the first-gen watch wa...", "url": "https://www.youtube.com/watch?v=prYst35-x_k", "urlToImage": null, "publishedAt": "2020-04-24T16:00:29Z", "content": null}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Christian de Looper", "title": "7 Of The Best Amazon Alexa Speakers - Forbes", "description": "Looking for a great speaker with arguably the smartest digital assistant, Alexa? Here are 7 of the best Amazon Alexa speakers out there.", "url": "https://www.forbes.com/sites/forbes-personal-shopper/2020/04/24/7-of-the-best-amazon-alexa-speakers/", "urlToImage": null, "publishedAt": "2020-04-24T16:00:00Z", "content": "Alexa is arguably the smartest digital assistant, and while Google Assistant also has a lot going for it, Alexa is the go-to for many users who dont have Android phones. There are a ton of Alexa speakers on the market, and while they all have the smart featur… [+4164 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "IANS", "title": "Huawei smartphones receive VoWiFi calling support in India: Here's how it works - India TV News", "description": "Huawei has introduced Voice over WiFi (VoWiFi) calling support for its smartphones users in India so that network issues at their home or workplace do not disrupt their communications.", "url": "https://www.indiatvnews.com/technology/news-huawei-smartphones-receive-support-for-vowifi-calling-in-india-610981", "urlToImage": null, "publishedAt": "2020-04-24T15:40:34Z", "content": "Huawei recently launched the P40 series globally.\r\nWorld's second-largest smartphone company Huawei has introduced Voice over WiFi (VoWiFi) calling support for its smartphones users in India so that network issues at their home or workplace do not disrupt the… [+2217 chars]"}, {"source": {"id": null, "name": "Gizchina.com"}, "author": null, "title": "Xiaomi Mi 10 Youth surfaces in TENAA database - Gizchina.com", "description": "The upcoming Xiaomi Mi 10 Youth has been certified by TENAA. The handset boasts Snapdragon 765G and will be revealed on April 27.", "url": "https://www.gizchina.com/2020/04/24/xiaomi-mi-10-youth-clears-out-tenaa/", "urlToImage": null, "publishedAt": "2020-04-24T15:23:34Z", "content": "The last days of April will be quite hectic for Xiaomi fans. The company will reveal on April 27, next Monday, the highly-anticipated MIUI 12 OS update and a new smartphone dubbed Mi 10 Youth. The handset basically is a rebranded Mi 10 Lite with Snapdragon 76… [+1028 chars]"}, {"source": {"id": null, "name": "Otakukart.com"}, "author": "Isheeta Kumar", "title": "PUBG Mobile Update 0.18.0 Release Date and Time - OtakuKart", "description": "PUBG mobile, a game that has caused almost everyone that plays it to be hooked onto it almost immediately and keeps them constantly engaged with their new updat", "url": "https://otakukart.com/575524/pubg-mobile-update-0-18-0-release-date-and-time/", "urlToImage": null, "publishedAt": "2020-04-24T14:18:09Z", "content": "PUBG mobile, a game that has caused almost everyone that plays it to be hooked onto it almost immediately and keeps them constantly engaged with their new updates, has recently announced the release of their latest update, 0.18.0. In this article, we will dis… [+3566 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "IANS", "title": "Apple Music now reaches Samsung smart TVs: Know details - India TV News", "description": "Samsung has included Apple Music music streaming app on its range of smart TVs. Read on to know more", "url": "https://www.indiatvnews.com/technology/news-apple-music-on-samsung-smart-tvs-know-details-610952", "urlToImage": null, "publishedAt": "2020-04-24T14:16:30Z", "content": "Apple Music can be bought for free for first 3 months\r\nSouth Korean tech giant Samsung has become the first TV manufacturer to integrate Apple Music on its Smart TV platform. Apple Music will be available on models from 2018 through 2020 and subscribers can s… [+1146 chars]"}, {"source": {"id": null, "name": "Searchengineland.com"}, "author": "https://www.facebook.com/barryschwartz", "title": "New free version of Google Shopping rolling out now - Search Engine Land", "description": "It is now rolling out and should be fully live in the US by early next week.", "url": "https://searchengineland.com/new-free-version-of-google-shopping-rolling-out-now-333589", "urlToImage": null, "publishedAt": "2020-04-24T13:52:00Z", "content": "Google’s new free version of Google Shopping is now rolling out. A Google spokesperson has confirmed with Search Engine Land that this has begun to roll out. This does not mean it is fully rolled out and all U.S. searchers will see it immediately, but by earl… [+741 chars]"}, {"source": {"id": null, "name": "Gsmarena.com"}, "author": "Michail", "title": "Here WeGo Maps comes to Huawei App Gallery - GSMArena.com news - GSMArena.com", "description": "Full turn-by-turn navigation available in over 100 countries.", "url": "https://www.gsmarena.com/here_wego_maps_comes_to_huawei_app_gallery-news-42854.php", "urlToImage": null, "publishedAt": "2020-04-24T13:51:02Z", "content": "Since losing its access to Google Mobile Services (GMS) nearly a year ago, Huawei has been looking for ways to expand its app portfolio through the App Gallery store. Now, it got a serious addition with Here WeGo Maps (formerly Here Maps) which is now availab… [+807 chars]"}, {"source": {"id": "the-next-web", "name": "The Next Web"}, "author": "Callum Booth", "title": "The fancy-pants LG Velvet arrives on May 7 — here’s what we know - The Next Web", "description": "If I asked you to list smartphone brands, LG wouldn’t be near the top. But the company is trying to change all that, and its latest attempt? Its new smartphone, the LG Velvet. Now, the latest update is the company will unveil this handset on May 7, something …", "url": "https://thenextweb.com/plugged/2020/04/24/lg-velvet-phone-may-7-launch-specs/", "urlToImage": null, "publishedAt": "2020-04-24T13:45:06Z", "content": "If I asked you to list smartphone brands, LG wouldnt be near the top. But the company is trying to change all that, and its latest attempt? Its new smartphone, the LG Velvet.\r\nNow, the latest update is the company will unveil this handset on May 7, something … [+2558 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Christopher Groux", "title": "'Call of Duty: Modern Warfare' Free Multiplayer This Weekend, When It Starts and How to Download - Newsweek", "description": "Just like last time, players can download all they need for the 'Modern Warfare' weekend by installing the 'Call of Duty: Warzone' standalone application for free.", "url": "https://www.newsweek.com/call-modern-warfare-free-multiplayer-weekend-april-24-time-download-1500016", "urlToImage": null, "publishedAt": "2020-04-24T13:42:18Z", "content": "Call of Duty: Modern Warfare is hosting another free multiplayer weekend that starts this Friday and lasts through Monday. In this brief rundown of the key details, we outline the times, maps and download instructions you need to know.\r\nCall of Duty: Modern W… [+2527 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Christopher Groux", "title": "'Borderlands 3' Claw & Order Guide - Echo Log Locations & Walkthrough - Newsweek", "description": "\"Borderlands 3\" has a new quest called Claw and Order. In this guide, we'll show the locations for every Echo Log you need to find.", "url": "https://www.newsweek.com/borderlands-3-claw-order-guide-echo-log-locations-walkthrough-1500009", "urlToImage": null, "publishedAt": "2020-04-24T13:20:10Z", "content": "Borderlands 3 Revenge of the Cartels event is officially live, and that means there are new quests for players to enjoy. One such mission, called Claw and Order, seems to be giving players trouble. In this guide we'll reveal the locations of all three Echo Lo… [+1711 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jon Porter", "title": "Telegram adding secure group video calls this year - The Verge", "description": "Messaging app Telegram is developing a group video calling service that’s due to be launched later this year. It announced the plans alongside the news that the service now boasts 400 million monthly active users.", "url": "https://www.theverge.com/2020/4/24/21234254/telegram-messaging-app-group-video-calling-security-usability", "urlToImage": null, "publishedAt": "2020-04-24T13:10:11Z", "content": "The messaging service now has 400 million monthly active users\r\nIllustration by Alex Castro / The Verge\r\nMessaging app Telegram is developing a group video calling service thats due to be launched later this year, the company announced today. It says that cur… [+1733 chars]"}, {"source": {"id": null, "name": "Techspot.com"}, "author": "Rob Thubron", "title": "Malwarebytes steps into the VPN space with WireGuard-based service - TechSpot", "description": "Available now for Windows 7 and higher—Mac, Android, iOS, and Chrome OS are coming soon—Malwarebytes Privacy costs $59.99 per year. You can also get it bundled with a 1-year license of Malwarebytes Premium for $89.99, saving buyers $49.99. Both options&hellip;", "url": "https://www.techspot.com/news/84974-malwarebytes-steps-vpn-space-wireguard-based-service.html", "urlToImage": null, "publishedAt": "2020-04-24T12:37:00Z", "content": "In brief: Malwarebytes is joining the list of antivirus companies that also offer a VPN. Called Malwarebytes Privacy, the service uses a newer and faster protocol: WireGuard. \r\nAvailable now for Windows 7 and higherMac, Android, iOS, and Chrome OS are coming … [+1527 chars]"}, {"source": {"id": null, "name": "9to5google.com"}, "author": null, "title": "OnePlus 8 Pro display issues surface on some devices but a fix is inbound - 9to5Google", "description": "Even with one of the best displays o the market, some OnePlus 8 models are still managing to have some pronounced issues.", "url": "https://9to5google.com/2020/04/24/oneplus-8-pro-display-issues-surface-on-some-devices-but-a-fix-is-inbound/", "urlToImage": null, "publishedAt": "2020-04-24T12:19:26Z", "content": "Even with one of the best displays on the market, some OnePlus 8 models are still managing to have some pronounced issues.\r\nMuch like with the Galaxy S20 Ultra recently, the new 120Hz displays are having problems with crushed black, low brightness, and green … [+1503 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "Is shrubs breeding possible in Animal Crossing New Horizons? Here’s every bush type! - India Gone Viral", "description": "Lots of Animal Crossing New Horizons players want to know if shrubs breeding is possible following the game's latest update.Animal Crossing New Horizons has received update 1.2 and this patch has atte", "url": "https://indiagoneviral.com/technology/2020/04/24/is-shrubs-breeding-possible-in-animal-crossing-new-horizons-heres-every-bush-type/40751/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-24T12:14:38Z", "content": "Lots of Animal Crossing New Horizons players want to know if shrubs breeding is possible following the game’s latest update.\r\nAnimal Crossing New Horizons has received update 1.2 and this patch has attempted to fix the broken bell economy. However, in more im… [+2485 chars]"}, {"source": {"id": null, "name": "Gizchina.com"}, "author": null, "title": "Google Assistant gets smarter with more precise voice recognition - Gizchina.com", "description": "Google Assistant gets smarter with more precise voice recognition. The recognition has been significantly improved with this new feature.", "url": "https://www.gizchina.com/2020/04/24/google-assistant-gets-smarter-with-more-precise-voice-recognition/", "urlToImage": null, "publishedAt": "2020-04-24T12:11:15Z", "content": "Connected speakers and other devices that integrate Googles voice assistant can teach Google to recognize your voice using the Voice Match feature. The recognition will be significantly improved thanks to greater precision via artificial intelligence.\r\nAs we … [+1698 chars]"}, {"source": {"id": null, "name": "Gsmarena.com"}, "author": "Yordan", "title": "Kuo: Apple to launch 3rd gen AirPods in Q1 2021 - GSMArena.com news - GSMArena.com", "description": "New AirPods Pro should be expected a year later - Q1 2022.", "url": "https://www.gsmarena.com/kuo_apple_to_launch_3rd_gen_airpods_in_q1_2021-news-42852.php", "urlToImage": null, "publishedAt": "2020-04-24T12:02:01Z", "content": "Apple is planning to start mass production of new AirPods at the end of 2020. This was revealed by the analyst Ming-Chi Kuo where he revealed the earphones will arrive in Q1 2021.\r\nThe note to investors, quoted by Apple Insider, also revealed the second-gen A… [+686 chars]"}, {"source": {"id": null, "name": "Gizmochina.com"}, "author": "https://www.facebook.com/simransingh93", "title": "Get Google Phone App for non-Pixel smartphones! - gizmochina", "description": "Google has crafted some of the apps purely for its Pixel devices. These apps not only improves the functionality but even adds to its value. Google’s refined software and impressive applications always remain favorite among the third-party development communi…", "url": "https://www.gizmochina.com/2020/04/24/get-google-phone-app-for-non-pixel-phones-from-the-play-store/", "urlToImage": null, "publishedAt": "2020-04-24T11:59:00Z", "content": "Google has crafted some of the apps purely for its Pixel devices. These apps not only improves the functionality but even adds to its value. Google’s refined software and impressive applications always remain favorite among the third-party development communi… [+2396 chars]"}, {"source": {"id": null, "name": "Gizchina.com"}, "author": null, "title": "All OnePlus 8 Models Are Out Of Stock: Popularity Exceeded Expectations - Gizchina.com", "description": "The OnePlus 8 and its Pro variant are considered to be new-gen flagships smartphones. But their current popularity have exceeded all expectations.", "url": "https://www.gizchina.com/2020/04/24/all-oneplus-8-models-are-out-stock-popularity-exceeded-expectations/", "urlToImage": null, "publishedAt": "2020-04-24T11:23:53Z", "content": "Just recently, the new-gen OnePlus 8 series flagship smartphones have been announced at a price of 3,999 yuan ($565). After the first sale, the entire network’s sales in one minute exceeded 100 million yuan ($14.12 million). In recent days, OnePlus Technology… [+1388 chars]"}, {"source": {"id": null, "name": "Gsmarena.com"}, "author": "Michail", "title": "Realme X3 SuperZoom clears Bluetooth SIG certification - GSMArena.com news - GSMArena.com", "description": "This is the fourth certification for the upcoming Realme phone.", "url": "https://www.gsmarena.com/realme_x3_superzoom_clears_bluetooth_sig_certification-news-42851.php", "urlToImage": null, "publishedAt": "2020-04-24T11:13:02Z", "content": "Realme\u0092s X3 has been in our rumor mill since the beginning of the month. We\u0092re expecting a vanilla X3 as well as an X3 SuperZoom which was spotted in several listings earlier this month. Now we have yet another sighting of the X3 SuperZoom which was spotted i… [+670 chars]"}, {"source": {"id": null, "name": "Gizchina.com"}, "author": null, "title": "Xiaomi Redmi K30i Render Images Leaked, Reveals Two Fewer Cameras Than K30 - Gizchina.com", "description": "Xiaomi is expected to soon announce the Redmi K30i smartphone which is supposed to be an affordable mid-range 5G smartphone from the brand.", "url": "https://www.gizchina.com/2020/04/24/xiaomi-redmi-k30i-render-images-leaked-reveals-two-fewer-cameras-than-k30/", "urlToImage": null, "publishedAt": "2020-04-24T10:59:44Z", "content": "Xiaomi‘s sub-brand Redmi is currently working on its next mid-range flagship smartphone dubbed Redmi K30i. A couple of days ago, we reported that the phone will come with 48MP primary sensor. Well, the device has now been part of yet another leak revealing so… [+1515 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Snapdragon 865-powered iQOO 3 price slashed by up to ₹4,000 in India - XDA Developers", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiS2h0dHBzOi8vd3d3LnhkYS1kZXZlbG9wZXJzLmNvbS9pcW9vLTMtc25hcGRyYWdvbi04NjUtNGctNWctcHJpY2UtY3V0LWluZGlhL9IBT2h0dHBzOi8vd3d3LnhkYS1kZXZlbG9wZXJzLmNvbS9pcW9vLTMtc25hcGRyYWdvbi04NjUtNGctNWctcHJpY2UtY3V0LWluZGlhL2FtcC8?oc=5", "urlToImage": null, "publishedAt": "2020-04-24T10:20:39Z", "content": null}, {"source": {"id": null, "name": "Nokiapoweruser.com"}, "author": null, "title": "Official Nokia Security+OS update tracker updated again (April 20) with April Security update details for all devices - Nokiapoweruser", "description": "The official Security+OS update tracker page for Nokia smartphones has been again updated on April 20, 2020, by Nokia Mobile (HMD) with details about the availability or unavailability of the April…", "url": "https://nokiapoweruser.com/official-nokia-securityos-update-tracker-updated-again-april-20-with-april-security-update-details-for-all-devices/", "urlToImage": null, "publishedAt": "2020-04-24T09:43:33Z", "content": "The official Security+OS update tracker page for Nokia smartphones has been again updated on April 20, 2020, by Nokia Mobile (HMD) with details about the availability or unavailability of the April Security update 2020 for all Nokia smartphones. As you may be… [+1198 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Kunal Gaurav", "title": "Google Meet rolls out major features to take on Zoom video conferencing app - Republic World - Republic World", "description": "While video conferencing platform Zoom’s popularity skyrocketed amid COVID-19 lockdowns, Google Meet has started rolling out an updated version to take it on.", "url": "https://www.republicworld.com/technology-news/apps/google-meet-rolls-out-major-feature-to-take-on-zoom-video-conferencing.html", "urlToImage": null, "publishedAt": "2020-04-24T09:41:09Z", "content": "While video conferencing platform Zoom’s popularity skyrocketed amid COVID-19 lockdowns, Google Meet has started rolling out an updated version to compete with it. Though Zoom became extremely popular for videoconferencing during social distancing measures, i… [+2205 chars]"}, {"source": {"id": null, "name": "Gsmarena.com"}, "author": "Yordan", "title": "Xiaomi Mi A3 once again is receiving Android 10 update - GSMArena.com news - GSMArena.com", "description": "No, you\u0092re not having a deja vu - this is the fourth time.", "url": "https://www.gsmarena.com/xiaomi_mi_a3_once_again_receiving_android_10_update-news-42849.php", "urlToImage": null, "publishedAt": "2020-04-24T09:12:02Z", "content": "Nothing in the world is certain except death, taxes and Xiaomi Mi A series phones having troubles with major Android updates. According to users on Reddit, some Xiaomi Mi A3 units are receiving an Android 10 new update, which is different from the previous th… [+474 chars]"}, {"source": {"id": null, "name": "Gsmarena.com"}, "author": "Michail", "title": "Meizu 17 series confirmed to use Snapdragon 865 and UFS 3.1 storage - GSMArena.com news - GSMArena.com", "description": "We also get a look at some exclusive cases for Meizu's upcoming flagships.", "url": "https://www.gsmarena.com/meizu_17_series_confirmed_to_use_snapdragon_865_and_ufs_31_storage-news-42848.php", "urlToImage": null, "publishedAt": "2020-04-24T08:24:01Z", "content": "The launch the Meizu 17 series if fast approaching - it's coming in two weeks on May 8. We are expecting a vanilla Meizu 17 alongside a Pro model and the company just confirmed both phones will be powered by the Snapdragon 865 chipset and use UFS 3.1 storage.… [+509 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Barry Collins", "title": "Why You Shouldn’t Charge Your MacBook Pro From The Left-Hand Side - Forbes", "description": "A new piece of research claims that plugging in a MacBook Pro charger on the left-hand side of the device can cause the laptop to run hot, potentially affecting its performance", "url": "https://www.forbes.com/sites/barrycollins/2020/04/24/why-you-shouldnt-charge-your-macbook-pro-from-the-left-hand-side/", "urlToImage": null, "publishedAt": "2020-04-24T08:09:40Z", "content": "Charging the MacBook Pro from the left-hand side can cause temperature spikes, a report claims\r\nNurPhoto via Getty Images\r\nA new piece of research claims that plugging in a MacBook Pro charger on the left-hand side of the device can cause the laptop to run ho… [+1866 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Prasid Banerjee", "title": "Database reappears on dark web with 309 Facebook users' personal info for sale - Livemint", "description": "The database includes users’ phone numbers, email addresses, names, Facebook IDs and age, according to the researchers.While passwords weren’t exposed in the breach, security professionals have recommended users to change it", "url": "https://www.livemint.com/technology/tech-news/database-reappears-on-dark-web-with-309-facebook-users-personal-info-for-sale-11587710058031.html", "urlToImage": null, "publishedAt": "2020-04-24T06:36:50Z", "content": "Personal database of 267 million Facebook users which was being sold on the dark web for just 500 (about 41,000) has now expanded to 309 million, cyber risk assessment platform Cyble Inc said Friday.The database includes users phone numbers, email addresses, … [+1936 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Airtel launches Rs 401 prepaid pack with free Disney+ Hotstar VIP subscription - India Today", "description": "Airtel has announced yet another exciting prepaid data pack for the people in quarantine. The Rs 401 data pack launched by Airtel comes with a free subscription to Disney+ Hotstar VIP.", "url": "https://www.indiatoday.in/technology/news/story/airtel-launches-rs-401-prepaid-pack-with-free-disney-hotstar-vip-subscription-1670404-2020-04-24", "urlToImage": null, "publishedAt": "2020-04-24T03:59:43Z", "content": "Airtel has announced yet another exciting prepaid data pack for the people in quarantine. The Rs 401 data pack launched by Airtel comes with a free subscription to Disney+ Hotstar VIP. The streaming app recently arrived in India to compete with the existing p… [+1937 chars]"}, {"source": {"id": null, "name": "Androidauthority.com"}, "author": null, "title": "The Realme X50m delivers 5G, 120Hz on the cheap - Android Authority", "description": "The Realme X50m 5G packs one hell of a punch for the price.", "url": "https://www.androidauthority.com/realme-x50m-5g-1110859/", "urlToImage": null, "publishedAt": "2020-04-24T01:31:48Z", "content": null}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Gordon Kelly", "title": "Google Just Gave Millions Of Users A Reason To Quit Chrome, Windows 10 - Forbes", "description": "Google has revealed an unfixable problem which may force you to pick between Windows 10 and Chrome.", "url": "https://www.forbes.com/sites/gordonkelly/2020/04/23/google-chrome-critical-security-exploit-windows-10-upgrade-warning-update-chrome-browser/", "urlToImage": null, "publishedAt": "2020-04-24T00:36:00Z", "content": "Google is always improving Chrome and it recently issued a brilliant (if long overdue) upgrade. That said, there have also been some recent controversial changes, security problems and data concerns and now Google has detailed a serious new problem in Chrome … [+2782 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Travis Scott's Astroworld Concert Live on Fortnite with 100 Thieves | HYPEBEAST Exclusive - HYPEBEAST", "description": "JUMP STRAIGHT TO CONCERT AT: 36:34 NEW SONG AT: 44:23 Watch Travis Scott's Astroworld concert live on Fortnite with Ceice from 100 Thieves for a HYPEBEAST ex...", "url": "https://www.youtube.com/watch?v=XgeRLTx_qqc", "urlToImage": null, "publishedAt": "2020-04-24T00:00:53Z", "content": "JUMP STRAIGHT TO CONCERT AT: 36:34NEW SONG AT: 44:23\r\nWatch Travis Scott's Astroworld concert live on Fortnite with Ceice from 100 Thieves for a HYPEBEAST exclusive.\r\nFor up-to-date news and more: http://HYPEBEAST.com\r\nSubscribe to our channel: https://www.yo… [+241 chars]"}, {"source": {"id": null, "name": "Macrumors.com"}, "author": "Juli Clover", "title": "Apple Now Has an Official TikTok Account, But No Videos Posted Yet - MacRumors", "description": "Apple appears to have created an official account on popular social networking app TikTok, which is a platform designed to allow users to share short...", "url": "https://www.macrumors.com/2020/04/23/apple-tiktok-account/", "urlToImage": null, "publishedAt": "2020-04-23T21:39:53Z", "content": "Apple appears to have created an official account on popular social networking app TikTok, which is a platform designed to allow users to share short videos.\r\nApple's account can be accessed through the username @apple on the TikTok website and within the Tik… [+1092 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Borderlands 3: Revenge of the Cartels - Official Trailer - IGN", "description": "Soak up some rays, rock those neon colors, and bust crime like it's the '80s in Revenge of the Cartels, the free seasonal event happening in Borderlands 3 fr...", "url": "https://www.youtube.com/watch?v=eWM5VdAykeM", "urlToImage": null, "publishedAt": "2020-04-23T21:00:25Z", "content": null}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Eddie Makuch", "title": "Xbox Series X Logo Trademarked: See The Stylish \"X\" Here - GameSpot", "description": "Take a look at what could be the logo for Microsoft's Xbox Series X.", "url": "https://www.gamespot.com/articles/xbox-series-x-logo-trademarked-see-the-stylish-x-h/1100-6476353/", "urlToImage": null, "publishedAt": "2020-04-23T20:34:00Z", "content": "Microsoft appears to be setting the stage for another Xbox Series X reveal. On April 16, the company filed a new trademark application for the next-generation console that, among other things, included what appears to be the console's logo.\r\nThe trademark app… [+2041 chars]"}, {"source": {"id": null, "name": "Gizchina.com"}, "author": null, "title": "Motorola Edge and Edge+ first photo samples surface in the web - Gizchina.com", "description": "Here are the first official photo samples taken with recently released Motorola Edge and Edge+. The company itself shared them.", "url": "https://www.gizchina.com/2020/04/23/motorola-edge-and-edge-are-in-for-the-first-photo-samples/", "urlToImage": null, "publishedAt": "2020-04-23T19:42:55Z", "content": "Motorola has finally taken the wraps of its flagship series with the release of Motorola Edge and Edge+. Both handsets come with a 6.7-inch AMOLED Endless Edge display with a 90Hz refresh rate. However, they differ in chipset, battery, and camera array. The E… [+1120 chars]"}, {"source": {"id": null, "name": "Nextplatform.com"}, "author": null, "title": "Locking Down Linux For The Enterprise - The Next Platform", "description": "Security has always been important for datacenter operators, but the days of putting a ring of protection around the datacenter and then walking away", "url": "https://www.nextplatform.com/2020/04/23/locking-down-linux-for-the-enterprise/", "urlToImage": null, "publishedAt": "2020-04-23T19:13:24Z", "content": "Security has always been important for datacenter operators, but the days of putting a ring of protection around the datacenter and then walking away satisfied in the knowledge that the data and applications therein were protected from outside forces are long… [+8627 chars]"}, {"source": {"id": null, "name": "Gsmarena.com"}, "author": "Ivan", "title": "Indian TWS earbud market grows by 700%, led by Apple's AirPods - GSMArena.com news - GSMArena.com", "description": "Realme's Buds Air are the second best-selling earbud in India for 2019.", "url": "https://www.gsmarena.com/indian_tws_earbud_market_grows_by_700_led_by_apples_airpods-news-42840.php", "urlToImage": null, "publishedAt": "2020-04-23T18:44:02Z", "content": "The Indian truly wireless earbud market saw a tremendous 700% increase in 2019, which made it the fastest-growing market in wearables in the world.\r\nApple dominated with its second-generation AirPods and its AirPods Pro, the latter of which launched in the co… [+535 chars]"}, {"source": {"id": null, "name": "Crn.com"}, "author": "Kyle Alspach", "title": "Apple Solidifies Plans To Launch Its Own Chips For Macs: Report - CRN: Technology news for channel partners and solution providers", "description": "Apple-designed chips for the Mac could be arriving in 2021 with designs based on the next iPhone processor, the A14.", "url": "https://www.crn.com/news/mobility/apple-solidifies-plans-to-launch-its-own-chips-for-macs-report", "urlToImage": null, "publishedAt": "2020-04-23T18:35:23Z", "content": "Apple is poised to debut internally developed processors in its Mac line in 2021, with the chips coming as variations on the processor for the next iPhone, Bloomberg reported. \r\nAn Apple-designed, Arm-based chip is expected to launch in \"at least one Mac\" dur… [+2457 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Apple A13 Bionic may be underclocked in iPhone SE - Hindustan Times", "description": "According to a screenshot of AnTuTu benchmark test results, the Apple A13 Bionic processor in the iPhone SE (2020) seems underclocked.", "url": "https://www.hindustantimes.com/tech/apple-a13-bionic-may-be-underclocked-in-iphone-se-benchmark-proves-it-weaker-than-iphone-11/story-Qdju2Q0D0Y3LFHPFQUSNCO.html", "urlToImage": null, "publishedAt": "2020-04-23T17:57:58Z", "content": "When the new iPhone SE launched a few days ago, it instantly became a hit for its ‘affordable’ price. One of the key selling points of the device is the A13 Bionic processor that is also found in the most powerful iPhone till date, the iPhone 11 Pro Max. But … [+1275 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Souhardya Biswas", "title": "Massive Armor Changes Revealed In Forthcoming Apex Legends LTM - Essentially Sports", "description": "Now, Respawn seems to be planning on another venture by massively restructuring the armors in Apex Legends as revealed by popular data miner iLootGames.", "url": "https://www.essentiallysports.com/massive-armor-changes-revealed-in-forthcoming-apex-legends-lmt-esports-news-2020/", "urlToImage": null, "publishedAt": "2020-04-23T17:40:26Z", "content": "Apex Legends revolutionized the perception of battle royale games after its launch in February 2019. At the time, the idea of resurrecting fallen teammate(s) was unknown in the BR genre. Respawn successfully implemented a concept in-game, which then allowed p… [+2389 chars]"}, {"source": {"id": null, "name": "Gsmarena.com"}, "author": "Ivan", "title": "Microsoft Surface Earbuds will launch in Europe on May 6, priced at €199 - GSMArena.com news - GSMArena.com", "description": "The truly wireless market is getting a fresh competitor.", "url": "https://www.gsmarena.com/microsoft_surface_earbuds_will_launch_in_europe_on_may_6_priced_at_199-news-42836.php", "urlToImage": null, "publishedAt": "2020-04-23T16:23:02Z", "content": "Microsoft's entry into TWS earbuds - the Surface Earbuds - will finally go on sale in European countries on May 6.\r\nThe buds will cost \u0080199, placing them slightly above the \u0080169 Samsung Galaxy Buds+ and way below the \u0080279 Apple AirPods Pro. Microsoft's Surfac… [+383 chars]"}, {"source": {"id": null, "name": "Androidpolice.com"}, "author": null, "title": "Asus Zenfone Max M2 is receiving Android 10 - Android Police", "description": "Asus significantly stepped up its update game last year and even started doing away with its custom Android skin, opting for an approach much closer to", "url": "https://www.androidpolice.com/2020/04/23/asus-zenfone-max-m2-android-10/", "urlToImage": null, "publishedAt": "2020-04-23T11:45:11Z", "content": "Asus significantly stepped up its update game last year and even started doing away with its custom Android skin, opting for an approach much closer to stock Android instead. While the latest phones are still first in line to receive the newest Android versio… [+988 chars]"}, {"source": {"id": null, "name": "Tomsguide.com"}, "author": "Richard Priday", "title": "Galaxy Z Flip YouTube 'Flex mode' paves way for killer Galaxy Fold 2 apps - Tom's Guide", "description": "Galaxy Z Flip's unique 'Flex mode' for YouTube shows what's possible when you create custom apps for foldable phones", "url": "https://www.tomsguide.com/news/galaxy-z-flip-youtube-flex-mode-paves-way-for-killer-galaxy-fold-2-apps", "urlToImage": null, "publishedAt": "2020-04-23T11:44:14Z", "content": "The Samsung Galaxy Z Flip\r\n now has its own version of the YouTube app. That's not only good news for Z Flip owners, but also for future foldable phones like the Galaxy Fold 2.\r\nIn an announcement on the Samsung press website\r\n, Google and Samsung revealed th… [+1679 chars]"}, {"source": {"id": null, "name": "Livemint.com"}, "author": "Aparna Banerjea", "title": "WhatsApp trick: How to send message to an unsaved number - Livemint", "description": "There is a way to send a WhatsApp text to someone without actually saving their number on the phone, and it does not require a third-party app.WhatsApp has been in the news for its upcoming new features such as increasing the number of participants from four …", "url": "https://www.livemint.com/technology/apps/whatsapp-trick-how-to-send-message-to-an-unsaved-number-11587312477237.html", "urlToImage": null, "publishedAt": "2020-04-23T11:35:40Z", "content": "WhatsApp has more than two billion users globally and is practically, the most popular messaging application for everyone. However, the users do face a huge problem when they are trying to text an unknown person without necessarily having to save the number. … [+3967 chars]"}, {"source": {"id": null, "name": "Gsmarena.com"}, "author": "Ivan", "title": "Motorola shares stunning Edge and Edge+ camera samples - GSMArena.com news - GSMArena.com", "description": "The samples show multiple resolutions, cameras and camera modes.", "url": "https://www.gsmarena.com/motorola_shares_stunning_edge_and_edge_camera_samples-news-42828.php", "urlToImage": null, "publishedAt": "2020-04-23T10:57:02Z", "content": null}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jon Porter", "title": "Twitter tests an easier way to find quote tweets - The Verge", "description": "Twitter is testing a new menu option that shows you every time a post has been retweeted with a comment. In screenshots posted by users with the feature, a new “Retweet with comments” counter can be seen.", "url": "https://www.theverge.com/2020/4/23/21232408/twitter-quote-retweets-counter-retweet-with-comment-test", "urlToImage": null, "publishedAt": "2020-04-23T10:48:26Z", "content": "A new Retweet with comments button has you covered\r\nIllustration by Alex Castro / The Verge\r\nTwitter is testing a new option that shows you all the times a post has been retweeted with a comment, the company has confirmed to The Verge. In screenshots posted b… [+1095 chars]"}, {"source": {"id": null, "name": "Givemesport.com"}, "author": "Jake Doyle", "title": "Call of Duty: Mobile hosting tournament with $1 million prize money - GIVEMESPORT", "description": "Call of Duty: Mobile hosting tournament with $1 million prize money", "url": "https://www.givemesport.com/1564431-call-of-duty-mobile-hosting-tournament-with-1-million-prize-money", "urlToImage": null, "publishedAt": "2020-04-23T10:36:22Z", "content": "Activision have announced that they will be hosting a Call of Duty: Mobile tournament.\r\nThe prize money? A cool $1 million is on the line.\r\nIt will be named ‘The Call of Duty: Mobile World Championship 2020’ and is set to commence on April 30 as an online esp… [+1910 chars]"}, {"source": {"id": null, "name": "Thejakartapost.com"}, "author": "The Jakarta Post", "title": "Facebook rolls out Messenger Kids to 70 new countries - The Jakarta Post - Jakarta Post", "description": "Facebook on Wednesday rolled out its Messenger Kids application to 70 new countries, saying it can help children deal with the challenges of distance learning and isolation during the virus lockdowns.", "url": "https://www.thejakartapost.com/life/2020/04/23/facebook-rolls-out-messenger-kids-to-70-new-countries.html", "urlToImage": null, "publishedAt": "2020-04-23T10:04:00Z", "content": "Facebook on Wednesday rolled out its Messenger Kids application to 70 new countries, saying it can help children deal with the challenges of distance learning and isolation during the virus lockdowns.\r\nThe app, which is aimed at children under 13, will also b… [+2197 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "Aaron Brown", "title": "WhatsApp is planning an awesome update that couldn't have come at a better time - Express", "description": "WHATSAPP has a new feature planned for its hugely-successful messaging service - and it's very topical. Here's everything you need to know about the upcoming update.", "url": "https://www.express.co.uk/life-style/science-technology/1271058/WhatsApp-Update-iPhone-iOS-Video-Call-Houseparty-Number-Of-People", "urlToImage": null, "publishedAt": "2020-04-23T08:45:00Z", "content": null}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "IANS", "title": "Microsoft developers are producing 30,000 security bugs: Here's why - India TV News", "description": "Microsoft developers are generating thousands of security bugs a month. Read on to know what it is about", "url": "https://www.indiatvnews.com/technology/news-microsoft-developers-find-30-000-security-issues-know-why-610482", "urlToImage": null, "publishedAt": "2020-04-23T08:17:56Z", "content": "Microsoft has collected over 13 million bugs since 2001\r\nAt Microsoft, 47,000 developers are generating nearly 30,000 bugs a month and these vulnerabilities get stored across over 100 AzureDevOps and GitHub repositories to quickly spot critical bugs and stay … [+1837 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "IANS", "title": "Google adds 4 new features to video calling app Duo - The Hindu", "description": "Google says it is rolling out a new video codec technology to improve video call quality and reliability, even on very low-bandwidth connections", "url": "https://www.thehindu.com/sci-tech/technology/internet/google-adds-4-new-features-to-video-calling-app-duo/article31412683.ece", "urlToImage": null, "publishedAt": "2020-04-23T07:21:43Z", "content": "Google has started rolling out four new features in its video-calling app Google Duo, along with a promise to add more soon.\r\nThe search engine giant is rolling out a new video codec technology to improve video call quality and reliability, even on very low-b… [+1039 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "India TV Tech Desk", "title": "Fortnite for Android now available on Google Play Store: Here's how you can download - India TV News", "description": "After almost 18 months, Epic Games has finally released Fortnite on the Google Play Store for all Android users. Here's what you need to know.", "url": "https://www.indiatvnews.com/technology/news-fortnite-for-android-finally-comes-to-google-play-store-610130", "urlToImage": null, "publishedAt": "2020-04-23T07:15:00Z", "content": "Fortnite requires an additional download of 7.4GB\r\nFortnite is one of the most popular battle royale games. The game is available on multiple platforms including Android, iOS PS4, PC, Xbox and Nintendo Switch. For smartphones, the game was first introduced in… [+1432 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "IANS", "title": "HP introduces free remote helpdesk for PC users in India: Here's how it works - India TV News", "description": "HP Inc. on Thursday introduced limited-period free helpdesk support to PC users of all brands to address their operational issues in India.", "url": "https://www.indiatvnews.com/technology/news-hp-introduces-free-remote-helpdesk-for-pc-users-in-india-610450", "urlToImage": null, "publishedAt": "2020-04-23T07:11:15Z", "content": "HP users can now get free remote helpdesk support.\r\nPC and printing major HP Inc. on Thursday introduced limited-period free helpdesk support to PC users of all brands to address their operational issues in India. In the absence of regular support and service… [+1235 chars]"}]}