{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Indiatvnews.com"}, "author": "IANS", "title": "1.6 Lakh Nintendo user accounts hacked; Company admits - India TV News", "description": "Nintendo has admitted that more than a lakh user accounts got affected by hacking and notified the ones affected", "url": "https://www.indiatvnews.com/technology/news-1-6-lakh-nintendo-accounts-hacked-details-exposed-see-what-it-is-611258", "urlToImage": null, "publishedAt": "2020-04-25T14:33:54Z", "content": "Nintendo Switch\r\nJapanese video game company Nintendo has admitted that over 160,000 user accounts were compromised recently where hackers took the login IDs and passwords and the company is notifying those who were affected.\r\nNintendo which \"sincerely apolog… [+1969 chars]"}, {"source": {"id": null, "name": "Indiagoneviral.com"}, "author": "IGV- News Desk Team", "title": "OnePlus 8 Pro vs Samsung Galaxy S20 Plus: Who wins? - India Gone Viral", "description": "The OnePlus 8 Pro and Samsung Galaxy S20 Plus are key smartphones for these two industry players. On the one hand, OnePlus is making a firm play for the flagship market, throwing its best technology i", "url": "https://indiagoneviral.com/technology/2020/04/25/oneplus-8-pro-vs-samsung-galaxy-s20-plus-who-wins/42191/india-gone-viral/", "urlToImage": null, "publishedAt": "2020-04-25T14:06:28Z", "content": "The OnePlus 8 Pro and Samsung Galaxy S20 Plus are key smartphones for these two industry players. On the one hand, OnePlus is making a firm play for the flagship market, throwing its best technology into its 8 Pro model, with a somewhat controversially higher… [+14740 chars]"}, {"source": {"id": null, "name": "9to5google.com"}, "author": null, "title": "This week’s top stories: Huawei caught falsifying photos, Google Store refresh, ‘Hey Google’ sensitivity, more - 9to5Google", "description": "Top Stories: Huawei caught claiming DSLR photos were taken on a smartphone, Google Store sees a refresh highlighting Google's hardware brands, and more.", "url": "https://9to5google.com/2020/04/25/top-stories-huawei-falsifying-photos-google-store-refresh/", "urlToImage": null, "publishedAt": "2020-04-25T14:01:43Z", "content": "In this week’s top stories: Huawei was caught claiming DSLR photos were taken on a smartphone, the Google Store sees a refresh highlighting Google’s hardware brands, adjustable “Hey Google” sensitivity outlined, and more.\r\nFiled under bizarre controversy this… [+3260 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "India TV Tech Desk", "title": "PUBG Mobile Lite 0.17.0 Beta update brings Payload mode, Falcon and more - India TV News", "description": "PUBG Mobile Lite 0.17.0 update starts rolling out under the Beta program. Here's what it brings and how you can install it on your Android, iOS device.", "url": "https://www.indiatvnews.com/technology/news-pubg-mobile-lite-0-17-0-beta-update-payload-mode-611221", "urlToImage": null, "publishedAt": "2020-04-25T13:08:48Z", "content": "PUBG Mobile Lite 0.17.0 Beta update starts rolling out.\r\nTencent Games is gearing up to launch the PUBG Mobile 0.18.0 update for both Android and iOS users. For the Lite users out there, the company has started rolling out the PUBG Mobile Lite 0.17.0 Beta upd… [+1758 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Mark Wilson", "title": "Why the Canon EOS R5 could be 'mind blowing' for video, according to a director - TechRadar India", "description": "Video skills could yet justify its likely hefty price tag", "url": "https://www.techradar.com/news/why-the-canon-eos-r5-could-be-mind-blowing-for-video-according-to-a-director", "urlToImage": null, "publishedAt": "2020-04-25T13:00:00Z", "content": "The Canon EOS R5s latest teaser announcement caused quite a stir this week. Not only is this relatively small, full-frame mirrorless camera shaping up to be a powerful stills camera, it appears to have cinema-grade video powers, too.\r\nIts fair to say we haven… [+7543 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Apple, Google Boost Privacy Protections for Covid Contact-Tracing Tool - Bloomberg Technology", "description": "Apr.25 -- Apple Inc. and Google said they are putting stronger privacy protections in their upcoming contact-tracing tool for Covid-19. Bloomberg's Mark Gurm...", "url": "https://www.youtube.com/watch?v=woKQVFKc4Tw", "urlToImage": null, "publishedAt": "2020-04-25T12:35:09Z", "content": null}, {"source": {"id": null, "name": "Deccanherald.com"}, "author": "Rohit KVN", "title": "WhatsApp increases group video call users' limit; is this enough to shun Zoom? - Deccan Herald", "description": "Last week, we reported Facebook-owned WhatsApp testing video group chat with the option to include more people, from the existing limit fo four. Now, the company has formally announced it will soon be releasing an update to the messenger app. WhatsApp messeng…", "url": "https://www.deccanherald.com/specials/whatsapp-increases-group-video-call-users-limit-is-this-enough-to-shun-zoom-829797.html", "urlToImage": null, "publishedAt": "2020-04-25T12:29:54Z", "content": "Last week, we reported Facebook-owned WhatsApp testing video group chat with the option to include more people, from the existing limit fo four. Now, the company has formally announced it will soon be releasing an update to the messenger app.\r\nWhatsApp messen… [+1314 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Christopher Groux", "title": "'Apex Legends' Battle Armor Event & Season 5 Start Date Revealed - Newsweek", "description": "\"Apex Legends\" Battle Armor event starts next week, and it leads right up to the release of Season 5.", "url": "https://www.newsweek.com/apex-legends-battle-armor-event-season-5-start-date-reveal-1500203", "urlToImage": null, "publishedAt": "2020-04-25T12:02:03Z", "content": "Apex Legends will host one more event before the start of Season 5. The Battle Armor event was revealed by Respawn Friday afternoon via an official blog post, and it focuses on a new mode with dedicated armor drops.\r\nPiggybacking off the popularity of the Evo… [+1984 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Gordon Kelly", "title": "Google Just Gave Millions Of Users A Reason To Quit Windows 10 - Forbes", "description": "Google has revealed an unfixable problem which may force you to pick between Windows 10 and Chrome.", "url": "https://www.forbes.com/sites/gordonkelly/2020/04/23/google-chrome-critical-security-exploit-windows-10-upgrade-warning-update-chrome-browser/", "urlToImage": null, "publishedAt": "2020-04-25T11:16:38Z", "content": "04/25 Update below. This post was originally published on April 23\r\nGoogle is always improving Chrome and it recently issued a brilliant (if long overdue) upgrade. Unfortunately, now Google has detailed a serious new problem in Chrome which cannot be fixed, a… [+3970 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Darren Allan", "title": "AMD Cezanne leak hints at next-gen laptop CPUs with RDNA 2 graphics that go for Intel’s jugular - TechRadar India", "description": "Zen 3 APUs with RDNA 2-powered integrated graphics, rumor has it", "url": "https://www.techradar.com/news/amd-cezanne-leak-hints-at-next-gen-laptop-cpus-with-rdna-2-graphics-that-go-for-intels-jugular", "urlToImage": null, "publishedAt": "2020-04-25T10:54:00Z", "content": "AMD Ryzen 4000 (codenamed Renoir) mobile chips are still very much fresh on the scene and making a huge impact in terms of competitiveness in the laptop world but weve already seen a leak for next-gen APUs apparently codenamed Cezanne (a name which has been d… [+2934 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "India TV Tech Desk", "title": "Vivo Y50 with punch-hole camera launched: Price, Specifications and more - India TV News", "description": "Vivo Y50 comes with a single punch-hole camera, 5,000mAh battery, Snapdragon 665 processor and more. Here's all you need to know.", "url": "https://www.indiatvnews.com/technology/news-vivo-y50-snapdragon-665-launched-price-specifications-611173", "urlToImage": null, "publishedAt": "2020-04-25T10:06:48Z", "content": "Vivo Y50 comes with a quad-camera setup at the back.\r\nVivo has launched yet another smartphone in its home country, China. The all-new Vivo Y50 is an addition to the companys mid-range Y family. The key highlights of the new smartphone include a single punch-… [+1314 chars]"}, {"source": {"id": null, "name": "Gsmarena.com"}, "author": "George", "title": "Xiaomi hypes up the Mi 10 Youth display - Samsung-made OLED, 4,300,000:1 contrast - GSMArena.com news - GSMArena.com", "description": "Other bits revealed in a couple of official Weibo posts include a 180Hz touch sampling rate, DC dimming and HDR10+ support.", "url": "https://www.gsmarena.com/xiaomi_the_mi_10_youth_display_samsung-news-42869.php", "urlToImage": null, "publishedAt": "2020-04-25T09:35:02Z", "content": "The Xiaomi Mi 10 Youth 5G is set to be announced in a couple of days, and we've already seen a TENAA listing detailing most specs as well as some official teasers highlighting its camera system. The teasing game continues on Weibo, where Xiaomi's now showcase… [+1011 chars]"}, {"source": {"id": null, "name": "Fossbytes.com"}, "author": "Sarvottam Kumar", "title": "After Ubuntu 20.04 Release, Ubuntu 20.10 Is Codenamed 'Groovy Gorilla' - Fossbytes", "description": "A day after Ubuntu 20.04 release, the Ubuntu development team is gearing up to make the next Ubuntu 20.10 groovier with Gorilla. 'Groovy Gorilla' is now the codename chosen for Ubuntu 20.10 which will release on October 22, 2020.", "url": "https://fossbytes.com/ubuntu-20-10-groovy-gorilla-codename/", "urlToImage": null, "publishedAt": "2020-04-25T09:35:00Z", "content": "A day after the Ubuntu 20.04 release, the Ubuntu development team is gearing up to make the next Ubuntu 20.10 groovier with “Gorilla.”\r\nFollowing the traditional method of codenaming each version, ‘Groovy Gorilla’ is now the codename for the Ubuntu 20.10. Wel… [+1750 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Xiaomi Redmi Note 9 series global launch on April 30 - Hindustan Times", "description": "Xiaomi has scheduled an event for April 30 where it will launch the Redmi Note 9 series globally.", "url": "https://www.hindustantimes.com/tech/xiaomi-redmi-note-9-series-global-launch-on-april-30/story-64qPbmmy1PcZ24Y6YEhWSM.html", "urlToImage": null, "publishedAt": "2020-04-25T08:03:04Z", "content": "Xiaomi announced it is hosting a global launch for the Redmi Note 9 series on April 30. The launch event as expected will be online-only, and it will feature other Xiaomi products as well.\r\nRedmi Note 9 series global is scheduled to take place on April 30, an… [+1161 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "India TV Tech Desk", "title": "Thanks to iPhone 11, Apple got 33% market share in India in Q1 2020 - India TV News", "description": "Apple records a 126% growth in Quarter 1, 2020 because of the iPhone 11 sales in India", "url": "https://www.indiatvnews.com/technology/news-apple-gains-33-market-share-in-india-in-q1-2020-611127", "urlToImage": null, "publishedAt": "2020-04-25T07:54:44Z", "content": "iPhone 11\r\nThe great Apple growth story continued in the first quarter of 2020 as the Cupertino-based iPhone maker grew 126 per cent in the premium segment (Rs 30,000 and above), reaching its share to 33 per cent as compared to 18 per cent a year ago signalli… [+2015 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Mike Moore", "title": "Beware - that email from HR might be a cyber scam - TechRadar India", "description": "Criminals look to exploit new working from home trend", "url": "https://www.techradar.com/news/beware-that-email-from-hr-might-be-a-cyber-scam", "urlToImage": null, "publishedAt": "2020-04-25T06:29:00Z", "content": "Remote workers are being targeted by a wide-ranging new online scam looking to steal business logins.\r\nResearchers at security firm Cofense have uncovered a phishing campaign masquerading as emails from HR departments.\r\nThe scam targets employees who are stil… [+1879 chars]"}, {"source": {"id": null, "name": "Express.co.uk"}, "author": "David Snelling", "title": "Samsung reveals another blockbuster 4K TV update for your television - Express", "description": "SAMSUNG is back with even more updates for your TV and here's what's now available on your 4K television.", "url": "https://www.express.co.uk/life-style/science-technology/1273517/Samsung-4K-TV-update-Apple-Music-app", "urlToImage": null, "publishedAt": "2020-04-25T06:01:07Z", "content": "“Our goal has always been to deliver the best entertainment experiences to consumers – and as people spend more time at home, we are more committed to that mission than ever,” said Salek Brodsky, Vice President of Strategic Partnerships and Business Developme… [+665 chars]"}, {"source": {"id": null, "name": "91mobiles.com"}, "author": null, "title": "LG Velvet specifications leak out ahead of May 7th launch - 91mobiles", "description": "LG Velvet key specifications including processor, cameras and battery details have leaked out ahead of the May 7th launch event.", "url": "https://www.91mobiles.com/hub/lg-velvet-specifications-leak-processor-camera-may-7-launch/", "urlToImage": null, "publishedAt": "2020-04-25T04:41:15Z", "content": "LG Velvet specifications will include the Snapdragon 765 5G processor \r\nLG Velvet specifications have appeared online ahead of the smartphone’s launch on May 7th. The upcoming phone from LG has been turning some heads thanks to its unique design language, esp… [+1673 chars]"}, {"source": {"id": null, "name": "Gadgetsnow.com"}, "author": "Gadgets Now Bureau", "title": "Text bomb: This message may crash your iPhone, iPad, Apple Watch, Mac - Gadgets Now", "description": "If you use an Apple device, here’s an important ‘warning’. A new text bomb is crashing iPhones, Apple Watch, iPad or Mac. This string of characters includes Italian flag emoji and some Sindhi characters. According to a report by 9to5Mac, users have reported r…", "url": "https://www.gadgetsnow.com/tech-news/text-bomb-this-message-may-crash-your-iphone-ipad-apple-watch-mac/articleshow/75368309.cms", "urlToImage": null, "publishedAt": "2020-04-25T03:51:46Z", "content": null}, {"source": {"id": null, "name": "Androidpolice.com"}, "author": null, "title": "The 5 best things about the OnePlus 8 Pro - Android Police", "description": "The higher price of the OnePlus 8 Pro hasn't gone down too well in some quarters, but there's no doubting that you still get a lot of phone for the money.", "url": "https://www.androidpolice.com/2020/04/24/5-best-oneplus-8-pro/", "urlToImage": null, "publishedAt": "2020-04-25T03:47:18Z", "content": "The higher price of the OnePlus 8 Pro hasn't gone down too well in some quarters, but there's no doubting that you still get a lot of phone for the money. Lets take a look at the five standout features of the latest OnePlus flagship. And don't worry, we've go… [+3189 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Matt Espineli", "title": "FF7 Remake Elemental Materia Guide: Where To Find This Essential Materia Orb - GameSpot", "description": "Here's how to get the only two Elemental Materia orbs available in FF7 Remake for PS4.", "url": "https://www.gamespot.com/articles/ff7-remake-elemental-materia-guide-where-to-find-t/1100-6476502/", "urlToImage": null, "publishedAt": "2020-04-25T03:26:00Z", "content": "In Final Fantasy 7 Remake, the Elemental Materia is one of the best Materia orbs you can get, as it can imbue either your weapons with elemental power and your armor with elemental defense. However, this Materia can be incredibly easy to miss if you're just g… [+2738 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Desire Athow", "title": "This AMD Ryzen notebook deal is probably the best we've ever seen - Techradar", "description": "Lenovo and AMD provide a glimpse into the future", "url": "https://www.techradar.com/news/this-amd-ryzen-laptop-is-the-probably-the-best-notebook-deal-ever", "urlToImage": null, "publishedAt": "2020-04-25T03:00:00Z", "content": "We reviewers are used to obsessing over incremental technology changes, but every now and then a supernova appears on our radar - something that can single handedly change the status quo.\r\nThe AMD Ryzen 4000 family is one such supernova and promises to bring … [+1829 chars]"}, {"source": {"id": null, "name": "Phonearena.com"}, "author": "Cosmin Vasile", "title": "OnePlus ends open beta program for two older flagships - PhoneArena", "description": "OnePlus recently announced it will end the open beta program for OnePlus 6 and 6T once the OxygenOS Open Beta 6 gets released.", "url": "https://www.phonearena.com/news/OnePlus-6T-open-beta-program-discontinued_id124141", "urlToImage": null, "publishedAt": "2020-04-25T02:00:00Z", "content": "The last major update OnePlus 6 and OnePlus 6T flagships will receive is Android 10. The Chinese company recently announced it will end the open beta program for these two smartphones once the OxygenOS Open Beta 6 gets released.Those who are still using beta … [+907 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "", "title": "Android's upcoming call recording feature could be region restricted - Engadget", "description": "Android's upcoming call recording feature could be coming soon.", "url": "https://www.engadget.com/android-call-recording-003653130.html", "urlToImage": null, "publishedAt": "2020-04-25T00:52:32Z", "content": "The document went on to say that when you record a call for the first time, you’ll be advised that you’re responsible for complying with local laws (many regions require consent by all parties prior to call recording). It states: “When you start recording, th… [+866 chars]"}, {"source": {"id": null, "name": "Venturebeat.com"}, "author": "Jeff Grubb", "title": "How Xbox Game Pass freed The Coalition to make Gears Tactics for PC - VentureBeat", "description": "Gears Tactics is the next big first-party Microsoft launch for Xbox Game Pass. Developer The Coalition made the game in part because of Game Pass.", "url": "https://venturebeat.com/2020/04/24/gears-tactics-xbox-game-pass/", "urlToImage": null, "publishedAt": "2020-04-24T23:33:30Z", "content": "Gears Tactics is launching April 28 for Windows 10, Xbox Game Pass for PC, and Steam. On How Games Make Money this week, host Jeff Grubb sits down to talk with The Coalition operations director Mike Crump and Xbox marketing general manager Ben Decker about th… [+4308 chars]"}, {"source": {"id": null, "name": "Androidcentral.com"}, "author": "Muhammad Jarir Kanji", "title": "Live Caption for phone calls may be coming to Android very soon - Android Central", "description": "One of the biggest limitations to Google's Live Caption feature will finally be addressed by Android 11, as it lets you now transcribe phone calls in real-time.", "url": "https://www.androidcentral.com/live-caption-phone-calls-may-be-coming-android-very-soon", "urlToImage": null, "publishedAt": "2020-04-24T22:22:05Z", "content": "When it launched with Android 10 last year, Live Caption was one of the most exciting new features to come out of the Mountain View giant's labs. Since then, it's been extremely popular with users, and Google has been hard at work expanding its availability. … [+1735 chars]"}, {"source": {"id": null, "name": "Gsmarena.com"}, "author": "Vlad", "title": "LG Velvet specs leak - GSMArena.com news - GSMArena.com", "description": "The phone will get official on May 7.", "url": "https://www.gsmarena.com/lg_velvet_specs_leak-news-42863.php", "urlToImage": null, "publishedAt": "2020-04-24T22:00:02Z", "content": "LG's most exciting smartphone in quite a while (at least design-wise) is getting official on May 7. The Velvet should be the first in a line of upper mid-range devices that are meant to replace the now-defunct G series.\r\nLG has been teasing bits and pieces ab… [+1355 chars]"}, {"source": {"id": null, "name": "Businessinsider.in"}, "author": "Lisa Eadicicco", "title": "A Microsoft Word update finally puts an end to the ongoing debate about whether you should put 1 or 2 spaces a - Business Insider India", "description": "Microsoft Word will begin flagging two spaces after a period as an error, a long-running debate that's been met with both excitement and criticism.The company", "url": "https://www.businessinsider.in/tech/news/a-microsoft-word-update-finally-puts-an-end-to-the-ongoing-debate-about-whether-you-should-put-1-or-2-spaces-after-a-period/articleshow/75365060.cms", "urlToImage": null, "publishedAt": "2020-04-24T21:14:00Z", "content": "Microsoft is putting its foot down in the age-old debate about whether it's correct to put one or two spaces after a period. \r\nMicrosoft Word's Editor function is getting a new feature that flags two spaces after a period as an error, according to The Verge. … [+1172 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Chris Pereira", "title": "4 Upcoming Animal Crossing: New Horizons Events Announced - GameSpot", "description": "Updates are coming to Animal Crossing: New Horizons, and here's what events will take place over the next two months.", "url": "https://www.gamespot.com/articles/4-upcoming-animal-crossing-new-horizons-events-ann/1100-6476292/", "urlToImage": null, "publishedAt": "2020-04-24T20:45:00Z", "content": "Update: Nature Day is now live in Animal Crossing: New Horizons, bringing two new merchants to your island. Find the rest of the scheduled events below or find out how Nature Day works in our guide.\r\nNintendo has outlined some of what players can expect from … [+2279 chars]"}, {"source": {"id": null, "name": "Windowslatest.com"}, "author": null, "title": "Microsoft is investigating Windows 10 KB4549951 issues - WindowsLatest", "description": "Windows 10 KB4549951, which was released on April 14 with security fixes, is reportedly plagued with serious issues for some users. The update is only available for consumers with Windows 10 version 1903 and 1909, and the patch contains security fixes. Initia…", "url": "https://www.windowslatest.com/2020/04/25/microsoft-comments-on-windows-10-kb4549951-issues/", "urlToImage": null, "publishedAt": "2020-04-24T20:38:00Z", "content": "Windows 10 KB4549951, which was released on April 14 with security fixes, is reportedly plagued with serious issues for some users. The update is only available for consumers with Windows 10 version 1903 and 1909, and the patch contains security fixes.\r\nIniti… [+2196 chars]"}, {"source": {"id": null, "name": "Gizmochina.com"}, "author": null, "title": "Honor 30 vs Huawei Nova 7 vs OnePlus 8: Specs Comparison - gizmochina", "description": "A comparison between flagship killers: Honor 30, Huawei Nova 7 and OnePlus 8.", "url": "https://www.gizmochina.com/2020/04/24/honor-30-vs-huawei-nova-7-vs-oneplus-8-specs-comparison/", "urlToImage": null, "publishedAt": "2020-04-24T19:40:00Z", "content": "The price of the top-tier flagships increased a lot during the last year. But at the same time, the number of flagship killers increased as well. The mainstream smartphone manufacturers are now releasing their main flagship lineups in more than one variant, a… [+5879 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "Indo Asian News Service", "title": "WhatsApp might start showing you ads soon - Hindustan Times", "description": "Users may see these ads on the platform after Facebook completes its multi-year effort to link all its social media platforms.", "url": "https://www.hindustantimes.com/tech/here-s-when-whatsapp-may-start-showing-you-ads/story-gv8bTx1RnxRhcaklVjU6MJ.html", "urlToImage": null, "publishedAt": "2020-04-24T19:33:56Z", "content": "Facebook has not abandoned its plans to serve ads on its instant messaging service WhatsApp, the media reported. Users may see these ads on the platform after Facebook completes its multi-year effort to link all its social media platforms, according to a repo… [+1263 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Magic Keyboard for iPad Pro - Top Features! Is it worth it? - 9to5Mac", "description": "In this video I go hands-on with the Magic Keyboard for iPad Pro. I'm using the $299 11-inch version, which is $50 cheaper than the 12.9-inch version. The Ma...", "url": "https://www.youtube.com/watch?v=a1DEwgdEF8c", "urlToImage": null, "publishedAt": "2020-04-24T18:56:41Z", "content": null}, {"source": {"id": null, "name": "Gsmarena.com"}, "author": "Michail", "title": "Our Xiaomi Mi 10 Pro video review is out - GSMArena.com news - GSMArena.com", "description": "Does Xiaomi's most expensive flagship deliver? Check out what Will has to say in our Mi 10 Pro video review.", "url": "https://www.gsmarena.com/our_xiaomi_mi_10_pro_video_review_is_out-news-42860.php", "urlToImage": null, "publishedAt": "2020-04-24T18:14:33Z", "content": "Our Xiaomi Mi 10 Pro written review has been out for a few days and now we present you with the video breakdown. This is without a doubt the best flagship Xiaomi has released so far, matching any top of the line offering from other premium smartphone makers. … [+545 chars]"}, {"source": {"id": null, "name": "Notebookcheck.net"}, "author": "Alex Alderson", "title": "Xiaomi rolls out another Android 9.0 Pie update to the Mi Note 10 and Mi Note 10 Pro just days before it makes MIUI 12 available - Notebookcheck.net", "description": "With MIUI 12 rumoured to be available from MIUI 12, Xiaomi has decided to push another Android 9.0 Pie-based update to the Mi Note 10 and Mi Note 10 Pro. While Xiaomi has pledged to update the CC9 Pro to Android 10 by the end of this month, the arrival of the…", "url": "https://www.notebookcheck.net/Xiaomi-rolls-out-another-Android-9-0-Pie-update-to-the-Mi-Note-10-and-Mi-Note-10-Pro-just-days-before-it-makes-MIUI-12-available.462633.0.html", "urlToImage": null, "publishedAt": "2020-04-24T17:44:08Z", "content": "While Xiaomi has promised to update the CC9 Pro to Android 10 this month,  it looks unlikely that its Global or EU Mi Note 10 series siblings will receive the same treatment. As we previously reported, Global handsets started receiving their latest Android 9.… [+686 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Carly Page", "title": "The Dell XPS 15 2020 may have been redesigned to take on the MacBook Pro - TechRadar India", "description": "Incoming model will boast smaller bezels and upward-firing speakers", "url": "https://www.techradar.com/news/the-dell-xps-15-2020-may-have-been-redesigned-to-take-on-the-macbook-pro", "urlToImage": null, "publishedAt": "2020-04-24T17:31:00Z", "content": "Dell looks poised to release an all-new version of its XPS 15 laptop that will take a number of design clues from the recently-revamped Dell XPS 13\r\n.\r\nThats according to leaked images posted on the Korea Energy Agency Efficiency Standardization Certification… [+2119 chars]"}, {"source": {"id": null, "name": "Gizchina.com"}, "author": null, "title": "OnePlus Z surfaces in leaked live-photos - Gizchina.com", "description": "The OnePlus Z mid-range is yet to be released by the company. Today, alleged live shots reveal the handset in all its glory.", "url": "https://www.gizchina.com/2020/04/24/oneplus-z-surfaces-in-leaked-live-photos/", "urlToImage": null, "publishedAt": "2020-04-24T16:22:11Z", "content": "This year, rumors were pointing to the arrival of three OnePlus smartphones. However, just two of them were released in the last week – OnePlus 8 and OnePlus 8 Pro. Apparently, the constant problems raised by the COVID-19 pandemic had delayed the construction… [+1718 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "The Apple Watch: 5 years later - Engadget", "description": "When Apple released its first wearable five years ago, many publications, including ours, were pretty skeptical. And with good reason, the first-gen watch wa...", "url": "https://www.youtube.com/watch?v=prYst35-x_k", "urlToImage": null, "publishedAt": "2020-04-24T16:00:29Z", "content": null}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Christian de Looper", "title": "7 Of The Best Amazon Alexa Speakers - Forbes", "description": "Looking for a great speaker with arguably the smartest digital assistant, Alexa? Here are 7 of the best Amazon Alexa speakers out there.", "url": "https://www.forbes.com/sites/forbes-personal-shopper/2020/04/24/7-of-the-best-amazon-alexa-speakers/", "urlToImage": null, "publishedAt": "2020-04-24T16:00:00Z", "content": "Alexa is arguably the smartest digital assistant, and while Google Assistant also has a lot going for it, Alexa is the go-to for many users who dont have Android phones. There are a ton of Alexa speakers on the market, and while they all have the smart featur… [+4164 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "How to download and send Ramadan WhatsApp Stickers - Hindustan Times", "description": "Here we talk about Ramadan-based stickers, how they can be downloaded as packs from the Google Play Store. Follow these steps.", "url": "https://www.hindustantimes.com/tech/how-to-download-and-send-ramadan-whatsapp-stickers/story-wdDqKUcUgBuQIm7WYst9oI.html", "urlToImage": null, "publishedAt": "2020-04-24T15:48:17Z", "content": "Although majority of us are at homes during the Covid-19 lockdown, some of us are celebrating the auspicious Ramadan festival. And WhatsApp Stickers can be the perfect way to wish each other. We are not talking about any other stickers but Ramadan-based stick… [+1418 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "IANS", "title": "Huawei smartphones receive VoWiFi calling support in India: Here's how it works - India TV News", "description": "Huawei has introduced Voice over WiFi (VoWiFi) calling support for its smartphones users in India so that network issues at their home or workplace do not disrupt their communications.", "url": "https://www.indiatvnews.com/technology/news-huawei-smartphones-receive-support-for-vowifi-calling-in-india-610981", "urlToImage": null, "publishedAt": "2020-04-24T15:40:34Z", "content": "Huawei recently launched the P40 series globally.\r\nWorld's second-largest smartphone company Huawei has introduced Voice over WiFi (VoWiFi) calling support for its smartphones users in India so that network issues at their home or workplace do not disrupt the… [+2217 chars]"}, {"source": {"id": null, "name": "Gizchina.com"}, "author": null, "title": "iQOO 3 4G and 5G variants price slashed in India - Gizchina.com", "description": "In light of the recent release of iQOO Neo 3 in China, the Indian branch of iQOO is slashing the price of both 4G and 5G variants of the iQOO 3.", "url": "https://www.gizchina.com/2020/04/24/iqoo-3-4g-and-5g-variants-get-a-price-cut-in-india/", "urlToImage": null, "publishedAt": "2020-04-24T14:56:55Z", "content": "Earlier this year, Vivo announced that it has cut the ties from its sub-brand iQOO. This way, the company would be able to act as a separate company and the first step would be launching a powerful Global campaign taking India as a key market. The company ann… [+1202 chars]"}, {"source": {"id": null, "name": "Searchengineland.com"}, "author": "https://www.facebook.com/barryschwartz", "title": "New free version of Google Shopping rolling out now - Search Engine Land", "description": "It is now rolling out and should be fully live in the US by early next week.", "url": "https://searchengineland.com/new-free-version-of-google-shopping-rolling-out-now-333589", "urlToImage": null, "publishedAt": "2020-04-24T13:52:00Z", "content": "Google’s new free version of Google Shopping is now rolling out. A Google spokesperson has confirmed with Search Engine Land that this has begun to roll out. This does not mean it is fully rolled out and all U.S. searchers will see it immediately, but by earl… [+741 chars]"}, {"source": {"id": null, "name": "Gsmarena.com"}, "author": "Michail", "title": "Here WeGo Maps comes to Huawei App Gallery - GSMArena.com news - GSMArena.com", "description": "Full turn-by-turn navigation available in over 100 countries.", "url": "https://www.gsmarena.com/here_wego_maps_comes_to_huawei_app_gallery-news-42854.php", "urlToImage": null, "publishedAt": "2020-04-24T13:51:02Z", "content": "Since losing its access to Google Mobile Services (GMS) nearly a year ago, Huawei has been looking for ways to expand its app portfolio through the App Gallery store. Now, it got a serious addition with Here WeGo Maps (formerly Here Maps) which is now availab… [+807 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Christopher Groux", "title": "'Borderlands 3' Claw & Order Guide - Echo Log Locations & Walkthrough - Newsweek", "description": "\"Borderlands 3\" has a new quest called Claw and Order. In this guide, we'll show the locations for every Echo Log you need to find.", "url": "https://www.newsweek.com/borderlands-3-claw-order-guide-echo-log-locations-walkthrough-1500009", "urlToImage": null, "publishedAt": "2020-04-24T13:20:10Z", "content": "Borderlands 3 Revenge of the Cartels event is officially live, and that means there are new quests for players to enjoy. One such mission, called Claw and Order, seems to be giving players trouble. In this guide we'll reveal the locations of all three Echo Lo… [+1711 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jon Porter", "title": "Telegram adding secure group video calls this year - The Verge", "description": "Messaging app Telegram is developing a group video calling service that’s due to be launched later this year. It announced the plans alongside the news that the service now boasts 400 million monthly active users.", "url": "https://www.theverge.com/2020/4/24/21234254/telegram-messaging-app-group-video-calling-security-usability", "urlToImage": null, "publishedAt": "2020-04-24T13:10:11Z", "content": "The messaging service now has 400 million monthly active users\r\nIllustration by Alex Castro / The Verge\r\nMessaging app Telegram is developing a group video calling service thats due to be launched later this year, the company announced today. It says that cur… [+1733 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "Microsoft Surface Earbuds could finally ship next month - India Today", "description": "Microsoft is reportedly planning to release the Surface Earbuds next month.", "url": "https://www.indiatoday.in/technology/news/story/microsoft-surface-earbuds-could-finally-ship-next-month-1670682-2020-04-24", "urlToImage": null, "publishedAt": "2020-04-24T12:47:32Z", "content": "Microsoft's take on Apple AirPods is releasing into the European markets next month. The Microsoft Surface Earbuds will be available to purchase in Germany, followed by a global release, at a price of EUR 199 (approximately Rs 16,500), according to a new repo… [+2127 chars]"}, {"source": {"id": null, "name": "Techspot.com"}, "author": "Rob Thubron", "title": "Malwarebytes steps into the VPN space with WireGuard-based service - TechSpot", "description": "Available now for Windows 7 and higher—Mac, Android, iOS, and Chrome OS are coming soon—Malwarebytes Privacy costs $59.99 per year. You can also get it bundled with a 1-year license of Malwarebytes Premium for $89.99, saving buyers $49.99. Both options&hellip;", "url": "https://www.techspot.com/news/84974-malwarebytes-steps-vpn-space-wireguard-based-service.html", "urlToImage": null, "publishedAt": "2020-04-24T12:37:00Z", "content": "In brief: Malwarebytes is joining the list of antivirus companies that also offer a VPN. Called Malwarebytes Privacy, the service uses a newer and faster protocol: WireGuard. \r\nAvailable now for Windows 7 and higherMac, Android, iOS, and Chrome OS are coming … [+1527 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Auto Desk", "title": "Mustang's electric SUV avatar suffers delivery delay due to Covid-19: Reports - Hindustan Times", "description": "Ford had unveiled Mustang Mach-E in a glitzy ceremony in the US in November of 2019..The SUV with an electric heart claims to be quicker than a Porsche Macan..Ford hopes to challenge the dominance of Tesla in markets like Norway, US and China.", "url": "https://auto.hindustantimes.com/auto/cars/mustang-s-electric-suv-avatar-suffers-delivery-delay-due-to-covid-19-reports-41587730739248.html", "urlToImage": null, "publishedAt": "2020-04-24T12:34:55Z", "content": "Ford made waves around the world when it showcased the electric SUV version of the world's best-selling sports car for decades. While some felt that the new vehicle was a disgrace to the lineage and legacy of Mustang, the Mustang Mach-E was a sure-shot show o… [+1834 chars]"}, {"source": {"id": null, "name": "Gsmarena.com"}, "author": "Yordan", "title": "Kuo: Apple to launch 3rd gen AirPods in Q1 2021 - GSMArena.com news - GSMArena.com", "description": "New AirPods Pro should be expected a year later - Q1 2022.", "url": "https://www.gsmarena.com/kuo_apple_to_launch_3rd_gen_airpods_in_q1_2021-news-42852.php", "urlToImage": null, "publishedAt": "2020-04-24T12:02:01Z", "content": "Apple is planning to start mass production of new AirPods at the end of 2020. This was revealed by the analyst Ming-Chi Kuo where he revealed the earphones will arrive in Q1 2021.\r\nThe note to investors, quoted by Apple Insider, also revealed the second-gen A… [+686 chars]"}, {"source": {"id": null, "name": "Sammobile.com"}, "author": "SamMobile", "title": "One way Galaxy Note 20 might not fall behind some competing flagships - SamMobile", "description": "Qualcomm has no intention to manufacture a Snapdragon 865+ variant this year, according to a recent report citing the head ...", "url": "https://www.sammobile.com/news/one-way-galaxy-note-20-might-not-fall-behind-competing-flagships/", "urlToImage": null, "publishedAt": "2020-04-24T11:24:34Z", "content": "Qualcomm has no intention to manufacture a Snapdragon 865+ variant this year, according to a recent report citing the head of Meizu Technology Marketing, Wan Zhiqiang. And although this may be disappointing news for tech enthusiasts, it could actually work in… [+1396 chars]"}, {"source": {"id": null, "name": "Gizchina.com"}, "author": null, "title": "All OnePlus 8 Models Are Out Of Stock: Popularity Exceeded Expectations - Gizchina.com", "description": "The OnePlus 8 and its Pro variant are considered to be new-gen flagships smartphones. But their current popularity have exceeded all expectations.", "url": "https://www.gizchina.com/2020/04/24/all-oneplus-8-models-are-out-stock-popularity-exceeded-expectations/", "urlToImage": null, "publishedAt": "2020-04-24T11:23:53Z", "content": "Just recently, the new-gen OnePlus 8 series flagship smartphones have been announced at a price of 3,999 yuan ($565). After the first sale, the entire network’s sales in one minute exceeded 100 million yuan ($14.12 million). In recent days, OnePlus Technology… [+1388 chars]"}, {"source": {"id": null, "name": "Gsmarena.com"}, "author": "Michail", "title": "Realme X3 SuperZoom clears Bluetooth SIG certification - GSMArena.com news - GSMArena.com", "description": "This is the fourth certification for the upcoming Realme phone.", "url": "https://www.gsmarena.com/realme_x3_superzoom_clears_bluetooth_sig_certification-news-42851.php", "urlToImage": null, "publishedAt": "2020-04-24T11:13:02Z", "content": "Realme\u0092s X3 has been in our rumor mill since the beginning of the month. We\u0092re expecting a vanilla X3 as well as an X3 SuperZoom which was spotted in several listings earlier this month. Now we have yet another sighting of the X3 SuperZoom which was spotted i… [+670 chars]"}, {"source": {"id": null, "name": "Indiatoday.in"}, "author": null, "title": "India Today League PUBG Mobile Invitational 2020 Day 2: Team IND claim second successive Chicken Dinner on Day 2 - India Today", "description": "India Today League PUBG Mobile Invitational 2020 Day 2: Team IND emerged as the winner of the 4th match on Day 2 to claim their second consecutive chicken dinner. Earlier, team Hydra clinched back-to-back chicken dinners.", "url": "https://www.indiatoday.in/sports/story/india-today-league-pubg-mobile-invitational-2020-day-2-live-1670485-2020-04-24", "urlToImage": null, "publishedAt": "2020-04-24T11:07:41Z", "content": "Hello and Welcome to the live updates of the Day 2 action of India Today League PUBG Mobile Invitational 2020\r\n5:21 pm IST: Team IND have come with another impressive performance to win their second back to back chicken dinner with total 6 kills in the 4th ma… [+10235 chars]"}, {"source": {"id": null, "name": "Gizchina.com"}, "author": null, "title": "Xiaomi Redmi K30i Render Images Leaked, Reveals Two Fewer Cameras Than K30 - Gizchina.com", "description": "Xiaomi is expected to soon announce the Redmi K30i smartphone which is supposed to be an affordable mid-range 5G smartphone from the brand.", "url": "https://www.gizchina.com/2020/04/24/xiaomi-redmi-k30i-render-images-leaked-reveals-two-fewer-cameras-than-k30/", "urlToImage": null, "publishedAt": "2020-04-24T11:00:12Z", "content": "Xiaomi‘s sub-brand Redmi is currently working on its next mid-range flagship smartphone dubbed Redmi K30i. A couple of days ago, we reported that the phone will come with 48MP primary sensor. Well, the device has now been part of yet another leak revealing so… [+1515 chars]"}, {"source": {"id": null, "name": "Gizmodo.co.uk"}, "author": null, "title": "Apple iPhone SE: First Look Review - Gizmodo UK", "description": "Being able to get the best phone processor on the market in a sub-£500 phone is a real power move by Apple.", "url": "https://www.gizmodo.co.uk/2020/04/apple-iphone-se-first-look-review/", "urlToImage": null, "publishedAt": "2020-04-24T11:00:00Z", "content": "Last year, Google turned the mid-range phone market on its head by introducing the ludicrously-priced and well-specced Pixel 3a. A few other brands have followed suit since then, but none have been quite as exciting as the new iPhone SE. Now it truly seems li… [+9454 chars]"}, {"source": {"id": null, "name": "Hindustantimes.com"}, "author": "HT Correspondent", "title": "Facebook data of over 267 million users leaked on Dark Web: Report - Hindustan Times", "description": "The database leaked on dark  web contains details of nearly 309 Facebook users.", "url": "https://www.hindustantimes.com/tech/facebook-data-of-over-267-million-users-leaked-on-dark-web-report/story-g3anJputolgCaKUAQUQKgK.html", "urlToImage": null, "publishedAt": "2020-04-24T09:59:05Z", "content": "Facebook is in trouble again and this time around it is for a data breach that has led to the personal data of over 267 million users being sold on the dark web.\r\nAccording to a report by the cybersecurity firm Sophos, which is based on the findings of anothe… [+1217 chars]"}, {"source": {"id": null, "name": "Nokiapoweruser.com"}, "author": null, "title": "Official Nokia Security+OS update tracker updated again (April 20) with April Security update details for all devices - Nokiapoweruser", "description": "The official Security+OS update tracker page for Nokia smartphones has been again updated on April 20, 2020, by Nokia Mobile (HMD) with details about the availability or unavailability of the April…", "url": "https://nokiapoweruser.com/official-nokia-securityos-update-tracker-updated-again-april-20-with-april-security-update-details-for-all-devices/", "urlToImage": null, "publishedAt": "2020-04-24T09:43:33Z", "content": "The official Security+OS update tracker page for Nokia smartphones has been again updated on April 20, 2020, by Nokia Mobile (HMD) with details about the availability or unavailability of the April Security update 2020 for all Nokia smartphones. As you may be… [+1198 chars]"}, {"source": {"id": null, "name": "Republicworld.com"}, "author": "Kunal Gaurav", "title": "Google Meet rolls out major features to take on Zoom video conferencing app - Republic World - Republic World", "description": "While video conferencing platform Zoom’s popularity skyrocketed amid COVID-19 lockdowns, Google Meet has started rolling out an updated version to take it on.", "url": "https://www.republicworld.com/technology-news/apps/google-meet-rolls-out-major-feature-to-take-on-zoom-video-conferencing.html", "urlToImage": null, "publishedAt": "2020-04-24T09:41:09Z", "content": "While video conferencing platform Zoom’s popularity skyrocketed amid COVID-19 lockdowns, Google Meet has started rolling out an updated version to compete with it. Though Zoom became extremely popular for videoconferencing during social distancing measures, i… [+2205 chars]"}, {"source": {"id": null, "name": "Gsmarena.com"}, "author": "Yordan", "title": "Xiaomi Mi A3 once again is receiving Android 10 update - GSMArena.com news - GSMArena.com", "description": "No, you\u0092re not having a deja vu - this is the fourth time.", "url": "https://www.gsmarena.com/xiaomi_mi_a3_once_again_receiving_android_10_update-news-42849.php", "urlToImage": null, "publishedAt": "2020-04-24T09:12:02Z", "content": "Nothing in the world is certain except death, taxes and Xiaomi Mi A series phones having troubles with major Android updates. According to users on Reddit, some Xiaomi Mi A3 units are receiving an Android 10 new update, which is different from the previous th… [+474 chars]"}, {"source": {"id": null, "name": "Indiatvnews.com"}, "author": "IANS", "title": "Google Assistant will now prompt you to say complete sentences for better results - India TV News", "description": "Google Assistant has received new changes for better user experience. Read on to know what is new", "url": "https://www.indiatvnews.com/technology/news-google-assistant-new-feature-see-what-they-is-it-610862", "urlToImage": null, "publishedAt": "2020-04-24T09:07:46Z", "content": "You can also adjust Google Assistant sensivity\r\nGoogle has introduced smarter ways to fine-tune Google Assistant to better tailor it for your environment and desired responsiveness at home. Now, when you set up Voice Match, Google Assistant will prompt you to… [+1768 chars]"}, {"source": {"id": null, "name": "Indianexpress.com"}, "author": "Bloomberg", "title": "Apple aims to sell Macs with its own chips starting in 2021 - The Indian Express", "description": "Apple is preparing to release at least one Mac with its own chip next year, according to the people. But the initiative to develop multiple chips, codenamed Kalamata, suggests the company will transition more of its Mac lineup away from current supplier Intel…", "url": "https://indianexpress.com/article/technology/laptops/apple-aims-to-sell-macs-with-its-own-chips-starting-in-2021-6377214/", "urlToImage": null, "publishedAt": "2020-04-24T08:34:43Z", "content": "By: Bloomberg | \r\nPublished: April 24, 2020 1:56:23 pm\r\n(Image: Bloomberg)Apple Inc is planning to start selling Mac computers with its own main processors by next year, relying on designs that helped popularize the iPhone and iPad, according to people famili… [+6384 chars]"}, {"source": {"id": null, "name": "Androidauthority.com"}, "author": null, "title": "The Realme X50m delivers 5G, 120Hz on the cheap - Android Authority", "description": "The Realme X50m 5G packs one hell of a punch for the price.", "url": "https://www.androidauthority.com/realme-x50m-5g-1110859/", "urlToImage": null, "publishedAt": "2020-04-24T01:31:48Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Travis Scott's Astroworld Concert Live on Fortnite with 100 Thieves | HYPEBEAST Exclusive - HYPEBEAST", "description": "JUMP STRAIGHT TO CONCERT AT: 36:34 NEW SONG AT: 44:23 Watch Travis Scott's Astroworld concert live on Fortnite with Ceice from 100 Thieves for a HYPEBEAST ex...", "url": "https://www.youtube.com/watch?v=XgeRLTx_qqc", "urlToImage": null, "publishedAt": "2020-04-24T00:00:53Z", "content": "JUMP STRAIGHT TO CONCERT AT: 36:34NEW SONG AT: 44:23\r\nWatch Travis Scott's Astroworld concert live on Fortnite with Ceice from 100 Thieves for a HYPEBEAST exclusive.\r\nFor up-to-date news and more: http://HYPEBEAST.com\r\nSubscribe to our channel: https://www.yo… [+241 chars]"}, {"source": {"id": null, "name": "Macrumors.com"}, "author": "Juli Clover", "title": "Apple Now Has an Official TikTok Account, But No Videos Posted Yet - MacRumors", "description": "Apple appears to have created an official account on popular social networking app TikTok, which is a platform designed to allow users to share short...", "url": "https://www.macrumors.com/2020/04/23/apple-tiktok-account/", "urlToImage": null, "publishedAt": "2020-04-23T21:39:53Z", "content": "Apple appears to have created an official account on popular social networking app TikTok, which is a platform designed to allow users to share short videos.\r\nApple's account can be accessed through the username @apple on the TikTok website and within the Tik… [+1092 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Eddie Makuch", "title": "Xbox Series X Logo Trademarked: See The Stylish \"X\" Here - GameSpot", "description": "Take a look at what could be the logo for Microsoft's Xbox Series X.", "url": "https://www.gamespot.com/articles/xbox-series-x-logo-trademarked-see-the-stylish-x-h/1100-6476353/", "urlToImage": null, "publishedAt": "2020-04-23T20:34:00Z", "content": "Microsoft appears to be setting the stage for another Xbox Series X reveal. On April 16, the company filed a new trademark application for the next-generation console that, among other things, included what appears to be the console's logo.\r\nThe trademark app… [+2041 chars]"}, {"source": {"id": null, "name": "Gizchina.com"}, "author": null, "title": "Motorola Edge and Edge+ first photo samples surface in the web - Gizchina.com", "description": "Here are the first official photo samples taken with recently released Motorola Edge and Edge+. The company itself shared them.", "url": "https://www.gizchina.com/2020/04/23/motorola-edge-and-edge-are-in-for-the-first-photo-samples/", "urlToImage": null, "publishedAt": "2020-04-23T19:42:55Z", "content": "Motorola has finally taken the wraps of its flagship series with the release of Motorola Edge and Edge+. Both handsets come with a 6.7-inch AMOLED Endless Edge display with a 90Hz refresh rate. However, they differ in chipset, battery, and camera array. The E… [+1120 chars]"}, {"source": {"id": null, "name": "Nextplatform.com"}, "author": null, "title": "Locking Down Linux For The Enterprise - The Next Platform", "description": "Security has always been important for datacenter operators, but the days of putting a ring of protection around the datacenter and then walking away", "url": "https://www.nextplatform.com/2020/04/23/locking-down-linux-for-the-enterprise/", "urlToImage": null, "publishedAt": "2020-04-23T19:13:24Z", "content": "Security has always been important for datacenter operators, but the days of putting a ring of protection around the datacenter and then walking away satisfied in the knowledge that the data and applications therein were protected from outside forces are long… [+8627 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Jeet T Arya", "title": "Did Apple underclock the A13 Bionic processor in the iPhone SE? - Techradar", "description": "Benchmarks scores show a slower performance", "url": "https://www.techradar.com/news/did-apple-underclock-the-a13-bionic-processor-in-the-iphone-se", "urlToImage": null, "publishedAt": "2020-04-23T17:22:00Z", "content": "The iPhone 11 Pro Max and the iPhone SE are powered by the same A13 Bionic chipset, so you might expect that things would be the same in terms of performance.\r\nOur own iPhone SE review showed that the new handset didn't hit the heights of the iPhone 11 Pro Ma… [+2497 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Messenger Kids | Greg's Geek Fix - ABC Action News", "description": "Facebook has developed a kid-friendly messaging with important parental controls.", "url": "https://www.youtube.com/watch?v=LQwyzA_3C5I", "urlToImage": null, "publishedAt": "2020-04-23T16:04:07Z", "content": null}]}