{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Nintendolife.com"}, "author": "Nintendo Life", "title": "Animal Crossing Appears To Have Nerfed Tarantula And Scorpion Spawn Rates - Nintendo Life", "description": "Data mine of recent update reveals all", "url": "http://www.nintendolife.com/news/2020/04/animal_crossing_appears_to_have_nerfed_tarantula_and_scorpion_spawn_rates", "urlToImage": null, "publishedAt": "2020-04-25T04:45:00Z", "content": "Earlier this week, Nintendo rolled out Version 1.2.0 of Animal Crossing: New Horizons. It added Leif, Redd, new seasonal events, and the 'Bank of Nook' even lowered the interest rate for all savings accounts. These weren't the only significant changes, though… [+1286 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "NVIDIA RTX Voice Benchmark on GTX vs. RTX GPUs, Gaming Performance, & Voice Quality - Gamers Nexus", "description": "This benchmark tests NVIDIA RTX Voice for gaming performance impact, mostly to determine if RT hardware is even being used. 2080 Super, 2060, and GTX 1080 in...", "url": "https://www.youtube.com/watch?v=f_obMmLXlP4", "urlToImage": null, "publishedAt": "2020-04-25T04:03:07Z", "content": null}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Stephen Nellis", "title": "Showdown looms between Silicon Valley, U.S. states over contact tracing apps - Reuters", "description": "U.S. states promoting apps that could prove essential to ending the coronavirus lockdown may be headed for a showdown with the two Silicon Valley companies that control key software on 99% of smartphones over the collection of sensitive GPS location data.", "url": "https://www.reuters.com/article/us-health-coronavirus-usa-apps-idUSKCN22702F", "urlToImage": null, "publishedAt": "2020-04-25T01:56:24Z", "content": "SAN FRANCISCO (Reuters) - U.S. states promoting apps that could prove essential to ending the coronavirus lockdown may be headed for a showdown with the two Silicon Valley companies that control key software on 99% of smartphones over the collection of sensit… [+5217 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Oscar Gonzalez", "title": "Travis Scott event in Fortnite: How to watch the encore and find the Giant Astro Heads - CNET", "description": "The rapper dropped new tracks in a jaw-dropping concert. Catch the next show at midnight.", "url": "https://www.cnet.com/news/travis-scott-event-in-fortnite-how-to-watch-the-encore-and-find-the-giant-astro-heads/", "urlToImage": null, "publishedAt": "2020-04-25T01:02:37Z", "content": "Play some Fortnite and listen to a new track from Travis Scott.\r\nEpic Games\r\nFortnite events aren't only for players to check out new content from developer Epic Games. The popular battle royale game has also played host to multiple premieres and collaboratio… [+3718 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "", "title": "Android's upcoming call recording feature could be region restricted - Engadget", "description": "Android's upcoming call recording feature could be coming soon.", "url": "https://www.engadget.com/android-call-recording-003653130.html", "urlToImage": null, "publishedAt": "2020-04-25T00:52:32Z", "content": "The document went on to say that when you record a call for the first time, you’ll be advised that you’re responsible for complying with local laws (many regions require consent by all parties prior to call recording). It states: “When you start recording, th… [+866 chars]"}, {"source": {"id": null, "name": "Dexerto.com"}, "author": "Albert Petrosyan", "title": "Infinity Ward reveal early look at next Modern Warfare update patch notes - Dexerto", "description": "Infinity Ward's April 24 Community Update previews next week's patch, which will include some new playlists, a lot of bug fixes, and the new weapon mastery camo.", "url": "https://www.dexerto.com/call-of-duty/infinity-ward-reveal-early-look-at-next-modern-warfare-update-patch-notes-1357713", "urlToImage": null, "publishedAt": "2020-04-25T00:44:34Z", "content": "Developers Infinity Ward have released their latest weekly Community Update for Modern Warfare, giving players an early glimpse at what the April 28 patch will bring to multiplayer and Warzone battle royale.\r\nAs part of their effort to improve communication w… [+2839 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Xbox Series X Game Reveals “Won't Be Too Much of a Wait' Says Phil Spencer - IGN Daily Fix - IGN", "description": "In today's Daily Fix, it sounds like some Xbox Series X game reveals could be coming soon, Nintendo confirms a pretty big Switch hack, and Elijah Wood hangs ...", "url": "https://www.youtube.com/watch?v=Xtqtu3Qg4CM", "urlToImage": null, "publishedAt": "2020-04-24T23:30:45Z", "content": null}, {"source": {"id": null, "name": "9to5google.com"}, "author": null, "title": "You can now easily record Google 3D animals on Android - 9to5Google", "description": "Even before stay at home orders, AR objects in Google Search were already a fun way to bring the outside world in. Record Google 3D animals...", "url": "https://9to5google.com/2020/04/24/google-3d-animals-record/", "urlToImage": null, "publishedAt": "2020-04-24T23:21:25Z", "content": "Even before stay at home orders, AR objects in Google Search were already a fun way to bring the outside world indoors. A new feature rolling out to Android today lets you easily record Google 3D animals.\r\nThe “View in your space” feature allows life-sized 3D… [+1446 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Julie Muncy", "title": "Nintendo Confirms Some 160,000 Accounts Might've Been Hacked - WIRED", "description": "To counteract the hacking attempt, the company is temporarily disabling users' ability to access their accounts through the Nintendo Network ID system.", "url": "https://www.wired.com/story/nintendo-switch-hack/", "urlToImage": null, "publishedAt": "2020-04-24T23:06:37Z", "content": "Hello, and welcome once again to Replay, WIRED's weekly roundup of videogame news. This week, we've got a hack you should know about, a delay, and some cool new tech. Let's get to it.\r\nEarlier today, Nintendo confirmed that a recent hacking attempt on its sys… [+3527 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Naruto Shippuden: Ultimate Ninja Storm 4 Road to Boruto - Official Switch Trailer - IGN", "description": "Experience the Fourth Great Ninja War and see through the conclusion of the Naruto Shippuden storyline in the game, available now on Nintendo Switch. Check o...", "url": "https://www.youtube.com/watch?v=H_T9pPijWPc", "urlToImage": null, "publishedAt": "2020-04-24T22:43:40Z", "content": null}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Nick Statt", "title": "OnePlus lays off employees in Europe less than two weeks after OnePlus 8 launch - The Verge", "description": "OnePlus just launched its OnePlus 8 and OnePlus 8 Pro flagships less than two weeks ago, but the company is now downsizing its offices in parts of Europe. The offices hardest hit with the layoffs include the UK, France, and Germany, with OnePlus reportedly mo…", "url": "https://www.theverge.com/2020/4/24/21235215/oneplus-layoffs-europe-regional-downsizing-uk-france-germany", "urlToImage": null, "publishedAt": "2020-04-24T22:26:07Z", "content": "It appears unrelated to the coronavirus\r\nPhoto by Vjeran Pavic / The Verge\r\nOnePlus launched its latest flagship phones, the OnePlus 8 and OnePlus 8 Pro, less than two weeks ago, but the Chinese phone maker is now laying off employees in regional offices thro… [+1293 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Dave Johnson", "title": "The Apple Watch Series 5 is $100 off at Amazon right now - CNET", "description": "Get the 40mm Apple Watch Series 5 (GPS and cellular) in silver for $399.", "url": "https://www.cnet.com/news/the-apple-watch-series-5-is-100-off-at-amazon-right-now/", "urlToImage": null, "publishedAt": "2020-04-24T22:21:19Z", "content": "Apple\r\nThe Apple Watch Series 5 isn't a remarkable upgrade from the Series 4, and for that reason alone, I know it's not everyone's favorite Apple smartwatch. But it's my personal fave (thanks in no small part to the always-on display), and the first one I've… [+855 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "WebToon's Most Popular Series Cross Over in Mobile Game | CBR - CBR - Comic Book Resources", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiQmh0dHBzOi8vd3d3LmNici5jb20vd2VidG9vbnMtcG9wdWxhci1zZXJpZXMtY3Jvc3NvdmVyLW1vYmlsZS1nYW1lL9IBRmh0dHBzOi8vd3d3LmNici5jb20vd2VidG9vbnMtcG9wdWxhci1zZXJpZXMtY3Jvc3NvdmVyLW1vYmlsZS1nYW1lL2FtcC8?oc=5", "urlToImage": null, "publishedAt": "2020-04-24T22:15:00Z", "content": null}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Morgan Hines", "title": "CDC: Frozen raspberries were culprit behind 2019 norovirus outbreak on multiple cruises - USA TODAY", "description": "Smoothies: Nutritious, delicious – and according to the CDC, the source of a norovirus outbreak that infected hundreds of cruise passengers in 2019.", "url": "https://www.usatoday.com/story/travel/cruises/2020/04/24/cdc-report-raspberries-caused-2019-norovirus-outbreak-cruises/3018721001/", "urlToImage": null, "publishedAt": "2020-04-24T21:58:07Z", "content": "Here is everything you need to know about the highly contagious norovirus.\r\nUSA TODAY\r\nPassengers contemplating boarding another cruise after the coronavirus pandemic might already be planning to pass up the buffet next time they sail due to social-distancing… [+3987 chars]"}, {"source": {"id": null, "name": "Tomsguide.com"}, "author": "Adam Ismail", "title": "LG Velvet release date, price, specs and rumors - Tom's Guide", "description": "The LG Velvet is intended to reboot the company's phones with a focus on design. Here's everything we know so far.", "url": "https://www.tomsguide.com/news/lg-velvet-release-date-price-specs-and-rumors", "urlToImage": null, "publishedAt": "2020-04-24T21:43:15Z", "content": "The upcoming LG Velvet is an important device for the Korean tech giant. In recent years, LG's smartphone arm hasn't delivered the kind of critical or commercial success necessary to stay relevant. A confused lineup of flagships with similar designs and specs… [+6025 chars]"}, {"source": {"id": null, "name": "Tmonews.com"}, "author": "Alex Wagner", "title": "iPhone SE launches today, Costco rolls out deal for T-Mobile customers - TmoNews", "description": "A little over a week after Apple surprised us with an updated iPhone SE, the new device has officially launche", "url": "https://www.tmonews.com/2020/04/iphone-se-launch-today-costco-deal-t-mobile-customers/", "urlToImage": null, "publishedAt": "2020-04-24T21:33:27Z", "content": "A little over a week after Apple surprised us with an updated iPhone SE, the new device has officially launched.\r\nThe iPhone SE is in stock and ready to ship at T-Mobile. The 64GB and 256GB have estimated ship dates of April 24-27, but you may have to wait a … [+1585 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Austen Goslin", "title": "Here are all of Valorant’s competitive ranks - Polygon", "description": "Riot has revealed Valorant’s competitive ranks, when the Ranked mode will go live, how many friends you can team up with, and ranked progression.", "url": "https://www.polygon.com/2020/4/24/21234911/valorant-rated-mode-release-date-ranks-competitive-matchmaking-teams", "urlToImage": null, "publishedAt": "2020-04-24T21:27:16Z", "content": "Riot has finally revealed the first details about Valorants upcoming ranked mode. Since Valorants closed beta started a few weeks ago, there has only been one mode: Unrated. But in the games next patch, Rated mode will be added, allowing players to earn ranks… [+2775 chars]"}, {"source": {"id": null, "name": "Jalopnik.com"}, "author": "Justin T. Westbrook", "title": "My New Favorite YouTuber Designed The Ferrari F430 - Jalopnik", "description": "The guy who designed the reinvented Mini, drew some McLarens and made the Ferrari F430 is now just making videos from his house about design, and they’re wonderful.", "url": "https://jalopnik.com/my-new-favorite-youtuber-designed-the-ferrari-f430-1843051028", "urlToImage": null, "publishedAt": "2020-04-24T21:11:56Z", "content": "The guy who designed the reinvented Mini, drew some McLarens and made the Ferrari F430 is now just making videos from his house about design, and theyre wonderful. \r\nThe only reason I write for Jalopnik today is because I used to search new cars and new car d… [+1335 chars]"}, {"source": {"id": null, "name": "Androidpolice.com"}, "author": null, "title": "T-Mobile confirms it's going to brick 5G on most Sprint 5G phones post-merger - Android Police", "description": "T-Mobile will shut down Sprint's 5G network in order to rework its spectrum into its own 5G grid. While those with a Galaxy S20 series device on Sprint", "url": "https://www.androidpolice.com/2020/04/24/t-mobile-confirms-its-going-to-brick-5g-on-most-sprint-5g-phones-post-merger/", "urlToImage": null, "publishedAt": "2020-04-24T21:06:31Z", "content": "This story was originally published 2020/04/22 11:47am PDTon Apr 22, 2020 and last updated 2020/04/24 1:56pm PDTApr 24, 2020. \r\nT-Mobile will shut down Sprint's 5G network in order to rework its spectrum into its own 5G grid. While those with a Galaxy S20 ser… [+3283 chars]"}, {"source": {"id": null, "name": "Threatpost.com"}, "author": "Tara Seals", "title": "Latest Apple Text-Bomb Crashes iPhones via Message Notifications - Threatpost", "description": "Sindhi-language characters can crash iPhones and other iOS/macOS devices if a victim views texts, Twitter posts or messages within various apps containing them.", "url": "https://threatpost.com/apple-text-bomb-crashes-iphones-message-notifications/155144/", "urlToImage": null, "publishedAt": "2020-04-24T20:41:00Z", "content": "Sindhi-language characters can crash iPhones and other iOS/macOS devices if a victim views texts, Twitter posts or messages within various apps containing them.Apple devices are vulnerable to a “text bomb” attack where simply looking at messages or posts cont… [+3338 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Eddie Makuch", "title": "Call Of Duty: Warzone Cheaters Now Only Play Each Other - GameSpot", "description": "Infinity Ward is working to clean up the CoD: Warzone battlefield on PS4, Xbox One, and PC; here's how.", "url": "https://www.gamespot.com/articles/call-of-duty-warzone-cheaters-now-only-play-each-o/1100-6476342/", "urlToImage": null, "publishedAt": "2020-04-24T20:15:00Z", "content": "Cheaters can ruin any online game, and Infinity Ward is taking drastic steps to reduce their influence in Call of Duty: Modern Warfare and Call of Duty: Warzone. The solution is simple: Make the cheaters play against each other so they can all be miserable.\r\n… [+2082 chars]"}, {"source": {"id": null, "name": "Autoevolution.com"}, "author": "Mihnea Radu", "title": "Front-Engined Lamborghini Aventador Is the Anti-Corvette Statement - autoevolution", "description": "Putting the engine in the wrong place is one of the most interesting things happening in the sports car world right now. But where is the right place? Now that the Chevy Corvette has it in the same location as every Italian exotic, maybe it's time for Lamborg…", "url": "https://www.autoevolution.com/news/front-engined-lamborghini-aventador-is-the-anti-corvette-statement-142977.html", "urlToImage": null, "publishedAt": "2020-04-24T20:11:00Z", "content": "We're kidding. The Aventador is one of the most amazing machines ever, but it's getting a little old. It came out roughly four batman movies ago and has stayed alive only though numerous small updates.In this video, TheSketchMonkey raises the possibility that… [+1238 chars]"}, {"source": {"id": null, "name": "9to5mac.com"}, "author": null, "title": "Magic Keyboard for iPad Pro top features — the best iPad accessory ever [Video] - 9to5Mac", "description": "Hands-on with top features for the Magic Keyboard for iPad Pro. It's the best accessory for the iPad Pro, and turns it into a versatile laptop.", "url": "https://9to5mac.com/2020/04/24/magic-keyboard-for-ipad-pro-review-top-features-best-ipad-accessory-ever-video/", "urlToImage": null, "publishedAt": "2020-04-24T19:42:23Z", "content": "Two days ago the Magic Keyboard for the 11-inch iPad Pro landed on my desk. Ive been using it constantly since it first arrived, and although its not perfect, I absolutely love it.\r\nIts so good that I can easily say that this is the best iPad accessory in the… [+13185 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "", "title": "Telegram promises secure group video calls sometime this year - Engadget", "description": "Telegram says it will add secure group video calls in 2020.", "url": "https://www.engadget.com/telegram-secure-group-video-calls-142035892.html", "urlToImage": null, "publishedAt": "2020-04-24T19:41:19Z", "content": "While Telegram didn’t release many details about the feature, it appears to be taking a dig at Zoom, which is facing pressure to fix several privacy issues. In response, Zoom has created a security council and promised upgrades, but that won’t stop competitor… [+831 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "David Murphy", "title": "Are You Charging Your MacBook on the Wrong Side? - Lifehacker", "description": "Yes, you read that headline correctly. There is apparently a “right” way and a “wrong” way to connect devices to a MacBook with Thunderbolt/USB-C ports on both sides. Doing it wrong can affect your computer’s performance.", "url": "https://lifehacker.com/are-you-charging-your-macbook-on-the-wrong-side-1843045306", "urlToImage": null, "publishedAt": "2020-04-24T19:31:53Z", "content": "Yes, you read that headline correctly. There is apparently a right way and a wrong way to connect devices to a MacBook with Thunderbolt/USB-C ports on both sides. Doing it wrong can affect your computers performance.\r\nI recently encountered this knowledge on … [+3975 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Steve Watts", "title": "Nintendo Switch Shortages Reportedly Exacerbated By Automated Buyers - GameSpot", "description": "Buying bots may be contributing to or even causing persistent hardware shortages for Nintendo's handheld hybrid.", "url": "https://www.gamespot.com/articles/nintendo-switch-shortages-reportedly-exacerbated-b/1100-6476478/", "urlToImage": null, "publishedAt": "2020-04-24T19:19:00Z", "content": "In the weeks since the coronavirus pandemic began and much of the world has been confined to their separate houses, Nintendo Switch hardware has been notoriously difficult to find. This has been chalked up to increased demand as people look for ways to occupy… [+1388 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Phil Hornshaw", "title": "Where Is Xur In Destiny 2? Location And Exotic Items (April 24-28) - GameSpot", "description": "Grab some new Destiny 2 Exotics from Xur to help you to take the gold in the Guardian Games.", "url": "https://www.gamespot.com/articles/where-is-xur-in-destiny-2-location-and-exotic-item/1100-6476472/", "urlToImage": null, "publishedAt": "2020-04-24T19:05:00Z", "content": "Destiny 2's latest seasonal event, the Guardian Games, kicked off this week, providing a whole bunch of new bounties to complete as players face off to see which of Destiny's three classes is the best. The spirit of competition is nice, but winning is better-… [+3933 chars]"}, {"source": {"id": null, "name": "9to5mac.com"}, "author": null, "title": "Facebook launches ‘Messenger Rooms’ as a Zoom and Group FaceTime alternative - 9to5Mac", "description": "Facebook is out today with a new product to connect multiple people via video chat and compete with popular offerings like Zoom, Group FaceTime, Skype, Houseparty, and more. Detailed by TechCrunch, Facebook announced a number of messaging updates today with t…", "url": "https://9to5mac.com/2020/04/24/facebook-launches-messenger-rooms-as-a-zoom-and-group-facetime-alternative/", "urlToImage": null, "publishedAt": "2020-04-24T18:47:18Z", "content": "Facebook is out today with a new product to connect multiple people via video chat and compete with popular offerings like Zoom, Group FaceTime, Skype, Houseparty, and more.\r\nDetailed by TechCrunch, Facebook announced a number of messaging updates today with … [+3683 chars]"}, {"source": {"id": null, "name": "Kotaku.com"}, "author": "Ari Notis", "title": "The Good, The Bad, And The Annoying Of Borderlands 3’s “Revenge Of The Cartels” Event - Kotaku", "description": "It’s been less than a month since Borderlands 3’s latest big expansion landed with a bang, but vault hunters already have access to another brand-new playground in which they can fire 87 bazillion guns. It’s called Villa Ultraviolet. It’s drenched in neon and…", "url": "https://kotaku.com/the-good-the-bad-and-the-annoying-of-borderlands-3-s-1843045200", "urlToImage": null, "publishedAt": "2020-04-24T17:51:07Z", "content": "Its been less than a month since Borderlands 3s latest big expansion landed with a bang, but vault hunters already have access to another brand-new playground in which they can fire 87 bazillion guns. Its called Villa Ultraviolet. Its drenched in neon and gau… [+4793 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jay Peters", "title": "Samsung and Google are offering free phone repairs to health care workers through June 30th - The Verge", "description": "Samsung and Google are offering free phone repairs to health care workers and first responders helping fight COVID-19 in partnership with phone repair company uBreakiFix. If you’re eligible, you’ll be able to get free repairs through June 30th for phones from…", "url": "https://www.theverge.com/2020/4/24/21234668/samsung-google-ubreakifix-free-phone-repairs-healthcare-first-responder-galaxy-pixel", "urlToImage": null, "publishedAt": "2020-04-24T17:39:26Z", "content": "In collaboration with uBreakiFix\r\nPhoto by Brennan King / The Verge\r\nSamsung and Google are offering free phone repairs to health care workers and first responders to help support those frontline workers in the fight against COVID-19 (via9to5Google). The two … [+1247 chars]"}, {"source": {"id": null, "name": "Boingboing.net"}, "author": null, "title": "This AI's only function is to draw penises - Boing Boing", "description": "DICK-RNN is a recurrent neural network trained with 10,000 doodles of dicks. You start drawing a shape and the AI tries its best to finish it as a penis. Starting with the balls helps a lot. Try it…", "url": "https://boingboing.net/2020/04/24/this-ais-only-function-is-to.html", "urlToImage": null, "publishedAt": "2020-04-24T17:38:00Z", "content": "“The Angel, The Automobilist, and Eighteen Others” is a new collection of early drawings by eccentric illustrator and storyteller Edward Gorey (1925-2000). Over at The Comics Journal, Mark Dery, author of the Gorey biography Born to Be Posthumous, reviews the… [+1660 chars]"}, {"source": {"id": null, "name": "Trueachievements.com"}, "author": "Heidi Nicholas", "title": "Sci-fi adventure Deliver Us The Moon joins Xbox Game Pass and Game Pass for PC today - TrueAchievements", "description": "Deliver Us The Moon is a sci-fi action adventure title which draws inspiration from movies such as Interstellar, and which joins the Xbox Game Pass and Xbox Game Pass for PC services today as a day one addition.", "url": "https://www.trueachievements.com/n41593/deliver-us-the-moon", "urlToImage": null, "publishedAt": "2020-04-24T17:19:36Z", "content": "The Xbox team has been busy lately: just yesterday, they surprise-dropped the announcement that Red Dead Redemption 2 will join Xbox Game Pass in May. Before that, they announced new titles for Xbox Game Pass, along with several new titles for Xbox Game Pass … [+1728 chars]"}, {"source": {"id": null, "name": "Androidpolice.com"}, "author": "https://www.facebook.com/corbin.davenport.50", "title": "Sony WH-C710N review: Great noise-cancelling headphones for under $200 - Android Police", "description": "Sony makes some of the best noise-canceling headphones around, especially the WH-1000XM3 (which is overdue for a replacement). The WH1000XM3 is a premium", "url": "https://www.androidpolice.com/2020/04/24/sony-wh-ch710n-review/", "urlToImage": null, "publishedAt": "2020-04-24T17:00:43Z", "content": "Sony makes some of the best noise-canceling headphones around, especially the WH-1000XM3 (which is overdue for a replacement). The WH1000XM3 is a premium set of headphones that regularly goes for around $300, and competing products like the Bose QuietComfort … [+4387 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Daymare 1998 (Resident Evil 2 Tribute) - Official Console Launch Trailer - IGN", "description": "Daymare 1998, the Resident Evil 2 tribute game, finally arrives on PlayStation 4 and Xbox One on April 28th. Check out the official console launch trailer he...", "url": "https://www.youtube.com/watch?v=BiWnPEGvWcA", "urlToImage": null, "publishedAt": "2020-04-24T17:00:11Z", "content": null}, {"source": {"id": "ign", "name": "IGN"}, "author": "Matt Purslow", "title": "Final Fantasy 7 Remake Save Editor Makes Red XIII Playable - IGN Southeast Asia", "description": "Give a dog a role.", "url": "https://sea.ign.com/news/159860/final-fantasy-7-remake-save-editor-makes-red-xiii-playable", "urlToImage": null, "publishedAt": "2020-04-24T16:30:11Z", "content": "A new Final Fantasy 7 Remake save game file editor can make Red XIII a playable character, albeit one with significant limitations.\r\nThe save editor is the work of Xeeynamo, and is actually his Kingdom Hearts save editor updated with Final Fantasy 7 Remake op… [+1689 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Trials of Mana - Your Adventure Begins Trailer - Nintendo Switch - Nintendo", "description": "Trials of Mana is Available Now on Nintendo Switch! A Trials of Mana Demo is also available and free to download! Forces of darkness will stop at nothing to ...", "url": "https://www.youtube.com/watch?v=qq1CTFtJI38", "urlToImage": null, "publishedAt": "2020-04-24T16:00:30Z", "content": "Trials of Mana is Available Now on Nintendo Switch! A Trials of Mana Demo is also available and free to download!\r\nForces of darkness will stop at nothing to get their hands on the powerful Sword of Mana. Begin your adventures today, join your companions, and… [+463 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Christian de Looper", "title": "7 Of The Best Amazon Alexa Speakers - Forbes", "description": "Looking for a great speaker with arguably the smartest digital assistant, Alexa? Here are 7 of the best Amazon Alexa speakers out there.", "url": "https://www.forbes.com/sites/forbes-personal-shopper/2020/04/24/7-of-the-best-amazon-alexa-speakers/", "urlToImage": null, "publishedAt": "2020-04-24T16:00:00Z", "content": "Alexa is arguably the smartest digital assistant, and while Google Assistant also has a lot going for it, Alexa is the go-to for many users who dont have Android phones. There are a ton of Alexa speakers on the market, and while they all have the smart featur… [+4164 chars]"}, {"source": {"id": null, "name": "Macrumors.com"}, "author": "Mitchel Broussard", "title": "Deals: Verizon Still Offering Big Discounts on AirPods Pro and iPhone XS Cases - MacRumors", "description": "Verizon has a few ongoing deals to end this week, offering what remains to be one of the lowest prices we've seen on Apple's AirPods Pro at...", "url": "https://www.macrumors.com/2020/04/24/deals-verizon-airpods-pro/", "urlToImage": null, "publishedAt": "2020-04-24T14:27:19Z", "content": "Verizon has a few ongoing deals to end this week, offering what remains to be one of the lowest prices we've seen on Apple's AirPods Pro at $224.99, down from $249.00. This deal beats Amazon's own sale by about $10, and is the best available online right now.… [+1290 chars]"}, {"source": {"id": null, "name": "Tomsguide.com"}, "author": "Kate Kozuch", "title": "Zoom just got a killer feature to beat every video call app - Tom's Guide", "description": "Real-time transcription takes Zoom meetings to the next level", "url": "https://www.tomsguide.com/news/zoom-just-got-a-killer-feature-to-beat-every-video-call-app", "urlToImage": null, "publishedAt": "2020-04-24T14:09:00Z", "content": "Zoom calls are about to give the video conferencing service a serious edge over Google Hangouts, Microsoft Teams, and all the other best video chat apps battling for the loyalty of everyone working from home. \r\nOtter.ai, a real-time chat transcription service… [+2215 chars]"}, {"source": {"id": null, "name": "Destructoid.com"}, "author": "Chris Moyse", "title": "WWE confirms there will be no WWE 2K release this year - Destructoid", "description": "WWE confirms there will be no WWE 2K release this year", "url": "https://www.Destructoid.com/wwe-confirms-there-will-be-no-wwe-2k-release-this-year-588012.phtml", "urlToImage": null, "publishedAt": "2020-04-24T14:00:00Z", "content": "Count it Out\r\nWorld Wrestling Entertainment (WWE) has confirmed that it will not be releasing a video game in 2020, marking the first year in decades that the company will forego a digital replication of its squared circle action. The announcement was officia… [+1439 chars]"}, {"source": {"id": null, "name": "Electrek.co"}, "author": null, "title": "Ford might delay Mustang Mach-E launch, will update as production restarts - Electrek", "description": "Ford might delay the Mustang Mach-E launch amid the coronavirus pandemic and will give an updated timeline as it restarts its production facilities. The Mustang Mach-E is Ford’s first all-electric vehicle built from the ground up and one of the most anticipat…", "url": "https://electrek.co/2020/04/24/ford-delay-mustang-mach-e-launch-production-restart/", "urlToImage": null, "publishedAt": "2020-04-24T13:27:26Z", "content": "Ford might delay the Mustang Mach-E launch amid the coronavirus pandemic and will give an updated timeline as it restarts its production facilities.\r\nThe Mustang Mach-E is Ford’s first all-electric vehicle built from the ground up and one of the most anticipa… [+2960 chars]"}, {"source": {"id": null, "name": "Pushsquare.com"}, "author": "Push Square", "title": "Rumour: 'Gigantic' Horizon Zero Dawn 2 Will Feature Co-Op on PS5 - Push Square", "description": "Could be a separate mode", "url": "http://www.pushsquare.com/news/2020/04/rumour_gigantic_horizon_zero_dawn_2_will_feature_co-op_on_ps5", "urlToImage": null, "publishedAt": "2020-04-24T12:45:00Z", "content": "Horizon: Zero Dawn was a purely single player adventure on PlayStation 4, but it looks like developer Guerilla Games has big plans for its next-generation sequel. According to Video Games Chronicle, a reliable source, the PlayStation 5 follow-up will include … [+1133 chars]"}, {"source": {"id": null, "name": "Rockpapershotgun.com"}, "author": null, "title": "XCOM: Chimera Squad is out now, and it's half-price - Rock Paper Shotgun", "description": "It’s time to put down your world-saving guns and pick up your alien-policemen batons, because XCOM: Chimera Squad is out.", "url": "https://www.rockpapershotgun.com/2020/04/24/xcom-chimera-squad-is-out-now-and-its-half-price/", "urlToImage": null, "publishedAt": "2020-04-24T10:17:00Z", "content": "It’s time to put down your world-saving guns and pick up your alien-policing batons, because XCOM: Chimera Squad is out. XCOPS takes a big sidewards leap away from the main series, boiling down turn-based combat into single-room encounters. Developers Firaxis… [+2356 chars]"}, {"source": {"id": null, "name": "Milehighreport.com"}, "author": "Tim Lynch", "title": "Denver Broncos: Alabama WR Jerry Jeudy highlights - Mile High Report", "description": "The Denver Broncos have a new wide receiver in Jerry Jeudy. Here are his Alabama highlight reels. Enjoy!", "url": "https://www.milehighreport.com/2020/4/24/21233874/jerry-jeudy-highlights", "urlToImage": null, "publishedAt": "2020-04-24T09:34:37Z", "content": "The Denver Broncos have a new wide receiver in Jerry Jeudy. Here are his Alabama highlight reels. Enjoy!"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Olivia Harris", "title": "Elijah Wood Apparently Came To Someone’s Animal Crossing: New Horizons Island - GameSpot", "description": "Elijah Wood too plays the stalk market in Animal Crossing: New Horizons.", "url": "https://www.gamespot.com/articles/elijah-wood-apparently-visited-an-animal-crossing-/1100-6476454/", "urlToImage": null, "publishedAt": "2020-04-24T08:52:30Z", "content": "The turnip trade has become a hot commodity in Animal Crossing: New Horizons, with players able to make millions in bells thanks to the community working together and opening their islands when they get a spicy price. Everyday people on Twitter are tweeting h… [+1403 chars]"}, {"source": {"id": null, "name": "Tomsguide.com"}, "author": "Roland Moore-Colyer", "title": "PS5 will be crushed by Xbox Series X power, says ex-Sony developer - Tom's Guide", "description": "PS5 is a ‘beast’ but can’t beat Xbox Series X, according to a former PlayStation developer", "url": "https://www.tomsguide.com/news/ps5-will-be-crushed-by-xbox-series-x-power-says-ex-sony-developer", "urlToImage": null, "publishedAt": "2020-04-24T07:11:26Z", "content": "A former Sony PlayStation developer has heaped praise on Microsofts Xbox Series X, claiming that the consoles extra power may send Sonys PS5 packing. \r\nThe developer in question is Chris Grannell, whos worked for Horizon: Zero Dawn studio Guerrilla Games and … [+2182 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": null, "title": "What's 'Zoom fatigue'? Here's why video calls can be so exhausting - msnNOW", "description": "With people taking more working meetings and social gatherings to video conference platforms, people are beginning to feel \"Zoom fatigue.\"", "url": "https://www.usatoday.com/story/news/nation/2020/04/23/zoom-fatigue-video-calls-coronavirus-can-make-us-tired-anxious/3010478001/", "urlToImage": null, "publishedAt": "2020-04-24T05:30:00Z", "content": "A few Zoom calls for work in the morning. Logging your children into their virtual classroom around lunchtime. And a FaceTime call with your parents at the end of the day.\r\nAs social distancing remains in effect across the country during the coronavirus pande… [+41700 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Gordon Kelly", "title": "Google Just Gave Millions Of Users A Reason To Quit Chrome, Windows 10 - Forbes", "description": "Google has revealed an unfixable problem which may force you to pick between Windows 10 and Chrome.", "url": "https://www.forbes.com/sites/gordonkelly/2020/04/23/google-chrome-critical-security-exploit-windows-10-upgrade-warning-update-chrome-browser/", "urlToImage": null, "publishedAt": "2020-04-24T00:36:00Z", "content": "Google is always improving Chrome and it recently issued a brilliant (if long overdue) upgrade. That said, there have also been some recent controversial changes, security problems and data concerns and now Google has detailed a serious new problem in Chrome … [+2782 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew Webster", "title": "Travis Scott’s first Fortnite concert was surreal and spectacular - The Verge", "description": "Rapper Travis Scott performed a surreal concert inside of the battle royale game Fortnite, utilizing trippy visuals to create a musical performance that could only be possible in a digital space.", "url": "https://www.theverge.com/2020/4/23/21233637/travis-scott-fortnite-concert-astronomical-live-report", "urlToImage": null, "publishedAt": "2020-04-24T00:29:22Z", "content": "Sicko mode\r\nIf theres one thing you can say about Fortnites live events, its that they keep getting more ambitious. From the original rocket launch to the mech vs. kaiju battle to the black hole that wiped out an entire island, each new event is more elaborat… [+3098 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Ewan Spence", "title": "Apple Leak Reveals Radical New MacBook - Forbes", "description": "Apple's first ARM powered MacBook is expected to launch next year, as Tim Cook moves away from Intel's grasp.", "url": "https://www.forbes.com/sites/ewanspence/2020/04/23/apple-macbook-pro-arm-intel-new-leak-rumor-specs-release-date/", "urlToImage": null, "publishedAt": "2020-04-23T23:53:07Z", "content": "Apple may be preparing to update the 13-inch and 16-inch MacBook Pro machines to Intels tenth-generation processors, but its longstanding project to bring ARM power to its MacOS platform gathers pace, with reports today that a release in 2021 is on the cards.… [+5450 chars]"}, {"source": {"id": null, "name": "Bleepingcomputer.com"}, "author": "Sergiu Gatlan", "title": "Windows 10 KB4549951 update fails to install, causes BSODs - BleepingComputer", "description": "The Windows 10 KB4549951 ​​​​​​​cumulative update is reportedly failing to install and is causing blue screens of death (BSOD) after installation reboots, among other issues, according to user reports.", "url": "https://www.bleepingcomputer.com/news/microsoft/windows-10-kb4549951-update-fails-to-install-causes-bsods/", "urlToImage": null, "publishedAt": "2020-04-23T23:11:05Z", "content": "The Windows 10 KB4549951 cumulative update is reportedly failing to install and is causing blue screens of death (BSOD) after installation reboots, among other issues, according to user reports.\r\nKB4549951 is a cumulative update with security fixes released a… [+6269 chars]"}, {"source": {"id": null, "name": "Venturebeat.com"}, "author": "Jeff Grubb", "title": "Your Super Mario Maker 2 levels are a lot less cute in World Maker - VentureBeat", "description": "Super Mario Maker 2 just got its final update, and the new World Maker mode highlights a problem: no one knows how to make a fun Mario course.", "url": "https://venturebeat.com/2020/04/23/your-super-mario-maker-2-levels-are-a-lot-less-cute-in-world-maker/", "urlToImage": null, "publishedAt": "2020-04-23T21:44:17Z", "content": "Super Mario Maker 2s latest update reveals that almost no one knows how to make a fun Mario stage. This was once easy to ignore, because thats not actually what you should go to Super Mario Maker for. Instead, this series has always provided players with a fa… [+2272 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Patricia Hernandez", "title": "Death Stranding fan spent 15 hours trying to spell out name with pee - Polygon", "description": "After discovering that Death Stranding lets you leave imprints in the snow, one determined fan spent hours trying to write out his name with the game’s infamous pee mechanic — but not without plenty of roadblocks along the way.", "url": "https://www.polygon.com/2020/4/23/21233323/death-stranding-pee-name-hideo-kojima-ps4-sony", "urlToImage": null, "publishedAt": "2020-04-23T20:48:16Z", "content": "To boldly go where no man has gone before"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Andrew Hoyle", "title": "iPhone 11 Pro vs. OnePlus 8 Pro cameras: My quarantine walk photo comparison - CNET", "description": "We put the two phones side-by-side to see which can take the best photos in daylight and night.", "url": "https://www.cnet.com/news/iphone-11-pro-vs-oneplus-8-pro-cameras-my-quarantine-walk-photo-comparison/", "urlToImage": null, "publishedAt": "2020-04-23T20:40:00Z", "content": "OnePlus has taken the wraps off its latest flagship, the OnePlus 8 Pro. Along with its silky blue finish, the phone packs a multicamera setup that includes a standard zoom, a super wide-angle lens and a 3x zoom. It impressed Lynn La in her full OnePlus 8 Pro … [+6477 chars]"}, {"source": {"id": null, "name": "Dexerto.com"}, "author": "Paul Cot", "title": "Trainers reporting increased shiny rates for Pokemon Go Buddy Up event - Dexerto", "description": "Trainers are encountering the likes of Feebas' shiny form much more frequently thanks to the Pokemon Go Buddy Up event.", "url": "https://www.dexerto.com/pokemon/trainers-reporting-increased-shiny-rates-for-pokemon-go-buddy-up-event-1357138", "urlToImage": null, "publishedAt": "2020-04-23T20:30:17Z", "content": "Trainers are currently in the middle of enjoying the bonuses that the Pokemon Go Buddy Up event has to offer. In addition to these though, increased shiny rates are also being reported.\r\nIn particular Feebas shiny encounters seem to have increased. The Magika… [+2551 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Michael McWhertor", "title": "Overwatch’s communication wheel now lets you customize the voice lines - Polygon", "description": "Players can now choose which voice lines are included in Overwatch’s communication wheel, with new additions like “press the objective,” “fall back,” and “sorry.”", "url": "https://www.polygon.com/2020/4/23/21233221/overwatch-communication-wheel-custom-voice-lines-update-patch", "urlToImage": null, "publishedAt": "2020-04-23T20:15:58Z", "content": "Players can now choose which voice lines are included in the wheel"}, {"source": {"id": null, "name": "Macrumors.com"}, "author": "Juli Clover", "title": "Demo: Using Apple Music on a Samsung TV - MacRumors", "description": "Samsung and Apple have partnered to bring the Apple Music app to Samsung TVs, and as of today, the Apple Music service and dedicated app can be...", "url": "https://www.macrumors.com/2020/04/23/apple-music-samsung-tv-demo/", "urlToImage": null, "publishedAt": "2020-04-23T19:49:03Z", "content": "Samsung and Apple have partnered to bring the Apple Music app to Samsung TVs, and as of today, the ‌Apple Music‌ service and dedicated app can be accessed on Samsung TV sets manufactured in 2018 and later.\r\nSubscribe to the MacRumors YouTube channel for more … [+1894 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Michael McWhertor", "title": "Sega Saturn mascot Segata Sanshiro may have just returned, with an evil twist - Polygon", "description": "We enter the dark middle chapter of Segata Sanshiro’s return in a new commercial from Sega featuring its new Japanese mascot, Sega Shiro.", "url": "https://www.polygon.com/2020/4/23/21233064/sega-segata-shiro-mascot-japan", "urlToImage": null, "publishedAt": "2020-04-23T19:07:52Z", "content": "The dark middle chapter of Segata Sanshiros return"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Samit Sarkar", "title": "Super Mega Baseball 3 release date set for mid-May - Polygon", "description": "The goofy sports game Super Mega Baseball 3 will be released May 13 on Nintendo Switch, PC, PS4, and Xbox One, Metalhead Software announced. The studio also released a new gameplay video showing off improvements to the action on the field.", "url": "https://www.polygon.com/2020/4/23/21231872/super-mega-baseball-3-release-date-switch-ps4-xbox-one-pc-gameplay-video", "urlToImage": null, "publishedAt": "2020-04-23T18:40:23Z", "content": "Check out gameplay improvements in new video"}, {"source": {"id": null, "name": "Jalopnik.com"}, "author": "Andrew P. Collins", "title": "Porsche's $1,500 Retro Radio Means Old 911s Can Have OEM Touchscreens With CarPlay - Jalopnik", "description": "Porsche’s going to sell factory-branded touchscreen infotainment systems in both single and double-DIN slot sizes for those of you with older P-cars who can’t live without Siri, Spotify, et al. for the duration of a drive. I bet Stuttgart sells every single o…", "url": "https://jalopnik.com/porsches-1-500-retro-radio-means-air-cooled-911s-can-h-1843025294", "urlToImage": null, "publishedAt": "2020-04-23T18:20:12Z", "content": "Porsches going to sell factory-branded touchscreen infotainment systems in both single and double-DIN slot sizes for those of you with older P-cars who cant live without Siri, Spotify, et al. for the duration of a drive. I bet Stuttgart sells every single one… [+2286 chars]"}, {"source": {"id": null, "name": "Techspot.com"}, "author": "Shawn Knight", "title": "Extreme overclocker pushes dated AMD FX-8350 beyond 8.1GHz - TechSpot", "description": "Renowned German overclocker Roman “der8auer” Hartung recently revisited an old CPU to see if a newer motherboard and a voltage controller could help him squeeze even more performance out of his already impressive AMD FX-8350 processor.", "url": "https://www.techspot.com/news/84960-extreme-overclocker-pushes-dated-amd-fx-8350-beyond.html", "urlToImage": null, "publishedAt": "2020-04-23T17:34:40Z", "content": "In a nutshell: Overclockers are a curious bunch. Much like automotive enthusiasts, they're obsessed with squeezing the absolute most performance out of a given piece of hardware or platform, even if it means going beyond what is practical or efficient. \r\nReno… [+1765 chars]"}, {"source": {"id": null, "name": "Uploadvr.com"}, "author": "www.facebook.com/ianhmltn", "title": "Supernatural Takes Oculus Quest Fitness A Few Steps Further Than Beat Saber - UploadVR", "description": "Supernatural is a new fitness and workout app for Oculus Quest that takes a few steps to be tuned for exercise and wireless not seen in other VR apps.", "url": "https://uploadvr.com/supernatural-fitness-quest/", "urlToImage": null, "publishedAt": "2020-04-23T17:00:00Z", "content": "After playing Supernatural this week, my legs are sore to a degree unmatched by Beat Saber, Pistol Whip, BoxVR, OhShape, or any other VR app.\r\nIt is easy to see the influence of those earlier VR games on the new exercise and fitness software from Within, but … [+2141 chars]"}, {"source": {"id": null, "name": "Macworld.com"}, "author": "Alexandria Haslam", "title": "This iPhone 8 Plus is way cheaper than the iPhone SE right now - Macworld", "description": "Verizon's Visible is selling the 64GB iPhone 8 Plus for $360 today and you get a $100 MasterCard gif card to boot.", "url": "https://www.macworld.com/article/3540190/this-iphone-8-plus-is-way-cheaper-than-the-iphone-se-right-now.html", "urlToImage": null, "publishedAt": "2020-04-23T16:11:00Z", "content": "If you like the price of the iPhone SE but don't want such a small screen, we've got a great deal for you: Verizon's Visible is selling an unlocked iPhone 8 Plus for $360 todayRemove non-product link, more than $200 off its usual price. And to sweeten the dea… [+1311 chars]"}, {"source": {"id": null, "name": "Motor1.com"}, "author": "Anthony Alaniz", "title": "New BMW M440i Convertible, M4 Coupe Spied Testing At The Green Hell - Motor1 ", "description": "The new 4 Series could debut this June.", "url": "https://www.motor1.com/news/414409/bmw-4-series-spied-nurburgring/", "urlToImage": null, "publishedAt": "2020-04-23T15:26:51Z", "content": "Development for the various BMW 4 Series variants continues as the automaker takes two different versions to the Nürburgring. New videos show both cars at the famous track, and both are still rocking camouflage. However, we can see the large, controversial gr… [+1531 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Nicole Carpenter", "title": "In Other Waters is about exploring an alien ocean through an AI interface - Polygon", "description": "In Other Waters, from developer Jump Over The Age, is a unique game that takes place entirely on a map interface. It’s out now on Windows PC and Nintendo Switch.", "url": "https://www.polygon.com/2020/4/23/21231689/in-other-waters-fellow-traveler-impressions-windows-pc-nintendo-switch", "urlToImage": null, "publishedAt": "2020-04-23T15:00:50Z", "content": "I know so much about Gliese 677Cc, the planetary setting of In Other Waters. The alien ocean is a weird, wonderful ecosystem of strange stalks, spores, and creatures scattered among its depths. \r\nIve noticed the odd behavior of the oceans flora and fauna. Ive… [+5874 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "What is XCOM 2? - Everything you need to know about XCOM 2 Collection - Nintendo Switch - Nintendo", "description": "Before you jump into the XCOM 2 Collection for Nintendo Switch on May 29, watch this video explaining everything you need to know about XCOM 2. Learn more: h...", "url": "https://www.youtube.com/watch?v=fGA9F8HhRIs", "urlToImage": null, "publishedAt": "2020-04-23T15:00:16Z", "content": "Before you jump into the XCOM 2 Collection for Nintendo Switch on May 29, watch this video explaining everything you need to know about XCOM 2.\r\nLearn more: https://www.nintendo.com/games/detail...\r\n#XCOM#XCOM2#NintendoSwitch\r\nSubscribe for more Nintendo fun!… [+309 chars]"}, {"source": {"id": "ign", "name": "IGN"}, "author": "Joe Skrebels", "title": "Xbox Series X Loads Gears 5 Four Times Faster Than Xbox One - IGN", "description": "The Coalition's Mike Rayner gives a practical sense of how much faster Series X can be.", "url": "https://www.ign.com/articles/xbox-series-x-loading-times-gears-5", "urlToImage": null, "publishedAt": "2020-04-23T14:13:07Z", "content": "Gears 5 loads 4 times quicker on Xbox Series X than on Xbox One - without a single change to the game's code.Speaking to Windows Central about the benefits of the new hardware, The Coalition's technical director Mike Rayner quantified just how much the studio… [+1577 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Torchlight III - Forts Trailer - Gematsu", "description": "https://gematsu.com/tag/torchlight-iii https://gematsu.com/gallery/torchlight-iii Torchlight III ---------------- Platforms: PlayStation 4, Xbox One, PC Publ...", "url": "https://www.youtube.com/watch?v=fD-KTCLvKq0", "urlToImage": null, "publishedAt": "2020-04-23T13:16:00Z", "content": "https://gematsu.com/tag/torchlight-iiihttps://gematsu.com/gallery/torchligh...\r\nTorchlight III----------------Platforms: PlayStation 4, Xbox One, PCPublisher: Perfect World EntertainmentDeveloper: Echtra Games"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Moving Out Review - IGN", "description": "Enjoyably tense and frequently hysterical, Moving Out is a must play for fans of same-screen multiplayer games. Reviewed by Tristan Ogilvie on Nintendo Switc...", "url": "https://www.youtube.com/watch?v=vHXb2QsCChQ", "urlToImage": null, "publishedAt": "2020-04-23T12:00:36Z", "content": "Enjoyably tense and frequently hysterical, Moving Out is a must play for fans of same-screen multiplayer games. Reviewed by Tristan Ogilvie on Nintendo Switch. Also available on PlayStation 4, Xbox One and PC."}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "All 5 Golden Wrench Locations | FORTNITE CHALLENGE WEEK 10 SEASON 2 - GamesRadar", "description": "Another week means another bunch of challenges, but the one that you’ll need help with the most this week is finding all of the Golden Wrenches. Here’s where...", "url": "https://www.youtube.com/watch?v=Q5MjRJlMfSY", "urlToImage": null, "publishedAt": "2020-04-23T08:50:23Z", "content": null}]}