{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Comicbook.com"}, "author": "Tyler Fischer", "title": "Ninja Calls Out Fortnite and Its \"Brain-Dead\" Players - ComicBook.com", "description": "Fortnite is in a bad place. Just earlier this month #RIPFornite was trending on Twitter. Meanwhile, the game's biggest streamers and content creators have also been lashing out against the game lately. Included in the latter has been Ninja, one of the most fa…", "url": "https://comicbook.com/gaming/news/ninja-fortnite-mixer-stream-rage-brain-dead-players/", "urlToImage": null, "publishedAt": "2020-04-26T04:05:11Z", "content": "Fortnite is in a bad place. Just earlier this month #RIPFornite was trending on Twitter. Meanwhile, the game's biggest streamers and content creators have also been lashing out against the game lately. Included in the latter has been Ninja, one of the most fa… [+2231 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Desire Athow", "title": "This 4TB PCIe SSD can make your Windows laptop feel more like a MacBook Pro - TechRadar", "description": "Assuming you have a compatible laptop, that is", "url": "https://www.techradar.com/news/this-4tb-pcie-ssd-can-make-your-windows-laptop-feel-more-like-a-macbook-pro", "urlToImage": null, "publishedAt": "2020-04-26T03:00:00Z", "content": "The Apple MacBook Pro 16 still holds bragging rights when it comes to the maximum storage capacity available in a traditional portable laptop. \r\nApple uses a proprietary approach, plugging memory chips directly into the motherboard to reach a whopping 8TB of … [+1494 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "", "title": "'Battlefield V' will get one last standalone update this summer - Engadget", "description": "'Battlefield V' is winding down with a final standalone update that should arrive in June.", "url": "https://www.engadget.com/battlefield-v-last-update-in-summer-013240631.html", "urlToImage": null, "publishedAt": "2020-04-26T02:32:34Z", "content": "DICE and EA are bringing Battlefield V’s steady stream of updates to a close. The developers have announced (via Rock Paper Shotgun) that there will be one last standalone update to the WWII shooter this summer. It’s not clear what the update will contain bes… [+391 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Rhett Allain", "title": "Wait a Second, That Table Has No Legs! - The-Latest News", "description": "How to build “magic,” gravity-defying structures—with Legos, kite string, and physics.", "url": "https://www.wired.com/story/wait-that-table-has-no-legs/", "urlToImage": null, "publishedAt": "2020-04-26T02:10:20Z", "content": "Really, this doesn't tell us much. All it says is that the upward-pulling tension has to be equal to the two downward forces (gravity and the other tension).\r\nBut what about the sum of the torques? If the object is in equilibrium, you can pick any point on th… [+2262 chars]"}, {"source": {"id": null, "name": "Comicbook.com"}, "author": "Matthew Aguilar", "title": "WWE: What The 2K Series Needs to Return to Glory - ComicBook.com", "description": "The road was a bit rough for WWE's 2K series this year, as WWE 2K20 had a lot of hype but failed do deliver the sales bar from previous games. It was also constantly under fire for glitches and bugs, especially at launch, all contributing to a $2 million doll…", "url": "https://comicbook.com/gaming/news/wwe-2k-series-what-it-needs-to-fix/", "urlToImage": null, "publishedAt": "2020-04-26T02:02:07Z", "content": "The road was a bit rough for WWE's 2K series this year, as WWE 2K20 had a lot of hype but failed do deliver the sales bar from previous games. It was also constantly under fire for glitches and bugs, especially at launch, all contributing to a $2 million doll… [+12960 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Ewan Spence", "title": "Apple Leak Reveals Radical New MacBook - Forbes", "description": "Apple's first ARM powered MacBook is expected to launch next year, as Tim Cook moves away from Intel's grasp.", "url": "https://www.forbes.com/sites/ewanspence/2020/04/25/apple-macbook-pro-arm-intel-new-leak-rumor-specs-release-date/", "urlToImage": null, "publishedAt": "2020-04-25T23:36:11Z", "content": "Apple may be preparing to update the 13-inch and 16-inch MacBook Pro machines to Intels tenth-generation processors, but its longstanding project to bring ARM power to its MacOS platform gathers pace, with reports today that a release in 2021 is on the cards.… [+6658 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Vanessa Hand Orellana", "title": "2 Apple Watch features that earned the smartwatch a permanent spot on my wrist - CNET", "description": "I started out a skeptic, but the Apple Watch eventually won me over. Here's what it took for me to take it seriously as a fitness tracker and smartwatch.", "url": "https://www.cnet.com/news/apple-watch-features-that-earned-smartwatch-permanent-spot-on-wrist/", "urlToImage": null, "publishedAt": "2020-04-25T23:09:24Z", "content": "Angela Lang/CNET\r\nI haven't always been a fan of the Apple Watch. I bought one as soon as it went on sale in 2015 hoping it would blow me away, but it ended up spending more time in my drawer than on my wrist. It took three more years and the addition of two … [+8182 chars]"}, {"source": {"id": null, "name": "Androidpolice.com"}, "author": "https://www.facebook.com/corbin.davenport.50", "title": "OnePlus 6/6T receive OxygenOS 10.3.3 following end of Open Beta program - Android Police", "description": "OnePlus just announced the end of the OxygenOS Open Beta program for the 6 and 6T, but the company promised that regular stable updates would continue.", "url": "https://www.androidpolice.com/2020/04/25/oneplus-6-6t-receive-oxygenos-10-3-3-following-end-of-open-beta-program/", "urlToImage": null, "publishedAt": "2020-04-25T22:31:20Z", "content": "OnePlus just announced the end of the OxygenOS Open Beta program for the 6 and 6T, but the company promised that regular stable updates would continue. Sure enough, both phones are now receiving a new system update, containing a handful of bug fixes and secur… [+1307 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "", "title": "Twitch has a problem with non-stop 'Valorant' streams - Engadget", "description": "Twitch channels have turned to running non-stop 'Valorant' streams to reel in gamers desperate for beta keys.", "url": "https://www.engadget.com/valorant-non-stop-twitch-streams-202140642.html", "urlToImage": null, "publishedAt": "2020-04-25T22:20:22Z", "content": "Valorant has been a hit on Twitch, but it’s now clear that success isn’t always for the right reasons. Kotaku has documented a slew of Twitch streams that are running 24/7 solely to attract people looking for Valorantbeta keys that drop after watching for at … [+698 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Matthew Forde", "title": "Sony slip-ups: ahead of the PS5, we look back at the PlayStation tech that just didn't work - TechRadar India", "description": "They can't all be winners", "url": "https://www.techradar.com/news/sony-slip-ups-ahead-of-the-ps5-we-look-back-at-the-playstation-tech-that-just-didnt-work", "urlToImage": null, "publishedAt": "2020-04-25T22:00:42Z", "content": "As we motor towards the next generation of consoles, Sony currently holds all of the cards and will be looking to build upon the monumental success it found during the current generation. Its sometimes easy to forget just how well the PlayStation 4 has sold, … [+6395 chars]"}, {"source": {"id": null, "name": "Delish.com"}, "author": "Kristin Salaky", "title": "No, You Don't Actually Have To Wipe Down Your Groceries - Yahoo Lifestyle", "description": "But you should definitely follow these other guidelines.", "url": "https://www.delish.com/food-news/a32251718/should-you-wipe-down-your-food-packages-coronavirus/", "urlToImage": null, "publishedAt": "2020-04-25T21:17:00Z", "content": "As social distancing continues amid the COVID-19 outbreak, even things as simple as grocery shopping have become stressful. You probably know proper protocol for inside the grocery store (keep your distance, bring a paper list, get in and out as quickly as po… [+4119 chars]"}, {"source": {"id": null, "name": "Comicbook.com"}, "author": "Tyler Fischer", "title": "New Assassin's Creed Game Will Be Revealed \"Soon\" - ComicBook.com", "description": "The new Assassin's Creed game will be revealed soon, according to a prominent industry insider. Last year, the long-running and popular stealth-action series, but increasingly action-RPG series, skipped its annual release pattern, opting to not release a new …", "url": "https://comicbook.com/gaming/news/assassins-creed-game-new-ragnarok-kingdom-reveal-rumor/", "urlToImage": null, "publishedAt": "2020-04-25T21:04:58Z", "content": "The new Assassin's Creed game will be revealed soon, according to a prominent industry insider. Last year, the long-running and popular stealth-action series, but increasingly action-RPG series, skipped its annual release pattern, opting to not release a new … [+2303 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Locking Villagers In Cages In Animal Crossing: New Horizons - The Vile Villager Episode 3 - GameSpot", "description": "On this episode of The Vile VIllager, Rob and Jake round up their villagers, trap them behind fences, and craft a maze riddled with Pitfall's for them to nav...", "url": "https://www.youtube.com/watch?v=yEhZi9AyhDM", "urlToImage": null, "publishedAt": "2020-04-25T21:00:13Z", "content": "On this episode of The Vile VIllager, Rob and Jake round up their villagers, trap them behind fences, and craft a maze riddled with Pitfall's for them to navigate.\r\nThe Vile Villager has returned, and this time they won't be satisfied with simply toying with … [+1050 chars]"}, {"source": {"id": null, "name": "Hypebeast.com"}, "author": "Rebecca Kim", "title": "Text Bug Is Causing iPhones and iOS Devices to Crash - HYPEBEAST", "description": "Just a notification with the text bomb can lock up phones.", "url": "https://hypebeast.com/2020/4/apple-text-bug-crash-iphones-ios-devices", "urlToImage": null, "publishedAt": "2020-04-25T20:22:00Z", "content": "Apple appears to be suffering similar software issues that arose on iOS 11 a few years ago when an Indian language character from a text message would crash iPhones. This time around, it seems that a certain string of Sindhi characters sent via text can lock … [+1029 chars]"}, {"source": {"id": null, "name": "Windowscentral.com"}, "author": "Asher Madan", "title": "Naughty Dog's Sylvia Chambers joins Microsoft's The Initiative as Character Animator - Windows Central", "description": "Today, Twitter's \"Klobrille\" noticed that Sylvia Chambers has joined Microsoft's new studio, The Initiative, as Character Animator. Chambers is known for her work at Sony's \"Naughty Dog,\" EA's \"DICE,\" and other teams.", "url": "https://www.windowscentral.com/naughty-dogs-sylvia-chambers-joins-microsofts-initiative-character-animatorr-animator", "urlToImage": null, "publishedAt": "2020-04-25T20:21:16Z", "content": "Source: Sony\r\n<ul><li>Character animations are some of the most important aspects of a game.</li><li>Sylvia Chambers recently joined Microsoft's \"The Initiative\" studio as Character Animator.</li><li>Chambers has worked at Naughty Dog, DICE, and more. </li><l… [+1555 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Fallout 76: Wastelanders Review - IGN", "description": "Fallout 76: Wastelanders reviewed by David Jagneaux on PlayStation 4 Pro. Also available on PC and Xbox One. \"With the Wastelanders update, Fallout 76 has ta...", "url": "https://www.youtube.com/watch?v=U-uDLErALu0", "urlToImage": null, "publishedAt": "2020-04-25T19:51:32Z", "content": "Fallout 76: Wastelanders reviewed by David Jagneaux on PlayStation 4 Pro. Also available on PC and Xbox One.\r\n\"With the Wastelanders update, Fallout 76 has taken a solid step in the right direction after its dire launch. New human NPCs bring a healthy dose of… [+633 chars]"}, {"source": {"id": "crypto-coins-news", "name": "Crypto Coins News"}, "author": null, "title": "Twitch Streamer Alinity Gets Bullied By A Bunch of Voyeuristic Creeps - CCN.com", "description": "Go ahead and call me a simp, bullies. You're the pathetic weirdos gawking at Alinity, then bullying her with calls for Twitch to ban her.", "url": "https://www.ccn.com/twitch-streamer-alinity-gets-bullied-by-a-bunch-of-voyeuristic-creeps/", "urlToImage": null, "publishedAt": "2020-04-25T19:49:00Z", "content": "<ul><li>Popular Twitch streamer Alinity had a nip slip Friday.</li><li>An army of goons immediately began harassing her on social media.</li><li>Alinity isnt the problem; the issue is the bullying of female gamers.</li></ul>In a Friday broadcast, popular Twit… [+3359 chars]"}, {"source": {"id": null, "name": "Business-standard.com"}, "author": "Mike Isaac & Sheera Frenkel | NYT", "title": "Zooms sudden popularity sets off scramble in rivals - Business Standard", "description": "Facebook, Google and other behemoths are training their sights on Silicon Valley's company of the moment", "url": "https://www.business-standard.com/article/international/zoom-s-sudden-popularity-sets-off-scramble-in-rivals-120042600008_1.html", "urlToImage": null, "publishedAt": "2020-04-25T19:28:16Z", "content": "As people turned in droves to the video chatting app Zoom in recent weeks, the buzz caught Facebook’s attention. Inside the social network, that immediately set off a scramble.\r\nMark Zuckerberg, Facebook’s chief executive, ordered employees to ramp up and foc… [+4014 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Stephen Shankland", "title": "Microsoft tells Chrome users to switch to its Edge browser on Outlook - CNET", "description": "Microsoft's web browser and email service are \"better together,\" the company argues.", "url": "https://www.cnet.com/news/microsoft-tells-chrome-users-to-switch-to-its-edge-browser-on-outlook/", "urlToImage": null, "publishedAt": "2020-04-25T19:18:49Z", "content": "Illustration by Stephen Shankland/CNET\r\nFor years, Google has placed prominent pop-up ads on its web properties suggesting people switch to Google's Chrome browser, saying they'll get better performance, features and security. Now Microsoft is trying the same… [+1886 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Alison DeNisco Rayome", "title": "Facebook Messenger Rooms: How to use the free Zoom video chat competitor - CNET", "description": "Up to 50 people can chat in a room at once, with no time limit.", "url": "https://www.cnet.com/how-to/facebook-messenger-rooms-how-to-use-the-free-zoom-video-chat-competitor/", "urlToImage": null, "publishedAt": "2020-04-25T18:43:15Z", "content": "Facebook Messenger Rooms is set to compete with Zoom and other group video chat apps.\r\nFacebook\r\nFacebook is getting in on the group-video-chat game with a new feature called Messenger Rooms, which seems set to compete with services like Zoom, Skype and Micro… [+2907 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "", "title": "US blames China for hacks allegedly targeting COVID-19 research - Engadget", "description": "US officials are pinning a surge of hacks on a Chinese bid to steal COVID-19 treatment and vaccine research.", "url": "https://www.engadget.com/us-blames-china-for-covid-19-research-hacks-171706759.html", "urlToImage": null, "publishedAt": "2020-04-25T18:39:46Z", "content": "China hasn’t responded to the accusations so far, and it’s notable that other countries have been accused of exploiting the new coronavirus. Reuters, for instance, asserted that Iranian hackers had tried to compromise email accounts for WHO workers. Russia an… [+413 chars]"}, {"source": {"id": null, "name": "Kotaku.com"}, "author": "Zack Zwiezen", "title": "New GTA Online Missions Are All About Preparing For A Recession - Kotaku", "description": "Grand Theft Auto Online received a new update a few days ago that added six new missions. These missions are all about an old-time GTA Online character, Gerald, and his attempts to get ready for an upcoming recession. Five of them are good and one of them is …", "url": "https://kotaku.com/new-gta-online-missions-are-all-about-preparing-for-a-r-1843048824", "urlToImage": null, "publishedAt": "2020-04-25T18:12:59Z", "content": "Grand Theft Auto Online received a new update a few days ago that added six new missions. These missions are all about an old-time GTA Online character, Gerald, and his attempts to get ready for an upcoming recession. Five of them are good and one of them is … [+2804 chars]"}, {"source": {"id": null, "name": "Nintendolife.com"}, "author": "Nintendo Life", "title": "The Pokémon Company Apologises For Featuring Dewgong In The Fourth Episode Of Twilight Wings - Nintendo Life", "description": "As it's not available in Sword and Shield", "url": "http://www.nintendolife.com/news/2020/04/the_pokemon_company_apologises_for_featuring_dewgong_in_the_fourth_episode_of_twilight_wings", "urlToImage": null, "publishedAt": "2020-04-25T17:30:00Z", "content": "@PcTV\r\nIt is true, I may have exaggerated, however, the overreaction is not a joke, of course, not always, so I mentioned \"sometimes\", that they seriously do a drama for something that is seriously not worth doing (example, madness by Blythe from Smash bros, … [+601 chars]"}, {"source": {"id": null, "name": "Sammobile.com"}, "author": "SamMobile", "title": "Galaxy S20 update with display green tint fix now widely available - SamMobile", "description": "Not every new flagship smartphone is perfect out of the box. And sometimes, issues can be introduced to new devices ...", "url": "https://www.sammobile.com/news/galaxy-s20-update-with-display-green-tint-fix-now-widely-available/", "urlToImage": null, "publishedAt": "2020-04-25T17:13:22Z", "content": "Not every new flagship smartphone is perfect out of the box. And sometimes, issues can be introduced to new devices after launch because of botched software updates, which is exactly what happened with the Galaxy S20 series recently: Galaxy S20, S20+, and S20… [+1391 chars]"}, {"source": {"id": null, "name": "Dotesports.com"}, "author": "Dylan Ladd", "title": "Fizz's Legends of Runeterra champion card revealed - Dot Esports", "description": "Elude your opponent’s strategies with the Tidal Trickster.", "url": "https://dotesports.com/lor/news/fizzs-legends-of-runeterra-card-and-followers-revealed", "urlToImage": null, "publishedAt": "2020-04-25T17:09:45Z", "content": "Legends of Runeterras card reveal season continues with the newest region, Bilgewater, and a familiar trickster that torments his adversaries by evading their strategies, Fizz.\r\nFizz is the champion that Riotunveiled in todays teasers. He’s a one-cost champio… [+1047 chars]"}, {"source": {"id": null, "name": "Mspoweruser.com"}, "author": "https://www.facebook.com/profile.php?id=100034991436602", "title": "Massive Discount: Microsoft's Surface Laptop 2 is $699 cheaper today - MSPoweruser - MSPoweruser", "description": "If you’re on the lookout for a light and premium Windows 10 PC, Surface Laptop 2 deserves your attention. The Laptop 2 is also $699 cheaper today, so it’s now even easier to recommend. Microsoft  Surface Laptop 2 (Intel Core i7, 16GB RAM, 1TB) is now availabl…", "url": "https://mspoweruser.com/huge-discount-on-surface-laptop-2-at-amazon/", "urlToImage": null, "publishedAt": "2020-04-25T17:00:50Z", "content": "If you’re on the lookout for a light and premium Windows 10 PC, Surface Laptop 2 deserves your attention. The Laptop 2 is also $699 cheaper today, so it’s now even easier to recommend.\r\nMicrosoft  Surface Laptop 2 (Intel Core i7, 16GB RAM, 1TB) is now availab… [+1099 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Mark Mills", "title": "Our love of the cloud is making a green energy future impossible - TechCrunch", "description": "Mark Mills Contributor Share on Twitter Mark Mills is the author of the book, “Digital Cathedrals: The Information Infrastructure Era,” and is a senior fellow at the Manhattan Institute, a Faculty Fellow at Northwestern University’s McCormick School of Engine…", "url": "http://techcrunch.com/2020/04/25/our-love-of-the-cloud-is-making-a-green-energy-future-impossible/", "urlToImage": null, "publishedAt": "2020-04-25T16:30:28Z", "content": "An epic number of citizens are video-conferencing to work in these lockdown times. But as they trade in a gas-burning commute for digital connectivity, their personal energy use for each two hours of video is greater than the share of fuel they would have con… [+13078 chars]"}, {"source": {"id": null, "name": "Motor1.com"}, "author": "Chris Okula", "title": "This Cayman GT4 Video Could Easily Be A Porsche Ad - Motor1 ", "description": "These are the ads we want to see.", "url": "https://www.motor1.com/news/414779/porsche-cayman-gt4-drive-commercial/", "urlToImage": null, "publishedAt": "2020-04-25T16:27:10Z", "content": "The Porsche Cayman GT4 was an earth-shattering machine when it first debuted in 2016. Here we have the familiar mid-engined Cayman sports car but with an engine from the 911 Carrera S and a GT badge usually reserved for Porches top of the line 911s. The Cayma… [+1584 chars]"}, {"source": {"id": null, "name": "Eurogamer.net"}, "author": "Wesley Yin-Poole", "title": "This stunning Minecraft city was created by a team of professional builders - Eurogamer.net", "description": null, "url": "https://www.eurogamer.net/articles/2020-04-25-this-stunning-minecraft-city-was-created-by-a-team-of-professional-builders", "urlToImage": null, "publishedAt": "2020-04-25T15:31:00Z", "content": "The Minecraft community is known for its incredible creations - but this stunning city was built by the pros.\r\nCity of Orario is an incredibly detailed 1500x1500 recreation of The Labyrinth City of Orario from the DanMachi anime. Its centrepiece is a massive … [+1151 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Sarah Perez", "title": "This Week in Apps: Facebook takes on Houseparty, Fortnite comes to Google Play, contact tracing API - TechCrunch", "description": "We continue to look at how the coronavirus outbreak is impacting mobile apps, including details about Apple and Google's contact tracing API, and more.", "url": "http://techcrunch.com/2020/04/25/this-week-in-apps-facebook-takes-on-houseparty-fortnite-comes-to-google-play-contract-tracing-api/", "urlToImage": null, "publishedAt": "2020-04-25T15:17:17Z", "content": "Welcome back to This Week in Apps, the Extra Crunch series that recaps the latest OS news, the applications they support and the money that flows through it all.\r\nThe app industry is as hot as ever, with a record 204 billion downloads and $120 billion in cons… [+1182 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Ian Sherr", "title": "Apple, Google update coronavirus tracking tech to address privacy concerns - CNET", "description": "The tech giants added new security features for their iPhone and Android phone technology.", "url": "https://www.cnet.com/news/apple-google-update-coronavirus-tracking-tech-to-address-privacy-concerns/", "urlToImage": null, "publishedAt": "2020-04-25T14:38:34Z", "content": "Background by Pixabay/Photo by Angela Lang/CNET\r\nFor the most up-to-date news and information about the coronavirus pandemic, visit the WHO website.\r\nAs companies and governments around the world battle the coronavirus pandemic, Apple and Google are making ch… [+4845 chars]"}, {"source": {"id": null, "name": "9to5google.com"}, "author": null, "title": "Google Meet call w/ thousands of Googlers watched an executive’s son praise Zoom - 9to5Google", "description": "Funny story: During a Google Meet call with thousands of Google employees, an executive's son walked in and sung praises to the competing Zoom service.", "url": "https://9to5google.com/2020/04/25/google-meet-zoom-competition-executive-son-story/", "urlToImage": null, "publishedAt": "2020-04-25T14:37:50Z", "content": "In the wake of the coronavirus pandemic, Zoom has skyrocketed to mainstream popularity with hundreds of millions of users added in the past couple of months. Google Meet, on the other hand, hasn’t seen anything near Zoom’s success. To twist the knife, a Googl… [+2200 chars]"}, {"source": {"id": null, "name": "Hypebeast.com"}, "author": "Patrick Johnson", "title": "Apple to Sell Redesigned MacBook With Its Own Chips Beginning 2021 - HYPEBEAST", "description": "As the company plans to move away from Intel processors entirely.", "url": "https://hypebeast.com/2020/4/apple-macbook-2021-rumors-new-processors", "urlToImage": null, "publishedAt": "2020-04-25T14:33:00Z", "content": "Apple‘s goal to sell computers with its own processors may finally come to fruition in 2021. The technology giant has relied on current supplier Intel Corp since 2006, but reports have hinted that the company plans to roll out a MacBook featuring processors b… [+1973 chars]"}, {"source": {"id": null, "name": "Jalopnik.com"}, "author": "Andrew P. Collins", "title": "This Badass Old Van Is Actually A Modern Ford F-150 - Jalopnik", "description": "I paw through a lot of Facebook groups and forums looking at modified vehicles belonging to people I don’t know. (If you also think this is fun, we could probably be friends.) But a modern chassis, drivetrain, and dashboard swap over to a classic body project…", "url": "https://jalopnik.com/this-badass-old-van-is-actually-a-modern-ford-f-150-1843014870", "urlToImage": null, "publishedAt": "2020-04-25T14:12:13Z", "content": "I paw through a lot of Facebook groups and forums looking at modified vehicles belonging to people I dont know. (If you also think this is fun, we could probably be friends.) But a modern chassis, drivetrain, and dashboard swap over to a classic body project … [+3160 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Eddie Makuch", "title": "WWE 2K21 Is Canceled, But Franchise Isn't Dead - GameSpot", "description": "The WWE announces that there won't be a new WWE 2K game this year but 2K says fans should watch out for \"exciting news\" on Monday.", "url": "https://www.gamespot.com/articles/wwe-2k21-is-canceled-but-franchise-isnt-dead/1100-6476445/", "urlToImage": null, "publishedAt": "2020-04-25T13:23:00Z", "content": "The WWE has officially confirmed that the next WWE 2K game is canceled. WWE 2K21 will not be released, management said on an earnings call. The news comes following potentially-delayed workflows due to the ongoing pandemic and a particularly poor showing from… [+1467 chars]"}, {"source": {"id": null, "name": "Androidcentral.com"}, "author": "Jerry Hildenbrand", "title": "Android 11 is finally bringing a modern UI to some existing features - Android Central", "description": "Features are better when you know that they exist. Android R ... err 11 is bringing an easy way to use some really great ones.", "url": "https://www.androidcentral.com/android-11-finally-bringing-modern-ui-some-existing-features", "urlToImage": null, "publishedAt": "2020-04-25T13:08:16Z", "content": "Android is, always has been, and always will be jam-packed with software features. Even the most bare-bones software as seen on something like the Pixel phone will have features that you never knew you needed until you did need them. And it will also have fea… [+2428 chars]"}, {"source": {"id": null, "name": "Soranews24.com"}, "author": "https://soranews24.com/author/scott-wilson/", "title": "Japanese artist paints Cloud from Final Fantasy VII Remake using traditional methods【Video】 - SoraNews24", "description": "Not just priceless, it's gil-less.", "url": "https://soranews24.com/2020/04/25/japanese-artist-paints-cloud-from-final-fantasy-vii-remake-using-traditional-methods%e3%80%90video%e3%80%91/", "urlToImage": null, "publishedAt": "2020-04-25T13:02:35Z", "content": "Not just priceless, it’s gil-less.\r\nWith the recent release of Final Fantasy VII Remake, fans of the original game and newcomers to the series alike have been creating some incredible works inspired by the game.\r\nAnd now that lineup includes well-known Nihong… [+2091 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ben Gilbert", "title": "How to set up Nintendo Switch two-factor authentication - Business Insider - Business Insider", "description": "Following a major breach, Nintendo is suggesting all Nintendo Switch owners set up two-factor authentication. Here's how to do it.", "url": "https://www.businessinsider.com/how-to-set-up-nintendo-switch-two-factor-authentication-2020-4", "urlToImage": null, "publishedAt": "2020-04-25T13:00:26Z", "content": "Do you have a Nintendo Switch? Did you also have a Nintendo 3DS or Wii U? \r\nIf you answered yes to both of those questions, there's a possibility your Nintendo Switch account was one of \"about 160,000\" breaches that Nintendo announced on Friday morning.\r\nSo, … [+180 chars]"}, {"source": {"id": null, "name": "Dexerto.com"}, "author": "Connor Bennett", "title": "All Apex Legends Season 5 easter eggs and teasers so far - Dexerto", "description": "Apex Legends Season 5 is already being teased in World's Edge. Here, we take a look at all the easter eggs and hints about the recently delayed season.", "url": "https://www.dexerto.com/apex-legends/all-apex-legends-season-5-easter-eggs-and-teasers-so-far-1357801", "urlToImage": null, "publishedAt": "2020-04-25T12:56:43Z", "content": "Ahead of Apex Legends season five, fans have been noticing a few teasers springing up around World’s Edge and Kings Canyon for a limited time. We’re going to round them up here and take a look at what else is in store.\r\nWith Apex Legends set to turn from seas… [+2141 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Dave Thier", "title": "‘Pokémon GO’: Here’s A Promo Code For Some Free PokéBalls And Berries. - Forbes", "description": "It's community day, and you need Pokéballs. Here's a 'Pokémon GO' promo code for some free great balls and razzberries.", "url": "https://www.forbes.com/sites/davidthier/2020/04/25/pokmon-go-heres-a-promo-code-for-some-free-pokballs-and-berries/", "urlToImage": null, "publishedAt": "2020-04-25T12:36:06Z", "content": "pokemon GO\r\nCredit: Niantic\r\nIts a weird one, today. Pokémon GO is running an extra-long Community Day with some crucial additions today, trying to re-orient an event all about getting outside and hanging out with people to one thats all about staying inside … [+1807 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Paul Tassi", "title": "Why Are Destiny 2’s Titans Suddenly Dominating Guardian Games? - Forbes", "description": "We can debate what to make of Destiny 2’s “whoops the real Olympics got cancelled” Guardian Games event in terms of how it’s been presented with its endless bounty grind, but I do think it has achieved at least part of its desired objectives, stirring up dram…", "url": "https://www.forbes.com/sites/paultassi/2020/04/25/why-are-destiny-2s-titans-suddenly-dominating-guardian-games/", "urlToImage": null, "publishedAt": "2020-04-25T12:35:58Z", "content": "Destiny 2\r\nBungie\r\nWe can debate what to make of Destiny 2s whoops the real Olympics got cancelled Guardian Games event in terms of how its been presented with its endless bounty grind, but I do think it has achieved at least part of its desired objectives, s… [+3395 chars]"}, {"source": {"id": null, "name": "Dexerto.com"}, "author": "Joe Craven", "title": "New master camo and Shoot the Ship modes coming to Modern Warfare - Dexerto", "description": "Infinity Ward confirmed the inclusion of a new master camo and new Shoot the Ship modes in an April 24 community update.", "url": "https://www.dexerto.com/call-of-duty/new-master-camo-and-shoot-the-ship-modes-coming-to-modern-warfare-1357780", "urlToImage": null, "publishedAt": "2020-04-25T12:11:57Z", "content": "Call of Duty developers Infinity Ward have confirmed that Modern Warfare will soon be graced with new Shoot the Ship modes, as well as a new master weapon camouflage, above the existing Damascus.\r\nIn an April 24 community update, Infinity Ward confirmed a hos… [+1718 chars]"}, {"source": {"id": null, "name": "Notebookcheck.net"}, "author": "Daniel R Deakin", "title": "Huge Pokémon Gold and Silver source code leak reveals some very beta-looking pocket monsters - Notebookcheck.net", "description": "The full source code for Pokémon Gold Version and Pokémon Silver Version has been shared online, and fans have been thoroughly enjoying going through the dozens of images that were part of the various builds. This includes pictures of front and back Pokémon s…", "url": "https://www.notebookcheck.net/Huge-Pokemon-Gold-and-Silver-source-code-leak-reveals-some-very-beta-looking-pocket-monsters.462921.0.html", "urlToImage": null, "publishedAt": "2020-04-25T12:07:03Z", "content": "Pokémon Gold and Pokémon Silver were released in Japan in 1999, before coming to Australia and North America in 2000 and Europe in 2001. The games were huge commercial and critical successes: Over 23 million units were sold. The full source code for the popul… [+1185 chars]"}, {"source": {"id": null, "name": "Dexerto.com"}, "author": "Andy Williams", "title": "Riot developer exposes sexist harassment during Valorant Twitch stream - Dexerto", "description": "A LoL developer has exposed the forms of sexual harassment they suffered during a Valorant Twitch stream, prompting a response from Riot.", "url": "https://www.dexerto.com/valorant/riot-developer-exposes-sexist-harassment-during-valorant-twitch-stream-1357781", "urlToImage": null, "publishedAt": "2020-04-25T12:07:01Z", "content": "A League of Legends developer has exposed the sexist abuse she faced during a Valorant Twitch stream, resulting in Riot pledging to find “long-term solutions.”\r\nValorant’s closed beta has been a massive success for Riot, garnering almost 300 million hours wat… [+3248 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Lynn La", "title": "iPhone SE vs. iPhone 8 comparison: Which $400 iPhone should you get? - CNET", "description": "Some retailers are still selling the iPhone 8 despite Apple discontinuing the device. But you should just get the new iPhone SE instead.", "url": "https://www.cnet.com/news/iphone-se-vs-iphone-8-spec-comparison-which-400-iphone-should-you-get/", "urlToImage": null, "publishedAt": "2020-04-25T11:28:26Z", "content": "In a bid to lure budget-minded iPhone fans, Apple debuted its new iPhone SE for 2020 on April 15 for $399 (£419, AU$749). It's a sequel to its 2016 iPhone of the same name. The new iPhone SE's specs are similar to the iPhone 8 from three years ago, which is l… [+8211 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Heather Kelly", "title": "Advertising adjusts for a new reality: Sweatpants for staying home and toilet paper that cares - The Washington Post", "description": "There's a reason ads on TV are starting to look the same and Instagram seems to know exactly what loungewear you should buy. Advertising is trying to hit the right notes during the pandemic.", "url": "https://www.washingtonpost.com/technology/2020/04/25/ads-coronavirus-change/", "urlToImage": null, "publishedAt": "2020-04-25T11:02:55Z", "content": "Just stay home seems like an unusual sell from a hotel-booking service, but these are unusual times. Companies large and small are figuring out how to make ads that dont seem insensitive or as if theyre from a different time, when people took beach vacations,… [+9194 chars]"}, {"source": {"id": null, "name": "Motor1.com"}, "author": "Jacob Oliva", "title": "Watch 2021 VW Golf R Spied In Action At The Nürburgring - Motor1 ", "description": "It's lacking something, though.", "url": "https://www.motor1.com/news/414745/volkswagen-golf-r-nurburgring-video/", "urlToImage": null, "publishedAt": "2020-04-25T10:42:03Z", "content": "More than a week ago, we've seen the 2021 Volkswagen Golf R in spy images from the Nürburgring with minimal camouflage almost non-existent, actually. However, those are only still shots and for many car enthusiasts, a non-moving preview of the Golf R won't su… [+1377 chars]"}, {"source": {"id": null, "name": "Autoevolution.com"}, "author": "Andrei Tutu", "title": "2015 Ford Mustang GT 'Generation Gap\" Is a Bad Boy 1967 Eleanor Conversion - autoevolution", "description": "Wouldn't it be a dream to enjoy a Ford Mustang that mixes the retro look of a 1967 Fastback with the plethora of benefits delivered by a 2015 GT? The answer to this question is obvious, so the motor-crazy crew over at B Is For Build decided to translate this …", "url": "https://www.autoevolution.com/news/2015-ford-mustang-gt-generation-gap-is-a-bad-boy-1967-eleanor-conversion-142983.html", "urlToImage": null, "publishedAt": "2020-04-25T10:39:00Z", "content": "It's been almost a month since we first discussed this stunning Blue Oval project and while the March article included all the uphill work required to put this contraption together, the time has come to start enjoying the fruits of all that labor. As such, th… [+1229 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Davey Winder", "title": "New Windows 10 Update Fail: Users Warn Of BSOD And Deleted Files - Forbes", "description": "As users complain of blue screens of death, deleted files and reboot loops, here's what you really need to know about this Windows 10 update.", "url": "https://www.forbes.com/sites/daveywinder/2020/04/25/new-windows-10-update-fail-users-warn-of-bsod-and-deleted-files/", "urlToImage": null, "publishedAt": "2020-04-25T10:03:45Z", "content": "The latest Patch Tuesday update has caused alarming problems for some Windows 10 users\r\nSOPA Images/LightRocket via Getty Images\r\nAs users complain of blue screens of death, deleted files and reboot loops, here's what you need to know about this Windows 10 up… [+4453 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Matt Espineli", "title": "FF7 Remake Elemental Materia Guide: Where To Find This Essential Materia Orb - GameSpot", "description": "Here's how to get the only two Elemental Materia orbs available in FF7 Remake for PS4.", "url": "https://www.gamespot.com/articles/ff7-remake-elemental-materia-guide-where-to-find-t/1100-6476502/", "urlToImage": null, "publishedAt": "2020-04-25T07:52:57Z", "content": "In Final Fantasy 7 Remake, the Elemental Materia is one of the best Materia orbs you can get, as it can imbue either your weapons with elemental power and your armor with elemental defense. However, this Materia can be incredibly easy to miss if you're just g… [+2738 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Oscar Gonzalez", "title": "Travis Scott event in Fortnite: How to watch the encore and find the Giant Astro Heads - CNET", "description": "The rapper dropped new tracks in a jaw-dropping concert. Catch the next show at midnight.", "url": "https://www.cnet.com/news/travis-scott-event-in-fortnite-how-to-watch-the-encore-and-find-the-giant-astro-heads/", "urlToImage": null, "publishedAt": "2020-04-25T01:02:37Z", "content": "Play some Fortnite and listen to a new track from Travis Scott.\r\nEpic Games\r\nFortnite events aren't only for players to check out new content from developer Epic Games. The popular battle royale game has also played host to multiple premieres and collaboratio… [+3718 chars]"}, {"source": {"id": null, "name": "Ubergizmo.com"}, "author": "Tyler Lee", "title": "Samsung’s Smartwatches Get A New Blood Pressure Monitoring App - Ubergizmo", "description": "Our smartwatches are getting better at what they do, where they can monitor more than just our daily activities like our steps taken, calories burnt, and so on. For example, the Apple Watch comes with an ECG monitoring tool that can alert the wearer if there …", "url": "https://www.ubergizmo.com/2020/04/samsung-smartwatch-blood-pressure-monitor/", "urlToImage": null, "publishedAt": "2020-04-25T00:42:49Z", "content": "Our smartwatches are getting better at what they do, where they can monitor more than just our daily activities like our steps taken, calories burnt, and so on. For example, the Apple Watch comes with an ECG monitoring tool that can alert the wearer if there … [+1254 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Resident Evil 3 Remake's Hidden Difficulty Modes Improve Its Horror - Screen Rant", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiTWh0dHBzOi8vc2NyZWVucmFudC5jb20vcmVzaWRlbnQtZXZpbC0zLXJlbWFrZS1uaWdodG1hcmUtZGlmZmljdWx0eS1tb2RlLWdvb2Qv0gFRaHR0cHM6Ly9zY3JlZW5yYW50LmNvbS9yZXNpZGVudC1ldmlsLTMtcmVtYWtlLW5pZ2h0bWFyZS1kaWZmaWN1bHR5LW1vZGUtZ29vZC9hbXAv?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T00:01:31Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Let's Play Predator: Hunting Grounds | GameSpot Community Fridays - GameSpot", "description": "Jean-Luc and Ben team up with, or fight against, the community in this new asymertrical online shooter.", "url": "https://www.youtube.com/watch?v=hYGTBArmQ80", "urlToImage": null, "publishedAt": "2020-04-24T22:50:36Z", "content": "Jean-Luc and Ben team up with, or fight against, the community in this new asymertrical online shooter."}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Michael Higham", "title": "The Big Final Fantasy 14 Overhaul You've Been Waiting For Will Come With Patch 5.3 - GameSpot", "description": "The long-awaited streamlined version of the base game Final Fantasy XIV: A Realm Reborn arrives with the next big update.", "url": "https://www.gamespot.com/articles/the-big-final-fantasy-14-overhaul-youve-been-waiti/1100-6476474/", "urlToImage": null, "publishedAt": "2020-04-24T22:12:00Z", "content": "As the MMORPG Final Fantasy XIV has evolved into a renowned, critically-acclaimed mainline series entry with its expansion packs, the one caveat players frequently bring up to newcomers is that they'll have grind out the base game A Realm Reborn. It's often r… [+2943 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Sean Szymkowski", "title": "Lexus GS bows out, exits production with Black Line special edition - CNET", "description": "The GS is on the way out, but a special edition will help mark its farewell.", "url": "https://www.cnet.com/roadshow/news/lexus-gs-production-discontinued-black-line-special-edition/", "urlToImage": null, "publishedAt": "2020-04-24T21:19:48Z", "content": "This is goodbye.\r\nLexus\r\nIt's time to part ways with the Lexus GS. Just a few years shy of its 30th anniversary, Toyota's luxury division confirmed the GS will exit production at the end of this year.\r\nAs the luxury sedan comes to the end of its life, Lexus a… [+1360 chars]"}, {"source": {"id": null, "name": "Androidpolice.com"}, "author": null, "title": "OnePlus reportedly issues massive layoffs in largest European markets - Android Police", "description": "OnePlus has reportedly made severe staffing cuts in its European operations. While the tech brand has experienced massive growth in other markets over the", "url": "https://www.androidpolice.com/2020/04/25/oneplus-reportedly-issued-massive-layoffs-in-largest-european-markets/", "urlToImage": null, "publishedAt": "2020-04-24T21:06:06Z", "content": "This story was originally published 2020/04/24 1:52pm PDTon Apr 24, 2020 and last updated 2020/04/25 12:38pm PDTApr 25, 2020. \r\nOnePlus has reportedly made severe staffing cuts in its European operations. While the tech brand has experienced massive growth in… [+3233 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "10 Fake Consoles That Actually Work - TheGamer", "description": "Sony, Microsoft, and Nintendo have all had their famous consoles ripped off. But have you ever wondered what it's like to own one of them? or even if they wo...", "url": "https://www.youtube.com/watch?v=G5P0soLY6zo", "urlToImage": null, "publishedAt": "2020-04-24T19:45:01Z", "content": null}, {"source": {"id": null, "name": "9to5mac.com"}, "author": null, "title": "Magic Keyboard for iPad Pro top features — the best iPad accessory ever [Video] - 9to5Mac", "description": "Hands-on with top features for the Magic Keyboard for iPad Pro. It's the best accessory for the iPad Pro, and turns it into a versatile laptop.", "url": "https://9to5mac.com/2020/04/24/magic-keyboard-for-ipad-pro-review-top-features-best-ipad-accessory-ever-video/", "urlToImage": null, "publishedAt": "2020-04-24T19:42:23Z", "content": "Two days ago the Magic Keyboard for the 11-inch iPad Pro landed on my desk. Ive been using it constantly since it first arrived, and although its not perfect, I absolutely love it.\r\nIts so good that I can easily say that this is the best iPad accessory in the… [+13185 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Ultimate Comparison: iPhone SE (2020) VS iPhone 11! - AppleInsider", "description": "AppleInsider compares the brand new 2020 iPhone SE against the iPhone 11 to see how much of a difference there is. : ➡ Grab the lowest prices on Apple hardwa...", "url": "https://www.youtube.com/watch?v=0sr9gG0ma44", "urlToImage": null, "publishedAt": "2020-04-24T19:16:05Z", "content": "AppleInsider compares the brand new 2020 iPhone SE against the iPhone 11 to see how much of a difference there is.\r\n: \r\nGrab the lowest prices on Apple hardware:\r\nMacs - https://prices.appleinsider.com/curre...iPads - https://prices.appleinsider.com/ipadApple… [+1026 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Megan Rose Dickey", "title": "Instacart has a problem with third-party apps letting shoppers pay for early access to orders - TechCrunch", "description": "Kara Carmichael has been an Instacart shopper for years in Orlando, Fla. It’s how she’s been able to support her family, she told TechCrunch. But she says she has noticed an increase in third-party bot activity that has made shopping “nearly impossible.” Desp…", "url": "http://techcrunch.com/2020/04/24/instacart-third-party-apps-bots-priority-access-batches-orders/", "urlToImage": null, "publishedAt": "2020-04-24T18:56:51Z", "content": "Kara Carmichael has been an Instacart shopper for years in Orlando, Fla. It’s how she’s been able to support her family, she told TechCrunch. But she says she has noticed an increase in third-party bot activity that has made shopping “nearly impossible.”\r\nDes… [+5147 chars]"}, {"source": {"id": null, "name": "Pri.org"}, "author": null, "title": "CES convention may have spread coronavirus throughout the US — and world - PRI", "description": "The Consumer Electronics Show in Las Vegas has become an intriguing puzzle piece of the pandemic's spread after new Bay Area COVID-19 deaths indicate the virus' presence in the United States earlier than thought.", "url": "https://www.pri.org/stories/2020-04-24/ces-convention-may-have-spread-coronavirus-throughout-us-and-world", "urlToImage": null, "publishedAt": "2020-04-24T18:27:02Z", "content": "This story originally appeared in APM Reports. \r\nWhen a doctor phoned Michael Webber on Monday with the results of his antibody test for the coronavirus, her first word was filled with irony: \"Congratulations.\"\r\nHe had tested positive, meaning that the 49-yea… [+13256 chars]"}, {"source": {"id": null, "name": "Androidpolice.com"}, "author": "https://www.facebook.com/corbin.davenport.50", "title": "Sony WH-C710N review: Great noise-cancelling headphones for under $200 - Android Police", "description": "Sony makes some of the best noise-canceling headphones around, especially the WH-1000XM3 (which is overdue for a replacement). The WH1000XM3 is a premium", "url": "https://www.androidpolice.com/2020/04/24/sony-wh-ch710n-review/", "urlToImage": null, "publishedAt": "2020-04-24T17:00:43Z", "content": "Sony makes some of the best noise-canceling headphones around, especially the WH-1000XM3 (which is overdue for a replacement). The WH1000XM3 is a premium set of headphones that regularly goes for around $300, and competing products like the Bose QuietComfort … [+4387 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Christian de Looper", "title": "7 Of The Best Amazon Alexa Speakers - Forbes", "description": "Looking for a great speaker with arguably the smartest digital assistant, Alexa? Here are 7 of the best Amazon Alexa speakers out there.", "url": "https://www.forbes.com/sites/forbes-personal-shopper/2020/04/24/7-of-the-best-amazon-alexa-speakers/", "urlToImage": null, "publishedAt": "2020-04-24T16:00:00Z", "content": "Alexa is arguably the smartest digital assistant, and while Google Assistant also has a lot going for it, Alexa is the go-to for many users who dont have Android phones. There are a ton of Alexa speakers on the market, and while they all have the smart featur… [+4164 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "OnePlus 8 Pro versus LG V60 smartphone showdown - Phandroid", "description": "This OnePlus 8 Pro versus LG V60 comparison will give you a detailed look at the LG V60 and the new OnePlus 8 Prom comparisons their software, hardware, and ...", "url": "https://www.youtube.com/watch?v=CDVfqqvF560", "urlToImage": null, "publishedAt": "2020-04-24T15:00:58Z", "content": null}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Paul Tassi", "title": "Mayhem 2.0 Has Broken ‘Borderlands 3’ In A Bad Way - Forbes", "description": "Borderlands 3 has introduced Mayhem 10 in Mayhem 2.0, and farming now makes little to no sense, and many builds are broken.", "url": "https://www.forbes.com/sites/paultassi/2020/04/24/mayhem-20-has-broken-borderlands-3-in-a-bad-way/", "urlToImage": null, "publishedAt": "2020-04-24T14:15:16Z", "content": "Borderlands 3\r\nGearbox\r\nYesterday, Borderlands 3 introduced a whole bunch of new things into the game, bug fixes, character buffs, a temporary loot event and a new Cartels game mode. But above all else Gearbox totally redesigned the endgame of Borderlands 3 f… [+4477 chars]"}, {"source": {"id": null, "name": "Tomsguide.com"}, "author": "Kate Kozuch", "title": "Zoom just got a killer feature to beat every video call app - Tom's Guide", "description": "Real-time transcription takes Zoom meetings to the next level", "url": "https://www.tomsguide.com/news/zoom-just-got-a-killer-feature-to-beat-every-video-call-app", "urlToImage": null, "publishedAt": "2020-04-24T14:09:00Z", "content": "Zoom calls are about to give the video conferencing service a serious edge over Google Hangouts, Microsoft Teams, and all the other best video chat apps battling for the loyalty of everyone working from home. \r\nOtter.ai, a real-time chat transcription service… [+2215 chars]"}, {"source": {"id": null, "name": "Electrek.co"}, "author": null, "title": "Ford might delay Mustang Mach-E launch, will update as production restarts - Electrek", "description": "Ford might delay the Mustang Mach-E launch amid the coronavirus pandemic and will give an updated timeline as it restarts its production facilities. The Mustang Mach-E is Ford’s first all-electric vehicle built from the ground up and one of the most anticipat…", "url": "https://electrek.co/2020/04/24/ford-delay-mustang-mach-e-launch-production-restart/", "urlToImage": null, "publishedAt": "2020-04-24T13:27:26Z", "content": "Ford might delay the Mustang Mach-E launch amid the coronavirus pandemic and will give an updated timeline as it restarts its production facilities.\r\nThe Mustang Mach-E is Ford’s first all-electric vehicle built from the ground up and one of the most anticipa… [+2960 chars]"}, {"source": {"id": null, "name": "Rockpapershotgun.com"}, "author": null, "title": "XCOM: Chimera Squad is out now, and it's half-price - Rock Paper Shotgun", "description": "It’s time to put down your world-saving guns and pick up your alien-policemen batons, because XCOM: Chimera Squad is out.", "url": "https://www.rockpapershotgun.com/2020/04/24/xcom-chimera-squad-is-out-now-and-its-half-price/", "urlToImage": null, "publishedAt": "2020-04-24T10:17:00Z", "content": "It’s time to put down your world-saving guns and pick up your alien-policing batons, because XCOM: Chimera Squad is out. XCOPS takes a big sidewards leap away from the main series, boiling down turn-based combat into single-room encounters. Developers Firaxis… [+2356 chars]"}, {"source": {"id": null, "name": "Dexerto.com"}, "author": "Andrew Amos", "title": "How to pick Redd's real art from fake art in Animal Crossing: New Horizons - Dexerto", "description": "Animal Crossing: New Horizons' newest visitor, Redd, will try to trip you up into buying his fake art. However, we've got a guide so you don't get conned.", "url": "https://www.dexerto.com/animal-crossing/how-to-pick-redd-real-fake-art-acnh-1357385", "urlToImage": null, "publishedAt": "2020-04-24T07:51:21Z", "content": "Jolly Redd is one of Animal Crossing: New Horizons’ latest editions. However, the Foxy villager can be a bit sly. Here’s a guide to making sure you’re always getting your bells worth when you buy his art.\r\nRedd is one of a couple new visitors added in Animal … [+3015 chars]"}]}