{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": "reuters", "name": "Reuters"}, "author": "Stephen Nellis", "title": "Showdown looms between Silicon Valley, U.S. states over contact tracing apps - Reuters", "description": "U.S. states promoting apps that could prove essential to ending the coronavirus lockdown may be headed for a showdown with the two Silicon Valley companies that control key software on 99% of smartphones over the collection of sensitive GPS location data.", "url": "https://www.reuters.com/article/us-health-coronavirus-usa-apps-idUSKCN22702F", "urlToImage": null, "publishedAt": "2020-04-25T01:56:24Z", "content": "SAN FRANCISCO (Reuters) - U.S. states promoting apps that could prove essential to ending the coronavirus lockdown may be headed for a showdown with the two Silicon Valley companies that control key software on 99% of smartphones over the collection of sensit… [+5217 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Oscar Gonzalez", "title": "Travis Scott event in Fortnite: How to watch the encore and find the Giant Astro Heads - CNET", "description": "The rapper dropped new tracks in a jaw-dropping concert. Catch the next show at midnight.", "url": "https://www.cnet.com/news/travis-scott-event-in-fortnite-how-to-watch-the-encore-and-find-the-giant-astro-heads/", "urlToImage": null, "publishedAt": "2020-04-25T01:02:37Z", "content": "Play some Fortnite and listen to a new track from Travis Scott.\r\nEpic Games\r\nFortnite events aren't only for players to check out new content from developer Epic Games. The popular battle royale game has also played host to multiple premieres and collaboratio… [+3718 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Matt Espineli", "title": "FF7 Remake Hell House Boss Guide: How To Burn This House To The Ground - GameSpot", "description": "Here's how to defeat the dreaded Hell House during Chapter 9 of FF7 Remake for PS4.", "url": "https://www.gamespot.com/articles/ff7-remake-hell-house-boss-guide-how-to-burn-this-/1100-6476500/", "urlToImage": null, "publishedAt": "2020-04-25T00:58:00Z", "content": "One of the tougher boss fights you'll encounter in Final Fantasy 7 Remake is the Hell House during Chapter 9. If you're not up coming into this one prepared, you're likely to get wiped quick. Below we detail everything you need to know about how to defeat thi… [+4573 chars]"}, {"source": {"id": null, "name": "Dexerto.com"}, "author": "Albert Petrosyan", "title": "Infinity Ward reveal early look at next Modern Warfare update patch notes - Dexerto", "description": "Infinity Ward's April 24 Community Update previews next week's patch, which will include some new playlists, a lot of bug fixes, and the new weapon mastery camo.", "url": "https://www.dexerto.com/call-of-duty/infinity-ward-reveal-early-look-at-next-modern-warfare-update-patch-notes-1357713", "urlToImage": null, "publishedAt": "2020-04-25T00:44:34Z", "content": "Developers Infinity Ward have released their latest weekly Community Update for Modern Warfare, giving players an early glimpse at what the April 28 patch will bring to multiplayer and Warzone battle royale.\r\nAs part of their effort to improve communication w… [+2839 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Xbox Series X Game Reveals “Won't Be Too Much of a Wait' Says Phil Spencer - IGN Daily Fix - IGN", "description": "In today's Daily Fix, it sounds like some Xbox Series X game reveals could be coming soon, Nintendo confirms a pretty big Switch hack, and Elijah Wood hangs ...", "url": "https://www.youtube.com/watch?v=Xtqtu3Qg4CM", "urlToImage": null, "publishedAt": "2020-04-24T23:30:45Z", "content": null}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Nick Statt", "title": "OnePlus lays off employees in Europe less than two weeks after OnePlus 8 launch - The Verge", "description": "OnePlus just launched its OnePlus 8 and OnePlus 8 Pro flagships less than two weeks ago, but the company is now downsizing its offices in parts of Europe. The offices hardest hit with the layoffs include the UK, France, and Germany, with OnePlus reportedly mo…", "url": "https://www.theverge.com/2020/4/24/21235215/oneplus-layoffs-europe-regional-downsizing-uk-france-germany", "urlToImage": null, "publishedAt": "2020-04-24T22:26:07Z", "content": "It appears unrelated to the coronavirus\r\nPhoto by Vjeran Pavic / The Verge\r\nOnePlus launched its latest flagship phones, the OnePlus 8 and OnePlus 8 Pro, less than two weeks ago, but the Chinese phone maker is now laying off employees in regional offices thro… [+1293 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Dave Johnson", "title": "The Apple Watch Series 5 is $100 off at Amazon right now - CNET", "description": "Get the 40mm Apple Watch Series 5 (GPS and cellular) in silver for $399.", "url": "https://www.cnet.com/news/the-apple-watch-series-5-is-100-off-at-amazon-right-now/", "urlToImage": null, "publishedAt": "2020-04-24T22:21:19Z", "content": "Apple\r\nThe Apple Watch Series 5 isn't a remarkable upgrade from the Series 4, and for that reason alone, I know it's not everyone's favorite Apple smartwatch. But it's my personal fave (thanks in no small part to the always-on display), and the first one I've… [+855 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Kallie Plagge", "title": "Animal Crossing Art Guide: How To Tell Fake Art From Real Art In New Horizons - GameSpot", "description": "When you're buying art from Jolly Redd, there's a chance it may be fake. Here's how to tell what's legit.", "url": "https://www.gamespot.com/articles/animal-crossing-art-guide-how-to-tell-fake-art-fro/1100-6476493/", "urlToImage": null, "publishedAt": "2020-04-24T22:14:00Z", "content": "With the April 23 update, Animal Crossing: New Horizons got a new special visitor: Jolly Redd, a fox who visits in his Treasure Trawler and sells art of questionable origin. You have to be careful when buying art from him, because sometimes, he sells forgerie… [+2584 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Morgan Hines", "title": "CDC: Frozen raspberries were culprit behind 2019 norovirus outbreak on multiple cruises - USA TODAY", "description": "Smoothies: Nutritious, delicious – and according to the CDC, the source of a norovirus outbreak that infected hundreds of cruise passengers in 2019.", "url": "https://www.usatoday.com/story/travel/cruises/2020/04/24/cdc-report-raspberries-caused-2019-norovirus-outbreak-cruises/3018721001/", "urlToImage": null, "publishedAt": "2020-04-24T21:58:07Z", "content": "Here is everything you need to know about the highly contagious norovirus.\r\nUSA TODAY\r\nPassengers contemplating boarding another cruise after the coronavirus pandemic might already be planning to pass up the buffet next time they sail due to social-distancing… [+3987 chars]"}, {"source": {"id": null, "name": "Tmonews.com"}, "author": "Alex Wagner", "title": "iPhone SE launches today, Costco rolls out deal for T-Mobile customers - TmoNews", "description": "A little over a week after Apple surprised us with an updated iPhone SE, the new device has officially launche", "url": "https://www.tmonews.com/2020/04/iphone-se-launch-today-costco-deal-t-mobile-customers/", "urlToImage": null, "publishedAt": "2020-04-24T21:33:27Z", "content": "A little over a week after Apple surprised us with an updated iPhone SE, the new device has officially launched.\r\nThe iPhone SE is in stock and ready to ship at T-Mobile. The 64GB and 256GB have estimated ship dates of April 24-27, but you may have to wait a … [+1585 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Austen Goslin", "title": "Here are all of Valorant’s competitive ranks - Polygon", "description": "Riot has revealed Valorant’s competitive ranks, when the Ranked mode will go live, how many friends you can team up with, and ranked progression.", "url": "https://www.polygon.com/2020/4/24/21234911/valorant-rated-mode-release-date-ranks-competitive-matchmaking-teams", "urlToImage": null, "publishedAt": "2020-04-24T21:27:16Z", "content": "Riot has finally revealed the first details about Valorants upcoming ranked mode. Since Valorants closed beta started a few weeks ago, there has only been one mode: Unrated. But in the games next patch, Rated mode will be added, allowing players to earn ranks… [+2775 chars]"}, {"source": {"id": null, "name": "Jalopnik.com"}, "author": "Justin T. Westbrook", "title": "My New Favorite YouTuber Designed The Ferrari F430 - Jalopnik", "description": "The guy who designed the reinvented Mini, drew some McLarens and made the Ferrari F430 is now just making videos from his house about design, and they’re wonderful.", "url": "https://jalopnik.com/my-new-favorite-youtuber-designed-the-ferrari-f430-1843051028", "urlToImage": null, "publishedAt": "2020-04-24T21:11:56Z", "content": "The guy who designed the reinvented Mini, drew some McLarens and made the Ferrari F430 is now just making videos from his house about design, and theyre wonderful. \r\nThe only reason I write for Jalopnik today is because I used to search new cars and new car d… [+1335 chars]"}, {"source": {"id": null, "name": "Androidpolice.com"}, "author": null, "title": "T-Mobile confirms it's going to brick 5G on most Sprint 5G phones post-merger - Android Police", "description": "T-Mobile will shut down Sprint's 5G network in order to rework its spectrum into its own 5G grid. While those with a Galaxy S20 series device on Sprint", "url": "https://www.androidpolice.com/2020/04/24/t-mobile-confirms-its-going-to-brick-5g-on-most-sprint-5g-phones-post-merger/", "urlToImage": null, "publishedAt": "2020-04-24T21:06:31Z", "content": "This story was originally published 2020/04/22 11:47am PDTon Apr 22, 2020 and last updated 2020/04/24 1:56pm PDTApr 24, 2020. \r\nT-Mobile will shut down Sprint's 5G network in order to rework its spectrum into its own 5G grid. While those with a Galaxy S20 ser… [+3283 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Dan Goodin", "title": "That no-click iOS 0-day reported to be under exploit doesn’t exist, Apple says - Ars Technica", "description": "Other critics also question evidence and say 0day may have been confused with simple bug.", "url": "https://arstechnica.com/information-technology/2020/04/apple-disputes-report-of-non-click-ios-0day-under-exploit-for-two-years/", "urlToImage": null, "publishedAt": "2020-04-24T20:40:00Z", "content": "22 with 18 posters participating\r\nApple is disputing the accuracy of this weeks report that found attackers have been exploiting an unpatched iOS bug that allowed them to take full control of iPhones.\r\nSan Francisco-based security firm ZecOps said on Wednesda… [+4799 chars]"}, {"source": {"id": null, "name": "9to5google.com"}, "author": null, "title": "Google Phone call recording function detailed, unsurprisingly region restricted - 9to5Google", "description": "Google has officially detailed a call recording feature for its Phone app which is found on Pixel, Nokia, and some other devices.", "url": "https://9to5google.com/2020/04/24/google-phone-call-recording-details/", "urlToImage": null, "publishedAt": "2020-04-24T20:19:31Z", "content": "Call recording is something that, unfortunately, you don’t see all that often anymore. Google has been working on a call recording option for its Phone app for a while, and now, they’ve officially divulged the details on it.\r\nAndroid Police first spotted a su… [+1206 chars]"}, {"source": {"id": null, "name": "9to5mac.com"}, "author": null, "title": "Magic Keyboard for iPad Pro top features — the best iPad accessory ever [Video] - 9to5Mac", "description": "Hands-on with top features for the Magic Keyboard for iPad Pro. It's the best accessory for the iPad Pro, and turns it into a versatile laptop.", "url": "https://9to5mac.com/2020/04/24/magic-keyboard-for-ipad-pro-review-top-features-best-ipad-accessory-ever-video/", "urlToImage": null, "publishedAt": "2020-04-24T19:42:23Z", "content": "Two days ago the Magic Keyboard for the 11-inch iPad Pro landed on my desk. Ive been using it constantly since it first arrived, and although its not perfect, I absolutely love it.\r\nIts so good that I can easily say that this is the best iPad accessory in the… [+13185 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "", "title": "Telegram promises secure group video calls sometime this year - Engadget", "description": "Telegram says it will add secure group video calls in 2020.", "url": "https://www.engadget.com/telegram-secure-group-video-calls-142035892.html", "urlToImage": null, "publishedAt": "2020-04-24T19:41:19Z", "content": "While Telegram didn’t release many details about the feature, it appears to be taking a dig at Zoom, which is facing pressure to fix several privacy issues. In response, Zoom has created a security council and promised upgrades, but that won’t stop competitor… [+831 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "David Murphy", "title": "Are You Charging Your MacBook on the Wrong Side? - Lifehacker", "description": "Yes, you read that headline correctly. There is apparently a “right” way and a “wrong” way to connect devices to a MacBook with Thunderbolt/USB-C ports on both sides. Doing it wrong can affect your computer’s performance.", "url": "https://lifehacker.com/are-you-charging-your-macbook-on-the-wrong-side-1843045306", "urlToImage": null, "publishedAt": "2020-04-24T19:31:53Z", "content": "Yes, you read that headline correctly. There is apparently a right way and a wrong way to connect devices to a MacBook with Thunderbolt/USB-C ports on both sides. Doing it wrong can affect your computers performance.\r\nI recently encountered this knowledge on … [+3975 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Michael Higham", "title": "The Big Final Fantasy 14 Overhaul You've Been Waiting For Will Come With Patch 5.3 - GameSpot", "description": "The long-awaited streamlined version of the base game Final Fantasy XIV: A Realm Reborn arrives with the next big update.", "url": "https://www.gamespot.com/articles/the-big-final-fantasy-14-overhaul-youve-been-waiti/1100-6476474/", "urlToImage": null, "publishedAt": "2020-04-24T19:03:00Z", "content": "As the MMORPG Final Fantasy XIV has evolved into a renowned, critically-acclaimed mainline series entry with its expansion packs, the one caveat players frequently bring up to newcomers is that they'll have grind out the base game A Realm Reborn. It's often r… [+2943 chars]"}, {"source": {"id": null, "name": "9to5mac.com"}, "author": null, "title": "Facebook launches ‘Messenger Rooms’ as a Zoom and Group FaceTime alternative - 9to5Mac", "description": "Facebook is out today with a new product to connect multiple people via video chat and compete with popular offerings like Zoom, Group FaceTime, Skype, Houseparty, and more. Detailed by TechCrunch, Facebook announced a number of messaging updates today with t…", "url": "https://9to5mac.com/2020/04/24/facebook-launches-messenger-rooms-as-a-zoom-and-group-facetime-alternative/", "urlToImage": null, "publishedAt": "2020-04-24T18:47:18Z", "content": "Facebook is out today with a new product to connect multiple people via video chat and compete with popular offerings like Zoom, Group FaceTime, Skype, Houseparty, and more.\r\nDetailed by TechCrunch, Facebook announced a number of messaging updates today with … [+3683 chars]"}, {"source": {"id": null, "name": "Extremetech.com"}, "author": "Joel Hruska", "title": "Deep Space Nine Upscale Project Update: Variable Frame Rate DVDs Can Burn in Hell - ExtremeTech", "description": "It's time for another Deep Space Nine Upscale Project update. I've moved closer to a final workflow for video processing, but have a few snags still to fix. Variable Frame Rate DVDs are basically Satan if your goal is perfect frame delivery.", "url": "https://www.extremetech.com/extreme/309653-deep-space-nine-upscale-project-update-variable-frame-rate-dvds-can-burn-in-hell", "urlToImage": null, "publishedAt": "2020-04-24T18:32:47Z", "content": "The following unhinged rant article is the sole opinion of its author. ExtremeTech does not discriminate against variable frame rate media.\r\nIn my previous two Star Trek: Deep Space Ninearticles, I’ve discussed my efforts to upscale the content, provided some… [+11490 chars]"}, {"source": {"id": null, "name": "Boingboing.net"}, "author": null, "title": "This AI's only function is to draw penises - Boing Boing", "description": "DICK-RNN is a recurrent neural network trained with 10,000 doodles of dicks. You start drawing a shape and the AI tries its best to finish it as a penis. Starting with the balls helps a lot. Try it…", "url": "https://boingboing.net/2020/04/24/this-ais-only-function-is-to.html", "urlToImage": null, "publishedAt": "2020-04-24T17:38:00Z", "content": "“The Angel, The Automobilist, and Eighteen Others” is a new collection of early drawings by eccentric illustrator and storyteller Edward Gorey (1925-2000). Over at The Comics Journal, Mark Dery, author of the Gorey biography Born to Be Posthumous, reviews the… [+1660 chars]"}, {"source": {"id": null, "name": "Trueachievements.com"}, "author": "Heidi Nicholas", "title": "Sci-fi adventure Deliver Us The Moon joins Xbox Game Pass and Game Pass for PC today - TrueAchievements", "description": "Deliver Us The Moon is a sci-fi action adventure title which draws inspiration from movies such as Interstellar, and which joins the Xbox Game Pass and Xbox Game Pass for PC services today as a day one addition.", "url": "https://www.trueachievements.com/n41593/deliver-us-the-moon", "urlToImage": null, "publishedAt": "2020-04-24T17:19:36Z", "content": "The Xbox team has been busy lately: just yesterday, they surprise-dropped the announcement that Red Dead Redemption 2 will join Xbox Game Pass in May. Before that, they announced new titles for Xbox Game Pass, along with several new titles for Xbox Game Pass … [+1728 chars]"}, {"source": {"id": null, "name": "Androidpolice.com"}, "author": "https://www.facebook.com/corbin.davenport.50", "title": "Sony WH-C710N review: Great noise-cancelling headphones for under $200 - Android Police", "description": "Sony makes some of the best noise-canceling headphones around, especially the WH-1000XM3 (which is overdue for a replacement). The WH1000XM3 is a premium", "url": "https://www.androidpolice.com/2020/04/24/sony-wh-ch710n-review/", "urlToImage": null, "publishedAt": "2020-04-24T17:00:43Z", "content": "Sony makes some of the best noise-canceling headphones around, especially the WH-1000XM3 (which is overdue for a replacement). The WH1000XM3 is a premium set of headphones that regularly goes for around $300, and competing products like the Bose QuietComfort … [+4387 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Daymare 1998 (Resident Evil 2 Tribute) - Official Console Launch Trailer - IGN", "description": "Daymare 1998, the Resident Evil 2 tribute game, finally arrives on PlayStation 4 and Xbox One on April 28th. Check out the official console launch trailer he...", "url": "https://www.youtube.com/watch?v=BiWnPEGvWcA", "urlToImage": null, "publishedAt": "2020-04-24T17:00:11Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Trials of Mana - Your Adventure Begins Trailer - Nintendo Switch - Nintendo", "description": "Trials of Mana is Available Now on Nintendo Switch! A Trials of Mana Demo is also available and free to download! Forces of darkness will stop at nothing to ...", "url": "https://www.youtube.com/watch?v=qq1CTFtJI38", "urlToImage": null, "publishedAt": "2020-04-24T16:00:30Z", "content": "Trials of Mana is Available Now on Nintendo Switch! A Trials of Mana Demo is also available and free to download!\r\nForces of darkness will stop at nothing to get their hands on the powerful Sword of Mana. Begin your adventures today, join your companions, and… [+463 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Christian de Looper", "title": "7 Of The Best Amazon Alexa Speakers - Forbes", "description": "Looking for a great speaker with arguably the smartest digital assistant, Alexa? Here are 7 of the best Amazon Alexa speakers out there.", "url": "https://www.forbes.com/sites/forbes-personal-shopper/2020/04/24/7-of-the-best-amazon-alexa-speakers/", "urlToImage": null, "publishedAt": "2020-04-24T16:00:00Z", "content": "Alexa is arguably the smartest digital assistant, and while Google Assistant also has a lot going for it, Alexa is the go-to for many users who dont have Android phones. There are a ton of Alexa speakers on the market, and while they all have the smart featur… [+4164 chars]"}, {"source": {"id": null, "name": "Pcworld.com"}, "author": "", "title": "Nintendo account hack FAQ: What happened, who’s at risk, and how you can secure your ID - PCWorld", "description": "Nintendo has divulged that some 160,000 online accounts have been compromised. Here's what happened and how you can secure your persona information.", "url": "https://www.pcworld.com/article/3540294/nintendo-account-hack-faq-what-happened-whos-at-risk-and-how-you-can-secure-your-id.html", "urlToImage": null, "publishedAt": "2020-04-24T15:43:00Z", "content": "Since youre probably playing a whole lot more Switch and 3DS games than usual these days, this hack couldnt have come at a worse time. Nintendo has announced that more than 150,000 older accounts have been hacked and are warning users to change their accounts… [+1848 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Ron Amadeo", "title": "Android 11 Preview 3 hands-on—Strange changes to Recent Apps and notifications - Ars Technica", "description": "Preview 3 has some unfinished UIs that raise interesting questions.", "url": "https://arstechnica.com/gadgets/2020/04/android-11-preview-3-brings-recent-apps-changes-auto-revoked-permissions/", "urlToImage": null, "publishedAt": "2020-04-24T15:11:00Z", "content": "18 with 15 posters participating\r\nThere's a new Android 11 Developer Preview. This one is Preview 3, and it launched yesterday for Google's Pixel line. Previous Android 11 previews haven't had a ton of new additions, but this version has a lot of strange and … [+11362 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Future Games Show Announcement Trailer - Coming June 2020 - GamesRadar", "description": "See the most exciting console, mobile and streaming games of 2020 in one show with a mixture of exclusives, deep dives and developer interviews. Coming June ...", "url": "https://www.youtube.com/watch?v=DbLFsALqD_0", "urlToImage": null, "publishedAt": "2020-04-24T15:00:12Z", "content": "See the most exciting console, mobile and streaming games of 2020 in one show with a mixture of exclusives, deep dives and developer interviews. Coming June 2020.Subscribe to Gamesradar: http://goo.gl/cnjsn1"}, {"source": {"id": null, "name": "Macrumors.com"}, "author": "Mitchel Broussard", "title": "Deals: Verizon Still Offering Big Discounts on AirPods Pro and iPhone XS Cases - MacRumors", "description": "Verizon has a few ongoing deals to end this week, offering what remains to be one of the lowest prices we've seen on Apple's AirPods Pro at...", "url": "https://www.macrumors.com/2020/04/24/deals-verizon-airpods-pro/", "urlToImage": null, "publishedAt": "2020-04-24T14:27:19Z", "content": "Verizon has a few ongoing deals to end this week, offering what remains to be one of the lowest prices we've seen on Apple's AirPods Pro at $224.99, down from $249.00. This deal beats Amazon's own sale by about $10, and is the best available online right now.… [+1290 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Paul Tassi", "title": "Mayhem 2.0 Has Broken ‘Borderlands 3’ In A Bad Way - Forbes", "description": "Borderlands 3 has introduced Mayhem 10 in Mayhem 2.0, and farming now makes little to no sense, and many builds are broken.", "url": "https://www.forbes.com/sites/paultassi/2020/04/24/mayhem-20-has-broken-borderlands-3-in-a-bad-way/", "urlToImage": null, "publishedAt": "2020-04-24T14:15:16Z", "content": "Borderlands 3\r\nGearbox\r\nYesterday, Borderlands 3 introduced a whole bunch of new things into the game, bug fixes, character buffs, a temporary loot event and a new Cartels game mode. But above all else Gearbox totally redesigned the endgame of Borderlands 3 f… [+4477 chars]"}, {"source": {"id": null, "name": "Tomsguide.com"}, "author": "Kate Kozuch", "title": "Zoom just got a killer feature to beat every video call app - Tom's Guide", "description": "Real-time transcription takes Zoom meetings to the next level", "url": "https://www.tomsguide.com/news/zoom-just-got-a-killer-feature-to-beat-every-video-call-app", "urlToImage": null, "publishedAt": "2020-04-24T14:09:00Z", "content": "Zoom calls are about to give the video conferencing service a serious edge over Google Hangouts, Microsoft Teams, and all the other best video chat apps battling for the loyalty of everyone working from home. \r\nOtter.ai, a real-time chat transcription service… [+2215 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "NARUTO SHIPPUDEN: Ultimate Ninja STORM 4 ROAD TO BORUTO – Launch Trailer - Nintendo Switch - Nintendo", "description": "The latest game in the Ultimate Ninja Storm series has arrived for Nintendo Switch! Fight in the Great Ninja War and fight alongside Boruto and the next gene...", "url": "https://www.youtube.com/watch?v=briRubbkA60", "urlToImage": null, "publishedAt": "2020-04-24T14:00:15Z", "content": null}, {"source": {"id": null, "name": "Destructoid.com"}, "author": "Chris Moyse", "title": "WWE confirms there will be no WWE 2K release this year - Destructoid", "description": "WWE confirms there will be no WWE 2K release this year", "url": "https://www.Destructoid.com/wwe-confirms-there-will-be-no-wwe-2k-release-this-year-588012.phtml", "urlToImage": null, "publishedAt": "2020-04-24T14:00:00Z", "content": "Count it Out\r\nWorld Wrestling Entertainment (WWE) has confirmed that it will not be releasing a video game in 2020, marking the first year in decades that the company will forego a digital replication of its squared circle action. The announcement was officia… [+1439 chars]"}, {"source": {"id": null, "name": "Searchengineland.com"}, "author": "https://www.facebook.com/barryschwartz", "title": "New free version of Google Shopping rolling out now - Search Engine Land", "description": "It is now rolling out and should be fully live in the US by early next week.", "url": "https://searchengineland.com/new-free-version-of-google-shopping-rolling-out-now-333589", "urlToImage": null, "publishedAt": "2020-04-24T13:52:00Z", "content": "Google’s new free version of Google Shopping is now rolling out. A Google spokesperson has confirmed with Search Engine Land that this has begun to roll out. This does not mean it is fully rolled out and all U.S. searchers will see it immediately, but by earl… [+740 chars]"}, {"source": {"id": null, "name": "Electrek.co"}, "author": null, "title": "Ford might delay Mustang Mach-E launch, will update as production restarts - Electrek", "description": "Ford might delay the Mustang Mach-E launch amid the coronavirus pandemic and will give an updated timeline as it restarts its production facilities. The Mustang Mach-E is Ford’s first all-electric vehicle built from the ground up and one of the most anticipat…", "url": "https://electrek.co/2020/04/24/ford-delay-mustang-mach-e-launch-production-restart/", "urlToImage": null, "publishedAt": "2020-04-24T13:27:26Z", "content": "Ford might delay the Mustang Mach-E launch amid the coronavirus pandemic and will give an updated timeline as it restarts its production facilities.\r\nThe Mustang Mach-E is Ford’s first all-electric vehicle built from the ground up and one of the most anticipa… [+2960 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "PS5's Unconfirmed New Tech - Next-Gen Console Watch - IGN", "description": "Welcome back to Next-Gen Console Watch 2020, our new show following all the news and rumors on the PlayStation 5 and Xbox Series X. This week we take a look ...", "url": "https://www.youtube.com/watch?v=kvFG14lhynY", "urlToImage": null, "publishedAt": "2020-04-24T13:00:23Z", "content": null}, {"source": {"id": null, "name": "Marketwatch.com"}, "author": "Tomi Kilgore", "title": "Zoom's stock surges toward a record after inclusion in the Nasdaq 100 - MarketWatch", "description": "", "url": "http://www.marketwatch.com/story/zooms-stock-surges-toward-a-record-after-inclusion-in-the-nasdaq-100-2020-04-24", "urlToImage": null, "publishedAt": "2020-04-24T12:37:00Z", "content": "Shares of Zoom Video Communications Inc.\r\n ZM, \r\n -6.08%\r\nsurged 3.9% toward a record high in premarket trading Friday, after the Nasdaq Inc.\r\n NDAQ, \r\n +1.71%\r\nsaid it was adding the virtual-meeting platform company to its Nasdaq 100 index\r\n NDX, \r\n +1.67%\r\n… [+546 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Dieter Bohn", "title": "Making macOS run well on ARM processors isn’t the hard part - The Verge", "description": "We finally have a report confirming Apple is actively working on ARM processors for Macs. But as Dieter Bohn explains, just getting macOS and Apple’s own apps running  on it isn’t enough. Processor transitions are hard!", "url": "https://www.theverge.com/2020/4/24/21233661/macos-arm-processor-transition-apps-developers-catalyst-wwdc", "urlToImage": null, "publishedAt": "2020-04-24T11:21:16Z", "content": "Less surprise will mean more delight\r\nPhoto by Nilay Patel / The Verge\r\nMark Gurman at Bloomberg has the confirmation weve all be waiting for: Apple will reportedly use a 12-core 5nm ARM processor in a 2021 Mac. Theres plenty of time to work out the details, … [+11995 chars]"}, {"source": {"id": null, "name": "Phonearena.com"}, "author": "Adrian Diaconescu", "title": "New leaks reveal LG Velvet 5G camera specs, battery size, memory, and more - PhoneArena", "description": "The LG Velvet 5G is not exactly a question mark after the company itself has revealed a bunch of stuff about the upcoming phone, but now almost all of the key specs are out of the bag.", "url": "https://www.phonearena.com/news/lg-velvet-5g-leaked-specs-camera-battery-memory-more_id124120", "urlToImage": null, "publishedAt": "2020-04-24T11:04:00Z", "content": "All content, features, and design are Copyright 2001-2020 PhoneArena.com.PhoneArena may receive a small commission if you purchase through affiliate links on this page.All rights reserved. Reproduction in whole or in part or in any form or medium without writ… [+28 chars]"}, {"source": {"id": null, "name": "Rockpapershotgun.com"}, "author": null, "title": "XCOM: Chimera Squad is out now, and it's half-price - Rock Paper Shotgun", "description": "It’s time to put down your world-saving guns and pick up your alien-policemen batons, because XCOM: Chimera Squad is out.", "url": "https://www.rockpapershotgun.com/2020/04/24/xcom-chimera-squad-is-out-now-and-its-half-price/", "urlToImage": null, "publishedAt": "2020-04-24T10:17:00Z", "content": "It’s time to put down your world-saving guns and pick up your alien-policing batons, because XCOM: Chimera Squad is out. XCOPS takes a big sidewards leap away from the main series, boiling down turn-based combat into single-room encounters. Developers Firaxis… [+2356 chars]"}, {"source": {"id": null, "name": "Milehighreport.com"}, "author": "Tim Lynch", "title": "Denver Broncos: Alabama WR Jerry Jeudy highlights - Mile High Report", "description": "The Denver Broncos have a new wide receiver in Jerry Jeudy. Here are his Alabama highlight reels. Enjoy!", "url": "https://www.milehighreport.com/2020/4/24/21233874/jerry-jeudy-highlights", "urlToImage": null, "publishedAt": "2020-04-24T09:34:37Z", "content": "The Denver Broncos have a new wide receiver in Jerry Jeudy. Here are his Alabama highlight reels. Enjoy!"}, {"source": {"id": null, "name": "Nintendolife.com"}, "author": "Nintendo Life", "title": "Random: Lord Of The Rings Actor Elijah Wood Visits Animal Crossing Player's Island To Sell His Turnips - Nintendo Life", "description": "Direct from Driftwood", "url": "http://www.nintendolife.com/news/2020/04/random_lord_of_the_rings_actor_elijah_wood_visits_animal_crossing_players_island_to_sell_his_turnips", "urlToImage": null, "publishedAt": "2020-04-24T02:30:00Z", "content": null}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Gordon Kelly", "title": "Google Just Gave Millions Of Users A Reason To Quit Chrome, Windows 10 - Forbes", "description": "Google has revealed an unfixable problem which may force you to pick between Windows 10 and Chrome.", "url": "https://www.forbes.com/sites/gordonkelly/2020/04/23/google-chrome-critical-security-exploit-windows-10-upgrade-warning-update-chrome-browser/", "urlToImage": null, "publishedAt": "2020-04-24T00:36:00Z", "content": "Google is always improving Chrome and it recently issued a brilliant (if long overdue) upgrade. That said, there have also been some recent controversial changes, security problems and data concerns and now Google has detailed a serious new problem in Chrome … [+2782 chars]"}, {"source": {"id": null, "name": "Bleepingcomputer.com"}, "author": "Sergiu Gatlan", "title": "Windows 10 KB4549951 update fails to install, causes BSODs - BleepingComputer", "description": "The Windows 10 KB4549951 ​​​​​​​cumulative update is reportedly failing to install and is causing blue screens of death (BSOD) after installation reboots, among other issues, according to user reports.", "url": "https://www.bleepingcomputer.com/news/microsoft/windows-10-kb4549951-update-fails-to-install-causes-bsods/", "urlToImage": null, "publishedAt": "2020-04-23T23:11:05Z", "content": "The Windows 10 KB4549951 cumulative update is reportedly failing to install and is causing blue screens of death (BSOD) after installation reboots, among other issues, according to user reports.\r\nKB4549951 is a cumulative update with security fixes released a… [+6269 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Patrick Holland", "title": "Motorola Edge Plus hands-on: A $1000 5G phone with premium specs - CNET", "description": "It costs the same as the Galaxy S20, is about the same size as Galaxy S20 Plus and has the same battery and main camera as the Galaxy S20 Ultra.", "url": "https://www.cnet.com/reviews/motorola-edge-plus-hands-on-a-1000-5g-phone-with-premium-specs-preview/", "urlToImage": null, "publishedAt": "2020-04-23T22:09:48Z", "content": "Motorola, a company best known for its budget and midrange phones, on Wednesday took an enormous step forward into the premium phone market and launched the Motorola Edge and Edge Plus. Both phones join the Motorola Razr as high-end offerings from the Chicago… [+9703 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "How to Make the Mario Remasters Meaningful - Mario 35th Anniversary - IGN", "description": "To celebrate Mario's 35th Anniversary (and presumably keep profits rolling in through Xbox Series X and Playstation 5 launch seasons), Nintendo is rumored to...", "url": "https://www.youtube.com/watch?v=53b9gIk8-pQ", "urlToImage": null, "publishedAt": "2020-04-23T22:00:03Z", "content": "To celebrate Mario's 35th Anniversary (and presumably keep profits rolling in through Xbox Series X and Playstation 5 launch seasons), Nintendo is rumored to be announcing a slew of Super Mario ports, remasters, remakes, and even a new Paper Mario title, all … [+274 chars]"}, {"source": {"id": null, "name": "Venturebeat.com"}, "author": "Jeff Grubb", "title": "Your Super Mario Maker 2 levels are a lot less cute in World Maker - VentureBeat", "description": "Super Mario Maker 2 just got its final update, and the new World Maker mode highlights a problem: no one knows how to make a fun Mario course.", "url": "https://venturebeat.com/2020/04/23/your-super-mario-maker-2-levels-are-a-lot-less-cute-in-world-maker/", "urlToImage": null, "publishedAt": "2020-04-23T21:44:17Z", "content": "Super Mario Maker 2s latest update reveals that almost no one knows how to make a fun Mario stage. This was once easy to ignore, because thats not actually what you should go to Super Mario Maker for. Instead, this series has always provided players with a fa… [+2272 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Alessandro Barbosa", "title": "CoD: Modern Warfare Multiplayer And Warzone Patch Fixes Important Exploits - GameSpot", "description": "A small but important update is out now, with the patch notes detailing exploit fixes.", "url": "https://www.gamespot.com/articles/cod-modern-warfare-patch-fixes-warzone-exploits/1100-6476369/", "urlToImage": null, "publishedAt": "2020-04-23T21:01:00Z", "content": "Developer Infinity Ward has released a new, relatively small update for Call of Duty: Modern Warfare and its standalone battle royale mode, Warzone, across all platforms.\r\nThe patch mainly fixes two large exploits, both of which were having a big impact in Wa… [+1441 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Patricia Hernandez", "title": "Death Stranding fan spent 15 hours trying to spell out name with pee - Polygon", "description": "After discovering that Death Stranding lets you leave imprints in the snow, one determined fan spent hours trying to write out his name with the game’s infamous pee mechanic — but not without plenty of roadblocks along the way.", "url": "https://www.polygon.com/2020/4/23/21233323/death-stranding-pee-name-hideo-kojima-ps4-sony", "urlToImage": null, "publishedAt": "2020-04-23T20:48:16Z", "content": "To boldly go where no man has gone before"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Andrew Hoyle", "title": "iPhone 11 Pro vs. OnePlus 8 Pro cameras: My quarantine walk photo comparison - CNET", "description": "We put the two phones side-by-side to see which can take the best photos in daylight and night.", "url": "https://www.cnet.com/news/iphone-11-pro-vs-oneplus-8-pro-cameras-my-quarantine-walk-photo-comparison/", "urlToImage": null, "publishedAt": "2020-04-23T20:40:00Z", "content": "OnePlus has taken the wraps off its latest flagship, the OnePlus 8 Pro. Along with its silky blue finish, the phone packs a multicamera setup that includes a standard zoom, a super wide-angle lens and a 3x zoom. It impressed Lynn La in her full OnePlus 8 Pro … [+6477 chars]"}, {"source": {"id": null, "name": "Dexerto.com"}, "author": "Paul Cot", "title": "Trainers reporting increased shiny rates for Pokemon Go Buddy Up event - Dexerto", "description": "Trainers are encountering the likes of Feebas' shiny form much more frequently thanks to the Pokemon Go Buddy Up event.", "url": "https://www.dexerto.com/pokemon/trainers-reporting-increased-shiny-rates-for-pokemon-go-buddy-up-event-1357138", "urlToImage": null, "publishedAt": "2020-04-23T20:30:17Z", "content": "Trainers are currently in the middle of enjoying the bonuses that the Pokemon Go Buddy Up event has to offer. In addition to these though, increased shiny rates are also being reported.\r\nIn particular Feebas shiny encounters seem to have increased. The Magika… [+2551 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Richard Wakeling", "title": "Xbox Series X: What Do Game Devs Think Of Microsoft's Next-Gen Console - GameSpot", "description": "Various Microsoft and third-party developers have spoken about the Xbox Series X and its improved hardware.", "url": "https://www.gamespot.com/articles/xbox-series-x-what-do-game-devs-think-of-microsoft/1100-6476426/", "urlToImage": null, "publishedAt": "2020-04-23T20:20:00Z", "content": "The Xbox Series X is set to usher in the next-generation of console gaming in just a few months--along with Sony's PlayStation 5. Microsoft has already shared plenty of details about its upcoming console, detailing the Xbox Series X's full specs, storage solu… [+3254 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Michael McWhertor", "title": "Overwatch’s communication wheel now lets you customize the voice lines - Polygon", "description": "Players can now choose which voice lines are included in Overwatch’s communication wheel, with new additions like “press the objective,” “fall back,” and “sorry.”", "url": "https://www.polygon.com/2020/4/23/21233221/overwatch-communication-wheel-custom-voice-lines-update-patch", "urlToImage": null, "publishedAt": "2020-04-23T20:15:58Z", "content": "Players can now choose which voice lines are included in the wheel"}, {"source": {"id": null, "name": "Macrumors.com"}, "author": "Juli Clover", "title": "Demo: Using Apple Music on a Samsung TV - MacRumors", "description": "Samsung and Apple have partnered to bring the Apple Music app to Samsung TVs, and as of today, the Apple Music service and dedicated app can be...", "url": "https://www.macrumors.com/2020/04/23/apple-music-samsung-tv-demo/", "urlToImage": null, "publishedAt": "2020-04-23T19:49:03Z", "content": "Samsung and Apple have partnered to bring the Apple Music app to Samsung TVs, and as of today, the ‌Apple Music‌ service and dedicated app can be accessed on Samsung TV sets manufactured in 2018 and later.\r\nSubscribe to the MacRumors YouTube channel for more … [+1894 chars]"}, {"source": {"id": null, "name": "9to5google.com"}, "author": null, "title": "Chromecast: 5 reasons you need one in your home [Video] - 9to5Google", "description": "You may or may not have picked up a Chromecast already but we've got five solid reason why you need the Google-powered streaming dongle.", "url": "https://9to5google.com/2020/04/23/chromecast-5-reasons-you-need-one-in-your-home-video/", "urlToImage": null, "publishedAt": "2020-04-23T19:34:53Z", "content": "Cord-cutters will no doubt be laughing at the thought of going without a streaming stick such as the Chromecast, but with COVID-19 spreading and people locked at home, there has never been a better time to introduce one to your home.\r\nIf you cast your mind ba… [+4562 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Michael McWhertor", "title": "Sega Saturn mascot Segata Sanshiro may have just returned, with an evil twist - Polygon", "description": "We enter the dark middle chapter of Segata Sanshiro’s return in a new commercial from Sega featuring its new Japanese mascot, Sega Shiro.", "url": "https://www.polygon.com/2020/4/23/21233064/sega-segata-shiro-mascot-japan", "urlToImage": null, "publishedAt": "2020-04-23T19:07:52Z", "content": "The dark middle chapter of Segata Sanshiros return"}, {"source": {"id": null, "name": "Techspot.com"}, "author": "Shawn Knight", "title": "Extreme overclocker pushes dated AMD FX-8350 beyond 8.1GHz - TechSpot", "description": "Renowned German overclocker Roman “der8auer” Hartung recently revisited an old CPU to see if a newer motherboard and a voltage controller could help him squeeze even more performance out of his already impressive AMD FX-8350 processor.", "url": "https://www.techspot.com/news/84960-extreme-overclocker-pushes-dated-amd-fx-8350-beyond.html", "urlToImage": null, "publishedAt": "2020-04-23T17:34:40Z", "content": "In a nutshell: Overclockers are a curious bunch. Much like automotive enthusiasts, they're obsessed with squeezing the absolute most performance out of a given piece of hardware or platform, even if it means going beyond what is practical or efficient. \r\nReno… [+1765 chars]"}, {"source": {"id": null, "name": "Uploadvr.com"}, "author": "www.facebook.com/ianhmltn", "title": "Supernatural Takes Oculus Quest Fitness A Few Steps Further Than Beat Saber - UploadVR", "description": "Supernatural is a new fitness and workout app for Oculus Quest that takes a few steps to be tuned for exercise and wireless not seen in other VR apps.", "url": "https://uploadvr.com/supernatural-fitness-quest/", "urlToImage": null, "publishedAt": "2020-04-23T17:00:00Z", "content": "After playing Supernatural this week, my legs are sore to a degree unmatched by Beat Saber, Pistol Whip, BoxVR, OhShape, or any other VR app.\r\nIt is easy to see the influence of those earlier VR games on the new exercise and fitness software from Within, but … [+2141 chars]"}, {"source": {"id": null, "name": "Macworld.com"}, "author": "Alexandria Haslam", "title": "This iPhone 8 Plus is way cheaper than the iPhone SE right now - Macworld", "description": "Verizon's Visible is selling the 64GB iPhone 8 Plus for $360 today and you get a $100 MasterCard gif card to boot.", "url": "https://www.macworld.com/article/3540190/this-iphone-8-plus-is-way-cheaper-than-the-iphone-se-right-now.html", "urlToImage": null, "publishedAt": "2020-04-23T16:11:00Z", "content": "If you like the price of the iPhone SE but don't want such a small screen, we've got a great deal for you: Verizon's Visible is selling an unlocked iPhone 8 Plus for $360 todayRemove non-product link, more than $200 off its usual price. And to sweeten the dea… [+1311 chars]"}, {"source": {"id": null, "name": "Motor1.com"}, "author": "Anthony Alaniz", "title": "New BMW M440i Convertible, M4 Coupe Spied Testing At The Green Hell - Motor1 ", "description": "The new 4 Series could debut this June.", "url": "https://www.motor1.com/news/414409/bmw-4-series-spied-nurburgring/", "urlToImage": null, "publishedAt": "2020-04-23T15:26:51Z", "content": "Development for the various BMW 4 Series variants continues as the automaker takes two different versions to the Nürburgring. New videos show both cars at the famous track, and both are still rocking camouflage. However, we can see the large, controversial gr… [+1531 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Nicole Carpenter", "title": "In Other Waters is about exploring an alien ocean through an AI interface - Polygon", "description": "In Other Waters, from developer Jump Over The Age, is a unique game that takes place entirely on a map interface. It’s out now on Windows PC and Nintendo Switch.", "url": "https://www.polygon.com/2020/4/23/21231689/in-other-waters-fellow-traveler-impressions-windows-pc-nintendo-switch", "urlToImage": null, "publishedAt": "2020-04-23T15:00:50Z", "content": "I know so much about Gliese 677Cc, the planetary setting of In Other Waters. The alien ocean is a weird, wonderful ecosystem of strange stalks, spores, and creatures scattered among its depths. \r\nIve noticed the odd behavior of the oceans flora and fauna. Ive… [+5874 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "What is XCOM 2? - Everything you need to know about XCOM 2 Collection - Nintendo Switch - Nintendo", "description": "Before you jump into the XCOM 2 Collection for Nintendo Switch on May 29, watch this video explaining everything you need to know about XCOM 2. Learn more: h...", "url": "https://www.youtube.com/watch?v=fGA9F8HhRIs", "urlToImage": null, "publishedAt": "2020-04-23T15:00:16Z", "content": "Before you jump into the XCOM 2 Collection for Nintendo Switch on May 29, watch this video explaining everything you need to know about XCOM 2.\r\nLearn more: https://www.nintendo.com/games/detail...\r\n#XCOM#XCOM2#NintendoSwitch\r\nSubscribe for more Nintendo fun!… [+309 chars]"}, {"source": {"id": null, "name": "Theinformation.com"}, "author": "", "title": "Inside WhatsApp's Retreat on Ads - theinformation.com", "description": "After more than a year of preparation, WhatsApp was finally close to flipping the switch on advertising, kick-starting a plan to generate billions of dollars a year in revenue from one of Facebook’s crown jewels, which it had acquired for $22 billion six year…", "url": "https://www.theinformation.com/articles/inside-whatsapps-retreat-on-ads", "urlToImage": null, "publishedAt": "2020-04-23T14:01:00Z", "content": "After more than a year of preparation, WhatsApp was finally close to flipping the switch on advertising, kick-starting a plan to generate billions of dollars a year in revenue from one of Facebooks crown jewels, which it had acquired for $22 billion six years… [+747 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Moving Out Review - IGN", "description": "Enjoyably tense and frequently hysterical, Moving Out is a must play for fans of same-screen multiplayer games. Reviewed by Tristan Ogilvie on Nintendo Switc...", "url": "https://www.youtube.com/watch?v=vHXb2QsCChQ", "urlToImage": null, "publishedAt": "2020-04-23T12:00:36Z", "content": "Enjoyably tense and frequently hysterical, Moving Out is a must play for fans of same-screen multiplayer games. Reviewed by Tristan Ogilvie on Nintendo Switch. Also available on PlayStation 4, Xbox One and PC."}, {"source": {"id": null, "name": "Bleepingcomputer.com"}, "author": "Lawrence Abrams", "title": "Malwarebytes releases new VPN service for Windows - BleepingComputer", "description": "Malwarebytes is expanding into privacy with the release of a new Windows VPN service called Malwarebytes Privacy. Malwarebytes plans on offering Mac, iOS, Android, and ChromeOS versions in the future.", "url": "https://www.bleepingcomputer.com/news/security/malwarebytes-releases-new-vpn-service-for-windows/", "urlToImage": null, "publishedAt": "2020-04-23T12:00:00Z", "content": "Malwarebytes is expanding into privacy with the release of a new Windows VPN service called Malwarebytes Privacy. Malwarebytes plans on offering Mac, iOS, Android, and ChromeOS versions in the future.\r\nMalwarebytes Privacy is available today for $59.99 as a s… [+2584 chars]"}, {"source": {"id": null, "name": "Pcmag.com"}, "author": "Matthew Humphries", "title": "Crucial Launches Its Fastest Ever M.2 SSD - PCMag", "description": "The P5 is a PCIe 3.0 x4 M.2 SSD capable of reaching 3,400MB/s read speeds and 3,000MB/s writes.", "url": "https://www.pcmag.com/news/crucial-launches-its-fastest-ever-m2-ssd", "urlToImage": null, "publishedAt": "2020-04-23T11:01:10Z", "content": "We're fast approaching the end of the road for PCIe 3.0 as PCIe 4.0 adoption begins by storage and motherboard manufacturers, but Crucial is offering us one more, \"extra fast\" 3.0 drive called the P5.\r\nThe Crucial P5 SSD is a PCIe x4 NVMe M.2 drive using Micr… [+1679 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "All 5 Golden Wrench Locations | FORTNITE CHALLENGE WEEK 10 SEASON 2 - GamesRadar", "description": "Another week means another bunch of challenges, but the one that you’ll need help with the most this week is finding all of the Golden Wrenches. Here’s where...", "url": "https://www.youtube.com/watch?v=Q5MjRJlMfSY", "urlToImage": null, "publishedAt": "2020-04-23T08:50:23Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Giving Fallout 76 Another Shot - GameSpot", "description": "Fallout 76 had a rocky launch, but with the Wastelanders update, you might be tempted to give it another shot. Here's what Jake Dekker has to say after spend...", "url": "https://www.youtube.com/watch?v=kOH48B9HChA", "urlToImage": null, "publishedAt": "2020-04-23T04:00:15Z", "content": null}]}