{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": "engadget", "name": "Engadget"}, "author": "", "title": "Former Apple designer drops Watch trivia on its fifth anniversary - Engadget", "description": "Imran Chaudhri, Apple’s design lead for hardware from 1995 to 2016, dropped some details about Apple Watch’s history on its fifth anniversary.  While Chaudhri is no longer with the tech giant, he shared a photo of the Watch team on launch day, as well as a re…", "url": "https://www.engadget.com/former-apple-designer-drops-watch-trivia-on-its-fifth-anniversary-144849444.html", "urlToImage": null, "publishedAt": "2020-04-25T18:39:26Z", "content": "Imran Chaudhri, Apple’s design lead for hardware from 1995 to 2016, dropped some details about Apple Watch’s history on its fifth anniversary. While Chaudhri is no longer with the tech giant, he shared a photo of the Watch team on launch day, as well as a rep… [+906 chars]"}, {"source": {"id": "ign", "name": "IGN"}, "author": null, "title": "Fallout 76: Wastelanders Review - IGN - IGN", "description": "The Wastelanders update at least solidifies Fallout 76 as something that’s worth recommending to series fans who are interested in multiplayer. The new storyline is great, but not as easy to play with friends as it should be.", "url": "https://ca.ign.com/articles/fallout-76-wastelanders-review", "urlToImage": null, "publishedAt": "2020-04-25T18:11:25Z", "content": "They say war never changes, but if thats true, nobody told Fallout 76. Following a rough launch in 2018 that was plagued by bugs, server issues, and a generally lackluster game, Bethesda has, to its credit, not given up: its consistently delivered a slew of u… [+9372 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Lynn La", "title": "Best phones under $300: Moto G Power, Galaxy A50, LG K40 and more - CNET", "description": "If you're looking for a phone on a budget, check out CNET's top 7 picks.", "url": "https://www.cnet.com/news/best-phones-under-300-moto-g-power-galaxy-a50-lg-k40-and-more/", "urlToImage": null, "publishedAt": "2020-04-25T17:17:48Z", "content": "If you're on a tight budget but in need of a phone, there are a many devices that cost $300 or less. Many of our favorite phones are from Motorola, which is unsurprising given that the company has made feature-rich budget phones for years now. In addition to … [+1302 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Gareth Beavis", "title": "iPhone SE 2020 teardown reveals intriguing facts about battery and camera - TechRadar India", "description": "Things are more similar than we anticipated", "url": "https://www.techradar.com/news/iphone-se-2020-teardown-reveals-intriguing-facts-about-battery-and-camera", "urlToImage": null, "publishedAt": "2020-04-25T16:21:00Z", "content": "Weve been waiting to see what parts are in Apples new iPhone - our iPhone SE review left us with a few questions we wanted answering, and iFixits iPhone SE early teardown has begun to provide a few of them.\r\nWhile theres still more to come when the full teard… [+2050 chars]"}, {"source": {"id": null, "name": "Androidpolice.com"}, "author": "https://www.facebook.com/corbin.davenport.50", "title": "The ultimate guide for installing the Google Play Store on Amazon Fire tablets - Android Police", "description": "Amazon's Fire tablets are incredibly popular, mostly because they're incredibly cheap. However, none of them come with access to the Google Play Store,", "url": "https://www.androidpolice.com/2020/04/25/install-play-store-amazon-fire-tablet/", "urlToImage": null, "publishedAt": "2020-04-25T16:07:19Z", "content": "This story was originally published 2020/03/18 4:41pm PDTon Mar 18, 2020 and last updated 2020/04/25 8:48am PDTApr 25, 2020. \r\nAmazon's Fire tablets are incredibly popular, mostly because they're incredibly cheap. However, none of them come with access to the… [+13115 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Ian Sherr", "title": "Apple, Google update coronavirus tracking tech to address privacy concerns - CNET", "description": "The tech giants added new security features for their iPhone and Android phone technology.", "url": "https://www.cnet.com/news/apple-google-update-coronavirus-tracking-tech-to-address-privacy-concerns/", "urlToImage": null, "publishedAt": "2020-04-25T14:38:34Z", "content": "Background by Pixabay/Photo by Angela Lang/CNET\r\nFor the most up-to-date news and information about the coronavirus pandemic, visit the WHO website.\r\nAs companies and governments around the world battle the coronavirus pandemic, Apple and Google are making ch… [+4845 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Cameron Faulkner", "title": "Save on Google Nest’s Hello video doorbell and the 15-inch MacBook Pro - The Verge", "description": "This weekend, Daily Steals is offering Verge readers a $30 discount on the Google Nest Hello video doorbell. Additionally, this is a good time to save on a 15-inch MacBook Pro, an iPhone SE 2, and Cyberpunk 2077.", "url": "https://www.theverge.com/good-deals/2020/4/25/21234844/google-nest-hello-video-doorbell-macbook-pro-cyberpunk-2077-deal-sale-preorder", "urlToImage": null, "publishedAt": "2020-04-25T14:15:44Z", "content": "Plus, you can pick up a discounted Shark robot vacuum and the iPhone SE 2 for less\r\nPhoto by Florence Ion for The Verge\r\nThis story is part of a group of stories called \r\nOnly the best deals on Verge-approved gadgets get the Verge Deals stamp of approval, so … [+3323 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Stephen Shankland", "title": "Why the iPhone SE's A13 chip is a big deal - CNET", "description": "Performance on a budget arrives just in time for buyers spooked by the pandemic.", "url": "https://www.cnet.com/news/iphone-se-a13-chip-processor-so-good-outclasses-all-android-phones/", "urlToImage": null, "publishedAt": "2020-04-25T13:56:55Z", "content": "John Kim/CNET\r\nBy packing the big A13 chip into its small iPhone SE, Apple has made its budget smartphone a more compelling product at just the right time for a coronavirus-spooked world. Where most budget phones cut costs by using lower-end processors, the n… [+3579 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Zoom’s Good Week Ends on Sour Note After Facebook Crashes Party - Bloomberg", "description": null, "url": "https://www.bloomberg.com/tosv2.html?vid=&uuid=177d2d80-8704-11ea-b23a-c3ca0be50368&url=L25ld3MvYXJ0aWNsZXMvMjAyMC0wNC0yNS96b29tLXMtZ29vZC13ZWVrLWVuZHMtb24tc291ci1ub3RlLWFmdGVyLWZhY2Vib29rLWNyYXNoZXMtcGFydHk=", "urlToImage": null, "publishedAt": "2020-04-25T13:13:17Z", "content": "To continue, please click the box below to let us know you're not a robot."}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Dave Thier", "title": "‘Pokémon GO’: Here’s A Promo Code For Some Free PokéBalls And Berries. - Forbes", "description": "It's community day, and you need Pokéballs. Here's a 'Pokémon GO' promo code for some free great balls and razzberries.", "url": "https://www.forbes.com/sites/davidthier/2020/04/25/pokmon-go-heres-a-promo-code-for-some-free-pokballs-and-berries/", "urlToImage": null, "publishedAt": "2020-04-25T12:36:06Z", "content": "pokemon GO\r\nCredit: Niantic\r\nIts a weird one, today. Pokémon GO is running an extra-long Community Day with some crucial additions today, trying to re-orient an event all about getting outside and hanging out with people to one thats all about staying inside … [+1807 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Jason Cipriani", "title": "14 hidden iPhone and iPad tricks: Screenshots, trackpad, better battery charging - CNET", "description": "Whether you have an iPhone SE or an iPhone 11 Pro, Apple's iOS 13 is full of lesser-known features like improved screenshots and a new volume indicator that make the iPhone and iPad infinitely appealing.", "url": "https://www.cnet.com/how-to/14-hidden-iphone-and-ipad-tricks-screenshots-trackpad-better-battery-charging/", "urlToImage": null, "publishedAt": "2020-04-25T11:29:05Z", "content": "iOS 13 brings a lot of new features to your iPhone.\r\nPatrick Holland/CNET\r\nOne benefit of using Apple devices is that the company keeps the majority of its lineup updated with the latest operating system. Take iOS and iPadOS 13.4 as an example. It spans from … [+9566 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Gordon Kelly", "title": "Google Just Gave Millions Of Users A Reason To Quit Windows 10 - Forbes", "description": "Google has revealed an unfixable problem which may force you to pick between Windows 10 and Chrome.", "url": "https://www.forbes.com/sites/gordonkelly/2020/04/23/google-chrome-critical-security-exploit-windows-10-upgrade-warning-update-chrome-browser/", "urlToImage": null, "publishedAt": "2020-04-25T11:16:38Z", "content": "04/25 Update below. This post was originally published on April 23\r\nGoogle is always improving Chrome and it recently issued a brilliant (if long overdue) upgrade. Unfortunately, now Google has detailed a serious new problem in Chrome which cannot be fixed, a… [+3970 chars]"}, {"source": {"id": null, "name": "Motor1.com"}, "author": "Jacob Oliva", "title": "Watch 2021 VW Golf R Spied In Action At The Nürburgring - Motor1 ", "description": "It's lacking something, though.", "url": "https://www.motor1.com/news/414745/volkswagen-golf-r-nurburgring-video/", "urlToImage": null, "publishedAt": "2020-04-25T10:42:03Z", "content": "More than a week ago, we've seen the 2021 Volkswagen Golf R in spy images from the Nürburgring with minimal camouflage almost non-existent, actually. However, those are only still shots and for many car enthusiasts, a non-moving preview of the Golf R won't su… [+1377 chars]"}, {"source": {"id": null, "name": "Autoevolution.com"}, "author": "Andrei Tutu", "title": "2015 Ford Mustang GT 'Generation Gap\" Is a Bad Boy 1967 Eleanor Conversion - autoevolution", "description": "Wouldn't it be a dream to enjoy a Ford Mustang that mixes the retro look of a 1967 Fastback with the plethora of benefits delivered by a 2015 GT? The answer to this question is obvious, so the motor-crazy crew over at B Is For Build decided to translate this …", "url": "https://www.autoevolution.com/news/2015-ford-mustang-gt-generation-gap-is-a-bad-boy-1967-eleanor-conversion-142983.html", "urlToImage": null, "publishedAt": "2020-04-25T10:39:00Z", "content": "It's been almost a month since we first discussed this stunning Blue Oval project and while the March article included all the uphill work required to put this contraption together, the time has come to start enjoying the fruits of all that labor. As such, th… [+1229 chars]"}, {"source": {"id": null, "name": "Dexerto.com"}, "author": "Andy Williams", "title": "Calls for Alinity to be banned on Twitch following livestream accident - Dexerto", "description": "Twitch star Alinity Divine has found herself in the public spotlight yet again, after a slip-up on steam.", "url": "https://www.dexerto.com/entertainment/calls-for-alinity-to-be-banned-on-twitch-following-livestream-accident-1357732", "urlToImage": null, "publishedAt": "2020-04-25T10:05:07Z", "content": "Twitch streamer Natalia ‘Alinity’ Mogollon has found herself at the center of controversy again, as calls for her to be banned from the platform have spread on social media after her April 24 livestream.\r\nThis follows her previous high-profile controversy, wh… [+2675 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "The Kim Komando Show", "title": "10 COVID-19 scams spreading right now that people are falling for - Fox News", "description": "The numbers are staggering. The Federal Trade Commission says coronavirus-related scams have cost Americans $13.4 million so far this year. Google blocks more than 100 million phishing emails every day as criminals try to steal money and personal information.…", "url": "https://www.foxnews.com/tech/10-covid-19-scams-spreading-right-now-that-people-are-falling-for", "urlToImage": null, "publishedAt": "2020-04-25T08:01:18Z", "content": "The numbers are staggering. The Federal Trade Commission says coronavirus-related scams have cost Americans $13.4 million so far this year. Google blocks more than 100 million phishing emails every day as criminals try to steal money and personal information.… [+7291 chars]"}, {"source": {"id": null, "name": "Nintendolife.com"}, "author": "Nintendo Life", "title": "Random: Cadence Of Hyrule Guitarist Jokingly Petitions For Time Travel Cheater Stamp In Animal Crossing - Nintendo Life", "description": "Insists he was \"just poking some fun\"", "url": "http://www.nintendolife.com/news/2020/04/random_cadence_of_hyrule_guitarist_jokingly_petitions_for_time_travel_cheater_stamp_in_animal_crossing", "urlToImage": null, "publishedAt": "2020-04-25T08:00:00Z", "content": "With the \"filthy\" \"cheater\" pejoratives removed, the general idea isn't 100% bad. Some online players unfamiliar with TTing might wonder why other people's towns online are so far ahead of their own town. So maybe a little (non-pejorative) icon could be added… [+1965 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Jordan Ramée", "title": "Apex Legends S4 Is Getting One More Limited-Time Event Before Season 5 Starts - GameSpot", "description": "Season 4: Assimilation is being extended by one week, providing enough room for Apex Legends to host a new Battle Armor limited-time event.", "url": "https://www.gamespot.com/articles/apex-legends-s4-is-getting-one-more-limited-time-e/1100-6476480/", "urlToImage": null, "publishedAt": "2020-04-25T07:52:00Z", "content": "Respawn is extending Apex Legends Season 4: Assimilation by one more week in order to squeeze in one last limited-time event before Season 5 begins. The new event, Battle Armor, begins on April 28 and continues for 14 days.\r\nDuring the Battle Armor event, a n… [+1774 chars]"}, {"source": {"id": null, "name": "Tomsguide.com"}, "author": "Roland Moore-Colyer", "title": "Xbox Series X's crazy fast load times revealed — and PS5 should be worried - Tom's Guide", "description": "Xbox Series X super-fast SSD loads Gears 5 four times faster than Xbox One", "url": "https://www.tomsguide.com/news/xbox-series-xs-crazy-fast-load-times-revealed-and-ps5-should-be-worried", "urlToImage": null, "publishedAt": "2020-04-25T06:25:00Z", "content": "Microsofts Xbox Series X will load games much, much faster than the Xbox One, even if a games code isnt tweaked for the next-generation console. \r\nGears 5 loads four times faster on the Xbox Series X than it does on the Xbox One, according to Mike Rayner, tec… [+2197 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "NVIDIA RTX Voice Benchmark on GTX vs. RTX GPUs, Gaming Performance, & Voice Quality - Gamers Nexus", "description": "This benchmark tests NVIDIA RTX Voice for gaming performance impact, mostly to determine if RT hardware is even being used. 2080 Super, 2060, and GTX 1080 in...", "url": "https://www.youtube.com/watch?v=f_obMmLXlP4", "urlToImage": null, "publishedAt": "2020-04-25T04:03:07Z", "content": null}, {"source": {"id": null, "name": "Androidpolice.com"}, "author": null, "title": "The 5 best things about the OnePlus 8 Pro - Android Police", "description": "The higher price of the OnePlus 8 Pro hasn't gone down too well in some quarters, but there's no doubting that you still get a lot of phone for the money.", "url": "https://www.androidpolice.com/2020/04/24/5-best-oneplus-8-pro/", "urlToImage": null, "publishedAt": "2020-04-25T03:47:18Z", "content": "The higher price of the OnePlus 8 Pro hasn't gone down too well in some quarters, but there's no doubting that you still get a lot of phone for the money. Lets take a look at the five standout features of the latest OnePlus flagship. And don't worry, we've go… [+3189 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Matt Espineli", "title": "FF7 Remake Elemental Materia Guide: Where To Find This Essential Materia Orb - GameSpot", "description": "Here's how to get the only two Elemental Materia orbs available in FF7 Remake for PS4.", "url": "https://www.gamespot.com/articles/ff7-remake-elemental-materia-guide-where-to-find-t/1100-6476502/", "urlToImage": null, "publishedAt": "2020-04-25T03:26:00Z", "content": "In Final Fantasy 7 Remake, the Elemental Materia is one of the best Materia orbs you can get, as it can imbue either your weapons with elemental power and your armor with elemental defense. However, this Materia can be incredibly easy to miss if you're just g… [+2738 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Phil Hornshaw", "title": "Final Fantasy 7 Remake Guide: Every Johnny Scene - GameSpot", "description": "Meeting Johnny around the slums of Midgar will get you extra story scenes and unlock a Trophy, but you'll have to seek him out.", "url": "https://www.gamespot.com/articles/final-fantasy-7-remake-guide-every-johnny-scene/1100-6476501/", "urlToImage": null, "publishedAt": "2020-04-25T02:33:00Z", "content": "As you work your way through the slums of Midgar in Final Fantasy 7 Remake, you can't help but meet Johnny, a colorful character who's not especially bright. Despite mostly good intentions, Johnny can't help but get himself into trouble almost constantly--but… [+3443 chars]"}, {"source": {"id": null, "name": "Japantimes.co.jp"}, "author": "Internal Submission", "title": "160000 Nintendo game accounts may have been hacked - The Japan Times", "description": "Birthdays, email addresses and other information of the account holders for game consoles such as Wii U and Nintendo 3DS online, could have been viewed.", "url": "https://www.japantimes.co.jp/news/2020/04/25/business/tech/160000-nintendo-game-accounts-hacked/", "urlToImage": null, "publishedAt": "2020-04-25T01:10:00Z", "content": "Nintendo Co. has said that about 160,000 accounts for its home video game networking service may have been hit by an unauthorized login.\r\nBirthdays, email addresses and other information of the account holders for game consoles such as Wii U and Nintendo 3DS … [+583 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Oscar Gonzalez", "title": "Travis Scott event in Fortnite: How to watch the encore and find the Giant Astro Heads - CNET", "description": "The rapper dropped new tracks in a jaw-dropping concert. Catch the next show at midnight.", "url": "https://www.cnet.com/news/travis-scott-event-in-fortnite-how-to-watch-the-encore-and-find-the-giant-astro-heads/", "urlToImage": null, "publishedAt": "2020-04-25T01:02:37Z", "content": "Play some Fortnite and listen to a new track from Travis Scott.\r\nEpic Games\r\nFortnite events aren't only for players to check out new content from developer Epic Games. The popular battle royale game has also played host to multiple premieres and collaboratio… [+3718 chars]"}, {"source": {"id": null, "name": "Phonearena.com"}, "author": "Cosmin Vasile", "title": "OnePlus hit with big layoffs in Europe - PhoneArena", "description": "OnePlus has decided to shrink its workforce in three major markets (France, Germany, and the United Kingdom) by as much as 80 percent.", "url": "https://www.phonearena.com/news/OnePlus-Europe-layoffs_id124136", "urlToImage": null, "publishedAt": "2020-04-25T00:12:00Z", "content": "There's no way to sugarcoat this, so let's we're not going to hide the news behind positive statements. OnePlus is in the process of streamlining its operations in Europe, which is rumored to result in massive layoffs across all countries in the region.Engadg… [+922 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Jordan Ramée", "title": "Patch Notes Released For Latest Borderlands 3 Update; Moze Gets Another Buff - GameSpot", "description": "A new update will kick off off a bunch of new content in Borderlands 3, and also implement numerous bug fixes.", "url": "https://www.gamespot.com/articles/patch-notes-released-for-latest-borderlands-3-upda/1100-6476425/", "urlToImage": null, "publishedAt": "2020-04-25T00:12:00Z", "content": "Gearbox has released the full patch notes for a Borderlands 3 update scheduled to release today at 12 PM PT / 3 PM ET. The update will see the start of the Revenge of the Cartels limited-time event and Loot the Universe, adds Mayhem Mode 2.0, and implements d… [+26277 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Resident Evil 3 Remake's Hidden Difficulty Modes Improve Its Horror - Screen Rant", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiTWh0dHBzOi8vc2NyZWVucmFudC5jb20vcmVzaWRlbnQtZXZpbC0zLXJlbWFrZS1uaWdodG1hcmUtZGlmZmljdWx0eS1tb2RlLWdvb2Qv0gFRaHR0cHM6Ly9zY3JlZW5yYW50LmNvbS9yZXNpZGVudC1ldmlsLTMtcmVtYWtlLW5pZ2h0bWFyZS1kaWZmaWN1bHR5LW1vZGUtZ29vZC9hbXAv?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T00:01:31Z", "content": null}, {"source": {"id": null, "name": "9to5google.com"}, "author": null, "title": "You can now easily record Google 3D animals on Android - 9to5Google", "description": "Even before stay at home orders, AR objects in Google Search were already a fun way to bring the outside world in. Record Google 3D animals...", "url": "https://9to5google.com/2020/04/24/google-3d-animals-record/", "urlToImage": null, "publishedAt": "2020-04-24T23:21:25Z", "content": "Even before stay at home orders, AR objects in Google Search were already a fun way to bring the outside world indoors. A new feature rolling out to Android today lets you easily record Google 3D animals.\r\nThe “View in your space” feature allows life-sized 3D… [+1446 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "", "title": "'Overwatch's' new voice lines make it easier to play as a team - Engadget", "description": "Blizzard Entertainment has rolled out an Overwatch PTR patch that includes new voiced options for the game’s Communications Wheel, so you don’t have to use the same lines again and again.  The upcoming voice commands include “Press the Attack!,” “Fall Back,” …", "url": "https://www.engadget.com/overwatch-communication-new-voice-lines-130551535.html", "urlToImage": null, "publishedAt": "2020-04-24T23:11:10Z", "content": "Blizzard Entertainment has rolled out an Overwatch PTR patch that includes new voiced options for the game’s Communications Wheel, so you don’t have to use the same lines again and again. The wheel gives you a way to talk to other players even if you don’t ha… [+713 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Morgan Hines", "title": "CDC: Frozen raspberries were culprit behind 2019 norovirus outbreak on multiple cruises - USA TODAY", "description": "Smoothies: Nutritious, delicious – and according to the CDC, the source of a norovirus outbreak that infected hundreds of cruise passengers in 2019.", "url": "https://www.usatoday.com/story/travel/cruises/2020/04/24/cdc-report-raspberries-caused-2019-norovirus-outbreak-cruises/3018721001/", "urlToImage": null, "publishedAt": "2020-04-24T21:58:07Z", "content": "Here is everything you need to know about the highly contagious norovirus.\r\nUSA TODAY\r\nPassengers contemplating boarding another cruise after the coronavirus pandemic might already be planning to pass up the buffet next time they sail due to social-distancing… [+3987 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Austen Goslin", "title": "Here are all of Valorant’s competitive ranks - Polygon", "description": "Riot has revealed Valorant’s competitive ranks, when the Ranked mode will go live, how many friends you can team up with, and ranked progression.", "url": "https://www.polygon.com/2020/4/24/21234911/valorant-rated-mode-release-date-ranks-competitive-matchmaking-teams", "urlToImage": null, "publishedAt": "2020-04-24T21:27:16Z", "content": "Riot has finally revealed the first details about Valorants upcoming ranked mode. Since Valorants closed beta started a few weeks ago, there has only been one mode: Unrated. But in the games next patch, Rated mode will be added, allowing players to earn ranks… [+2775 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Lisa Eadicicco", "title": "Microsoft Word now says 2 spaces after a period is wrong - Business Insider - Business Insider", "description": "Microsoft Word will now flag two spaces after a period as an error, putting an end to the debate.", "url": "https://www.businessinsider.com/microsoft-word-update-2-spaces-after-period-wrong-2020-4", "urlToImage": null, "publishedAt": "2020-04-24T21:12:09Z", "content": "Microsoft is putting its foot down in the age-old debate about whether it's correct to put one or two spaces after a period.\r\nMicrosoft Word's editor function is getting a new feature that flags two spaces after a period as an error, according to The Verge. S… [+1126 chars]"}, {"source": {"id": null, "name": "Androidpolice.com"}, "author": null, "title": "T-Mobile confirms it's going to brick 5G on most Sprint 5G phones post-merger - Android Police", "description": "T-Mobile will shut down Sprint's 5G network in order to rework its spectrum into its own 5G grid. While those with a Galaxy S20 series device on Sprint", "url": "https://www.androidpolice.com/2020/04/24/t-mobile-confirms-its-going-to-brick-5g-on-most-sprint-5g-phones-post-merger/", "urlToImage": null, "publishedAt": "2020-04-24T21:06:31Z", "content": "This story was originally published 2020/04/22 11:47am PDTon Apr 22, 2020 and last updated 2020/04/24 1:56pm PDTApr 24, 2020. \r\nT-Mobile will shut down Sprint's 5G network in order to rework its spectrum into its own 5G grid. While those with a Galaxy S20 ser… [+3283 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Chris Pereira", "title": "4 Upcoming Animal Crossing: New Horizons Events Announced - GameSpot", "description": "Updates are coming to Animal Crossing: New Horizons, and here's what events will take place over the next two months.", "url": "https://www.gamespot.com/articles/4-upcoming-animal-crossing-new-horizons-events-ann/1100-6476292/", "urlToImage": null, "publishedAt": "2020-04-24T20:45:00Z", "content": "Update: Nature Day is now live in Animal Crossing: New Horizons, bringing two new merchants to your island. Find the rest of the scheduled events below or find out how Nature Day works in our guide.\r\nNintendo has outlined some of what players can expect from … [+2279 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Ryan Gilliam", "title": "Destiny cheating up 50%, Bungie announces Trials improvements - Polygon", "description": "Since Trials of Osiris came into Destiny 2, the game has become rampant with cheaters. In its weekly blog, Bungie announced changes to combat cheaters, as well as prevent other Trials pain points.", "url": "https://www.polygon.com/2020/4/24/21234670/destiny-2-trials-osiris-cheating-rate-increase-free-adept-token-fix-bug-patch", "urlToImage": null, "publishedAt": "2020-04-24T20:27:15Z", "content": "Destiny 2 finally revived the long-dormant Trials of Osiris this season. But the signature PvP mode has been more of a frustration point for players this season than a joyful return. In an effort to be more transparent around the problems currently facing Des… [+5161 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Jeremy Winslow", "title": "Grab This Free Pac-Man Game On PC, PS4, And Xbox One - GameSpot", "description": "Pac-Man CE2 is the latest game given away as publishers and developers respond to the coronavirus.", "url": "https://www.gamespot.com/articles/grab-this-free-pac-man-game-on-pc-ps4-and-xbox-one/1100-6476482/", "urlToImage": null, "publishedAt": "2020-04-24T20:15:00Z", "content": "With social distancing extended due to the coronavirus (COVID-19) pandemic, Bandai Namco Entertainment is giving away Pac-Man Championship Edition 2 for free on PC, PlayStation 4, and Xbox One.\r\nThis comes as the game company attempts to live up to its \"more … [+2250 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Eddie Makuch", "title": "Call Of Duty: Warzone Cheaters Now Only Play Each Other - GameSpot", "description": "Infinity Ward is working to clean up the CoD: Warzone battlefield on PS4, Xbox One, and PC; here's how.", "url": "https://www.gamespot.com/articles/call-of-duty-warzone-cheaters-now-only-play-each-o/1100-6476342/", "urlToImage": null, "publishedAt": "2020-04-24T20:15:00Z", "content": "Cheaters can ruin any online game, and Infinity Ward is taking drastic steps to reduce their influence in Call of Duty: Modern Warfare and Call of Duty: Warzone. The solution is simple: Make the cheaters play against each other so they can all be miserable.\r\n… [+2082 chars]"}, {"source": {"id": null, "name": "Autoevolution.com"}, "author": "Mihnea Radu", "title": "Front-Engined Lamborghini Aventador Is the Anti-Corvette Statement - autoevolution", "description": "Putting the engine in the wrong place is one of the most interesting things happening in the sports car world right now. But where is the right place? Now that the Chevy Corvette has it in the same location as every Italian exotic, maybe it's time for Lamborg…", "url": "https://www.autoevolution.com/news/front-engined-lamborghini-aventador-is-the-anti-corvette-statement-142977.html", "urlToImage": null, "publishedAt": "2020-04-24T20:11:00Z", "content": "We're kidding. The Aventador is one of the most amazing machines ever, but it's getting a little old. It came out roughly four batman movies ago and has stayed alive only though numerous small updates.In this video, TheSketchMonkey raises the possibility that… [+1238 chars]"}, {"source": {"id": null, "name": "Autoevolution.com"}, "author": "Mircea Panait", "title": "Lexus Sends Off GS Luxury Sedan With \"Eternal Touring\" Special Edition - autoevolution", "description": "Pretty much the Japanese equivalent to the Black Line in America, Eternal Touring is how Lexus bids farewell to the GS luxury sedan. Introduced in 1993 with exterior styling from the one and only Giorgetto Giugiaro, the GS is getting on a bit considering that…", "url": "https://www.autoevolution.com/news/lexus-sends-off-gs-luxury-sedan-with-eternal-touring-special-edition-142976.html", "urlToImage": null, "publishedAt": "2020-04-24T19:53:00Z", "content": "Codenamed L10, the fourth generation will be replaced by the ES in August 2020. No direct successor of the Grand touring Sedan is planned, and given the appetite for crossovers and SUVs, it doesn’t come as a surprise. The ES isn’t only longer than the GS but … [+1677 chars]"}, {"source": {"id": null, "name": "9to5mac.com"}, "author": null, "title": "Magic Keyboard for iPad Pro top features — the best iPad accessory ever [Video] - 9to5Mac", "description": "Hands-on with top features for the Magic Keyboard for iPad Pro. It's the best accessory for the iPad Pro, and turns it into a versatile laptop.", "url": "https://9to5mac.com/2020/04/24/magic-keyboard-for-ipad-pro-review-top-features-best-ipad-accessory-ever-video/", "urlToImage": null, "publishedAt": "2020-04-24T19:42:23Z", "content": "Two days ago the Magic Keyboard for the 11-inch iPad Pro landed on my desk. Ive been using it constantly since it first arrived, and although its not perfect, I absolutely love it.\r\nIts so good that I can easily say that this is the best iPad accessory in the… [+13185 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "David Murphy", "title": "Are You Charging Your MacBook on the Wrong Side? - Lifehacker", "description": "Yes, you read that headline correctly. There is apparently a “right” way and a “wrong” way to connect devices to a MacBook with Thunderbolt/USB-C ports on both sides. Doing it wrong can affect your computer’s performance.", "url": "https://lifehacker.com/are-you-charging-your-macbook-on-the-wrong-side-1843045306", "urlToImage": null, "publishedAt": "2020-04-24T19:31:53Z", "content": "Yes, you read that headline correctly. There is apparently a right way and a wrong way to connect devices to a MacBook with Thunderbolt/USB-C ports on both sides. Doing it wrong can affect your computers performance.\r\nI recently encountered this knowledge on … [+3975 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Jenae Sitzes", "title": "Nintendo Switch Lite Back In Stock At Best Buy And Target - GameSpot", "description": "The Nintendo Switch and its handheld-only cousin, the Switch Lite, are running out of stock at many retailers.", "url": "https://www.gamespot.com/articles/nintendo-switch-lite-back-in-stock-at-best-buy-and/1100-6475212/", "urlToImage": null, "publishedAt": "2020-04-24T19:09:00Z", "content": "Though it's not nearly as crucial as hand sanitizer, tissues, toilet paper, and other household goods, the Nintendo Switch console is seeing a major national shortage right now, as major retailers respond to increased demand for online goods due to the corona… [+3213 chars]"}, {"source": {"id": null, "name": "Androidcentral.com"}, "author": "Samantha Nelson", "title": "Google Stadia vs. PlayStation Now: Which is better? - Android Central", "description": "Google Stadia and PlayStation Now both allow you to pay $10/month to stream games across devices. Both services offer free trials so you can test them yourself, but our guide lays out the features to help you figure out what's right for you.", "url": "https://www.androidcentral.com/google-stadia-vs-playstation-now", "urlToImage": null, "publishedAt": "2020-04-24T18:12:57Z", "content": "Google Stadia launched in November, offering subscribers the chance to play new AAA games across their PC, TV, and Android devices without any downloads or updates. Google has promised to continue to expand its games library and add new features to the still-… [+10145 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Phillip Martinez", "title": "'Pokémon Go' Community Day: Shiny Abra, Start Time and Everything You Need to Know - Newsweek", "description": "Community Day will last for six hours instead of the usual three.", "url": "https://www.newsweek.com/pokemon-go-shiny-abra-community-day-start-time-counter-alakazam-1500100", "urlToImage": null, "publishedAt": "2020-04-24T17:46:09Z", "content": "The Abra Community Day event in Pokémon Go is finally here. After being rescheduled from its original March date due to the coronavirus pandemic, Niantic has developed a way to allow Pokémon Go players to enjoy the most popular in-game event from anywhere, in… [+2636 chars]"}, {"source": {"id": null, "name": "Boingboing.net"}, "author": null, "title": "This AI's only function is to draw penises - Boing Boing", "description": "DICK-RNN is a recurrent neural network trained with 10,000 doodles of dicks. You start drawing a shape and the AI tries its best to finish it as a penis. Starting with the balls helps a lot. Try it…", "url": "https://boingboing.net/2020/04/24/this-ais-only-function-is-to.html", "urlToImage": null, "publishedAt": "2020-04-24T17:38:00Z", "content": "“The Angel, The Automobilist, and Eighteen Others” is a new collection of early drawings by eccentric illustrator and storyteller Edward Gorey (1925-2000). Over at The Comics Journal, Mark Dery, author of the Gorey biography Born to Be Posthumous, reviews the… [+1660 chars]"}, {"source": {"id": null, "name": "Trueachievements.com"}, "author": "Heidi Nicholas", "title": "Sci-fi adventure Deliver Us The Moon joins Xbox Game Pass and Game Pass for PC today - TrueAchievements", "description": "Deliver Us The Moon is a sci-fi action adventure title which draws inspiration from movies such as Interstellar, and which joins the Xbox Game Pass and Xbox Game Pass for PC services today as a day one addition.", "url": "https://www.trueachievements.com/n41593/deliver-us-the-moon", "urlToImage": null, "publishedAt": "2020-04-24T17:19:36Z", "content": "The Xbox team has been busy lately: just yesterday, they surprise-dropped the announcement that Red Dead Redemption 2 will join Xbox Game Pass in May. Before that, they announced new titles for Xbox Game Pass, along with several new titles for Xbox Game Pass … [+1728 chars]"}, {"source": {"id": null, "name": "Charlieintel.com"}, "author": null, "title": "IW Community Update April 24 – Modern Warfare Patch Preview And More - CharlieINTEL.com", "description": "Infinity Ward has released the latest Community Update on their blog highlighting what’s happening at the studio and at Raven Software. In the community update post, the studio has given a peak at what’s coming in next week’s update, including new master camo…", "url": "https://charlieintel.com/infinity-ward-community-update-april-24/60310/", "urlToImage": null, "publishedAt": "2020-04-24T17:19:00Z", "content": "Infinity Ward has released the latest Community Update on their blog highlighting what’s happening at the studio and at Raven Software.\r\nIn the community update post, the studio has given a peak at what’s coming in next week’s update, including new master cam… [+2310 chars]"}, {"source": {"id": null, "name": "Androidpolice.com"}, "author": "https://www.facebook.com/corbin.davenport.50", "title": "Sony WH-C710N review: Great noise-cancelling headphones for under $200 - Android Police", "description": "Sony makes some of the best noise-canceling headphones around, especially the WH-1000XM3 (which is overdue for a replacement). The WH1000XM3 is a premium", "url": "https://www.androidpolice.com/2020/04/24/sony-wh-ch710n-review/", "urlToImage": null, "publishedAt": "2020-04-24T17:00:43Z", "content": "Sony makes some of the best noise-canceling headphones around, especially the WH-1000XM3 (which is overdue for a replacement). The WH1000XM3 is a premium set of headphones that regularly goes for around $300, and competing products like the Bose QuietComfort … [+4387 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Christian de Looper", "title": "7 Of The Best Amazon Alexa Speakers - Forbes", "description": "Looking for a great speaker with arguably the smartest digital assistant, Alexa? Here are 7 of the best Amazon Alexa speakers out there.", "url": "https://www.forbes.com/sites/forbes-personal-shopper/2020/04/24/7-of-the-best-amazon-alexa-speakers/", "urlToImage": null, "publishedAt": "2020-04-24T16:00:00Z", "content": "Alexa is arguably the smartest digital assistant, and while Google Assistant also has a lot going for it, Alexa is the go-to for many users who dont have Android phones. There are a ton of Alexa speakers on the market, and while they all have the smart featur… [+4164 chars]"}, {"source": {"id": null, "name": "Siliconera.com"}, "author": "Sato", "title": "Final Fantasy XIV Patch 5.3 Will Revamp Quests and Finally Bring in Flying Mounts to A Realm Reborn Areas - Siliconera", "description": "Square Enix hosted its latest Letter from the Producer LIVE broadcast with new info on Final Fantasy XIV Patch 5.3 - Reflections in Crystal.", "url": "https://www.siliconera.com/final-fantasy-xiv-patch-5-3-will-revamp-a-realm-reborn-quests-and-finally-bring-in-flying-mounts/", "urlToImage": null, "publishedAt": "2020-04-24T15:30:00Z", "content": "Square Enix hosted its latest Letter from the Producer LIVE broadcast with new info on Final Fantasy XIV Patch 5.3 – Reflections in Crystal. Patch 5.3 continues the Shadowbringers storyline and NieR series crossover raid series. It also brings plenty of QoL i… [+3367 chars]"}, {"source": {"id": null, "name": "Guru3d.com"}, "author": "<!-- Template: news_story_author_posted -->\r\nHilbert Hagedoorn", "title": "AMD Ryzen 3 3300X Has a fully enabled CCX, unlike the Ryzen 3 3100 - guru3d.com", "description": "This week AMD announced two entry-level quad-core processors, the Ryzen 3 3100 and 3300X. The difference between the two 4-core / 8-thread parts, however, is to be found in the way how the active pro...", "url": "https://www.guru3d.com/news-story/amd-ryzen-3-3300x-has-a-fully-enabled-ccxunlike-the-ryzen-3-3100.html", "urlToImage": null, "publishedAt": "2020-04-24T15:15:00Z", "content": "This week AMD announced two entry-level quad-core processors, the Ryzen 3 3100 and 3300X. The difference between the two 4-core / 8-thread parts, however, is to be found in the way how the active processor cores are assigned. \r\nIn a block diagram leaked by Vi… [+2333 chars]"}, {"source": {"id": null, "name": "Tomsguide.com"}, "author": "Kate Kozuch", "title": "Zoom just got a killer feature to beat every video call app - Tom's Guide", "description": "Real-time transcription takes Zoom meetings to the next level", "url": "https://www.tomsguide.com/news/zoom-just-got-a-killer-feature-to-beat-every-video-call-app", "urlToImage": null, "publishedAt": "2020-04-24T14:09:00Z", "content": "Zoom calls are about to give the video conferencing service a serious edge over Google Hangouts, Microsoft Teams, and all the other best video chat apps battling for the loyalty of everyone working from home. \r\nOtter.ai, a real-time chat transcription service… [+2215 chars]"}, {"source": {"id": null, "name": "Gamesradar.com"}, "author": "Alex Avard", "title": "Horizon: Zero Dawn 2 has become a PS5 exclusive, described as \"gigantic\" in new report - GamesRadar+", "description": "New report suggests Guerrilla wants to release a \"a standalone co-op game\" before Horizon Zero Dawn 2", "url": "https://www.gamesradar.com/horizon-zero-dawn-2-has-become-a-ps5-exclusive-described-as-gigantic-in-new-report/", "urlToImage": null, "publishedAt": "2020-04-24T14:08:00Z", "content": "The next entry in the Horizon: Zero Dawn series from Guerrilla Games is reportedly worked on with plans for a full trilogy, states a new report suggesting that a co-op focused PS5 sequel to 2017's critically acclaimed open world game is already well underway.… [+1497 chars]"}, {"source": {"id": null, "name": "Destructoid.com"}, "author": "Chris Moyse", "title": "WWE confirms there will be no WWE 2K release this year - Destructoid", "description": "WWE confirms there will be no WWE 2K release this year", "url": "https://www.Destructoid.com/wwe-confirms-there-will-be-no-wwe-2k-release-this-year-588012.phtml", "urlToImage": null, "publishedAt": "2020-04-24T14:00:00Z", "content": "Count it Out\r\nWorld Wrestling Entertainment (WWE) has confirmed that it will not be releasing a video game in 2020, marking the first year in decades that the company will forego a digital replication of its squared circle action. The announcement was officia… [+1439 chars]"}, {"source": {"id": null, "name": "Searchengineland.com"}, "author": "https://www.facebook.com/barryschwartz", "title": "New free version of Google Shopping rolling out now - Search Engine Land", "description": "It is now rolling out and should be fully live in the US by early next week.", "url": "https://searchengineland.com/new-free-version-of-google-shopping-rolling-out-now-333589", "urlToImage": null, "publishedAt": "2020-04-24T13:52:00Z", "content": "Google’s new free version of Google Shopping is now rolling out. A Google spokesperson has confirmed with Search Engine Land that this has begun to roll out. This does not mean it is fully rolled out and all U.S. searchers will see it immediately, but by earl… [+741 chars]"}, {"source": {"id": null, "name": "Kitguru.net"}, "author": "Mustafa Mahmoud", "title": "Mick Gordon promises to fix bad DOOM Eternal soundtrack himself - KitGuru", "description": "A few days ago, the official OST for the highly-praised DOOM Eternal was released to those who purchased the game’s collector’s edition. Unfortunately, some fans noticed that the soundtrack featured m", "url": "https://www.kitguru.net/gaming/uncategorized/mustafa-mahmoud/mick-gordon-promises-to-fix-bad-doom-eternal-soundtrack-himself/", "urlToImage": null, "publishedAt": "2020-04-24T13:49:05Z", "content": "A few days ago, the official OST for the highly-praised DOOM Eternal was released to those who purchased the games collectors edition. Unfortunately, some fans noticed that the soundtrack featured much flatter dynamic mixing when compared to DOOM (2016). The … [+1566 chars]"}, {"source": {"id": null, "name": "Electrek.co"}, "author": null, "title": "Ford might delay Mustang Mach-E launch, will update as production restarts - Electrek", "description": "Ford might delay the Mustang Mach-E launch amid the coronavirus pandemic and will give an updated timeline as it restarts its production facilities. The Mustang Mach-E is Ford’s first all-electric vehicle built from the ground up and one of the most anticipat…", "url": "https://electrek.co/2020/04/24/ford-delay-mustang-mach-e-launch-production-restart/", "urlToImage": null, "publishedAt": "2020-04-24T13:27:26Z", "content": "Ford might delay the Mustang Mach-E launch amid the coronavirus pandemic and will give an updated timeline as it restarts its production facilities.\r\nThe Mustang Mach-E is Ford’s first all-electric vehicle built from the ground up and one of the most anticipa… [+2960 chars]"}, {"source": {"id": null, "name": "Pushsquare.com"}, "author": "Push Square", "title": "Next-Gen Game Reveals Are Imminent, But Sony Silent on PS5 Plans - Push Square", "description": "Microsoft says game reveals are coming", "url": "http://www.pushsquare.com/news/2020/04/next-gen_game_reveals_are_imminent_but_sony_silent_on_ps5_plans", "urlToImage": null, "publishedAt": "2020-04-24T13:00:00Z", "content": "Weve already got a glimpse of a couple of PlayStation 5 games courtesy of Godfall and Quantum Error, but with coronavirus scuppering its plans, Sony has been largely tight-lipped about its next-gen plans. Despite not showing much more than the Japanese giant,… [+1062 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Lynn La", "title": "iPhone SE vs. iPhone 11 comparison: Which new iPhone should you buy? - CNET", "description": "Apple's iPhone SE for 2020 is $300 cheaper than the baseline iPhone 11. Here's what you get (and don't get) for that price.", "url": "https://www.cnet.com/news/iphone-se-vs-iphone-11-comparison-which-new-phone-should-get-buy-specs-versus/", "urlToImage": null, "publishedAt": "2020-04-24T11:52:58Z", "content": "Apple announced its latest iPhone SE for 2020 on April 15, with the aim to court budget-minded phone users who may not be able to splurge on $1,000 handsets like the iPhone 11 Pro or Galaxy S20. As the sequel to 2016's sleeper-hit iPhone of the same name, the… [+8282 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Dieter Bohn", "title": "Making macOS run well on ARM processors isn’t the hard part - The Verge", "description": "We finally have a report confirming Apple is actively working on ARM processors for Macs. But as Dieter Bohn explains, just getting macOS and Apple’s own apps running  on it isn’t enough. Processor transitions are hard!", "url": "https://www.theverge.com/2020/4/24/21233661/macos-arm-processor-transition-apps-developers-catalyst-wwdc", "urlToImage": null, "publishedAt": "2020-04-24T11:21:16Z", "content": "Less surprise will mean more delight\r\nPhoto by Nilay Patel / The Verge\r\nMark Gurman at Bloomberg has the confirmation weve all be waiting for: Apple will reportedly use a 12-core 5nm ARM processor in a 2021 Mac. Theres plenty of time to work out the details, … [+11995 chars]"}, {"source": {"id": null, "name": "Phonearena.com"}, "author": "Adrian Diaconescu", "title": "New leaks reveal LG Velvet 5G camera specs, battery size, memory, and more - PhoneArena", "description": "The LG Velvet 5G is not exactly a question mark after the company itself has revealed a bunch of stuff about the upcoming phone, but now almost all of the key specs are out of the bag.", "url": "https://www.phonearena.com/news/lg-velvet-5g-leaked-specs-camera-battery-memory-more_id124120", "urlToImage": null, "publishedAt": "2020-04-24T11:04:00Z", "content": "All content, features, and design are Copyright 2001-2020 PhoneArena.com.PhoneArena may receive a small commission if you purchase through affiliate links on this page.All rights reserved. Reproduction in whole or in part or in any form or medium without writ… [+28 chars]"}, {"source": {"id": null, "name": "Rockpapershotgun.com"}, "author": null, "title": "XCOM: Chimera Squad is out now, and it's half-price - Rock Paper Shotgun", "description": "It’s time to put down your world-saving guns and pick up your alien-policemen batons, because XCOM: Chimera Squad is out.", "url": "https://www.rockpapershotgun.com/2020/04/24/xcom-chimera-squad-is-out-now-and-its-half-price/", "urlToImage": null, "publishedAt": "2020-04-24T10:17:00Z", "content": "It’s time to put down your world-saving guns and pick up your alien-policing batons, because XCOM: Chimera Squad is out. XCOPS takes a big sidewards leap away from the main series, boiling down turn-based combat into single-room encounters. Developers Firaxis… [+2356 chars]"}, {"source": {"id": null, "name": "Milehighreport.com"}, "author": "Tim Lynch", "title": "Denver Broncos: Alabama WR Jerry Jeudy highlights - Mile High Report", "description": "The Denver Broncos have a new wide receiver in Jerry Jeudy. Here are his Alabama highlight reels. Enjoy!", "url": "https://www.milehighreport.com/2020/4/24/21233874/jerry-jeudy-highlights", "urlToImage": null, "publishedAt": "2020-04-24T09:34:37Z", "content": "The Denver Broncos have a new wide receiver in Jerry Jeudy. Here are his Alabama highlight reels. Enjoy!"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Travis Scott's Astroworld Concert Live on Fortnite with 100 Thieves | HYPEBEAST Exclusive - HYPEBEAST", "description": "JUMP STRAIGHT TO CONCERT AT: 36:34 NEW SONG AT: 44:23 Watch Travis Scott's Astroworld concert live on Fortnite with Ceice from 100 Thieves for a HYPEBEAST ex...", "url": "https://www.youtube.com/watch?v=XgeRLTx_qqc", "urlToImage": null, "publishedAt": "2020-04-24T00:00:53Z", "content": "JUMP STRAIGHT TO CONCERT AT: 36:34NEW SONG AT: 44:23\r\nWatch Travis Scott's Astroworld concert live on Fortnite with Ceice from 100 Thieves for a HYPEBEAST exclusive.\r\nFor up-to-date news and more: http://HYPEBEAST.com\r\nSubscribe to our channel: https://www.yo… [+241 chars]"}, {"source": {"id": null, "name": "Bbc.com"}, "author": "https://www.facebook.com/bbcnews", "title": "Coronavirus: 'Our wedding is cancelled but we still have to pay' - BBC News", "description": "Venues are forcing couples to pay big cancellation fees for weddings delayed by the lockdown.", "url": "https://www.bbc.com/news/business-52400441", "urlToImage": null, "publishedAt": "2020-04-23T23:12:17Z", "content": "Media caption'We've saved so hard for so long for it, it's beyond belief almost'\r\nBrides and grooms say they are being charged thousands of pounds in cancellation and postponement fees for weddings that can't go ahead because of the coronavirus lockdown. \r\nWh… [+7995 chars]"}, {"source": {"id": null, "name": "Bleepingcomputer.com"}, "author": "Sergiu Gatlan", "title": "Windows 10 KB4549951 update fails to install, causes BSODs - BleepingComputer", "description": "The Windows 10 KB4549951 ​​​​​​​cumulative update is reportedly failing to install and is causing blue screens of death (BSOD) after installation reboots, among other issues, according to user reports.", "url": "https://www.bleepingcomputer.com/news/microsoft/windows-10-kb4549951-update-fails-to-install-causes-bsods/", "urlToImage": null, "publishedAt": "2020-04-23T23:11:05Z", "content": "The Windows 10 KB4549951 cumulative update is reportedly failing to install and is causing blue screens of death (BSOD) after installation reboots, among other issues, according to user reports.\r\nKB4549951 is a cumulative update with security fixes released a… [+6269 chars]"}, {"source": {"id": null, "name": "Venturebeat.com"}, "author": "Jeff Grubb", "title": "Your Super Mario Maker 2 levels are a lot less cute in World Maker - VentureBeat", "description": "Super Mario Maker 2 just got its final update, and the new World Maker mode highlights a problem: no one knows how to make a fun Mario course.", "url": "https://venturebeat.com/2020/04/23/your-super-mario-maker-2-levels-are-a-lot-less-cute-in-world-maker/", "urlToImage": null, "publishedAt": "2020-04-23T21:44:17Z", "content": "Super Mario Maker 2s latest update reveals that almost no one knows how to make a fun Mario stage. This was once easy to ignore, because thats not actually what you should go to Super Mario Maker for. Instead, this series has always provided players with a fa… [+2272 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Eddie Makuch", "title": "Xbox Series X Logo Trademarked: See The Stylish \"X\" Here - GameSpot", "description": "Take a look at what could be the logo for Microsoft's Xbox Series X.", "url": "https://www.gamespot.com/articles/xbox-series-x-logo-trademarked-see-the-stylish-x-h/1100-6476353/", "urlToImage": null, "publishedAt": "2020-04-23T20:34:00Z", "content": "Microsoft appears to be setting the stage for another Xbox Series X reveal. On April 16, the company filed a new trademark application for the next-generation console that, among other things, included what appears to be the console's logo.\r\nThe trademark app… [+2041 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Ryan W. Miller", "title": "What's 'Zoom fatigue'? Here's why video calls can be so exhausting - USA TODAY", "description": "With people taking more working meetings and social gatherings to video conference platforms, people are beginning to feel \"Zoom fatigue.\"", "url": "https://www.usatoday.com/story/news/nation/2020/04/23/zoom-fatigue-video-calls-coronavirus-can-make-us-tired-anxious/3010478001/", "urlToImage": null, "publishedAt": "2020-04-23T18:57:30Z", "content": "Some farms and animal sanctuaries have found a way to lighten the mood during virtual meetings.\r\nUSA TODAY\r\nA few Zoom calls for work in the morning. Logging your children into their virtual classroom around lunchtime. And a FaceTime call with your parents at… [+5598 chars]"}]}