{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Tomsguide.com"}, "author": "Roland Moore-Colyer", "title": "Xbox Series X games: every confirmed title for 2020 and beyond - Tom's Guide", "description": "All of the Xbox Series X games we expect to hit Microsoft's next-generation console", "url": "https://www.tomsguide.com/best-picks/best-xbox-series-x-games", "urlToImage": null, "publishedAt": "2020-04-26T12:14:08Z", "content": "Microsofts Xbox Series X is set to launch at the end of the year, so it's time to take a look at which Xbox Series X games to expect at launch at beyond. \r\nSo far weve seen the consoles design, been given a breakdown of the specs, and have seen the small twea… [+12292 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Vanessa Hand Orellana", "title": "2 Apple Watch features that earned the smartwatch a permanent spot on my wrist - CNET", "description": "I started out a skeptic, but the Apple Watch eventually won me over. Here's what it took for me to take it seriously as a fitness tracker and smartwatch.", "url": "https://www.cnet.com/news/apple-watch-features-that-earned-smartwatch-permanent-spot-wrist/", "urlToImage": null, "publishedAt": "2020-04-26T11:24:00Z", "content": "Angela Lang/CNET\r\nI haven't always been a fan of the Apple Watch. I bought one as soon as it went on sale in 2015 hoping it would blow me away, but it ended up spending more time in my drawer than on my wrist. It took three more years and the addition of two … [+8182 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Stephen Shankland", "title": "iPhone SE outclasses all Android phones thanks to Apple's A13 chip - CNET", "description": "Performance on a budget arrives just in time for buyers spooked by the pandemic.", "url": "https://www.cnet.com/news/iphone-se-outclasses-all-android-phones-thanks-apples-a13-chip-processor/", "urlToImage": null, "publishedAt": "2020-04-26T11:23:59Z", "content": "John Kim/CNET\r\nBy packing the big A13 chip into its small iPhone SE, Apple has made its budget smartphone a more compelling product at just the right time for a coronavirus-spooked world. Where most budget phones cut costs by using lower-end processors, the n… [+3579 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Douglas Busvine", "title": "Germany flips on smartphone contact tracing, backs Apple and Google - Reuters", "description": "Germany changed course on Sunday over which type of smartphone technology it wanted to use to trace coronavirus infections, backing an approach supported by Apple and Google along with a growing number of other European countries.", "url": "https://www.reuters.com/article/us-health-coronavirus-europe-tech-idUSKCN22807J", "urlToImage": null, "publishedAt": "2020-04-26T08:03:22Z", "content": "BERLIN (Reuters) - Germany changed course on Sunday over which type of smartphone technology it wanted to use to trace coronavirus infections, backing an approach supported by Apple and Google along with a growing number of other European countries. \r\nChancel… [+3449 chars]"}, {"source": {"id": null, "name": "Appleinsider.com"}, "author": "AppleInsider", "title": "Month-end deals knock up to $500 off Macs, iPads, Apple Watches, AirPods at B&H - AppleInsider", "description": "B&amp;H Photo is slashing prices on Apple hardware during its month-end Apple sale, and discounts span a variety of product lines, from Apple Watches to 2020 iPad Pros and MacBook Airs. Save up to $500 instantly with fast, free shipping.", "url": "https://appleinsider.com/articles/20/04/26/month-end-deals-knock-up-to-500-off-macs-ipads-apple-watches-airpods-at-bh", "urlToImage": null, "publishedAt": "2020-04-26T04:42:11Z", "content": "B&amp;H Photo is slashing prices on Apple hardware during its month-end Apple sale, and discounts span a variety of product lines, from Apple Watches to 2020 iPad Pros and MacBook Airs. Save up to $500 instantly with fast, free shipping.AppleInsider proudly o… [+3181 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "", "title": "Amazon asks workers to request leave if they continue staying at home - Engadget", "description": "Amazon warehouse workers will have to request a leave of absence if they want to stay at home after May 1st.", "url": "https://www.engadget.com/amazon-workers-must-request-leave-034137183.html", "urlToImage": null, "publishedAt": "2020-04-26T04:04:22Z", "content": "Amazon warehouse workers wanting to stay home to avoid COVID-19 will soon have to make a formal request. The online retailer is asking staff staying home to either report to their shifts starting May 1st or else request a leave of absence. A spokesperson told… [+588 chars]"}, {"source": {"id": null, "name": "Whatculture.com"}, "author": "James Weeds", "title": "WWE 2K New Video Game - What Can We Expect & How WWE Games Can Recover - WhatCulture", "description": "Who else jumped for joy at the recent confirmation of 2K21’s cancellation?", "url": "https://whatculture.com/gaming/wwe-2k-new-video-game-what-can-we-expect-how-wwe-games-can-recover", "urlToImage": null, "publishedAt": "2020-04-26T03:58:20Z", "content": "2K Games\r\nConfirming the cancellation of this years instalment in the WWE 2K series, 2K games are set to share details on the future of the franchise this Monday with the possible unveil of an alternative wrestling game.\r\nAfter a dreadful launch of WWE 2K20, … [+1149 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "David Priest", "title": "The best Alexa devices to buy for 2020 - CNET", "description": "The best Alexa-enabled or compatible gadgets to use with your Echo smart speaker or display.", "url": "https://www.cnet.com/news/the-best-alexa-devices-to-buy-for-2020/", "urlToImage": null, "publishedAt": "2020-04-26T03:34:31Z", "content": "Amazon's Alexa is good for more than asking for music to play or for the current temperature outside. You can use this voice assistant in a range of ways with compatible Amazon Echo smart speakers and displays, from voice control of smart devices and two-way … [+8959 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Desire Athow", "title": "This 4TB PCIe SSD can make your Windows laptop feel more like a MacBook Pro - TechRadar", "description": "Assuming you have a compatible laptop, that is", "url": "https://www.techradar.com/news/this-4tb-pcie-ssd-can-make-your-windows-laptop-feel-more-like-a-macbook-pro", "urlToImage": null, "publishedAt": "2020-04-26T03:00:00Z", "content": "The Apple MacBook Pro 16 still holds bragging rights when it comes to the maximum storage capacity available in a traditional portable laptop. \r\nApple uses a proprietary approach, plugging memory chips directly into the motherboard to reach a whopping 8TB of … [+1494 chars]"}, {"source": {"id": null, "name": "Zdnet.com"}, "author": "Catalin Cimpanu", "title": "Hackers are exploiting a Sophos firewall zero-day - ZDNet", "description": "Sophos releases emergency patch to fix SQL injection bug exploited in the wild, impacting its XG Firewall product.", "url": "https://www.zdnet.com/article/hackers-are-exploiting-a-sophos-firewall-zero-day/", "urlToImage": null, "publishedAt": "2020-04-26T02:39:00Z", "content": "Cyber-security firm Sophos has published an emergency security update on Saturday to patch a zero-day vulnerability in its XG enterprise firewall product that was being abused in the wild by hackers.\r\nSophos said it first learned of the zero-day on late Wedne… [+2563 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "", "title": "'Battlefield V' will get one last standalone update this summer - Engadget", "description": "'Battlefield V' is winding down with a final standalone update that should arrive in June.", "url": "https://www.engadget.com/battlefield-v-last-update-in-summer-013240631.html", "urlToImage": null, "publishedAt": "2020-04-26T02:32:34Z", "content": "DICE and EA are bringing Battlefield V’s steady stream of updates to a close. The developers have announced (via Rock Paper Shotgun) that there will be one last standalone update to the WWII shooter this summer. It’s not clear what the update will contain bes… [+391 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Shockingly Detailed Minecraft Cities Are Available To Buy Online - Screen Rant", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiRGh0dHBzOi8vc2NyZWVucmFudC5jb20vbWluZWNyYWZ0LWNpdHktYnV5LXNhbGUtdmFydW5hLWJ1aWxkcy1vcmFyaW8v0gFIaHR0cHM6Ly9zY3JlZW5yYW50LmNvbS9taW5lY3JhZnQtY2l0eS1idXktc2FsZS12YXJ1bmEtYnVpbGRzLW9yYXJpby9hbXAv?oc=5", "urlToImage": null, "publishedAt": "2020-04-26T01:40:14Z", "content": null}, {"source": {"id": null, "name": "Digitaltrends.com"}, "author": "Alex Blake", "title": "Here’s why you shouldn’t charge your MacBook Pro on the left side - Digital Trends", "description": "If your MacBook Pro gets warm and slows down when you charge it up, it could be the result of a rather strange glitch. Here’s how to get things back to normal.", "url": "https://www.digitaltrends.com/computing/why-you-shouldnt-charge-macbook-pro-left-side/", "urlToImage": null, "publishedAt": "2020-04-26T01:10:03Z", "content": "If you own a MacBook Pro and have noticed it gets hot while charging, there could be a simple solution. Only charge it using the ports on the right-hand side of your device.\r\nThe issue seems to affect USB-C MacBook Pro models, meaning any high-end Apple lapto… [+2007 chars]"}, {"source": {"id": null, "name": "Androidpolice.com"}, "author": "https://www.facebook.com/corbin.davenport.50", "title": "OnePlus 6/6T receive OxygenOS 10.3.3 following end of Open Beta program - Android Police", "description": "OnePlus just announced the end of the OxygenOS Open Beta program for the 6 and 6T, but the company promised that regular stable updates would continue.", "url": "https://www.androidpolice.com/2020/04/25/oneplus-6-6t-receive-oxygenos-10-3-3-following-end-of-open-beta-program/", "urlToImage": null, "publishedAt": "2020-04-25T22:31:20Z", "content": "OnePlus just announced the end of the OxygenOS Open Beta program for the 6 and 6T, but the company promised that regular stable updates would continue. Sure enough, both phones are now receiving a new system update, containing a handful of bug fixes and secur… [+1307 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "", "title": "Twitch has a problem with non-stop 'Valorant' streams - Engadget", "description": "Twitch channels have turned to running non-stop 'Valorant' streams to reel in gamers desperate for beta keys.", "url": "https://www.engadget.com/valorant-non-stop-twitch-streams-202140642.html", "urlToImage": null, "publishedAt": "2020-04-25T22:20:22Z", "content": "Valorant has been a hit on Twitch, but it’s now clear that success isn’t always for the right reasons. Kotaku has documented a slew of Twitch streams that are running 24/7 solely to attract people looking for Valorantbeta keys that drop after watching for at … [+698 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Kevin Knezevic", "title": "Pokemon Go April Abra Community Day Now Live: Shiny Abra, Bonuses, And Extended Hours - GameSpot", "description": "Pokemon Go's delayed Abra Community Day is now set for Saturday, April 25; here's everything you need to know about the event.", "url": "https://www.gamespot.com/articles/pokemon-go-april-abra-community-day-now-live-shiny/1100-6474599/", "urlToImage": null, "publishedAt": "2020-04-25T22:00:00Z", "content": "Pokemon Go's long-delayed Abra Community Day has finally arrived. The event, which was originally slated to take place on March 15 before developer Niantic postponed it due to the COVID-19 pandemic, will now be held today, April 25, more than a month after it… [+3241 chars]"}, {"source": {"id": null, "name": "Reviewjournal.com"}, "author": "Julie Wootton-Greener", "title": "CES 2020 attendee reports positive COVID-19 antibody test - Las Vegas Review-Journal", "description": "<p>The news — reported Thursday by American Public Media — is renewing social media speculation about whether the virus was circulating at the show in January in Las Vegas.</p>", "url": "https://www.reviewjournal.com/post/2014973", "urlToImage": null, "publishedAt": "2020-04-25T21:33:00Z", "content": "A CES 2020 attendee who reportedly developed flu-like symptoms after returning home from the conference in January says he found out Monday that his COVID-19 antibody test came back positive.\r\nThe news, reported Thursday by American Public Media, is renewing … [+3174 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Souhardya Biswas", "title": "Fan Comes Up With Potential Buffs And Rework Concepts For Apex Legends - Essentially Sports", "description": "Popular Apex Legends data miner and content creator, iLootGames has shared some of these ideas which were provided to him by an Apex fan named wicked_fool.", "url": "https://www.essentiallysports.com/fan-comes-up-with-potential-buffs-and-rework-concepts-for-apex-legends-esports-news-2020/", "urlToImage": null, "publishedAt": "2020-04-25T21:17:00Z", "content": "Apex Legends Season 5 is set to begin on May 12, which will also mark the end of Season 4. Respawn will also add a new Battle Armor LTM, which will have four phases from April 28 through May 12. Meanwhile, players have spotted few in-game teasers, and more ar… [+3086 chars]"}, {"source": {"id": null, "name": "Androidpit.com"}, "author": "Daniel Iglesias", "title": "The best new apps on the Google Play Store this week - AndroidPIT", "description": "This week, we're back again with five new Android apps released on the Google Play Store. There's something for everyone this week.", "url": "https://www.androidpit.com/apps-of-the-week-25-04-2020", "urlToImage": null, "publishedAt": "2020-04-25T21:00:00Z", "content": "As every week, with the help of our community, we offer you a list of applications that have just appeared on the Google Play Store. We hope that this will allow you to discover new apps and have fun. Unlike last week, there are plenty of games this week incl… [+3725 chars]"}, {"source": {"id": null, "name": "Androidpolice.com"}, "author": null, "title": "Facebook adds Messenger Rooms to the bevy of group video services - Android Police", "description": "Video calls have become an important way to stay in touch with friends and family during this time of isolation. There's already plenty to choose from,", "url": "https://www.androidpolice.com/2020/04/25/facebook-adds-messenger-rooms-to-the-bevy-of-group-video-services/", "urlToImage": null, "publishedAt": "2020-04-25T20:49:00Z", "content": "Video calls have become an important way to stay in touch with friends and family during this time of isolation. There's already plenty to choose from, but now Facebook is giving us something new to consider as Messenger Rooms begins to roll out across the gl… [+1587 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Andrew Hoyle", "title": "Don't buy the Huawei P40 Pro before you read this: 5 things to know - CNET", "description": "Huawei's P40 Pro is on sale now. Here's what you should know before you spend your money.", "url": "https://www.cnet.com/news/dont-buy-huawei-p40-pro-before-you-5-things-know/", "urlToImage": null, "publishedAt": "2020-04-25T20:43:37Z", "content": "Andrew Hoyle/CNET\r\nHuawei's P40 series, which includes the base P40, the P40 Pro and the P40 Pro Plus, are on sale now in the UK and wider Europe and hope to do battle with the likes of the Galaxy S20, iPhone 11 Pro and OnePlus 8. \r\nFor the past week, I've be… [+5550 chars]"}, {"source": {"id": null, "name": "Windowscentral.com"}, "author": "Asher Madan", "title": "Naughty Dog's Sylvia Chambers joins Microsoft's The Initiative as Character Animator - Windows Central", "description": "Today, Twitter's \"Klobrille\" noticed that Sylvia Chambers has joined Microsoft's new studio, The Initiative, as Character Animator. Chambers is known for her work at Sony's \"Naughty Dog,\" EA's \"DICE,\" and other teams.", "url": "https://www.windowscentral.com/naughty-dogs-sylvia-chambers-joins-microsofts-initiative-character-animatorr-animator", "urlToImage": null, "publishedAt": "2020-04-25T20:21:16Z", "content": "Source: Sony\r\n<ul><li>Character animations are some of the most important aspects of a game.</li><li>Sylvia Chambers recently joined Microsoft's \"The Initiative\" studio as Character Animator.</li><li>Chambers has worked at Naughty Dog, DICE, and more. </li><l… [+1555 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Eddie Makuch", "title": "Call Of Duty: Warzone Is Matching Cheaters With Each Other - GameSpot", "description": "Infinity Ward is working to clean up the CoD: Warzone battlefield on PS4, Xbox One, and PC; here's how.", "url": "https://www.gamespot.com/articles/call-of-duty-warzone-is-matching-cheaters-with-eac/1100-6476342/", "urlToImage": null, "publishedAt": "2020-04-25T19:54:00Z", "content": "Cheaters can ruin any online game, and Infinity Ward is taking drastic steps to reduce their influence in Call of Duty: Modern Warfare and Call of Duty: Warzone. The solution is simple: Make the cheaters play against each other so they can all be miserable.\r\n… [+2082 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Fallout 76: Wastelanders Review - IGN", "description": "Fallout 76: Wastelanders reviewed by David Jagneaux on PlayStation 4 Pro. Also available on PC and Xbox One. \"With the Wastelanders update, Fallout 76 has ta...", "url": "https://www.youtube.com/watch?v=U-uDLErALu0", "urlToImage": null, "publishedAt": "2020-04-25T19:51:32Z", "content": "Fallout 76: Wastelanders reviewed by David Jagneaux on PlayStation 4 Pro. Also available on PC and Xbox One.\r\n\"With the Wastelanders update, Fallout 76 has taken a solid step in the right direction after its dire launch. New human NPCs bring a healthy dose of… [+633 chars]"}, {"source": {"id": "crypto-coins-news", "name": "Crypto Coins News"}, "author": null, "title": "Twitch Streamer Alinity Gets Bullied By A Bunch of Voyeuristic Creeps - CCN.com", "description": "Go ahead and call me a simp, bullies. You're the pathetic weirdos gawking at Alinity, then bullying her with calls for Twitch to ban her.", "url": "https://www.ccn.com/twitch-streamer-alinity-gets-bullied-by-a-bunch-of-voyeuristic-creeps/", "urlToImage": null, "publishedAt": "2020-04-25T19:49:00Z", "content": "<ul><li>Popular Twitch streamer Alinity had a nip slip Friday.</li><li>An army of goons immediately began harassing her on social media.</li><li>Alinity isnt the problem; the issue is the bullying of female gamers.</li></ul>In a Friday broadcast, popular Twit… [+3359 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Discord’s Mobile Voice Overlay is no longer a Samsung Galaxy exclusive - XDA Developers", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiWmh0dHBzOi8vd3d3LnhkYS1kZXZlbG9wZXJzLmNvbS9kaXNjb3JkLW1vYmlsZS12b2ljZS1vdmVybGF5LWF2YWlsYWJsZS1hbGwtYW5kcm9pZC1kZXZpY2VzL9IBXmh0dHBzOi8vd3d3LnhkYS1kZXZlbG9wZXJzLmNvbS9kaXNjb3JkLW1vYmlsZS12b2ljZS1vdmVybGF5LWF2YWlsYWJsZS1hbGwtYW5kcm9pZC1kZXZpY2VzL2FtcC8?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T19:16:00Z", "content": null}, {"source": {"id": null, "name": "Bleepingcomputer.com"}, "author": "Lawrence Abrams", "title": "Ubuntu 20.04 LTS for Windows 10 Released on Microsoft Store - BleepingComputer", "description": "In their first Windows LTS release in two years, Canonical has released Ubuntu 20.04 for the Windows 10 Subsystem for Linux on the Microsoft Store.", "url": "https://www.bleepingcomputer.com/news/linux/ubuntu-2004-lts-for-windows-10-released-on-microsoft-store/", "urlToImage": null, "publishedAt": "2020-04-25T19:08:13Z", "content": "In their first Windows LTS release in two years, Canonical has released Ubuntu 20.04 for the Windows 10 Subsystem for Linux on the Microsoft Store. \r\nThe last release of Ubuntu was almost two years ago on May 2018 when Ubuntu 18.04 LTS was released and versio… [+962 chars]"}, {"source": {"id": null, "name": "Comicbook.com"}, "author": "Tyler Fischer", "title": "Top 5 Nintendo Switch Games Revealed This Week - ComicBook.com", "description": "Like most weeks, a lot of new Nintendo Switch games were announced this week. Some look good, some less so. That said, if you have -- somehow -- run out of games to play on your Nintendo Switch or Nintendo Switch Lite, don't worry, plenty of new games are com…", "url": "https://comicbook.com/gaming/news/nintendo-switch-games-new-april-2020/", "urlToImage": null, "publishedAt": "2020-04-25T19:03:47Z", "content": "Like most weeks, a lot of new Nintendo Switch games were announced this week. Some look good, some less so. That said, if you have -- somehow -- run out of games to play on your Nintendo Switch or Nintendo Switch Lite, don't worry, plenty of new games are com… [+3212 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "What We Want From A Resident Evil 4 Remake - GameSpot", "description": "Capcom is reportedly working on a remake of Resident Evil 4. Jean-Luc talks about a few major things he’d like to see in it that could improve an already exc...", "url": "https://www.youtube.com/watch?v=c_ghuXUzMxI", "urlToImage": null, "publishedAt": "2020-04-25T19:00:06Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Assassin's Creed 2020 Reveal Date is Set, Hints Industry Insider - GameRant", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiP2h0dHBzOi8vZ2FtZXJhbnQuY29tL2Fzc2Fzc2lucy1jcmVlZC1yYWduYXJvay0yMDIwLXJldmVhbC1kYXRlL9IBQ2h0dHBzOi8vZ2FtZXJhbnQuY29tL2Fzc2Fzc2lucy1jcmVlZC1yYWduYXJvay0yMDIwLXJldmVhbC1kYXRlL2FtcC8?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T18:39:58Z", "content": null}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "", "title": "WhatsApp claims spyware firm launched attacks with US servers - Engadget", "description": "WhatsApp has accused NSO Group of launching its surveillance attacks from US servers despite claims to the contrary.", "url": "https://www.engadget.com/whatsapp-says-nso-group-launched-attacks-from-us-155827515.html", "urlToImage": null, "publishedAt": "2020-04-25T18:39:41Z", "content": "Facebook just escalated its lawsuit over surveillance firm NSO Group’s WhatsApp call exploit attacks. The WhatsApp team has filed accusations that NSO relied on US-based servers to stage its spyware attacks using Pegasus software. NSO reportedly used the Los … [+725 chars]"}, {"source": {"id": null, "name": "Kotaku.com"}, "author": "Zack Zwiezen", "title": "New GTA Online Missions Are All About Preparing For A Recession - Kotaku", "description": "Grand Theft Auto Online received a new update a few days ago that added six new missions. These missions are all about an old-time GTA Online character, Gerald, and his attempts to get ready for an upcoming recession. Five of them are good and one of them is …", "url": "https://kotaku.com/new-gta-online-missions-are-all-about-preparing-for-a-r-1843048824", "urlToImage": null, "publishedAt": "2020-04-25T18:12:59Z", "content": "Grand Theft Auto Online received a new update a few days ago that added six new missions. These missions are all about an old-time GTA Online character, Gerald, and his attempts to get ready for an upcoming recession. Five of them are good and one of them is … [+2804 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "James O'Connor", "title": "Travis Scott Fortnite Concert: Don't Miss The Final Day! - GameSpot", "description": "Rapper Travis Scott will be doing a virtual global tour of Fortnite in the form of the Astronomical concert tonight, performing a new track in the massive battle royale game. Here are all the show times.", "url": "https://www.gamespot.com/articles/travis-scott-fortnite-concert-dont-miss-the-final-/1100-6476241/", "urlToImage": null, "publishedAt": "2020-04-25T18:10:00Z", "content": "Fortnite: Battle Royale is hosting a series of Travis Scott concerts today and tomorrow. Dubbed the Astronomical event, the virtual music performance has been promoted as \"an other-worldly experience\" that was \"built from the ground up in Fortnite.\" The first… [+1876 chars]"}, {"source": {"id": null, "name": "Sammobile.com"}, "author": "SamMobile", "title": "Galaxy S20 update with display green tint fix now widely available - SamMobile", "description": "Not every new flagship smartphone is perfect out of the box. And sometimes, issues can be introduced to new devices ...", "url": "https://www.sammobile.com/news/galaxy-s20-update-with-display-green-tint-fix-now-widely-available/", "urlToImage": null, "publishedAt": "2020-04-25T17:13:22Z", "content": "Not every new flagship smartphone is perfect out of the box. And sometimes, issues can be introduced to new devices after launch because of botched software updates, which is exactly what happened with the Galaxy S20 series recently: Galaxy S20, S20+, and S20… [+1391 chars]"}, {"source": {"id": null, "name": "Dotesports.com"}, "author": "Dylan Ladd", "title": "Fizz's Legends of Runeterra champion card revealed - Dot Esports", "description": "Elude your opponent’s strategies with the Tidal Trickster.", "url": "https://dotesports.com/lor/news/fizzs-legends-of-runeterra-card-and-followers-revealed", "urlToImage": null, "publishedAt": "2020-04-25T17:09:45Z", "content": "Legends of Runeterras card reveal season continues with the newest region, Bilgewater, and a familiar trickster that torments his adversaries by evading their strategies, Fizz.\r\nFizz is the champion that Riotunveiled in todays teasers. He’s a one-cost champio… [+1047 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Darren Allan", "title": "AMD Cezanne leak hints at next-gen laptop CPUs with RDNA 2 graphics that go for Intel’s jugular - TechRadar", "description": "Zen 3 APUs with RDNA 2-powered integrated graphics, rumor has it", "url": "https://www.techradar.com/news/amd-cezanne-leak-hints-at-next-gen-laptop-cpus-with-rdna-2-graphics-that-go-for-intels-jugular", "urlToImage": null, "publishedAt": "2020-04-25T17:05:52Z", "content": "AMD Ryzen 4000 (codenamed Renoir) mobile chips are still very much fresh on the scene and making a huge impact in terms of competitiveness in the laptop world but weve already seen a leak for next-gen APUs apparently codenamed Cezanne (a name which has been d… [+2934 chars]"}, {"source": {"id": null, "name": "Mspoweruser.com"}, "author": "https://www.facebook.com/profile.php?id=100034991436602", "title": "Massive Discount: Microsoft's Surface Laptop 2 is $699 cheaper today - MSPoweruser - MSPoweruser", "description": "If you’re on the lookout for a light and premium Windows 10 PC, Surface Laptop 2 deserves your attention. The Laptop 2 is also $699 cheaper today, so it’s now even easier to recommend. Microsoft  Surface Laptop 2 (Intel Core i7, 16GB RAM, 1TB) is now availabl…", "url": "https://mspoweruser.com/huge-discount-on-surface-laptop-2-at-amazon/", "urlToImage": null, "publishedAt": "2020-04-25T17:00:50Z", "content": "If you’re on the lookout for a light and premium Windows 10 PC, Surface Laptop 2 deserves your attention. The Laptop 2 is also $699 cheaper today, so it’s now even easier to recommend.\r\nMicrosoft  Surface Laptop 2 (Intel Core i7, 16GB RAM, 1TB) is now availab… [+1099 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Kevin Knezevic", "title": "Animal Crossing: New Horizons Free Goodies Available For Nintendo Switch Online Members - GameSpot", "description": "NSO subscribers can claim a free, exclusive Nook Inc. silk rug for New Horizons from the Nintendo Switch Eshop.", "url": "https://www.gamespot.com/articles/animal-crossing-new-horizons-free-goodies-availabl/1100-6476315/", "urlToImage": null, "publishedAt": "2020-04-25T16:47:00Z", "content": "Nintendo is offering a few special freebies for Animal Crossing: New Horizons. In addition to the Pocket Camp crossover items you can receive through the series' mobile spin-off, Switch Online members can nab an exclusive Nook Inc. silk rug from the Switch Es… [+1592 chars]"}, {"source": {"id": null, "name": "Dexerto.com"}, "author": "Joe Craven", "title": "Ninja blasts Fortnite for catering to ‘unskilled’ players - Dexerto", "description": "The Mixer star hit out at Fortnite over the reintroduction of certain weapons that take little to no skill to use.", "url": "https://www.dexerto.com/fortnite/ninja-blasts-fortnite-for-catering-to-unskilled-players-1357861", "urlToImage": null, "publishedAt": "2020-04-25T16:00:13Z", "content": "Popular Fortnite veteran Tyler 'Ninja' Blevins has criticized Epic Games' battle royale, arguing there are too many weapons that any player can use effectively. \r\nNinja, like many other prominent content creators, has recently transitioned away from Fortnite … [+2509 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Matthew Forde", "title": "Sony slip-ups: ahead of the PS5, we look back at the PlayStation tech that just didn't work - TechRadar India", "description": "They can't all be winners", "url": "https://www.techradar.com/news/sony-slip-ups-ahead-of-the-ps5-we-look-back-at-the-playstation-tech-that-just-didnt-work", "urlToImage": null, "publishedAt": "2020-04-25T16:00:00Z", "content": "As we motor towards the next generation of consoles, Sony currently holds all of the cards and will be looking to build upon the monumental success it found during the current generation. Its sometimes easy to forget just how well the PlayStation 4 has sold, … [+6393 chars]"}, {"source": {"id": null, "name": "9to5google.com"}, "author": null, "title": "Google Meet call w/ thousands of Googlers watched an executive’s son praise Zoom - 9to5Google", "description": "Funny story: During a Google Meet call with thousands of Google employees, an executive's son walked in and sung praises to the competing Zoom service.", "url": "https://9to5google.com/2020/04/25/google-meet-zoom-competition-executive-son-story/", "urlToImage": null, "publishedAt": "2020-04-25T14:37:50Z", "content": "In the wake of the coronavirus pandemic, Zoom has skyrocketed to mainstream popularity with hundreds of millions of users added in the past couple of months. Google Meet, on the other hand, hasn’t seen anything near Zoom’s success. To twist the knife, a Googl… [+2200 chars]"}, {"source": {"id": null, "name": "Jalopnik.com"}, "author": "Andrew P. Collins", "title": "This Badass Old Van Is Actually A Modern Ford F-150 - Jalopnik", "description": "I paw through a lot of Facebook groups and forums looking at modified vehicles belonging to people I don’t know. (If you also think this is fun, we could probably be friends.) But a modern chassis, drivetrain, and dashboard swap over to a classic body project…", "url": "https://jalopnik.com/this-badass-old-van-is-actually-a-modern-ford-f-150-1843014870", "urlToImage": null, "publishedAt": "2020-04-25T14:12:13Z", "content": "I paw through a lot of Facebook groups and forums looking at modified vehicles belonging to people I dont know. (If you also think this is fun, we could probably be friends.) But a modern chassis, drivetrain, and dashboard swap over to a classic body project … [+3160 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Rhett Allain", "title": "Wait a Second, That Table Has No Legs! - WIRED", "description": "How to build “magic,” gravity-defying structures—with Legos, kite string, and physics.", "url": "https://www.wired.com/story/wait-that-table-has-no-legs/", "urlToImage": null, "publishedAt": "2020-04-25T14:00:00Z", "content": "Really, this doesn't tell us much. All it says is that the upward-pulling tension has to be equal to the two downward forces (gravity and the other tension).\r\nBut what about the sum of the torques? If the object is in equilibrium, you can pick any point on th… [+2262 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Eddie Makuch", "title": "WWE 2K21 Is Canceled, But Franchise Isn't Dead - GameSpot", "description": "The WWE announces that there won't be a new WWE 2K game this year but 2K says fans should watch out for \"exciting news\" on Monday.", "url": "https://www.gamespot.com/articles/wwe-2k21-is-canceled-but-franchise-isnt-dead/1100-6476445/", "urlToImage": null, "publishedAt": "2020-04-25T13:23:00Z", "content": "The WWE has officially confirmed that the next WWE 2K game is canceled. WWE 2K21 will not be released, management said on an earnings call. The news comes following potentially-delayed workflows due to the ongoing pandemic and a particularly poor showing from… [+1467 chars]"}, {"source": {"id": null, "name": "Soranews24.com"}, "author": "https://soranews24.com/author/scott-wilson/", "title": "Japanese artist paints Cloud from Final Fantasy VII Remake using traditional methods【Video】 - SoraNews24", "description": "Not just priceless, it's gil-less.", "url": "https://soranews24.com/2020/04/25/japanese-artist-paints-cloud-from-final-fantasy-vii-remake-using-traditional-methods%e3%80%90video%e3%80%91/", "urlToImage": null, "publishedAt": "2020-04-25T13:02:35Z", "content": "Not just priceless, it’s gil-less.\r\nWith the recent release of Final Fantasy VII Remake, fans of the original game and newcomers to the series alike have been creating some incredible works inspired by the game.\r\nAnd now that lineup includes well-known Nihong… [+2091 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ben Gilbert", "title": "How to set up Nintendo Switch two-factor authentication - Business Insider - Business Insider", "description": "Following a major breach, Nintendo is suggesting all Nintendo Switch owners set up two-factor authentication. Here's how to do it.", "url": "https://www.businessinsider.com/how-to-set-up-nintendo-switch-two-factor-authentication-2020-4", "urlToImage": null, "publishedAt": "2020-04-25T13:00:26Z", "content": "Do you have a Nintendo Switch? Did you also have a Nintendo 3DS or Wii U? \r\nIf you answered yes to both of those questions, there's a possibility your Nintendo Switch account was one of \"about 160,000\" breaches that Nintendo announced on Friday morning.\r\nSo, … [+180 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Paul Tassi", "title": "Why Are Destiny 2’s Titans Suddenly Dominating Guardian Games? - Forbes", "description": "We can debate what to make of Destiny 2’s “whoops the real Olympics got cancelled” Guardian Games event in terms of how it’s been presented with its endless bounty grind, but I do think it has achieved at least part of its desired objectives, stirring up dram…", "url": "https://www.forbes.com/sites/paultassi/2020/04/25/why-are-destiny-2s-titans-suddenly-dominating-guardian-games/", "urlToImage": null, "publishedAt": "2020-04-25T12:35:58Z", "content": "Destiny 2\r\nBungie\r\nWe can debate what to make of Destiny 2s whoops the real Olympics got cancelled Guardian Games event in terms of how its been presented with its endless bounty grind, but I do think it has achieved at least part of its desired objectives, s… [+3395 chars]"}, {"source": {"id": null, "name": "Dexerto.com"}, "author": "Joe Craven", "title": "New master camo and Shoot the Ship modes coming to Modern Warfare - Dexerto", "description": "Infinity Ward confirmed the inclusion of a new master camo and new Shoot the Ship modes in an April 24 community update.", "url": "https://www.dexerto.com/call-of-duty/new-master-camo-and-shoot-the-ship-modes-coming-to-modern-warfare-1357780", "urlToImage": null, "publishedAt": "2020-04-25T12:11:57Z", "content": "Call of Duty developers Infinity Ward have confirmed that Modern Warfare will soon be graced with new Shoot the Ship modes, as well as a new master weapon camouflage, above the existing Damascus.\r\nIn an April 24 community update, Infinity Ward confirmed a hos… [+1718 chars]"}, {"source": {"id": null, "name": "Notebookcheck.net"}, "author": "Daniel R Deakin", "title": "Huge Pokémon Gold and Silver source code leak reveals some very beta-looking pocket monsters - Notebookcheck.net", "description": "The full source code for Pokémon Gold Version and Pokémon Silver Version has been shared online, and fans have been thoroughly enjoying going through the dozens of images that were part of the various builds. This includes pictures of front and back Pokémon s…", "url": "https://www.notebookcheck.net/Huge-Pokemon-Gold-and-Silver-source-code-leak-reveals-some-very-beta-looking-pocket-monsters.462921.0.html", "urlToImage": null, "publishedAt": "2020-04-25T12:07:03Z", "content": "Pokémon Gold and Pokémon Silver were released in Japan in 1999, before coming to Australia and North America in 2000 and Europe in 2001. The games were huge commercial and critical successes: Over 23 million units were sold. The full source code for the popul… [+1185 chars]"}, {"source": {"id": null, "name": "Dexerto.com"}, "author": "Andy Williams", "title": "Riot developer exposes sexist harassment during Valorant Twitch stream - Dexerto", "description": "A LoL developer has exposed the forms of sexual harassment they suffered during a Valorant Twitch stream, prompting a response from Riot.", "url": "https://www.dexerto.com/valorant/riot-developer-exposes-sexist-harassment-during-valorant-twitch-stream-1357781", "urlToImage": null, "publishedAt": "2020-04-25T12:07:01Z", "content": "A League of Legends developer has exposed the sexist abuse she faced during a Valorant Twitch stream, resulting in Riot pledging to find “long-term solutions.”\r\nValorant’s closed beta has been a massive success for Riot, garnering almost 300 million hours wat… [+3248 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Lynn La", "title": "iPhone SE vs. iPhone 8 comparison: Which $400 iPhone should you get? - CNET", "description": "Some retailers are still selling the iPhone 8 despite Apple discontinuing the device. But you should just get the new iPhone SE instead.", "url": "https://www.cnet.com/news/iphone-se-vs-iphone-8-spec-comparison-which-400-iphone-should-you-get/", "urlToImage": null, "publishedAt": "2020-04-25T11:28:26Z", "content": "In a bid to lure budget-minded iPhone fans, Apple debuted its new iPhone SE for 2020 on April 15 for $399 (£419, AU$749). It's a sequel to its 2016 iPhone of the same name. The new iPhone SE's specs are similar to the iPhone 8 from three years ago, which is l… [+8211 chars]"}, {"source": {"id": null, "name": "Ghacks.net"}, "author": null, "title": "Android 11 may revoke app permissions automatically - Ghacks Technology News", "description": "Android 11 devices may revoke application permissions automatically if they are configured that way by the owner of the device.", "url": "https://www.ghacks.net/2020/04/25/android-11-may-revoke-app-permissions-automatically/", "urlToImage": null, "publishedAt": "2020-04-25T11:17:37Z", "content": "Google released the third developer preview of the upcoming Android 11 operating system. The preview includes a number of changes and also some new features that developers and those interested in previewing new versions may check out right now.\r\nOne of the c… [+2019 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Gordon Kelly", "title": "Google Just Gave Millions Of Users A Reason To Quit Windows 10 - Forbes", "description": "Google has revealed an unfixable problem which may force you to pick between Windows 10 and Chrome.", "url": "https://www.forbes.com/sites/gordonkelly/2020/04/23/google-chrome-critical-security-exploit-windows-10-upgrade-warning-update-chrome-browser/", "urlToImage": null, "publishedAt": "2020-04-25T11:16:38Z", "content": "04/25 Update below. This post was originally published on April 23\r\nGoogle is always improving Chrome and it recently issued a brilliant (if long overdue) upgrade. Unfortunately, now Google has detailed a serious new problem in Chrome which cannot be fixed, a… [+3970 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "13 Changes We Need To See in Animal Crossing New Horizons - ANIMAL CROSSING NEW HORIZONS GAMEPLAY - Eurogamer", "description": "We love Animal Crossing: New Horizons here at Eurogamer, but there are some changes we'd like to see to the game. Our own Animal Crossing: New Horizons gamep...", "url": "https://www.youtube.com/watch?v=5B4uDpzf9Dc", "urlToImage": null, "publishedAt": "2020-04-25T11:00:02Z", "content": null}, {"source": {"id": null, "name": "Autoevolution.com"}, "author": "Andrei Tutu", "title": "2015 Ford Mustang GT 'Generation Gap\" Is a Bad Boy 1967 Eleanor Conversion - autoevolution", "description": "Wouldn't it be a dream to enjoy a Ford Mustang that mixes the retro look of a 1967 Fastback with the plethora of benefits delivered by a 2015 GT? The answer to this question is obvious, so the motor-crazy crew over at B Is For Build decided to translate this …", "url": "https://www.autoevolution.com/news/2015-ford-mustang-gt-generation-gap-is-a-bad-boy-1967-eleanor-conversion-142983.html", "urlToImage": null, "publishedAt": "2020-04-25T10:39:00Z", "content": "It's been almost a month since we first discussed this stunning Blue Oval project and while the March article included all the uphill work required to put this contraption together, the time has come to start enjoying the fruits of all that labor. As such, th… [+1229 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Davey Winder", "title": "New Windows 10 Update Fail: Users Warn Of BSOD And Deleted Files - Forbes", "description": "As users complain of blue screens of death, deleted files and reboot loops, here's what you really need to know about this Windows 10 update.", "url": "https://www.forbes.com/sites/daveywinder/2020/04/25/new-windows-10-update-fail-users-warn-of-bsod-and-deleted-files/", "urlToImage": null, "publishedAt": "2020-04-25T10:03:45Z", "content": "The latest Patch Tuesday update has caused alarming problems for some Windows 10 users\r\nSOPA Images/LightRocket via Getty Images\r\nAs users complain of blue screens of death, deleted files and reboot loops, here's what you need to know about this Windows 10 up… [+4453 chars]"}, {"source": {"id": null, "name": "Motor1.com"}, "author": "Jacob Oliva", "title": "2020 Hyundai Sonata N-Line To Debut Mid-May? - Motor1 ", "description": "We could be seeing the performance variant by next month.", "url": "https://www.motor1.com/news/414725/hyundai-sonata-n-line-debut/", "urlToImage": null, "publishedAt": "2020-04-25T08:22:07Z", "content": "The Hyundai Sonata has evolved from its once classy design. I can still remember how enamored I was with the Sonata around 10 years ago. Its design was simple, with straight lines and some touches of chrome that are fit for an executive midsize sedan, but it … [+1715 chars]"}, {"source": {"id": "ign", "name": "IGN"}, "author": "Felicia Miranda", "title": "FF7 Remake Hard Mode Guide: Tips on MP Recovery, Healing, and the Best Materia - IGN - IGN", "description": "Get through hard mode in FF7 Remake with our guide which includes ways to preserve MP, recover MP and HP, and our suggestions for the best materia to use.", "url": "https://www.ign.com/articles/ff7-remake-hard-mode-guide", "urlToImage": null, "publishedAt": "2020-04-25T02:29:59Z", "content": "FF7 Remakes hard mode brings a new layer of difficulty to Clouds adventure in Midgar, challenging players to really step up their strategy and perfect their combat skills. The biggest differences to expect in FF7Rs hard mode are stronger enemies, unusable ite… [+3714 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Jordan Ramée", "title": "Patch Notes Released For Latest Borderlands 3 Update; Moze Gets Another Buff - GameSpot", "description": "A new update will kick off off a bunch of new content in Borderlands 3, and also implement numerous bug fixes.", "url": "https://www.gamespot.com/articles/patch-notes-released-for-latest-borderlands-3-upda/1100-6476425/", "urlToImage": null, "publishedAt": "2020-04-25T00:12:00Z", "content": "Gearbox has released the full patch notes for a Borderlands 3 update scheduled to release today at 12 PM PT / 3 PM ET. The update will see the start of the Revenge of the Cartels limited-time event and Loot the Universe, adds Mayhem Mode 2.0, and implements d… [+26277 chars]"}, {"source": {"id": null, "name": "Neowin.net"}, "author": "https://www.facebook.com/profile.php?id=100022982110913", "title": "Messenger Rooms launching with a fifty-person limit - Neowin", "description": "Facebook has announced a new feature called Messenger Rooms. Rooms will host up to 50 people in one video call and later on will be accessible across Facebook's products such as Instagram and Portal.", "url": "https://www.neowin.net/news/messenger-rooms-launching-with-a-fifty-person-limit/", "urlToImage": null, "publishedAt": "2020-04-24T22:12:00Z", "content": "Facebook has announced that it’s rolling out a new feature this week for its platform called Messenger Rooms. The new feature will allow you to create a room from Messenger or Facebook and invite anyone to join your video call, even if they don’t have a Faceb… [+1497 chars]"}, {"source": {"id": null, "name": "Tomsguide.com"}, "author": "Adam Ismail", "title": "LG Velvet release date, price, specs and rumors - Tom's Guide", "description": "The LG Velvet is intended to reboot the company's phones with a focus on design. Here's everything we know so far.", "url": "https://www.tomsguide.com/news/lg-velvet-release-date-price-specs-and-rumors", "urlToImage": null, "publishedAt": "2020-04-24T21:43:15Z", "content": "The upcoming LG Velvet is an important device for the Korean tech giant. In recent years, LG's smartphone arm hasn't delivered the kind of critical or commercial success necessary to stay relevant. A confused lineup of flagships with similar designs and specs… [+6025 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "iPad Pro Magic Keyboard Review: Almost Perfect... - Dom Esposito", "description": "Apple Magic Keyboard Review - Best iPad Keyboard Case? Worth the Money? This iPad Pro Magic Keyboard packs a trackpad, backlit keys, and. costs $300+ but sho...", "url": "https://www.youtube.com/watch?v=_evwRhwt8IQ", "urlToImage": null, "publishedAt": "2020-04-24T21:14:17Z", "content": "Apple Magic Keyboard Review - Best iPad Keyboard Case? Worth the Money? This iPad Pro Magic Keyboard packs a trackpad, backlit keys, and. costs $300+ but should you buy it? Check out my Magic Keyboard for iPad Pro review! Covering design, SideCar use, keyboar… [+238 chars]"}, {"source": {"id": null, "name": "Androidpolice.com"}, "author": null, "title": "OnePlus reportedly issues massive layoffs in largest European markets - Android Police", "description": "OnePlus has reportedly made severe staffing cuts in its European operations. While the tech brand has experienced massive growth in other markets over the", "url": "https://www.androidpolice.com/2020/04/25/oneplus-reportedly-issued-massive-layoffs-in-largest-european-markets/", "urlToImage": null, "publishedAt": "2020-04-24T21:06:06Z", "content": "This story was originally published 2020/04/24 1:52pm PDTon Apr 24, 2020 and last updated 2020/04/25 12:38pm PDTApr 25, 2020. \r\nOnePlus has reportedly made severe staffing cuts in its European operations. While the tech brand has experienced massive growth in… [+3233 chars]"}, {"source": {"id": null, "name": "Autoevolution.com"}, "author": "Mircea Panait", "title": "Lexus Sends Off GS Luxury Sedan With \"Eternal Touring\" Special Edition - autoevolution", "description": "Pretty much the Japanese equivalent to the Black Line in America, Eternal Touring is how Lexus bids farewell to the GS luxury sedan. Introduced in 1993 with exterior styling from the one and only Giorgetto Giugiaro, the GS is getting on a bit considering that…", "url": "https://www.autoevolution.com/news/lexus-sends-off-gs-luxury-sedan-with-eternal-touring-special-edition-142976.html", "urlToImage": null, "publishedAt": "2020-04-24T19:53:00Z", "content": "Codenamed L10, the fourth generation will be replaced by the ES in August 2020. No direct successor of the Grand touring Sedan is planned, and given the appetite for crossovers and SUVs, it doesn’t come as a surprise. The ES isn’t only longer than the GS but … [+1677 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Steve Watts", "title": "Nintendo Switch Shortages Reportedly Exacerbated By Automated Buyers - GameSpot", "description": "Buying bots may be contributing to or even causing persistent hardware shortages for Nintendo's handheld hybrid.", "url": "https://www.gamespot.com/articles/nintendo-switch-shortages-reportedly-exacerbated-b/1100-6476478/", "urlToImage": null, "publishedAt": "2020-04-24T19:19:00Z", "content": "In the weeks since the coronavirus pandemic began and much of the world has been confined to their separate houses, Nintendo Switch hardware has been notoriously difficult to find. This has been chalked up to increased demand as people look for ways to occupy… [+1388 chars]"}, {"source": {"id": null, "name": "Boardingarea.com"}, "author": "http://www.facebook.com/runningwithmiles", "title": "Great Deal: Bose 700 Noise Cancelling Headphones for $100 Off (Even More with Card Discounts) - Running with Miles - Running with Miles", "description": "Get a great deal on the Bose 700 - their top-of-the-line noise cancelling headphones! Save $100 off or even more if you use these card discounts!", "url": "https://runningwithmiles.boardingarea.com/great-deal-bose-700-noise-cancelling-headphones-for-100-off-even-more-with-card-discounts/", "urlToImage": null, "publishedAt": "2020-04-24T19:11:36Z", "content": "Get a great deal on the Bose 700 – their top-of-the-line noise cancelling headphones! Save $100 off or even more if you use these card discounts!Last year, Bose updated their top of the line noise cancelling headphones with the Bose 700. These incorporated so… [+1882 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Jeffrey Parkin", "title": "Choosing which of XCOM: Chimera Squad factions to investigate first - Polygon", "description": "XCOM: Chimera Squad has three factions that your team will investigate across a series of missions. It doesn’t matter which you choose first, but each has different types of units to face.", "url": "https://www.polygon.com/guides/2020/4/24/21234689/xcom-chimera-squad-factions-progeny-gray-phoenix-sacred-coil-investigate", "urlToImage": null, "publishedAt": "2020-04-24T18:42:52Z", "content": "XCOM: Chimera Squads City 31 has three enemy factions effectively terrorist groups that Chimera Squad has to investigate. One of your first tasks in the game is to choose between The Progeny, Gray Phoenix, and Sacred Coil.\r\nIn this guide, well introduce you t… [+2083 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Trials of Mana - Your Adventure Begins Trailer - Nintendo Switch - Nintendo", "description": "Trials of Mana is Available Now on Nintendo Switch! A Trials of Mana Demo is also available and free to download! Forces of darkness will stop at nothing to ...", "url": "https://www.youtube.com/watch?v=qq1CTFtJI38", "urlToImage": null, "publishedAt": "2020-04-24T16:00:30Z", "content": "Trials of Mana is Available Now on Nintendo Switch! A Trials of Mana Demo is also available and free to download!\r\nForces of darkness will stop at nothing to get their hands on the powerful Sword of Mana. Begin your adventures today, join your companions, and… [+463 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "OnePlus 8 Pro versus LG V60 smartphone showdown - Phandroid", "description": "This OnePlus 8 Pro versus LG V60 comparison will give you a detailed look at the LG V60 and the new OnePlus 8 Prom comparisons their software, hardware, and ...", "url": "https://www.youtube.com/watch?v=CDVfqqvF560", "urlToImage": null, "publishedAt": "2020-04-24T15:00:58Z", "content": null}, {"source": {"id": null, "name": "Electrek.co"}, "author": null, "title": "Ford might delay Mustang Mach-E launch, will update as production restarts - Electrek", "description": "Ford might delay the Mustang Mach-E launch amid the coronavirus pandemic and will give an updated timeline as it restarts its production facilities. The Mustang Mach-E is Ford’s first all-electric vehicle built from the ground up and one of the most anticipat…", "url": "https://electrek.co/2020/04/24/ford-delay-mustang-mach-e-launch-production-restart/", "urlToImage": null, "publishedAt": "2020-04-24T13:27:26Z", "content": "Ford might delay the Mustang Mach-E launch amid the coronavirus pandemic and will give an updated timeline as it restarts its production facilities.\r\nThe Mustang Mach-E is Ford’s first all-electric vehicle built from the ground up and one of the most anticipa… [+2960 chars]"}]}