{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Tomsguide.com"}, "author": "Philip Michaels", "title": "iPhone SE 2020 vs. iPhone 7: Should you upgrade? - Tom's Guide", "description": "The iPhone SE 2020 looks a lot like the iPhone 7, but that’s where the similarities end", "url": "https://www.tomsguide.com/face-off/iphone-se-2020-vs-iphone-7", "urlToImage": null, "publishedAt": "2020-04-25T09:27:56Z", "content": "It may feel like the iPhone 7\r\n came out ages ago, but it's really been only three-and-a-half years. In this age, when people are going longer than ever between phone upgrades, there are plenty of iPhone 7 and iPhone 7 Plus models still out in the wild, with … [+8971 chars]"}, {"source": {"id": null, "name": "Androidcentral.com"}, "author": "Stephen Warwick", "title": "EU states 'being completely held hostage by Google and Apple' says official - Android Central", "description": "Apple and Google have rebuffed calls from France and Germany to support their contact tracing apps, which use centralized data containing user information.", "url": "https://www.androidcentral.com/eu-states-being-completely-held-hostage-google-and-apple-says-official", "urlToImage": null, "publishedAt": "2020-04-25T09:10:59Z", "content": "An EU official has said that Apple and Google are holding EU states hostage after they rebuffed further calls to support contact tracing solutions offered by France and Germany.\r\nAs Reuters reports:\r\nA standoff between the two largest nations in the European … [+2171 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Kalhan Rosenblatt", "title": "Amid quarantine, thousands are escaping to tropical islands — via 'Animal Crossing' - NBC News", "description": "\"Animal Crossing: New Horizons\" and other video games known as \"life simulators\" have offered players a mental escape from the coronavirus quarantine.", "url": "https://www.nbcnews.com/tech/video-games/amid-quarantine-thousands-are-escaping-tropical-islands-animal-crossing-n1189976", "urlToImage": null, "publishedAt": "2020-04-25T08:48:05Z", "content": "For Amy Okuda, not being able to spend time with her mother, who lives just five miles down the road, has been one of the most difficult parts of being in quarantine.\r\nDisenchanted with FaceTime and Zoom, Okuda and her mother found another way to connect by m… [+7442 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Twitch Streamer Alinity Reveals a Little Too Much on Stream - GameRant", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiM2h0dHBzOi8vZ2FtZXJhbnQuY29tL2FsaW5pdHktdHdpdGNoLW5pcC1zbGlwLXZpZGVvL9IBN2h0dHBzOi8vZ2FtZXJhbnQuY29tL2FsaW5pdHktdHdpdGNoLW5pcC1zbGlwLXZpZGVvL2FtcC8?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T08:18:09Z", "content": null}, {"source": {"id": null, "name": "Tomsguide.com"}, "author": "Roland Moore-Colyer", "title": "Xbox Series X's crazy fast load times revealed — and PS5 should be worried - Tom's Guide", "description": "Xbox Series X super-fast SSD loads Gears 5 four times faster than Xbox One", "url": "https://www.tomsguide.com/news/xbox-series-xs-crazy-fast-load-times-revealed-and-ps5-should-be-worried", "urlToImage": null, "publishedAt": "2020-04-25T06:25:00Z", "content": "Microsofts Xbox Series X will load games much, much faster than the Xbox One, even if a games code isnt tweaked for the next-generation console. \r\nGears 5 loads four times faster on the Xbox Series X than it does on the Xbox One, according to Mike Rayner, tec… [+2197 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "NVIDIA RTX Voice Benchmark on GTX vs. RTX GPUs, Gaming Performance, & Voice Quality - Gamers Nexus", "description": "This benchmark tests NVIDIA RTX Voice for gaming performance impact, mostly to determine if RT hardware is even being used. 2080 Super, 2060, and GTX 1080 in...", "url": "https://www.youtube.com/watch?v=f_obMmLXlP4", "urlToImage": null, "publishedAt": "2020-04-25T04:03:07Z", "content": null}, {"source": {"id": null, "name": "Androidpolice.com"}, "author": null, "title": "The 5 best things about the OnePlus 8 Pro - Android Police", "description": "The higher price of the OnePlus 8 Pro hasn't gone down too well in some quarters, but there's no doubting that you still get a lot of phone for the money.", "url": "https://www.androidpolice.com/2020/04/24/5-best-oneplus-8-pro/", "urlToImage": null, "publishedAt": "2020-04-25T03:47:18Z", "content": "The higher price of the OnePlus 8 Pro hasn't gone down too well in some quarters, but there's no doubting that you still get a lot of phone for the money. Lets take a look at the five standout features of the latest OnePlus flagship. And don't worry, we've go… [+3189 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Desire Athow", "title": "This AMD Ryzen notebook deal is probably the best we've ever seen - TechRadar", "description": "Lenovo and AMD provide a glimpse into the future", "url": "https://www.techradar.com/news/this-amd-ryzen-laptop-is-the-probably-the-best-notebook-deal-ever", "urlToImage": null, "publishedAt": "2020-04-25T03:00:00Z", "content": "We reviewers are used to obsessing over incremental technology changes, but every now and then a supernova appears on our radar - something that can single handedly change the status quo.\r\nThe AMD Ryzen 4000 family is one such supernova and promises to bring … [+1829 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Phil Hornshaw", "title": "Final Fantasy 7 Remake Guide: Every Johnny Scene - GameSpot", "description": "Meeting Johnny around the slums of Midgar will get you extra story scenes and unlock a Trophy, but you'll have to seek him out.", "url": "https://www.gamespot.com/articles/final-fantasy-7-remake-guide-every-johnny-scene/1100-6476501/", "urlToImage": null, "publishedAt": "2020-04-25T02:33:00Z", "content": "As you work your way through the slums of Midgar in Final Fantasy 7 Remake, you can't help but meet Johnny, a colorful character who's not especially bright. Despite mostly good intentions, Johnny can't help but get himself into trouble almost constantly--but… [+3443 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Oscar Gonzalez", "title": "Travis Scott event in Fortnite: How to watch the encore and find the Giant Astro Heads - CNET", "description": "The rapper dropped new tracks in a jaw-dropping concert. Catch the next show at midnight.", "url": "https://www.cnet.com/news/travis-scott-event-in-fortnite-how-to-watch-the-encore-and-find-the-giant-astro-heads/", "urlToImage": null, "publishedAt": "2020-04-25T01:02:37Z", "content": "Play some Fortnite and listen to a new track from Travis Scott.\r\nEpic Games\r\nFortnite events aren't only for players to check out new content from developer Epic Games. The popular battle royale game has also played host to multiple premieres and collaboratio… [+3718 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "", "title": "Android's upcoming call recording feature could be region restricted - Engadget", "description": "Android's upcoming call recording feature could be coming soon.", "url": "https://www.engadget.com/android-call-recording-003653130.html", "urlToImage": null, "publishedAt": "2020-04-25T00:52:32Z", "content": "The document went on to say that when you record a call for the first time, you’ll be advised that you’re responsible for complying with local laws (many regions require consent by all parties prior to call recording). It states: “When you start recording, th… [+866 chars]"}, {"source": {"id": null, "name": "Dexerto.com"}, "author": "Albert Petrosyan", "title": "Infinity Ward reveal early look at next Modern Warfare update patch notes - Dexerto", "description": "Infinity Ward's April 24 Community Update previews next week's patch, which will include some new playlists, a lot of bug fixes, and the new weapon mastery camo.", "url": "https://www.dexerto.com/call-of-duty/infinity-ward-reveal-early-look-at-next-modern-warfare-update-patch-notes-1357713", "urlToImage": null, "publishedAt": "2020-04-25T00:44:34Z", "content": "Developers Infinity Ward have released their latest weekly Community Update for Modern Warfare, giving players an early glimpse at what the April 28 patch will bring to multiplayer and Warzone battle royale.\r\nAs part of their effort to improve communication w… [+2839 chars]"}, {"source": {"id": null, "name": "9to5google.com"}, "author": null, "title": "You can now easily record Google 3D animals on Android - 9to5Google", "description": "Even before stay at home orders, AR objects in Google Search were already a fun way to bring the outside world in. Record Google 3D animals...", "url": "https://9to5google.com/2020/04/24/google-3d-animals-record/", "urlToImage": null, "publishedAt": "2020-04-24T23:21:25Z", "content": "Even before stay at home orders, AR objects in Google Search were already a fun way to bring the outside world indoors. A new feature rolling out to Android today lets you easily record Google 3D animals.\r\nThe “View in your space” feature allows life-sized 3D… [+1446 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Julie Muncy", "title": "Nintendo Confirms Some 160,000 Accounts Might've Been Hacked - WIRED", "description": "To counteract the hacking attempt, the company is temporarily disabling users' ability to access their accounts through the Nintendo Network ID system.", "url": "https://www.wired.com/story/nintendo-switch-hack/", "urlToImage": null, "publishedAt": "2020-04-24T23:06:37Z", "content": "Hello, and welcome once again to Replay, WIRED's weekly roundup of videogame news. This week, we've got a hack you should know about, a delay, and some cool new tech. Let's get to it.\r\nEarlier today, Nintendo confirmed that a recent hacking attempt on its sys… [+3527 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Naruto Shippuden: Ultimate Ninja Storm 4 Road to Boruto - Official Switch Trailer - IGN", "description": "Experience the Fourth Great Ninja War and see through the conclusion of the Naruto Shippuden storyline in the game, available now on Nintendo Switch. Check o...", "url": "https://www.youtube.com/watch?v=H_T9pPijWPc", "urlToImage": null, "publishedAt": "2020-04-24T22:43:40Z", "content": null}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Dave Johnson", "title": "The Apple Watch Series 5 is $100 off at Amazon right now - CNET", "description": "Get the 40mm Apple Watch Series 5 (GPS and cellular) in silver for $399.", "url": "https://www.cnet.com/news/the-apple-watch-series-5-is-100-off-at-amazon-right-now/", "urlToImage": null, "publishedAt": "2020-04-24T22:21:19Z", "content": "Apple\r\nThe Apple Watch Series 5 isn't a remarkable upgrade from the Series 4, and for that reason alone, I know it's not everyone's favorite Apple smartwatch. But it's my personal fave (thanks in no small part to the always-on display), and the first one I've… [+855 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Morgan Hines", "title": "CDC: Frozen raspberries were culprit behind 2019 norovirus outbreak on multiple cruises - USA TODAY", "description": "Smoothies: Nutritious, delicious – and according to the CDC, the source of a norovirus outbreak that infected hundreds of cruise passengers in 2019.", "url": "https://www.usatoday.com/story/travel/cruises/2020/04/24/cdc-report-raspberries-caused-2019-norovirus-outbreak-cruises/3018721001/", "urlToImage": null, "publishedAt": "2020-04-24T21:58:07Z", "content": "Here is everything you need to know about the highly contagious norovirus.\r\nUSA TODAY\r\nPassengers contemplating boarding another cruise after the coronavirus pandemic might already be planning to pass up the buffet next time they sail due to social-distancing… [+3987 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Lisa Eadicicco", "title": "Microsoft Word now says 2 spaces after a period is wrong - Business Insider - Business Insider", "description": "Microsoft Word will now flag two spaces after a period as an error, putting an end to the debate.", "url": "https://www.businessinsider.com/microsoft-word-update-2-spaces-after-period-wrong-2020-4", "urlToImage": null, "publishedAt": "2020-04-24T21:12:09Z", "content": "Microsoft is putting its foot down in the age-old debate about whether it's correct to put one or two spaces after a period.\r\nMicrosoft Word's editor function is getting a new feature that flags two spaces after a period as an error, according to The Verge. S… [+1126 chars]"}, {"source": {"id": null, "name": "Androidpolice.com"}, "author": null, "title": "T-Mobile confirms it's going to brick 5G on most Sprint 5G phones post-merger - Android Police", "description": "T-Mobile will shut down Sprint's 5G network in order to rework its spectrum into its own 5G grid. While those with a Galaxy S20 series device on Sprint", "url": "https://www.androidpolice.com/2020/04/24/t-mobile-confirms-its-going-to-brick-5g-on-most-sprint-5g-phones-post-merger/", "urlToImage": null, "publishedAt": "2020-04-24T21:06:31Z", "content": "This story was originally published 2020/04/22 11:47am PDTon Apr 22, 2020 and last updated 2020/04/24 1:56pm PDTApr 24, 2020. \r\nT-Mobile will shut down Sprint's 5G network in order to rework its spectrum into its own 5G grid. While those with a Galaxy S20 ser… [+3283 chars]"}, {"source": {"id": null, "name": "Androidpolice.com"}, "author": null, "title": "OnePlus reportedly issues massive layoffs in largest European markets - Android Police", "description": "OnePlus has reportedly made severe staffing cuts in its European operations. While the tech brand has experienced massive growth in other markets over the", "url": "https://www.androidpolice.com/2020/04/24/oneplus-reportedly-issued-massive-layoffs-in-largest-european-markets/", "urlToImage": null, "publishedAt": "2020-04-24T21:06:06Z", "content": "OnePlus has reportedly made severe staffing cuts in its European operations. While the tech brand has experienced massive growth in other markets over the past few years, it has also faced major headwinds across the continent in the same time which have led t… [+1601 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Eddie Makuch", "title": "Call Of Duty: Warzone Cheaters Now Only Play Each Other - GameSpot", "description": "Infinity Ward is working to clean up the CoD: Warzone battlefield on PS4, Xbox One, and PC; here's how.", "url": "https://www.gamespot.com/articles/call-of-duty-warzone-cheaters-now-only-play-each-o/1100-6476342/", "urlToImage": null, "publishedAt": "2020-04-24T20:15:00Z", "content": "Cheaters can ruin any online game, and Infinity Ward is taking drastic steps to reduce their influence in Call of Duty: Modern Warfare and Call of Duty: Warzone. The solution is simple: Make the cheaters play against each other so they can all be miserable.\r\n… [+2082 chars]"}, {"source": {"id": null, "name": "Autoevolution.com"}, "author": "Mihnea Radu", "title": "Front-Engined Lamborghini Aventador Is the Anti-Corvette Statement - autoevolution", "description": "Putting the engine in the wrong place is one of the most interesting things happening in the sports car world right now. But where is the right place? Now that the Chevy Corvette has it in the same location as every Italian exotic, maybe it's time for Lamborg…", "url": "https://www.autoevolution.com/news/front-engined-lamborghini-aventador-is-the-anti-corvette-statement-142977.html", "urlToImage": null, "publishedAt": "2020-04-24T20:11:00Z", "content": "We're kidding. The Aventador is one of the most amazing machines ever, but it's getting a little old. It came out roughly four batman movies ago and has stayed alive only though numerous small updates.In this video, TheSketchMonkey raises the possibility that… [+1238 chars]"}, {"source": {"id": null, "name": "9to5mac.com"}, "author": null, "title": "Magic Keyboard for iPad Pro top features — the best iPad accessory ever [Video] - 9to5Mac", "description": "Hands-on with top features for the Magic Keyboard for iPad Pro. It's the best accessory for the iPad Pro, and turns it into a versatile laptop.", "url": "https://9to5mac.com/2020/04/24/magic-keyboard-for-ipad-pro-review-top-features-best-ipad-accessory-ever-video/", "urlToImage": null, "publishedAt": "2020-04-24T19:42:23Z", "content": "Two days ago the Magic Keyboard for the 11-inch iPad Pro landed on my desk. Ive been using it constantly since it first arrived, and although its not perfect, I absolutely love it.\r\nIts so good that I can easily say that this is the best iPad accessory in the… [+13185 chars]"}, {"source": {"id": null, "name": "Carscoops.com"}, "author": null, "title": "Lexus Blames Slow Sales For Killing The GS - CarScoops", "description": "Last year, the Lexus GS only grabbed only grabbed 0.88% of sales in the mid-size luxury segment.", "url": "https://www.carscoops.com/2020/04/lexus-blames-slow-sales-for-killing-the-gs/", "urlToImage": null, "publishedAt": "2020-04-24T19:41:10Z", "content": "After a 27 year run, Lexus is pulling the plug on the GS.\r\nIn a statement to Carscoops, the company said they are constantly evaluating model mixes throughout our lineup. As part of this process, they have decided to phase out their Audi A6, BMW 5-Series and … [+1800 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "David Murphy", "title": "Are You Charging Your MacBook on the Wrong Side? - Lifehacker", "description": "Yes, you read that headline correctly. There is apparently a “right” way and a “wrong” way to connect devices to a MacBook with Thunderbolt/USB-C ports on both sides. Doing it wrong can affect your computer’s performance.", "url": "https://lifehacker.com/are-you-charging-your-macbook-on-the-wrong-side-1843045306", "urlToImage": null, "publishedAt": "2020-04-24T19:31:53Z", "content": "Yes, you read that headline correctly. There is apparently a right way and a wrong way to connect devices to a MacBook with Thunderbolt/USB-C ports on both sides. Doing it wrong can affect your computers performance.\r\nI recently encountered this knowledge on … [+3975 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "", "title": "Valorant's wild success on Twitch wasn't an accident - Engadget", "description": "For Valorant’s Twitch debut, Riot Games partnered with “multiple hundreds” of influencers from around the globe. None of them were paid.", "url": "https://www.engadget.com/valorant-riot-twitch-hundreds-streamers-marketing-interview-170004017.html", "urlToImage": null, "publishedAt": "2020-04-24T19:30:07Z", "content": "Lewis used to be the head of marketing for League of Legends, and she helped enact that game’s Partner Program, which rewards video-focused influencers with in-game perks, developer access, promotional support and the opportunity to participate in reveals. Ot… [+4507 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Phil Hornshaw", "title": "Where Is Xur In Destiny 2? Location And Exotic Items (April 24-28) - GameSpot", "description": "Grab some new Destiny 2 Exotics from Xur to help you to take the gold in the Guardian Games.", "url": "https://www.gamespot.com/articles/where-is-xur-in-destiny-2-location-and-exotic-item/1100-6476472/", "urlToImage": null, "publishedAt": "2020-04-24T19:05:00Z", "content": "Destiny 2's latest seasonal event, the Guardian Games, kicked off this week, providing a whole bunch of new bounties to complete as players face off to see which of Destiny's three classes is the best. The spirit of competition is nice, but winning is better-… [+3933 chars]"}, {"source": {"id": null, "name": "Destructoid.com"}, "author": "Chris Carter", "title": "Pac-Man Championship Edition 2 is free for a limited time - Destructoid", "description": "Pac-Man Championship Edition 2 is free for a limited time", "url": "https://www.Destructoid.com/pac-man-championship-edition-2-is-free-for-a-limited-time-588041.phtml", "urlToImage": null, "publishedAt": "2020-04-24T19:00:00Z", "content": "Today from May 10\r\nAnother promo due to the global pandemic: check!\r\nBandai Namco, as part of a \"More Fun For Everyone at Home\" initiative, is making Pac-Man Championship Edition 2 free...for everyone. Thankfully it's not just a PC promo like so many others: … [+892 chars]"}, {"source": {"id": null, "name": "9to5mac.com"}, "author": null, "title": "Facebook launches ‘Messenger Rooms’ as a Zoom and Group FaceTime alternative - 9to5Mac", "description": "Facebook is out today with a new product to connect multiple people via video chat and compete with popular offerings like Zoom, Group FaceTime, Skype, Houseparty, and more. Detailed by TechCrunch, Facebook announced a number of messaging updates today with t…", "url": "https://9to5mac.com/2020/04/24/facebook-launches-messenger-rooms-as-a-zoom-and-group-facetime-alternative/", "urlToImage": null, "publishedAt": "2020-04-24T18:47:18Z", "content": "Facebook is out today with a new product to connect multiple people via video chat and compete with popular offerings like Zoom, Group FaceTime, Skype, Houseparty, and more.\r\nDetailed by TechCrunch, Facebook announced a number of messaging updates today with … [+3683 chars]"}, {"source": {"id": null, "name": "Androidcentral.com"}, "author": "Samantha Nelson", "title": "Google Stadia vs. PlayStation Now: Which is better? - Android Central", "description": "Google Stadia and PlayStation Now both allow you to pay $10/month to stream games across devices. Both services offer free trials so you can test them yourself, but our guide lays out the features to help you figure out what's right for you.", "url": "https://www.androidcentral.com/google-stadia-vs-playstation-now", "urlToImage": null, "publishedAt": "2020-04-24T18:12:57Z", "content": "Google Stadia launched in November, offering subscribers the chance to play new AAA games across their PC, TV, and Android devices without any downloads or updates. Google has promised to continue to expand its games library and add new features to the still-… [+10145 chars]"}, {"source": {"id": null, "name": "Motor1.com"}, "author": "Anthony Alaniz", "title": "2021 Jaguar F-Pace SVR Caught Making Noise At The Nurburgring - Motor1 ", "description": "The supercharged 5.0-liter V8 sounds glorious.", "url": "https://www.motor1.com/news/414679/2021-jaguar-f-pace-svr-spied/", "urlToImage": null, "publishedAt": "2020-04-24T18:02:03Z", "content": "The Jaguar F-Pace has quickly become the automakers best-selling vehicle. In 2019, it accounted for half of all U.S. Jaguar sales. Jaguar is hoping to continue the SUVs success with a mid-cycle refresh for the 2021 model year, and that includes giving the hig… [+1844 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Phillip Martinez", "title": "'Pokémon Go' Community Day: Shiny Abra, Start Time and Everything You Need to Know - Newsweek", "description": "Community Day will last for six hours instead of the usual three.", "url": "https://www.newsweek.com/pokemon-go-shiny-abra-community-day-start-time-counter-alakazam-1500100", "urlToImage": null, "publishedAt": "2020-04-24T17:46:09Z", "content": "The Abra Community Day event in Pokémon Go is finally here. After being rescheduled from its original March date due to the coronavirus pandemic, Niantic has developed a way to allow Pokémon Go players to enjoy the most popular in-game event from anywhere, in… [+2636 chars]"}, {"source": {"id": null, "name": "Boingboing.net"}, "author": null, "title": "This AI's only function is to draw penises - Boing Boing", "description": "DICK-RNN is a recurrent neural network trained with 10,000 doodles of dicks. You start drawing a shape and the AI tries its best to finish it as a penis. Starting with the balls helps a lot. Try it…", "url": "https://boingboing.net/2020/04/24/this-ais-only-function-is-to.html", "urlToImage": null, "publishedAt": "2020-04-24T17:38:00Z", "content": "“The Angel, The Automobilist, and Eighteen Others” is a new collection of early drawings by eccentric illustrator and storyteller Edward Gorey (1925-2000). Over at The Comics Journal, Mark Dery, author of the Gorey biography Born to Be Posthumous, reviews the… [+1660 chars]"}, {"source": {"id": null, "name": "Trueachievements.com"}, "author": "Heidi Nicholas", "title": "Sci-fi adventure Deliver Us The Moon joins Xbox Game Pass and Game Pass for PC today - TrueAchievements", "description": "Deliver Us The Moon is a sci-fi action adventure title which draws inspiration from movies such as Interstellar, and which joins the Xbox Game Pass and Xbox Game Pass for PC services today as a day one addition.", "url": "https://www.trueachievements.com/n41593/deliver-us-the-moon", "urlToImage": null, "publishedAt": "2020-04-24T17:19:36Z", "content": "The Xbox team has been busy lately: just yesterday, they surprise-dropped the announcement that Red Dead Redemption 2 will join Xbox Game Pass in May. Before that, they announced new titles for Xbox Game Pass, along with several new titles for Xbox Game Pass … [+1728 chars]"}, {"source": {"id": null, "name": "Techxplore.com"}, "author": "Peter Grad", "title": "Report: Apple to unveil its own 12-core ARM processor on 2021 Mac - Tech Xplore", "description": "Apple will begin manufacturing its own processors for the next generation of computers, Bloomberg news reported Thursday. Apple's long-rumored transition from Intel to ARM-based processors is expected to start with a lower-priced Mac in 2021.", "url": "https://techxplore.com/news/2020-04-apple-unveil-core-arm-processor.html", "urlToImage": null, "publishedAt": "2020-04-24T17:10:47Z", "content": "Apple will begin manufacturing its own processors for the next generation of computers, Bloomberg news reported Thursday. Apple's long-rumored transition from Intel to ARM-based processors is expected to start with a lower-priced Mac in 2021.\r\nThe new process… [+3265 chars]"}, {"source": {"id": null, "name": "Androidpolice.com"}, "author": "https://www.facebook.com/corbin.davenport.50", "title": "Sony WH-C710N review: Great noise-cancelling headphones for under $200 - Android Police", "description": "Sony makes some of the best noise-canceling headphones around, especially the WH-1000XM3 (which is overdue for a replacement). The WH1000XM3 is a premium", "url": "https://www.androidpolice.com/2020/04/24/sony-wh-ch710n-review/", "urlToImage": null, "publishedAt": "2020-04-24T17:00:43Z", "content": "Sony makes some of the best noise-canceling headphones around, especially the WH-1000XM3 (which is overdue for a replacement). The WH1000XM3 is a premium set of headphones that regularly goes for around $300, and competing products like the Bose QuietComfort … [+4387 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Daymare 1998 (Resident Evil 2 Tribute) - Official Console Launch Trailer - IGN", "description": "Daymare 1998, the Resident Evil 2 tribute game, finally arrives on PlayStation 4 and Xbox One on April 28th. Check out the official console launch trailer he...", "url": "https://www.youtube.com/watch?v=BiWnPEGvWcA", "urlToImage": null, "publishedAt": "2020-04-24T17:00:11Z", "content": null}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Dave Johnson", "title": "Nintendo Switch Lite is in stock at Best Buy and Target: Get it while you can - CNET", "description": "Best Buy has the red-hot game console in stock in both yellow and turquoise. For now.", "url": "https://www.cnet.com/news/get-it-while-you-can-nintendo-switch-lite-in-stock-at-best-buy-and-target/", "urlToImage": null, "publishedAt": "2020-04-24T16:25:41Z", "content": "Óscar Gutiérrez/CNET\r\nIt probably won't be in stock for long, so if you need a Nintendo Switch Lite, it's best not to dawdle. Inventory on the Switch Lite has been low for weeks, with retailers like Amazon completely sold out. Why the shortage? The coronaviru… [+1125 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Christian de Looper", "title": "7 Of The Best Amazon Alexa Speakers - Forbes", "description": "Looking for a great speaker with arguably the smartest digital assistant, Alexa? Here are 7 of the best Amazon Alexa speakers out there.", "url": "https://www.forbes.com/sites/forbes-personal-shopper/2020/04/24/7-of-the-best-amazon-alexa-speakers/", "urlToImage": null, "publishedAt": "2020-04-24T16:00:00Z", "content": "Alexa is arguably the smartest digital assistant, and while Google Assistant also has a lot going for it, Alexa is the go-to for many users who dont have Android phones. There are a ton of Alexa speakers on the market, and while they all have the smart featur… [+4164 chars]"}, {"source": {"id": null, "name": "Siliconera.com"}, "author": "Sato", "title": "Final Fantasy XIV Patch 5.3 Will Revamp Quests and Finally Bring in Flying Mounts to A Realm Reborn Areas - Siliconera", "description": "Square Enix hosted its latest Letter from the Producer LIVE broadcast with new info on Final Fantasy XIV Patch 5.3 - Reflections in Crystal.", "url": "https://www.siliconera.com/final-fantasy-xiv-patch-5-3-will-revamp-a-realm-reborn-quests-and-finally-bring-in-flying-mounts/", "urlToImage": null, "publishedAt": "2020-04-24T15:30:00Z", "content": "Square Enix hosted its latest Letter from the Producer LIVE broadcast with new info on Final Fantasy XIV Patch 5.3 – Reflections in Crystal. Patch 5.3 continues the Shadowbringers storyline and NieR series crossover raid series. It also brings plenty of QoL i… [+3367 chars]"}, {"source": {"id": null, "name": "Dualshockers.com"}, "author": "Scott White", "title": "Final Fantasy 12 PS4, PC Patch Adds Zodiac Age Features, Reportedly Breaks PC version - DualShockers", "description": "Final Fantasy 12 PS4 and PC players finally get the Switch, Xbox Zodiac Age features, but you should avoid patching your PC version for now.", "url": "https://www.dualshockers.com/final-fantasy-12-ps4-pc-patch-zodiac-age-features/", "urlToImage": null, "publishedAt": "2020-04-24T15:28:41Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Borderlands 3: How to Solve the Revenge of the Cartels Mansion Puzzle - GameRant", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMigQFodHRwczovL2dhbWVyYW50LmNvbS9ib3JkZXJsYW5kcy0zLXJldmVuZ2Utb2YtdGhlLWNhcnRlbHMtcHV6emxlLW1hbnNpb24tdmlsbGEtdWx0cmF2aW9sZXQtZXZlbnQtc29sdXRpb24tc29sdmUtY2hhbGxlbmdlLXNoYXBlcy_SAYUBaHR0cHM6Ly9nYW1lcmFudC5jb20vYm9yZGVybGFuZHMtMy1yZXZlbmdlLW9mLXRoZS1jYXJ0ZWxzLXB1enpsZS1tYW5zaW9uLXZpbGxhLXVsdHJhdmlvbGV0LWV2ZW50LXNvbHV0aW9uLXNvbHZlLWNoYWxsZW5nZS1zaGFwZXMvYW1wLw?oc=5", "urlToImage": null, "publishedAt": "2020-04-24T15:12:00Z", "content": null}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Paul Tassi", "title": "Mayhem 2.0 Has Broken ‘Borderlands 3’ In A Bad Way - Forbes", "description": "Borderlands 3 has introduced Mayhem 10 in Mayhem 2.0, and farming now makes little to no sense, and many builds are broken.", "url": "https://www.forbes.com/sites/paultassi/2020/04/24/mayhem-20-has-broken-borderlands-3-in-a-bad-way/", "urlToImage": null, "publishedAt": "2020-04-24T14:15:16Z", "content": "Borderlands 3\r\nGearbox\r\nYesterday, Borderlands 3 introduced a whole bunch of new things into the game, bug fixes, character buffs, a temporary loot event and a new Cartels game mode. But above all else Gearbox totally redesigned the endgame of Borderlands 3 f… [+4477 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Mackenzie Frazier", "title": "Cheap iPhone deal: price cuts on the iPhone SE, iPhone 11, 11 Pro and iPhone XR - TechRadar India", "description": "Save up to $320 on the Apple iPhone with eligible trade-in", "url": "https://www.techradar.com/news/cheap-iphone-deals-price-cuts-iphone-se-iphone-11-pro-iphone-xr", "urlToImage": null, "publishedAt": "2020-04-24T14:15:00Z", "content": "You can score a cheap iPhone deal from Apple with up to $320 in savings with an eligible trade-in. This limited-time offer gets you the all-new iPhone SE on sale for just $229, the iPhone 11 on sale for $449, the 11 Pro on sale for $679, and the iPhone XR on … [+2204 chars]"}, {"source": {"id": null, "name": "Tomsguide.com"}, "author": "Kate Kozuch", "title": "Zoom just got a killer feature to beat every video call app - Tom's Guide", "description": "Real-time transcription takes Zoom meetings to the next level", "url": "https://www.tomsguide.com/news/zoom-just-got-a-killer-feature-to-beat-every-video-call-app", "urlToImage": null, "publishedAt": "2020-04-24T14:09:00Z", "content": "Zoom calls are about to give the video conferencing service a serious edge over Google Hangouts, Microsoft Teams, and all the other best video chat apps battling for the loyalty of everyone working from home. \r\nOtter.ai, a real-time chat transcription service… [+2215 chars]"}, {"source": {"id": null, "name": "Destructoid.com"}, "author": "Chris Moyse", "title": "WWE confirms there will be no WWE 2K release this year - Destructoid", "description": "WWE confirms there will be no WWE 2K release this year", "url": "https://www.Destructoid.com/wwe-confirms-there-will-be-no-wwe-2k-release-this-year-588012.phtml", "urlToImage": null, "publishedAt": "2020-04-24T14:00:00Z", "content": "Count it Out\r\nWorld Wrestling Entertainment (WWE) has confirmed that it will not be releasing a video game in 2020, marking the first year in decades that the company will forego a digital replication of its squared circle action. The announcement was officia… [+1439 chars]"}, {"source": {"id": null, "name": "Onmsft.com"}, "author": "Rabia Noureen", "title": "Microsoft has started promoting its new Edge browser on Outlook.com - OnMSFT", "description": "Non-Edge users are now seeing messages promoting Microsoft’s new web browser on Outlook.com.", "url": "https://www.onmsft.com/news/microsoft-has-started-promoting-its-new-edge-browser-on-outlook-com", "urlToImage": null, "publishedAt": "2020-04-24T13:56:00Z", "content": "While Microsoft has already praised the capabilities of its new Microsoft Edge on various occasions, the company has now started promoting the new web browser on Outlook.com (via Windows Latest). Interestingly, non-Edge users who access their inbox on Outlook… [+1415 chars]"}, {"source": {"id": null, "name": "Searchengineland.com"}, "author": "https://www.facebook.com/barryschwartz", "title": "New free version of Google Shopping rolling out now - Search Engine Land", "description": "It is now rolling out and should be fully live in the US by early next week.", "url": "https://searchengineland.com/new-free-version-of-google-shopping-rolling-out-now-333589", "urlToImage": null, "publishedAt": "2020-04-24T13:52:00Z", "content": "Google’s new free version of Google Shopping is now rolling out. A Google spokesperson has confirmed with Search Engine Land that this has begun to roll out. This does not mean it is fully rolled out and all U.S. searchers will see it immediately, but by earl… [+741 chars]"}, {"source": {"id": "the-next-web", "name": "The Next Web"}, "author": "Callum Booth", "title": "The fancy-pants LG Velvet arrives on May 7 — here’s what we know - The Next Web", "description": "If I asked you to list smartphone brands, LG wouldn’t be near the top. But the company is trying to change all that, and its latest attempt? Its new smartphone, the LG Velvet. Now, the latest update is the company will unveil this handset on May 7, something …", "url": "https://thenextweb.com/plugged/2020/04/24/lg-velvet-phone-may-7-launch-specs/", "urlToImage": null, "publishedAt": "2020-04-24T13:45:06Z", "content": "If I asked you to list smartphone brands, LG wouldnt be near the top. But the company is trying to change all that, and its latest attempt? Its new smartphone, the LG Velvet.\r\nNow, the latest update is the company will unveil this handset on May 7, something … [+2558 chars]"}, {"source": {"id": null, "name": "Electrek.co"}, "author": null, "title": "Ford might delay Mustang Mach-E launch, will update as production restarts - Electrek", "description": "Ford might delay the Mustang Mach-E launch amid the coronavirus pandemic and will give an updated timeline as it restarts its production facilities. The Mustang Mach-E is Ford’s first all-electric vehicle built from the ground up and one of the most anticipat…", "url": "https://electrek.co/2020/04/24/ford-delay-mustang-mach-e-launch-production-restart/", "urlToImage": null, "publishedAt": "2020-04-24T13:27:26Z", "content": "Ford might delay the Mustang Mach-E launch amid the coronavirus pandemic and will give an updated timeline as it restarts its production facilities.\r\nThe Mustang Mach-E is Ford’s first all-electric vehicle built from the ground up and one of the most anticipa… [+2960 chars]"}, {"source": {"id": null, "name": "Pushsquare.com"}, "author": "Push Square", "title": "Next-Gen Game Reveals Are Imminent, But Sony Silent on PS5 Plans - Push Square", "description": "Microsoft says game reveals are coming", "url": "http://www.pushsquare.com/news/2020/04/next-gen_game_reveals_are_imminent_but_sony_silent_on_ps5_plans", "urlToImage": null, "publishedAt": "2020-04-24T13:00:00Z", "content": "Weve already got a glimpse of a couple of PlayStation 5 games courtesy of Godfall and Quantum Error, but with coronavirus scuppering its plans, Sony has been largely tight-lipped about its next-gen plans. Despite not showing much more than the Japanese giant,… [+1062 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Joan E. Solsman", "title": "This Oculus Quest fitness app worked me so hard I forgot to breathe - CNET", "description": "Supernatural is a new spin on virtual reality fitness, and it may save me from backsliding into a lazy slug during lockdown.", "url": "https://www.cnet.com/news/supernatural-vr-fitness-mashup-of-pelaton-and-beat-saber-oculus-quest/", "urlToImage": null, "publishedAt": "2020-04-24T12:57:15Z", "content": "Supernatural sets game-ified, choreographed workouts to popular music in virtual reality. \r\nWithin\r\nSupernatural, a new virtual realityfitness game you can play in your home, isn't playing around. I sweat so hard I have to guzzle five glasses of water for eve… [+9525 chars]"}, {"source": {"id": null, "name": "Videogameschronicle.com"}, "author": "Andy Robinson", "title": "Guerrilla is planning a Horizon Zero Dawn trilogy - Video Games Chronicle", "description": "Plans for next-gen sequel indicate ‘gigantic’ scope and co-op mode…", "url": "https://www.videogameschronicle.com/news/horizon-zero-dawn-2/", "urlToImage": null, "publishedAt": "2020-04-24T12:08:00Z", "content": "PlayStation and Guerrilla Games are planning a trilogy of Horizon Zero Dawn games.\r\nMultiple sources have told VGC that Sony Interactive Entertainment has greenlit ambitious plans for the post-apocalyptic open-world franchise, which debuted in 2017 with the t… [+3729 chars]"}, {"source": {"id": null, "name": "Rockpapershotgun.com"}, "author": null, "title": "XCOM: Chimera Squad is out now, and it's half-price - Rock Paper Shotgun", "description": "It’s time to put down your world-saving guns and pick up your alien-policemen batons, because XCOM: Chimera Squad is out.", "url": "https://www.rockpapershotgun.com/2020/04/24/xcom-chimera-squad-is-out-now-and-its-half-price/", "urlToImage": null, "publishedAt": "2020-04-24T10:17:00Z", "content": "It’s time to put down your world-saving guns and pick up your alien-policing batons, because XCOM: Chimera Squad is out. XCOPS takes a big sidewards leap away from the main series, boiling down turn-based combat into single-room encounters. Developers Firaxis… [+2356 chars]"}, {"source": {"id": null, "name": "Milehighreport.com"}, "author": "Tim Lynch", "title": "Denver Broncos: Alabama WR Jerry Jeudy highlights - Mile High Report", "description": "The Denver Broncos have a new wide receiver in Jerry Jeudy. Here are his Alabama highlight reels. Enjoy!", "url": "https://www.milehighreport.com/2020/4/24/21233874/jerry-jeudy-highlights", "urlToImage": null, "publishedAt": "2020-04-24T09:34:37Z", "content": "The Denver Broncos have a new wide receiver in Jerry Jeudy. Here are his Alabama highlight reels. Enjoy!"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "James O'Connor", "title": "Fallout 76 Releases A Community Calendar For Next Month And Teases PTS Return - GameSpot", "description": "With the Wastelanders update out now, Bethesda is looking to the future of Fallout 76 on PC, PS4, and Xbox One.", "url": "https://www.gamespot.com/articles/fallout-76-releases-a-community-calendar-for-next-/1100-6476455/", "urlToImage": null, "publishedAt": "2020-04-24T08:52:42Z", "content": "Fallout 76 recently released its new Wastelanders update, adding NPCs and making the whole game feel a bit more like a traditional Fallout game. Now, as fans enjoy this update, Bethesda has released a community calendar, providing a roadmap for what players c… [+1089 chars]"}, {"source": {"id": "buzzfeed", "name": "Buzzfeed"}, "author": "[{\"@type\":\"Person\",\"name\":\"Tatiana Tenreyro\",\"url\":\"https://www.buzzfeed.com/tatianatenreyrowhitlock\",\"jobTitle\":\"BuzzFeed Staff\"}]", "title": "Elijah Wood Dropped By A Fan's \"Animal Crossing\" Island To Sell Turnips And Was The Perfect Guest - BuzzFeed", "description": "The turnip-selling struggle is real.", "url": "https://www.buzzfeed.com/tatianatenreyrowhitlock/elijah-wood-animal-crossing", "urlToImage": null, "publishedAt": "2020-04-24T02:40:00Z", "content": "Nintendo/Tatiana Tenreyro\r\nHere's me, finally making a good profit off turnips after waiting an hour to enter a stranger's island."}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Jordan Ramée", "title": "CS:GO And Team Fortress Source Code Leaked, But Valve Isn't Worried - GameSpot", "description": "Though it's now become a problem in 2020, the leak of the source code for Team Fortress 2 and Counter-Strike:Global Offensive actually traces back to 2018.", "url": "https://www.gamespot.com/articles/csgo-and-team-fortress-source-code-leaked-but-valv/1100-6476395/", "urlToImage": null, "publishedAt": "2020-04-24T02:00:00Z", "content": "Valve seemingly has a bit of a leak problem right now, as the source code for both Team Fortress 2 and Counter-Strike: Global Offensive has recently made its way into the public eye. Or at least, that's how it appears. The source code has actually been public… [+4707 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew Webster", "title": "Travis Scott’s first Fortnite concert was surreal and spectacular - The Verge", "description": "Rapper Travis Scott performed a surreal concert inside of the battle royale game Fortnite, utilizing trippy visuals to create a musical performance that could only be possible in a digital space.", "url": "https://www.theverge.com/2020/4/23/21233637/travis-scott-fortnite-concert-astronomical-live-report", "urlToImage": null, "publishedAt": "2020-04-24T00:29:22Z", "content": "Sicko mode\r\nIf theres one thing you can say about Fortnites live events, its that they keep getting more ambitious. From the original rocket launch to the mech vs. kaiju battle to the black hole that wiped out an entire island, each new event is more elaborat… [+3098 chars]"}, {"source": {"id": null, "name": "Bleepingcomputer.com"}, "author": "Sergiu Gatlan", "title": "Windows 10 KB4549951 update fails to install, causes BSODs - BleepingComputer", "description": "The Windows 10 KB4549951 ​​​​​​​cumulative update is reportedly failing to install and is causing blue screens of death (BSOD) after installation reboots, among other issues, according to user reports.", "url": "https://www.bleepingcomputer.com/news/microsoft/windows-10-kb4549951-update-fails-to-install-causes-bsods/", "urlToImage": null, "publishedAt": "2020-04-23T23:11:05Z", "content": "The Windows 10 KB4549951 cumulative update is reportedly failing to install and is causing blue screens of death (BSOD) after installation reboots, among other issues, according to user reports.\r\nKB4549951 is a cumulative update with security fixes released a… [+6269 chars]"}, {"source": {"id": null, "name": "Venturebeat.com"}, "author": "Jeff Grubb", "title": "Your Super Mario Maker 2 levels are a lot less cute in World Maker - VentureBeat", "description": "Super Mario Maker 2 just got its final update, and the new World Maker mode highlights a problem: no one knows how to make a fun Mario course.", "url": "https://venturebeat.com/2020/04/23/your-super-mario-maker-2-levels-are-a-lot-less-cute-in-world-maker/", "urlToImage": null, "publishedAt": "2020-04-23T21:44:17Z", "content": "Super Mario Maker 2s latest update reveals that almost no one knows how to make a fun Mario stage. This was once easy to ignore, because thats not actually what you should go to Super Mario Maker for. Instead, this series has always provided players with a fa… [+2272 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Patricia Hernandez", "title": "Death Stranding fan spent 15 hours trying to spell out name with pee - Polygon", "description": "After discovering that Death Stranding lets you leave imprints in the snow, one determined fan spent hours trying to write out his name with the game’s infamous pee mechanic — but not without plenty of roadblocks along the way.", "url": "https://www.polygon.com/2020/4/23/21233323/death-stranding-pee-name-hideo-kojima-ps4-sony", "urlToImage": null, "publishedAt": "2020-04-23T20:48:16Z", "content": "To boldly go where no man has gone before"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Eddie Makuch", "title": "Xbox Series X Logo Trademarked: See The Stylish \"X\" Here - GameSpot", "description": "Take a look at what could be the logo for Microsoft's Xbox Series X.", "url": "https://www.gamespot.com/articles/xbox-series-x-logo-trademarked-see-the-stylish-x-h/1100-6476353/", "urlToImage": null, "publishedAt": "2020-04-23T20:34:00Z", "content": "Microsoft appears to be setting the stage for another Xbox Series X reveal. On April 16, the company filed a new trademark application for the next-generation console that, among other things, included what appears to be the console's logo.\r\nThe trademark app… [+2041 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Michael McWhertor", "title": "Overwatch’s communication wheel now lets you customize the voice lines - Polygon", "description": "Players can now choose which voice lines are included in Overwatch’s communication wheel, with new additions like “press the objective,” “fall back,” and “sorry.”", "url": "https://www.polygon.com/2020/4/23/21233221/overwatch-communication-wheel-custom-voice-lines-update-patch", "urlToImage": null, "publishedAt": "2020-04-23T20:15:58Z", "content": "Players can now choose which voice lines are included in the wheel"}, {"source": {"id": null, "name": "Macrumors.com"}, "author": "Juli Clover", "title": "Demo: Using Apple Music on a Samsung TV - MacRumors", "description": "Samsung and Apple have partnered to bring the Apple Music app to Samsung TVs, and as of today, the Apple Music service and dedicated app can be...", "url": "https://www.macrumors.com/2020/04/23/apple-music-samsung-tv-demo/", "urlToImage": null, "publishedAt": "2020-04-23T19:49:03Z", "content": "Samsung and Apple have partnered to bring the Apple Music app to Samsung TVs, and as of today, the ‌Apple Music‌ service and dedicated app can be accessed on Samsung TV sets manufactured in 2018 and later.\r\nSubscribe to the MacRumors YouTube channel for more … [+1894 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Michael McWhertor", "title": "Sega Saturn mascot Segata Sanshiro may have just returned, with an evil twist - Polygon", "description": "We enter the dark middle chapter of Segata Sanshiro’s return in a new commercial from Sega featuring its new Japanese mascot, Sega Shiro.", "url": "https://www.polygon.com/2020/4/23/21233064/sega-segata-shiro-mascot-japan", "urlToImage": null, "publishedAt": "2020-04-23T19:07:52Z", "content": "The dark middle chapter of Segata Sanshiros return"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Ryan W. Miller", "title": "What's 'Zoom fatigue'? Here's why video calls can be so exhausting - USA TODAY", "description": "With people taking more working meetings and social gatherings to video conference platforms, people are beginning to feel \"Zoom fatigue.\"", "url": "https://www.usatoday.com/story/news/nation/2020/04/23/zoom-fatigue-video-calls-coronavirus-can-make-us-tired-anxious/3010478001/", "urlToImage": null, "publishedAt": "2020-04-23T18:57:30Z", "content": "Some farms and animal sanctuaries have found a way to lighten the mood during virtual meetings.\r\nUSA TODAY\r\nA few Zoom calls for work in the morning. Logging your children into their virtual classroom around lunchtime. And a FaceTime call with your parents at… [+5598 chars]"}, {"source": {"id": null, "name": "Essentiallysports.com"}, "author": "Souhardya Biswas", "title": "Massive Armor Changes Revealed In Forthcoming Apex Legends LTM - Essentially Sports", "description": "Now, Respawn seems to be planning on another venture by massively restructuring the armors in Apex Legends as revealed by popular data miner iLootGames.", "url": "https://www.essentiallysports.com/massive-armor-changes-revealed-in-forthcoming-apex-legends-lmt-esports-news-2020/", "urlToImage": null, "publishedAt": "2020-04-23T17:40:26Z", "content": "Apex Legends revolutionized the perception of battle royale games after its launch in February 2019. At the time, the idea of resurrecting fallen teammate(s) was unknown in the BR genre. Respawn successfully implemented a concept in-game, which then allowed p… [+2389 chars]"}, {"source": {"id": null, "name": "Macrumors.com"}, "author": "Juli Clover", "title": "Apple Releases iOS 13.4.1 for iPhone SE Ahead of Launch - MacRumors", "description": "Apple today released the iOS 13.4.1 update for iPhone SE owners, suggesting iPhone SE models arriving to customers tomorrow will have iOS 13.4...", "url": "https://www.macrumors.com/2020/04/23/apple-releases-ios-13-4-1-for-iphone-se/", "urlToImage": null, "publishedAt": "2020-04-23T17:26:44Z", "content": "Apple today released the iOS 13.4.1 update for iPhone SE owners, suggesting ‌iPhone‌ SE models arriving to customers tomorrow will have iOS 13.4 installed and will need a day-one software update.\r\n‌iPhone‌ SE owners can install the new update over-the-air tom… [+870 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Matt Burns", "title": "Porsche unveils CarPlay-equipped radios for vintage Porsches - TechCrunch", "description": "Own a classic Porsche? Who doesn’t? The German automaker today unveiled a line of head units designed to replicate the vintage look while still featuring modern connectivity such as Bluetooth, DAB+, and Apple CarPlay. These radios are official Porsche hardwar…", "url": "http://techcrunch.com/2020/04/23/porsche-unveils-carplay-equipped-radios-for-vintage-porsches/", "urlToImage": null, "publishedAt": "2020-04-23T15:12:37Z", "content": "Own a classic Porsche? Who doesnt? The German automaker today unveiled a line of head units designed to replicate the vintage look while still featuring modern connectivity such as Bluetooth, DAB+, and Apple CarPlay.\r\nThese radios are official Porsche hardwar… [+806 chars]"}]}