{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Cnet.com"}, "author": "Alison DeNisco Rayome", "title": "Facebook added a free group video chat feature called Messenger Rooms. Here's how to use it - CNET", "description": "Up to 50 people can chat in a room at once, with no time limit.", "url": "https://www.cnet.com/how-to/facebook-added-a-free-group-video-chat-feature-called-messenger-rooms-heres-how-to-use-it/", "urlToImage": null, "publishedAt": "2020-04-26T16:08:31Z", "content": "Facebook Messenger Rooms is set to compete with Zoom and other group video chat apps.\r\nFacebook\r\nFacebook's new group video chat feature Messenger Rooms is getting ready to compete with services like Zoom, Skype and Microsoft Teams, as more people turn to vid… [+2887 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Gabe Gurwin", "title": "Free Alien Game Available Today To Celebrate Alien Day - GameSpot", "description": "Alien: Blackout is a sequel to Alien: Isolation and is completely free on iOS and Android.", "url": "https://www.gamespot.com/articles/free-alien-game-available-today-to-celebrate-alien/1100-6476505/", "urlToImage": null, "publishedAt": "2020-04-26T14:13:00Z", "content": "April 26 is Alien Day, a fan holiday created to honor the legendary science-fiction horror franchise, and D3 Go's mobile game Alien: Blackout is free to help you celebrate. Available for both iOS and Android, it's a strategic and tense adventure that differs … [+1232 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Michael Moore", "title": "A Fold Apart review: turns working through anxiety into puzzle solving - The Verge", "description": "In A Fold Apart, the puzzles and how you solve them act as a metaphor for the two main characters working through their anxieties about their relationship. The game follows who we’ll call Red and Blue, since they don’t have names and their genders are selecta…", "url": "https://www.theverge.com/2020/4/26/21232982/a-fold-apart-review-nintendo-switch-ios-puzzle", "urlToImage": null, "publishedAt": "2020-04-26T14:12:23Z", "content": "Relationships are about communication... and puzzles\r\nIt can be difficult to find time to finish a video game, especially if you only have a few hours a week to play. In our biweekly column Short Play we suggest video games that can be started and finished in… [+3808 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Dave Thier", "title": "How To Tell Real Art From Fake In ‘Animal Crossing: New Horizons’ - Forbes", "description": "Redd the Fox has real art and fake art. Here's how to tell the difference in 'Animal Crossing': New Horizons'.", "url": "https://www.forbes.com/sites/davidthier/2020/04/26/how-to-tell-real-art-from-fake-in-animal-crossing-new-horizons/", "urlToImage": null, "publishedAt": "2020-04-26T13:57:16Z", "content": "'Animal Crossing: New Horizons'\r\nCredit: Nintendo\r\nYour parents might have told you that your Art History degree would never help you in the real world, and Ill bet you are very excited to tell them about the marginal advantage you have now gained in Animal C… [+2105 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Lynn La", "title": "iPhone SE vs. iPhone 8 comparison: Which $400 iPhone should you get? - CNET", "description": "Some retailers are still selling the iPhone 8 despite Apple discontinuing the device. But you should just get the new iPhone SE instead.", "url": "https://www.cnet.com/news/iphone-se-vs-iphone-8-spec-comparison-which-400-iphone-should-you-get-buy/", "urlToImage": null, "publishedAt": "2020-04-26T13:45:54Z", "content": "In a bid to lure budget-minded iPhone fans, Apple debuted its new iPhone SE for 2020 on April 15 for $399 (£419, AU$749). It's a sequel to its 2016 iPhone of the same name. The new iPhone SE's specs are similar to the iPhone 8 from three years ago, which is l… [+8211 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Paul Tassi", "title": "Why Are Destiny 2’s Titans Suddenly Dominating Guardian Games? - Forbes", "description": "We can debate what to make of Destiny 2’s “whoops the real Olympics got cancelled” Guardian Games event in terms of how it’s been presented with its endless bounty grind, but I do think it has achieved at least part of its desired objectives, stirring up dram…", "url": "https://www.forbes.com/sites/paultassi/2020/04/26/why-are-destiny-2s-titans-suddenly-dominating-guardian-games/", "urlToImage": null, "publishedAt": "2020-04-26T13:17:01Z", "content": "Destiny 2\r\nBungie\r\nThis post was updated on 4/26 at 9 AM.\r\nWe can debate what to make of Destiny 2s whoops the real Olympics got cancelled Guardian Games event in terms of how its been presented with its endless bounty grind, but I do think it has achieved at… [+4800 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "10 Greatest Gaming Gadgets Of All Time - TheGamer", "description": "Must have gaming accessories that every gamer needs to enhance their video game experience. From Nintendo Switch Pro controllers, gaming chairs, ps4 accessor...", "url": "https://www.youtube.com/watch?v=syHU2IH1C2s", "urlToImage": null, "publishedAt": "2020-04-26T13:15:02Z", "content": "Must have gaming accessories that every gamer needs to enhance their video game experience. From Nintendo Switch Pro controllers, gaming chairs, ps4 accessories, and even some fan favorites for Xbox play! \r\nSUBSCRIBE NOW to The Gamer! Click here: https://goo.… [+1385 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Dale Smith", "title": "Google officially lets you change your OK, Google sensitivity settings. Here's how - CNET", "description": "Your Google Home smart speaker gets new audio controls that are easy to fine-tune.", "url": "https://www.cnet.com/how-to/google-officially-lets-you-change-your-ok-google-sensitivity-settings-heres-how/", "urlToImage": null, "publishedAt": "2020-04-26T12:47:48Z", "content": "Google Home's new wake word sensitivity setting should work for Google Home and Google Nest speakers as well as Nest Hub smart displays.\r\nAngela Lang/CNET\r\nHey, Google, can you hear me? Now your Google Home can. The search giant is officially rolling out new … [+3239 chars]"}, {"source": {"id": null, "name": "Dronedj.com"}, "author": null, "title": "DJI Mavic Air 2 packaging appears online, ActiveTrack 3.0, Sony IMX586 sensor - DroneDJ", "description": "Another image of the DJI Mavic Air 2 has appeared online ahead of its unveiling on the 27th of April. We have an image of the packing the DJI Mavic Air 2.", "url": "https://dronedj.com/2020/04/26/dji-mavic-air-2-packaging-appears-online/", "urlToImage": null, "publishedAt": "2020-04-26T12:34:00Z", "content": "Once again, another image of the DJI Mavic Air 2 has appeared online ahead of its unveiling on the 27th of April. So, far we have seen images of the actual drone and what looks to be product images from DJI, today we have an image of the packing the DJI Mavic… [+3448 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Samsung’s first smartphone with pop-up front camera shown off in leaked renders - XDA Developers", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiYmh0dHBzOi8vd3d3LnhkYS1kZXZlbG9wZXJzLmNvbS9zYW1zdW5nLWdhbGF4eS1maXJzdC1zbWFydHBob25lLXBvcC11cC1mcm9udC1jYW1lcmEtbGVha2VkLXJlbmRlcnMv0gFmaHR0cHM6Ly93d3cueGRhLWRldmVsb3BlcnMuY29tL3NhbXN1bmctZ2FsYXh5LWZpcnN0LXNtYXJ0cGhvbmUtcG9wLXVwLWZyb250LWNhbWVyYS1sZWFrZWQtcmVuZGVycy9hbXAv?oc=5", "urlToImage": null, "publishedAt": "2020-04-26T12:16:31Z", "content": null}, {"source": {"id": null, "name": "Bgr.com"}, "author": "Maren Estrada", "title": "10 deals you don’t want to miss on Sunday: 3 different face masks, AirPods Pro, iPhone screen protectors, Bose 700, more - BGR", "description": "There’s no better way to close out the weekend and mentally prepare yourself for the week again than by taking advantage of today’s roundup of the best daily deals out there. The stars of the show on Sunday’s list include three different types of face masks t…", "url": "https://bgr.com/2020/04/26/amazon-deals-of-the-day-on-april-26/", "urlToImage": null, "publishedAt": "2020-04-26T11:59:09Z", "content": "There’s no better way to close out the weekend and mentally prepare yourself for the week again than by taking advantage of today’s roundup of the best daily deals out there. The stars of the show on Sunday’s list include three different types of face masks t… [+1173 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "", "title": "You can use some iPhone 8 parts inside an iPhone SE - Engadget", "description": "The iPhone SE can use some parts from the iPhone 8, but don't expect to borrow a battery.", "url": "https://www.engadget.com/iphone-se-iphone-8-parts-intercangeable-112709142.html", "urlToImage": null, "publishedAt": "2020-04-26T11:46:31Z", "content": "It’s cliché to say the new iPhone SE is a recycled iPhone 8, but how many parts do the two share in common, really? It’s at once more and less than you think. iFixit has tried swapping parts ahead of its customary teardown report, and it’s clear that you can … [+722 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Stephen Shankland", "title": "iPhone SE outclasses all Android phones thanks to Apple's A13 chip - CNET", "description": "Performance on a budget arrives just in time for buyers spooked by the pandemic.", "url": "https://www.cnet.com/news/iphone-se-outclasses-all-android-phones-thanks-apples-a13-chip-processor/", "urlToImage": null, "publishedAt": "2020-04-26T11:23:59Z", "content": "John Kim/CNET\r\nBy packing the big A13 chip into its small iPhone SE, Apple has made its budget smartphone a more compelling product at just the right time for a coronavirus-spooked world. Where most budget phones cut costs by using lower-end processors, the n… [+3579 chars]"}, {"source": {"id": null, "name": "Sammobile.com"}, "author": "SamMobile", "title": "White Galaxy S20 Ultra pops up in live photo ahead of China release - SamMobile", "description": "A few weeks ago, word on the street was that Samsung is preparing a white Galaxy S20 Ultra for China. ...", "url": "https://www.sammobile.com/news/white-galaxy-s20-ultra-live-photo-china-release/", "urlToImage": null, "publishedAt": "2020-04-26T11:10:31Z", "content": "A few weeks ago, word on the street was that Samsung is preparing a white Galaxy S20 Ultra for China. Now, we get a preview of what the flagship would look like in this color option. Twitter tipster Ice Unverse shared a photo of a white Galaxy S20 Ultra, or a… [+1059 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Darren Allan", "title": "Windows 10 now has ads for Edge browser in its search box – is Microsoft going too far in pestering users? - TechRadar India", "description": "Following adverts being run on Outlook.com, and the Start menu", "url": "https://www.techradar.com/news/windows-10-now-has-ads-for-edge-browser-in-its-search-box-is-microsoft-going-too-far-in-pestering-users", "urlToImage": null, "publishedAt": "2020-04-26T11:10:00Z", "content": "Windows 10 is now showing adverts within the search box which are attempting to persuade people to switch to Microsoft Edge, in yet another move to promote the revamped browser which runs the risk of starting to irritate people given how prevalent these ads a… [+2115 chars]"}, {"source": {"id": null, "name": "Dexerto.com"}, "author": "Daniel Cleary", "title": "Modern Warfare leak reveals first look at returning classic CoD weapon - Dexerto", "description": "A classic Call of Duty weapon looks set to make its return in Modern Warfare, after early gameplay was revealed for an upcoming LMG.", "url": "https://www.dexerto.com/call-of-duty/modern-warfare-leak-reveals-first-look-at-returning-classic-cod-weapon-1358213", "urlToImage": null, "publishedAt": "2020-04-26T11:03:55Z", "content": "Call of Duty leaker and YouTuber TheGamingRevolution has revealed the first in-game look at a classified Modern Warfare light-machine gun that will be released in Season 3.\r\nThe much-anticipated release of Modern Warfare’s third season brought many changes su… [+1511 chars]"}, {"source": {"id": null, "name": "Venturebeat.com"}, "author": "Ian Hamilton, UploadVR", "title": "Supernatural gives you a better workout than Beat Saber … or any other VR fitness app - VentureBeat", "description": "After playing Supernatural this week, my legs are sore to a degree unmatched by Beat Saber, Pistol Whip, BoxVR, OhShape, or any other VR app.", "url": "https://venturebeat.com/2020/04/26/supernatural-gives-you-a-better-workout-than-beat-saber-or-any-other-vr-fitness-app/", "urlToImage": null, "publishedAt": "2020-04-26T10:36:06Z", "content": "After playing Supernatural this week, my legs are sore to a degree unmatched by Beat Saber, Pistol Whip, BoxVR, OhShape, or any other VR app.\r\nIts easy to see the influence of those earlier VR games on the new exercise and fitness software from Within, but Su… [+2143 chars]"}, {"source": {"id": null, "name": "Macworld.com"}, "author": "", "title": "Apple’s iPad Pro Magic Keyboard: The heavy truth - Macworld", "description": "It weighs as much as a laptop--and works like one. And it’s just one option among many.", "url": "https://www.macworld.com/article/3539648/heavy-truth-ipad-pro-magic-keyboard.html", "urlToImage": null, "publishedAt": "2020-04-26T09:10:32Z", "content": "When Apple announced the new Magic Keyboard for iPad Pro, it decided to play coy about how much it weighed. The result is that, despite some accurate speculation, none of us found out for sure until this week when the first keyboards arrived in the hands of r… [+5065 chars]"}, {"source": {"id": null, "name": "Motor1.com"}, "author": "Jacob Oliva", "title": "Watch 2021 BMW M3 G80 Go Flat Out At The Nürburgring In Spy Video - Motor1 ", "description": "Don't forget to put your best headphones on while watching this.", "url": "https://www.motor1.com/news/414807/bmw-m3-g80-nurburgring-spy-video/", "urlToImage": null, "publishedAt": "2020-04-26T09:05:19Z", "content": "The next BMW M3 isn't about to be revealed until next year, or in the metal, at least. Despite that, BMW isn't holding back in testing the G80 generation of its performance sedan. Spied at the Nürburgring in Nürburg, Germany, the M3 was caught pushing its lim… [+1419 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Douglas Busvine", "title": "Germany flips on smartphone contact tracing, backs Apple and Google - Reuters", "description": "Germany changed course on Sunday over which type of smartphone technology it wanted to use to trace coronavirus infections, backing an approach supported by Apple and Google along with a growing number of other European countries.", "url": "https://www.reuters.com/article/us-health-coronavirus-europe-tech-idUSKCN22807J", "urlToImage": null, "publishedAt": "2020-04-26T08:03:22Z", "content": "BERLIN (Reuters) - Germany changed course on Sunday over which type of smartphone technology it wanted to use to trace coronavirus infections, backing an approach supported by Apple and Google along with a growing number of other European countries. \r\nChancel… [+3449 chars]"}, {"source": {"id": null, "name": "Wccftech.com"}, "author": "Aernout van de Velde", "title": "FFVII Remake Part 2 Weapons Possibly Shown Off Through The Game’s Digital Art Book - Wccftech", "description": "The FFVII Remake digital artbook might have well provided a sneak peek at some of the weapons included in part 2 of the game. Without spoiling too much, the recently released first part of Final Fantasy VII Remake contains some iconic weapons that were also p…", "url": "https://wccftech.com/ffvii-remake-part-2-weapons/", "urlToImage": null, "publishedAt": "2020-04-26T04:53:30Z", "content": "The FFVII Remake digital artbook might have well provided a sneak peek at some of the weapons included in part 2 of the game.\r\nWithout spoiling too much, the recently released first part of Final Fantasy VII Remake contains some iconic weapons that were also … [+2046 chars]"}, {"source": {"id": null, "name": "Comicbook.com"}, "author": "Tyler Fischer", "title": "Ninja Calls Out Fortnite and Its \"Brain-Dead\" Players - ComicBook.com", "description": "Fortnite is in a bad place. Just earlier this month #RIPFornite was trending on Twitter. Meanwhile, the game's biggest streamers and content creators have also been lashing out against the game lately. Included in the latter has been Ninja, one of the most fa…", "url": "https://comicbook.com/gaming/news/ninja-fortnite-mixer-stream-rage-brain-dead-players/", "urlToImage": null, "publishedAt": "2020-04-26T04:05:11Z", "content": "Fortnite is in a bad place. Just earlier this month #RIPFornite was trending on Twitter. Meanwhile, the game's biggest streamers and content creators have also been lashing out against the game lately. Included in the latter has been Ninja, one of the most fa… [+2231 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "", "title": "Amazon asks workers to request leave if they continue staying at home - Engadget", "description": "Amazon warehouse workers will have to request a leave of absence if they want to stay at home after May 1st.", "url": "https://www.engadget.com/amazon-workers-must-request-leave-034137183.html", "urlToImage": null, "publishedAt": "2020-04-26T04:04:22Z", "content": "Amazon warehouse workers wanting to stay home to avoid COVID-19 will soon have to make a formal request. The online retailer is asking staff staying home to either report to their shifts starting May 1st or else request a leave of absence. A spokesperson told… [+588 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "David Priest", "title": "The best Alexa devices to buy for 2020 - CNET", "description": "The best Alexa-enabled or compatible gadgets to use with your Echo smart speaker or display.", "url": "https://www.cnet.com/news/the-best-alexa-devices-to-buy-for-2020/", "urlToImage": null, "publishedAt": "2020-04-26T03:34:31Z", "content": "Amazon's Alexa is good for more than asking for music to play or for the current temperature outside. You can use this voice assistant in a range of ways with compatible Amazon Echo smart speakers and displays, from voice control of smart devices and two-way … [+8959 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Desire Athow", "title": "This 4TB PCIe SSD can make your Windows laptop feel more like a MacBook Pro - TechRadar", "description": "Assuming you have a compatible laptop, that is", "url": "https://www.techradar.com/news/this-4tb-pcie-ssd-can-make-your-windows-laptop-feel-more-like-a-macbook-pro", "urlToImage": null, "publishedAt": "2020-04-26T03:00:00Z", "content": "The Apple MacBook Pro 16 still holds bragging rights when it comes to the maximum storage capacity available in a traditional portable laptop. \r\nApple uses a proprietary approach, plugging memory chips directly into the motherboard to reach a whopping 8TB of … [+1494 chars]"}, {"source": {"id": null, "name": "Dotesports.com"}, "author": "Dylan Ladd", "title": "Nautilus Legends of Runeterra champion card revealed - Dot Esports", "description": "Dive into the fearsome depths with Nautilus.", "url": "https://dotesports.com/lor/news/nautilus-legends-of-runeterra-champion-card-revealed", "urlToImage": null, "publishedAt": "2020-04-26T02:37:52Z", "content": "Legends of Runeterras card reveal season has surprised fans with another set of champion and follower cards from Bilgewater. \r\nNautilus is the surprise champion that Riot Gamesunveiled in tonights teasers. He’s a seven-cost champion unit using zero power and … [+917 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Shockingly Detailed Minecraft Cities Are Available To Buy Online - Screen Rant", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiRGh0dHBzOi8vc2NyZWVucmFudC5jb20vbWluZWNyYWZ0LWNpdHktYnV5LXNhbGUtdmFydW5hLWJ1aWxkcy1vcmFyaW8v0gFIaHR0cHM6Ly9zY3JlZW5yYW50LmNvbS9taW5lY3JhZnQtY2l0eS1idXktc2FsZS12YXJ1bmEtYnVpbGRzLW9yYXJpby9hbXAv?oc=5", "urlToImage": null, "publishedAt": "2020-04-26T01:40:14Z", "content": null}, {"source": {"id": null, "name": "Nasaspaceflight.com"}, "author": null, "title": "Starship SN4 set for cryogenic proof test - NASASpaceflight.com", "description": "Starship SN4 is set for a crucial cryogenic proof test as early as Saturday evening…", "url": "https://www.nasaspaceflight.com/2020/04/starship-sn4-set-for-test/", "urlToImage": null, "publishedAt": "2020-04-26T00:55:27Z", "content": "Starship SN4 is set for a crucial cryogenic proof test as early as Saturday evening at SpaceX’s launch site in Boca Chica, Texas. The cryogenic proof test is one of the first tests necessary to prove the vehicle’s flight-worthiness. If all goes well, SpaceX t… [+5301 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Ewan Spence", "title": "Apple Leak Reveals Radical New MacBook - Forbes", "description": "Apple's first ARM powered MacBook is expected to launch next year, as Tim Cook moves away from Intel's grasp.", "url": "https://www.forbes.com/sites/ewanspence/2020/04/25/apple-macbook-pro-arm-intel-new-leak-rumor-specs-release-date/", "urlToImage": null, "publishedAt": "2020-04-25T23:36:11Z", "content": "Apple may be preparing to update the 13-inch and 16-inch MacBook Pro machines to Intels tenth-generation processors, but its longstanding project to bring ARM power to its MacOS platform gathers pace, with reports today that a release in 2021 is on the cards.… [+6658 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Darren Allan", "title": "AMD Cezanne leak hints at next-gen laptop CPUs with RDNA 2 graphics that go for Intel’s jugular - TechRadar Singapore", "description": "Zen 3 APUs with RDNA 2-powered integrated graphics, rumor has it", "url": "https://www.techradar.com/news/amd-cezanne-leak-hints-at-next-gen-laptop-cpus-with-rdna-2-graphics-that-go-for-intels-jugular", "urlToImage": null, "publishedAt": "2020-04-25T22:50:00Z", "content": "AMD Ryzen 4000 (codenamed Renoir) mobile chips are still very much fresh on the scene and making a huge impact in terms of competitiveness in the laptop world but weve already seen a leak for next-gen APUs apparently codenamed Cezanne (a name which has been d… [+2934 chars]"}, {"source": {"id": null, "name": "Androidpolice.com"}, "author": "https://www.facebook.com/corbin.davenport.50", "title": "OnePlus 6/6T receive OxygenOS 10.3.3 following end of Open Beta program - Android Police", "description": "OnePlus just announced the end of the OxygenOS Open Beta program for the 6 and 6T, but the company promised that regular stable updates would continue.", "url": "https://www.androidpolice.com/2020/04/25/oneplus-6-6t-receive-oxygenos-10-3-3-following-end-of-open-beta-program/", "urlToImage": null, "publishedAt": "2020-04-25T22:31:20Z", "content": "OnePlus just announced the end of the OxygenOS Open Beta program for the 6 and 6T, but the company promised that regular stable updates would continue. Sure enough, both phones are now receiving a new system update, containing a handful of bug fixes and secur… [+1307 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Matt Binder", "title": "Zoom hackers are spoofing HR meeting invites to steal user login info - Mashable", "description": "Job loss is a real fear and these hackers are taking advantage of that panic.", "url": "https://mashable.com/article/zoom-phishing-email-hack-coronavirus-unemployment/", "urlToImage": null, "publishedAt": "2020-04-25T22:11:26Z", "content": "Zoom\r\n may have fixed\r\n many of its own security issues, but itll never be immune to hackers trying to trick the companys users.\r\nMalicious actors are now targeting users with fake Zoom meeting emails in order to steal their personal information and login cre… [+2239 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "", "title": "Twitch has a problem with non-stop 'Valorant' streams - Engadget", "description": "Twitch channels have turned to running non-stop 'Valorant' streams to reel in gamers desperate for beta keys.", "url": "https://www.engadget.com/valorant-non-stop-twitch-streams-202140642.html", "urlToImage": null, "publishedAt": "2020-04-25T22:06:02Z", "content": "Valorant has been a hit on Twitch, but it’s now clear that success isn’t always for the right reasons. Kotaku has documented a slew of Twitch streams that are running 24/7 solely to attract people looking for Valorantbeta keys that drop after watching for at … [+698 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Kevin Knezevic", "title": "Pokemon Go April Abra Community Day Now Live: Shiny Abra, Bonuses, And Extended Hours - GameSpot", "description": "Pokemon Go's delayed Abra Community Day is now set for Saturday, April 25; here's everything you need to know about the event.", "url": "https://www.gamespot.com/articles/pokemon-go-april-abra-community-day-now-live-shiny/1100-6474599/", "urlToImage": null, "publishedAt": "2020-04-25T22:00:00Z", "content": "Pokemon Go's long-delayed Abra Community Day has finally arrived. The event, which was originally slated to take place on March 15 before developer Niantic postponed it due to the COVID-19 pandemic, will now be held today, April 25, more than a month after it… [+3241 chars]"}, {"source": {"id": null, "name": "Reviewjournal.com"}, "author": "Julie Wootton-Greener", "title": "CES 2020 attendee reports positive COVID-19 antibody test - Las Vegas Review-Journal", "description": "<p>The news — reported Thursday by American Public Media — is renewing social media speculation about whether the virus was circulating at the show in January in Las Vegas.</p>", "url": "https://www.reviewjournal.com/post/2014973", "urlToImage": null, "publishedAt": "2020-04-25T21:33:00Z", "content": "A CES 2020 attendee who reportedly developed flu-like symptoms after returning home from the conference in January says he found out Monday that his COVID-19 antibody test came back positive.\r\nThe news, reported Thursday by American Public Media, is renewing … [+3174 chars]"}, {"source": {"id": null, "name": "Bleedingcool.com"}, "author": "Gavin Sheehan", "title": "Nintendo Will Remove Network ID Sign-In After Nintendo Switch Hack - Bleeding Cool News", "description": "Nintendo has decided to take action to curb the latest hacking issues with the Nintendo Switch be eliminating network sign-in options.", "url": "https://bleedingcool.com/games/nintendo-will-remove-network-id-sign-in-after-nintendo-switch-hack/", "urlToImage": null, "publishedAt": "2020-04-25T20:23:56Z", "content": "Nintendo has decided to take action to curb the latest hacking issues with the Nintendo Switch be eliminating network sign-in options. The company released a statement complete with an FAQ about what's been going on and why they're doing this. If you're not a… [+1789 chars]"}, {"source": {"id": null, "name": "Windowscentral.com"}, "author": "Asher Madan", "title": "Naughty Dog's Sylvia Chambers joins Microsoft's The Initiative as Character Animator - Windows Central", "description": "Today, Twitter's \"Klobrille\" noticed that Sylvia Chambers has joined Microsoft's new studio, The Initiative, as Character Animator. Chambers is known for her work at Sony's \"Naughty Dog,\" EA's \"DICE,\" and other teams.", "url": "https://www.windowscentral.com/naughty-dogs-sylvia-chambers-joins-microsofts-initiative-character-animatorr-animator", "urlToImage": null, "publishedAt": "2020-04-25T20:21:16Z", "content": "Source: Sony\r\n<ul><li>Character animations are some of the most important aspects of a game.</li><li>Sylvia Chambers recently joined Microsoft's \"The Initiative\" studio as Character Animator.</li><li>Chambers has worked at Naughty Dog, DICE, and more. </li><l… [+1555 chars]"}, {"source": {"id": null, "name": "Gizchina.com"}, "author": "https://web.facebook.com/udinmwen.efosa", "title": "Sony PlayStation 5 will have pleasant surprises at launch – former Sony engineer - Gizchina.com", "description": "Sony PlayStation 5 will have pleasant surprises at launch - former Sony engineer. We will have to wait a few months for this device to arrive.", "url": "https://www.gizchina.com/2020/04/25/sony-playstation-5-will-have-pleasant-surprises-at-launch-former-sony-engineer/", "urlToImage": null, "publishedAt": "2020-04-25T20:15:38Z", "content": "The latest gaming consoles from Sony and Microsoft will arrive at the end of the year. There is a race to the finish line between these manufacturers and on paper, Microsoft seems to be ahead. Microsoft has revealed more about the Xbox Series X compared to So… [+1587 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Fallout 76: Wastelanders Review - IGN", "description": "Fallout 76: Wastelanders reviewed by David Jagneaux on PlayStation 4 Pro. Also available on PC and Xbox One. \"With the Wastelanders update, Fallout 76 has ta...", "url": "https://www.youtube.com/watch?v=U-uDLErALu0", "urlToImage": null, "publishedAt": "2020-04-25T19:51:32Z", "content": "Fallout 76: Wastelanders reviewed by David Jagneaux on PlayStation 4 Pro. Also available on PC and Xbox One.\r\n\"With the Wastelanders update, Fallout 76 has taken a solid step in the right direction after its dire launch. New human NPCs bring a healthy dose of… [+633 chars]"}, {"source": {"id": "crypto-coins-news", "name": "Crypto Coins News"}, "author": null, "title": "Twitch Streamer Alinity Gets Bullied By A Bunch of Voyeuristic Creeps - CCN.com", "description": "Go ahead and call me a simp, bullies. You're the pathetic weirdos gawking at Alinity, then bullying her with calls for Twitch to ban her.", "url": "https://www.ccn.com/twitch-streamer-alinity-gets-bullied-by-a-bunch-of-voyeuristic-creeps/", "urlToImage": null, "publishedAt": "2020-04-25T19:49:00Z", "content": "<ul><li>Popular Twitch streamer Alinity had a nip slip Friday.</li><li>An army of goons immediately began harassing her on social media.</li><li>Alinity isnt the problem; the issue is the bullying of female gamers.</li></ul>In a Friday broadcast, popular Twit… [+3359 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Discord’s Mobile Voice Overlay is no longer a Samsung Galaxy exclusive - XDA Developers", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiWmh0dHBzOi8vd3d3LnhkYS1kZXZlbG9wZXJzLmNvbS9kaXNjb3JkLW1vYmlsZS12b2ljZS1vdmVybGF5LWF2YWlsYWJsZS1hbGwtYW5kcm9pZC1kZXZpY2VzL9IBXmh0dHBzOi8vd3d3LnhkYS1kZXZlbG9wZXJzLmNvbS9kaXNjb3JkLW1vYmlsZS12b2ljZS1vdmVybGF5LWF2YWlsYWJsZS1hbGwtYW5kcm9pZC1kZXZpY2VzL2FtcC8?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T19:16:00Z", "content": null}, {"source": {"id": null, "name": "Yahoo.com"}, "author": "Rudie Obias", "title": "These rarely on sale Apple AirPods Pro are the cheapest we've ever seen them - Yahoo Entertainment", "description": "Quick, snag the newest AirPods Pro for $25 off.", "url": "https://www.yahoo.com/entertainment/apple-airpods-pro-sale-163019057.html", "urlToImage": null, "publishedAt": "2020-04-25T19:01:38Z", "content": "Yahoo Life is committed to finding you the best products at the best prices. We may receive a share from purchases made via links on this page. Pricing and availability is subject to change.\r\nCustomizable and noise-canceling: the Apple AirPods Pro are a solid… [+2692 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "What We Want From A Resident Evil 4 Remake - GameSpot", "description": "Capcom is reportedly working on a remake of Resident Evil 4. Jean-Luc talks about a few major things he’d like to see in it that could improve an already exc...", "url": "https://www.youtube.com/watch?v=c_ghuXUzMxI", "urlToImage": null, "publishedAt": "2020-04-25T19:00:06Z", "content": null}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "", "title": "WhatsApp claims spyware firm launched attacks with US servers - Engadget", "description": "WhatsApp has accused NSO Group of launching its surveillance attacks from US servers despite claims to the contrary.", "url": "https://www.engadget.com/whatsapp-says-nso-group-launched-attacks-from-us-155827515.html", "urlToImage": null, "publishedAt": "2020-04-25T18:39:41Z", "content": "Facebook just escalated its lawsuit over surveillance firm NSO Group’s WhatsApp call exploit attacks. The WhatsApp team has filed accusations that NSO relied on US-based servers to stage its spyware attacks using Pegasus software. NSO reportedly used the Los … [+725 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "", "title": "Android's upcoming call recording feature could be region restricted - Engadget", "description": "Android's upcoming call recording feature could be coming soon.", "url": "https://www.engadget.com/android-call-recording-003653130.html", "urlToImage": null, "publishedAt": "2020-04-25T18:38:59Z", "content": "The document went on to say that when you record a call for the first time, you’ll be advised that you’re responsible for complying with local laws (many regions require consent by all parties prior to call recording). It states: “When you start recording, th… [+866 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "James O'Connor", "title": "Travis Scott Fortnite Concert: Don't Miss The Final Day! - GameSpot", "description": "Rapper Travis Scott will be doing a virtual global tour of Fortnite in the form of the Astronomical concert tonight, performing a new track in the massive battle royale game. Here are all the show times.", "url": "https://www.gamespot.com/articles/travis-scott-fortnite-concert-dont-miss-the-final-/1100-6476241/", "urlToImage": null, "publishedAt": "2020-04-25T18:10:00Z", "content": "Fortnite: Battle Royale is hosting a series of Travis Scott concerts today and tomorrow. Dubbed the Astronomical event, the virtual music performance has been promoted as \"an other-worldly experience\" that was \"built from the ground up in Fortnite.\" The first… [+1876 chars]"}, {"source": {"id": null, "name": "Nintendolife.com"}, "author": "Nintendo Life", "title": "The Pokémon Company Apologises For Featuring Dewgong In The Fourth Episode Of Twilight Wings - Nintendo Life", "description": "As it's not available in Sword and Shield", "url": "http://www.nintendolife.com/news/2020/04/the_pokemon_company_apologises_for_featuring_dewgong_in_the_fourth_episode_of_twilight_wings", "urlToImage": null, "publishedAt": "2020-04-25T17:30:00Z", "content": "@KayFiOS Agreed. I've been playing since Red, completed the Red Dex and the National Dex in Pokemon X/Y. The series as a whole has steadily stagnated over the years, with brief moments of improvement only acting as a band-aid for the lack of ambition and aiml… [+5140 chars]"}, {"source": {"id": null, "name": "Mspoweruser.com"}, "author": "https://www.facebook.com/profile.php?id=100034991436602", "title": "Massive Discount: Microsoft's Surface Laptop 2 is $699 cheaper today - MSPoweruser - MSPoweruser", "description": "If you’re on the lookout for a light and premium Windows 10 PC, Surface Laptop 2 deserves your attention. The Laptop 2 is also $699 cheaper today, so it’s now even easier to recommend. Microsoft  Surface Laptop 2 (Intel Core i7, 16GB RAM, 1TB) is now availabl…", "url": "https://mspoweruser.com/huge-discount-on-surface-laptop-2-at-amazon/", "urlToImage": null, "publishedAt": "2020-04-25T17:00:50Z", "content": "If you’re on the lookout for a light and premium Windows 10 PC, Surface Laptop 2 deserves your attention. The Laptop 2 is also $699 cheaper today, so it’s now even easier to recommend.\r\nMicrosoft  Surface Laptop 2 (Intel Core i7, 16GB RAM, 1TB) is now availab… [+1099 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Kevin Knezevic", "title": "Animal Crossing: New Horizons Free Goodies Available For Nintendo Switch Online Members - GameSpot", "description": "NSO subscribers can claim a free, exclusive Nook Inc. silk rug for New Horizons from the Nintendo Switch Eshop.", "url": "https://www.gamespot.com/articles/animal-crossing-new-horizons-free-goodies-availabl/1100-6476315/", "urlToImage": null, "publishedAt": "2020-04-25T16:47:00Z", "content": "Nintendo is offering a few special freebies for Animal Crossing: New Horizons. In addition to the Pocket Camp crossover items you can receive through the series' mobile spin-off, Switch Online members can nab an exclusive Nook Inc. silk rug from the Switch Es… [+1592 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Matthew Forde", "title": "Sony slip-ups: ahead of the PS5, we look back at the PlayStation tech that just didn't work - TechRadar India", "description": "They can't all be winners", "url": "https://www.techradar.com/news/sony-slip-ups-ahead-of-the-ps5-we-look-back-at-the-playstation-tech-that-just-didnt-work", "urlToImage": null, "publishedAt": "2020-04-25T16:00:00Z", "content": "As we motor towards the next generation of consoles, Sony currently holds all of the cards and will be looking to build upon the monumental success it found during the current generation. Its sometimes easy to forget just how well the PlayStation 4 has sold, … [+6393 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Sarah Perez", "title": "This Week in Apps: Facebook takes on Houseparty, Fortnite comes to Google Play, contact tracing API - TechCrunch", "description": "We continue to look at how the coronavirus outbreak is impacting mobile apps, including details about Apple and Google's contact tracing API, and more.", "url": "http://techcrunch.com/2020/04/25/this-week-in-apps-facebook-takes-on-houseparty-fortnite-comes-to-google-play-contract-tracing-api/", "urlToImage": null, "publishedAt": "2020-04-25T15:17:17Z", "content": "Welcome back to This Week in Apps, the Extra Crunch series that recaps the latest OS news, the applications they support and the money that flows through it all.\r\nThe app industry is as hot as ever, with a record 204 billion downloads and $120 billion in cons… [+1182 chars]"}, {"source": {"id": null, "name": "Tomsguide.com"}, "author": "Kate Kozuch", "title": "Apple Watch five years later: What I love and hate - Tom's Guide", "description": "What I think of the Apple Watch on its 5th birthday", "url": "https://www.tomsguide.com/news/apple-watch-five-years-later-what-i-love-and-hate", "urlToImage": null, "publishedAt": "2020-04-25T15:16:44Z", "content": "When I bought the first-ever Apple Watch five years ago, I thought my dreams of becoming a cyborg with a robot army would finally come true. Or, at the very least, Id be the ultimate, up-in-coming hotshot tech reporter on my upstate college campus. \r\nMy anarc… [+5879 chars]"}, {"source": {"id": null, "name": "9to5google.com"}, "author": null, "title": "Google Meet call w/ thousands of Googlers watched an executive’s son praise Zoom - 9to5Google", "description": "Funny story: During a Google Meet call with thousands of Google employees, an executive's son walked in and sung praises to the competing Zoom service.", "url": "https://9to5google.com/2020/04/25/google-meet-zoom-competition-executive-son-story/", "urlToImage": null, "publishedAt": "2020-04-25T14:37:50Z", "content": "In the wake of the coronavirus pandemic, Zoom has skyrocketed to mainstream popularity with hundreds of millions of users added in the past couple of months. Google Meet, on the other hand, hasn’t seen anything near Zoom’s success. To twist the knife, a Googl… [+2200 chars]"}, {"source": {"id": null, "name": "Decrypt.co"}, "author": "Mathew Di Salvo", "title": "Telegram hits 400 million users while SEC prevents TON launch - Decrypt", "description": "The popular messaging app says over 1.5 million people sign up to use its platform every day. But without its upcoming blockchain network, it will struggle to profit from them.", "url": "https://decrypt.co/26672/blockchain-network-telegram-crypto-telegram", "urlToImage": null, "publishedAt": "2020-04-25T14:13:59Z", "content": "The messenger app Telegram on Friday announced that it has hit 400 million unique monthly userswith at least 1.5 million new people signing up to the platform every day. \r\nBut due to an ongoing court case with the SEC, those 400 million users wont have direct… [+2212 chars]"}, {"source": {"id": null, "name": "Gearpatrol.com"}, "author": "Tucker Bowe", "title": "Klipsch's Wireless Earbuds Are Now Cheaper Than Ever - Gear Patrol", "description": "Amazon is selling Klipsch's first pair of wireless earbuds for cheaper than ever. The Klipsch T5 True Wireless are on sale for $100, which is half off.", "url": "https://gearpatrol.com/2020/04/25/klipsch-t5-true-wireless-deal/", "urlToImage": null, "publishedAt": "2020-04-25T14:07:04Z", "content": "Klipsch released its first pair of true wireless earbuds, the T5 True Wireless, this past summer. They sound good and are relatively inexpensive; about $100 cheaper than most other wireless earbuds from traditional audiophile-focused companies. Now Amazon is … [+1027 chars]"}, {"source": {"id": null, "name": "9to5google.com"}, "author": null, "title": "This week’s top stories: Huawei caught falsifying photos, Google Store refresh, ‘Hey Google’ sensitivity, more - 9to5Google", "description": "Top Stories: Huawei caught claiming DSLR photos were taken on a smartphone, Google Store sees a refresh highlighting Google's hardware brands, and more.", "url": "https://9to5google.com/2020/04/25/top-stories-huawei-falsifying-photos-google-store-refresh/", "urlToImage": null, "publishedAt": "2020-04-25T14:01:43Z", "content": "In this week’s top stories: Huawei was caught claiming DSLR photos were taken on a smartphone, the Google Store sees a refresh highlighting Google’s hardware brands, adjustable “Hey Google” sensitivity outlined, and more.\r\nFiled under bizarre controversy this… [+3260 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Rhett Allain", "title": "Wait a Second, That Table Has No Legs! - WIRED", "description": "How to build “magic,” gravity-defying structures—with Legos, kite string, and physics.", "url": "https://www.wired.com/story/wait-that-table-has-no-legs/", "urlToImage": null, "publishedAt": "2020-04-25T14:00:00Z", "content": "Really, this doesn't tell us much. All it says is that the upward-pulling tension has to be equal to the two downward forces (gravity and the other tension).\r\nBut what about the sum of the torques? If the object is in equilibrium, you can pick any point on th… [+2262 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Eddie Makuch", "title": "WWE 2K21 Is Canceled, But Franchise Isn't Dead - GameSpot", "description": "The WWE announces that there won't be a new WWE 2K game this year but 2K says fans should watch out for \"exciting news\" on Monday.", "url": "https://www.gamespot.com/articles/wwe-2k21-is-canceled-but-franchise-isnt-dead/1100-6476445/", "urlToImage": null, "publishedAt": "2020-04-25T13:23:00Z", "content": "The WWE has officially confirmed that the next WWE 2K game is canceled. WWE 2K21 will not be released, management said on an earnings call. The news comes following potentially-delayed workflows due to the ongoing pandemic and a particularly poor showing from… [+1467 chars]"}, {"source": {"id": null, "name": "Dexerto.com"}, "author": "Connor Bennett", "title": "All Apex Legends Season 5 easter eggs and teasers so far - Dexerto", "description": "Apex Legends Season 5 is already being teased in World's Edge. Here, we take a look at all the easter eggs and hints about the recently delayed season.", "url": "https://www.dexerto.com/apex-legends/all-apex-legends-season-5-easter-eggs-and-teasers-so-far-1357801", "urlToImage": null, "publishedAt": "2020-04-25T12:56:43Z", "content": "Ahead of Apex Legends season five, fans have been noticing a few teasers springing up around World’s Edge and Kings Canyon for a limited time. We’re going to round them up here and take a look at what else is in store.\r\nWith Apex Legends set to turn from seas… [+2141 chars]"}, {"source": {"id": null, "name": "Dexerto.com"}, "author": "Andy Williams", "title": "Riot developer exposes sexist harassment during Valorant Twitch stream - Dexerto", "description": "A LoL developer has exposed the forms of sexual harassment they suffered during a Valorant Twitch stream, prompting a response from Riot.", "url": "https://www.dexerto.com/valorant/riot-developer-exposes-sexist-harassment-during-valorant-twitch-stream-1357781", "urlToImage": null, "publishedAt": "2020-04-25T12:07:01Z", "content": "A League of Legends developer has exposed the sexist abuse she faced during a Valorant Twitch stream, resulting in Riot pledging to find “long-term solutions.”\r\nValorant’s closed beta has been a massive success for Riot, garnering almost 300 million hours wat… [+3248 chars]"}, {"source": {"id": null, "name": "Slashgear.com"}, "author": "Osmond Chia", "title": "2020: Death of the flagship killer phones - SlashGear", "description": "It’s the underdog story of the tech world. Every year, we expect to see OnePlus, Xiaomi, Asus and the other underdog fighters that trade blows with the heavyweight champs like the iPhone and Samsun…", "url": "https://www.slashgear.com/2020-death-of-the-flagship-killer-25618232/", "urlToImage": null, "publishedAt": "2020-04-25T11:06:28Z", "content": "Its the underdog story of the tech world. Every year, we expect to see OnePlus, Xiaomi, Asus and the other underdog fighters that trade blows with the heavyweight champs like the iPhone and Samsung Galaxy S series. These underdog flagship killers bring hope t… [+4488 chars]"}, {"source": {"id": null, "name": "Autoevolution.com"}, "author": "Andrei Tutu", "title": "2015 Ford Mustang GT 'Generation Gap\" Is a Bad Boy 1967 Eleanor Conversion - autoevolution", "description": "Wouldn't it be a dream to enjoy a Ford Mustang that mixes the retro look of a 1967 Fastback with the plethora of benefits delivered by a 2015 GT? The answer to this question is obvious, so the motor-crazy crew over at B Is For Build decided to translate this …", "url": "https://www.autoevolution.com/news/2015-ford-mustang-gt-generation-gap-is-a-bad-boy-1967-eleanor-conversion-142983.html", "urlToImage": null, "publishedAt": "2020-04-25T10:39:00Z", "content": "It's been almost a month since we first discussed this stunning Blue Oval project and while the March article included all the uphill work required to put this contraption together, the time has come to start enjoying the fruits of all that labor. As such, th… [+1229 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Davey Winder", "title": "New Windows 10 Update Fail: Users Warn Of BSOD And Deleted Files - Forbes", "description": "As users complain of blue screens of death, deleted files and reboot loops, here's what you really need to know about this Windows 10 update.", "url": "https://www.forbes.com/sites/daveywinder/2020/04/25/new-windows-10-update-fail-users-warn-of-bsod-and-deleted-files/", "urlToImage": null, "publishedAt": "2020-04-25T10:03:45Z", "content": "The latest Patch Tuesday update has caused alarming problems for some Windows 10 users\r\nSOPA Images/LightRocket via Getty Images\r\nAs users complain of blue screens of death, deleted files and reboot loops, here's what you need to know about this Windows 10 up… [+4453 chars]"}, {"source": {"id": null, "name": "Motor1.com"}, "author": "Jacob Oliva", "title": "2020 Hyundai Sonata N-Line To Debut Mid-May? - Motor1 ", "description": "We could be seeing the performance variant by next month.", "url": "https://www.motor1.com/news/414725/hyundai-sonata-n-line-debut/", "urlToImage": null, "publishedAt": "2020-04-25T08:22:07Z", "content": "The Hyundai Sonata has evolved from its once classy design. I can still remember how enamored I was with the Sonata around 10 years ago. Its design was simple, with straight lines and some touches of chrome that are fit for an executive midsize sedan, but it … [+1715 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Ryan Gilliam", "title": "FF7 Remake Leviathan boss fight guide - Polygon", "description": "Leviathan is one of the harder bosses in the Final Fantasy 7 Remake. But you can defeat it if you play smart and careful. If you’re patient, you can add Leviathan to your arsenal of Summons.", "url": "https://www.polygon.com/final-fantasy-7-remake-guide/2020/4/24/21235156/ff7-leviathan-boss-fight-strategy-weakness-materia-abilities", "urlToImage": null, "publishedAt": "2020-04-25T00:47:58Z", "content": "In Final Fantasy 7 Remake, youll go up against Leviathan in Chadleys VR room after completing some battle intel. Leviathan is a super powerful summon, but you need to defeat it in battle before youll earn its Materia. This fight is punishing, so prepare for a… [+5098 chars]"}, {"source": {"id": null, "name": "Tomsguide.com"}, "author": "Adam Ismail", "title": "LG Velvet release date, price, specs and rumors - Tom's Guide", "description": "The LG Velvet is intended to reboot the company's phones with a focus on design. Here's everything we know so far.", "url": "https://www.tomsguide.com/news/lg-velvet-release-date-price-specs-and-rumors", "urlToImage": null, "publishedAt": "2020-04-24T21:43:15Z", "content": "The upcoming LG Velvet is an important device for the Korean tech giant. In recent years, LG's smartphone arm hasn't delivered the kind of critical or commercial success necessary to stay relevant. A confused lineup of flagships with similar designs and specs… [+6025 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "iPad Pro Magic Keyboard Review: Almost Perfect... - Dom Esposito", "description": "Apple Magic Keyboard Review - Best iPad Keyboard Case? Worth the Money? This iPad Pro Magic Keyboard packs a trackpad, backlit keys, and. costs $300+ but sho...", "url": "https://www.youtube.com/watch?v=_evwRhwt8IQ", "urlToImage": null, "publishedAt": "2020-04-24T21:14:17Z", "content": "Apple Magic Keyboard Review - Best iPad Keyboard Case? Worth the Money? This iPad Pro Magic Keyboard packs a trackpad, backlit keys, and. costs $300+ but should you buy it? Check out my Magic Keyboard for iPad Pro review! Covering design, SideCar use, keyboar… [+238 chars]"}, {"source": {"id": null, "name": "Androidpolice.com"}, "author": null, "title": "OnePlus reportedly issues massive layoffs in largest European markets - Android Police", "description": "OnePlus has reportedly made severe staffing cuts in its European operations. While the tech brand has experienced massive growth in other markets over the", "url": "https://www.androidpolice.com/2020/04/25/oneplus-reportedly-issued-massive-layoffs-in-largest-european-markets/", "urlToImage": null, "publishedAt": "2020-04-24T21:06:06Z", "content": "This story was originally published 2020/04/24 1:52pm PDTon Apr 24, 2020 and last updated 2020/04/25 12:38pm PDTApr 25, 2020. \r\nOnePlus has reportedly made severe staffing cuts in its European operations. While the tech brand has experienced massive growth in… [+3233 chars]"}, {"source": {"id": null, "name": "Autoevolution.com"}, "author": "Mircea Panait", "title": "Lexus Sends Off GS Luxury Sedan With \"Eternal Touring\" Special Edition - autoevolution", "description": "Pretty much the Japanese equivalent to the Black Line in America, Eternal Touring is how Lexus bids farewell to the GS luxury sedan. Introduced in 1993 with exterior styling from the one and only Giorgetto Giugiaro, the GS is getting on a bit considering that…", "url": "https://www.autoevolution.com/news/lexus-sends-off-gs-luxury-sedan-with-eternal-touring-special-edition-142976.html", "urlToImage": null, "publishedAt": "2020-04-24T19:53:00Z", "content": "Codenamed L10, the fourth generation will be replaced by the ES in August 2020. No direct successor of the Grand touring Sedan is planned, and given the appetite for crossovers and SUVs, it doesn’t come as a surprise. The ES isn’t only longer than the GS but … [+1677 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Trials of Mana - Your Adventure Begins Trailer - Nintendo Switch - Nintendo", "description": "Trials of Mana is Available Now on Nintendo Switch! A Trials of Mana Demo is also available and free to download! Forces of darkness will stop at nothing to ...", "url": "https://www.youtube.com/watch?v=qq1CTFtJI38", "urlToImage": null, "publishedAt": "2020-04-24T16:00:30Z", "content": "Trials of Mana is Available Now on Nintendo Switch! A Trials of Mana Demo is also available and free to download!\r\nForces of darkness will stop at nothing to get their hands on the powerful Sword of Mana. Begin your adventures today, join your companions, and… [+463 chars]"}]}