{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Gamespot.com"}, "author": "Phil Hornshaw", "title": "Final Fantasy 7 Remake Enemy Skill Guide: Where To Get Each Enemy Ability - GameSpot", "description": "One of the cooler Materia you can get from Chadley lets you steal abilities from the Midgar monsters who threaten you.", "url": "https://www.gamespot.com/articles/final-fantasy-7-remake-enemy-skill-guide-where-to-/1100-6476498/", "urlToImage": null, "publishedAt": "2020-04-24T23:50:00Z", "content": "Working your way through Final Fantasy 7 Remake, you'll often get your best, most useful, or most interesting Materia from Chadley, the strange kid you meet in Chapter 3. Chadley gives you \"Battle Intel\" assignments, and unlocking each one lets you purchase a… [+4542 chars]"}, {"source": {"id": null, "name": "Avclub.com"}, "author": "William Hughes", "title": "Elijah Wood is a very polite Animal Crossing guest - The A.V. Club", "description": "Nintendo’s recent “Let’s all chill on a cool island run by ruthless capitalist raccoons” simulator, Animal Crossing: New Horizons, arrived at essentially the perfect moment in the ongoing zeit-shit, offering a cheerful and relaxing respite from the outside wo…", "url": "https://news.avclub.com/elijah-wood-is-a-very-polite-animal-crossing-guest-1843054282", "urlToImage": null, "publishedAt": "2020-04-24T23:34:00Z", "content": "Nintendos recent Lets all chill on a cool island run by ruthless capitalist raccoons simulator, Animal Crossing: New Horizons, arrived at essentially the perfect moment in the ongoing zeit-shit, offering a cheerful and relaxing respite from the outside world … [+1961 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Xbox Series X Game Reveals “Won't Be Too Much of a Wait' Says Phil Spencer - IGN Daily Fix - IGN", "description": "In today's Daily Fix, it sounds like some Xbox Series X game reveals could be coming soon, Nintendo confirms a pretty big Switch hack, and Elijah Wood hangs ...", "url": "https://www.youtube.com/watch?v=Xtqtu3Qg4CM", "urlToImage": null, "publishedAt": "2020-04-24T23:30:45Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Naruto Shippuden: Ultimate Ninja Storm 4 Road to Boruto - Official Switch Trailer - IGN", "description": "Experience the Fourth Great Ninja War and see through the conclusion of the Naruto Shippuden storyline in the game, available now on Nintendo Switch. Check o...", "url": "https://www.youtube.com/watch?v=H_T9pPijWPc", "urlToImage": null, "publishedAt": "2020-04-24T22:43:40Z", "content": null}, {"source": {"id": null, "name": "Kotaku.com"}, "author": "Nathan Grayson", "title": "Valorant Twitch Streamers Are Gaming The System With 24/7 Streams That Rack Up Viewers Desperate For Beta Keys - Kotaku", "description": "If you take a look at many of Twitch’s top Valorant streams right now, you’ll note that they claim to be running “24/7.” This might strike you as odd, given that human beings generally need to eat, sleep, and all that fancy, life-sustaining jazz. Most of thes…", "url": "https://kotaku.com/valorant-twitch-streamers-are-gaming-the-system-with-24-1843048097", "urlToImage": null, "publishedAt": "2020-04-24T22:28:01Z", "content": "If you take a look at many of Twitchs top Valorant streams right now, youll note that they claim to be running 24/7. This might strike you as odd, given that human beings generally need to eat, sleep, and all that fancy, life-sustaining jazz. Most of these st… [+9335 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Nick Statt", "title": "OnePlus lays off employees in Europe less than two weeks after OnePlus 8 launch - The Verge", "description": "OnePlus just launched its OnePlus 8 and OnePlus 8 Pro flagships less than two weeks ago, but the company is now downsizing its offices in parts of Europe. The offices hardest hit with the layoffs include the UK, France, and Germany, with OnePlus reportedly mo…", "url": "https://www.theverge.com/2020/4/24/21235215/oneplus-layoffs-europe-regional-downsizing-uk-france-germany", "urlToImage": null, "publishedAt": "2020-04-24T22:26:07Z", "content": "It appears unrelated to the coronavirus\r\nPhoto by Vjeran Pavic / The Verge\r\nOnePlus launched its latest flagship phones, the OnePlus 8 and OnePlus 8 Pro, less than two weeks ago, but the Chinese phone maker is now laying off employees in regional offices thro… [+1293 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Dave Johnson", "title": "The Apple Watch Series 5 is $100 off at Amazon right now - CNET", "description": "Get the 40mm Apple Watch Series 5 (GPS and cellular) in silver for $399.", "url": "https://www.cnet.com/news/the-apple-watch-series-5-is-100-off-at-amazon-right-now/", "urlToImage": null, "publishedAt": "2020-04-24T22:21:19Z", "content": "Apple\r\nThe Apple Watch Series 5 isn't a remarkable upgrade from the Series 4, and for that reason alone, I know it's not everyone's favorite Apple smartwatch. But it's my personal fave (thanks in no small part to the always-on display), and the first one I've… [+855 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Morgan Hines", "title": "CDC: Frozen raspberries were culprit behind 2019 norovirus outbreak on multiple cruises - USA TODAY", "description": "Smoothies: Nutritious, delicious – and according to the CDC, the source of a norovirus outbreak that infected hundreds of cruise passengers in 2019.", "url": "https://www.usatoday.com/story/travel/cruises/2020/04/24/cdc-report-raspberries-caused-2019-norovirus-outbreak-cruises/3018721001/", "urlToImage": null, "publishedAt": "2020-04-24T21:58:07Z", "content": "Here is everything you need to know about the highly contagious norovirus.\r\nUSA TODAY\r\nPassengers contemplating boarding another cruise after the coronavirus pandemic might already be planning to pass up the buffet next time they sail due to social-distancing… [+3987 chars]"}, {"source": {"id": null, "name": "Tmonews.com"}, "author": "Alex Wagner", "title": "iPhone SE launches today, Costco rolls out deal for T-Mobile customers - TmoNews", "description": "A little over a week after Apple surprised us with an updated iPhone SE, the new device has officially launche", "url": "https://www.tmonews.com/2020/04/iphone-se-launch-today-costco-deal-t-mobile-customers/", "urlToImage": null, "publishedAt": "2020-04-24T21:33:27Z", "content": "A little over a week after Apple surprised us with an updated iPhone SE, the new device has officially launched.\r\nThe iPhone SE is in stock and ready to ship at T-Mobile. The 64GB and 256GB have estimated ship dates of April 24-27, but you may have to wait a … [+1585 chars]"}, {"source": {"id": null, "name": "Jalopnik.com"}, "author": "Justin T. Westbrook", "title": "My New Favorite YouTuber Designed The Ferrari F430 - Jalopnik", "description": "The guy who designed the reinvented Mini, drew some McLarens and made the Ferrari F430 is now just making videos from his house about design, and they’re wonderful.", "url": "https://jalopnik.com/my-new-favorite-youtuber-designed-the-ferrari-f430-1843051028", "urlToImage": null, "publishedAt": "2020-04-24T21:11:56Z", "content": "The guy who designed the reinvented Mini, drew some McLarens and made the Ferrari F430 is now just making videos from his house about design, and theyre wonderful. \r\nThe only reason I write for Jalopnik today is because I used to search new cars and new car d… [+1335 chars]"}, {"source": {"id": null, "name": "Androidpolice.com"}, "author": null, "title": "T-Mobile confirms it's going to brick 5G on most Sprint 5G phones post-merger - Android Police", "description": "T-Mobile will shut down Sprint's 5G network in order to rework its spectrum into its own 5G grid. While those with a Galaxy S20 series device on Sprint", "url": "https://www.androidpolice.com/2020/04/24/t-mobile-confirms-its-going-to-brick-5g-on-most-sprint-5g-phones-post-merger/", "urlToImage": null, "publishedAt": "2020-04-24T21:06:31Z", "content": "This story was originally published 2020/04/22 11:47am PDTon Apr 22, 2020 and last updated 2020/04/24 1:56pm PDTApr 24, 2020. \r\nT-Mobile will shut down Sprint's 5G network in order to rework its spectrum into its own 5G grid. While those with a Galaxy S20 ser… [+3283 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Dan Goodin", "title": "That no-click iOS 0-day reported to be under exploit doesn’t exist, Apple says - Ars Technica", "description": "Other critics also question evidence and say 0day may have been confused with simple bug.", "url": "https://arstechnica.com/information-technology/2020/04/apple-disputes-report-of-non-click-ios-0day-under-exploit-for-two-years/", "urlToImage": null, "publishedAt": "2020-04-24T20:40:00Z", "content": "22 with 18 posters participating\r\nApple is disputing the accuracy of this weeks report that found attackers have been exploiting an unpatched iOS bug that allowed them to take full control of iPhones.\r\nSan Francisco-based security firm ZecOps said on Wednesda… [+4799 chars]"}, {"source": {"id": null, "name": "9to5google.com"}, "author": null, "title": "Google Phone call recording function detailed, unsurprisingly region restricted - 9to5Google", "description": "Google has officially detailed a call recording feature for its Phone app which is found on Pixel, Nokia, and some other devices.", "url": "https://9to5google.com/2020/04/24/google-phone-call-recording-details/", "urlToImage": null, "publishedAt": "2020-04-24T20:19:31Z", "content": "Call recording is something that, unfortunately, you don’t see all that often anymore. Google has been working on a call recording option for its Phone app for a while, and now, they’ve officially divulged the details on it.\r\nAndroid Police first spotted a su… [+1206 chars]"}, {"source": {"id": null, "name": "9to5mac.com"}, "author": null, "title": "Magic Keyboard for iPad Pro top features — the best iPad accessory ever [Video] - 9to5Mac", "description": "Hands-on with top features for the Magic Keyboard for iPad Pro. It's the best accessory for the iPad Pro, and turns it into a versatile laptop.", "url": "https://9to5mac.com/2020/04/24/magic-keyboard-for-ipad-pro-review-top-features-best-ipad-accessory-ever-video/", "urlToImage": null, "publishedAt": "2020-04-24T19:42:23Z", "content": "Two days ago the Magic Keyboard for the 11-inch iPad Pro landed on my desk. Ive been using it constantly since it first arrived, and although its not perfect, I absolutely love it.\r\nIts so good that I can easily say that this is the best iPad accessory in the… [+13185 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Christopher Carbone", "title": "Apple and Google will shut down coronavirus tracing app when pandemic ends, companies say - Fox News", "description": "Apple and Google say they will shut down their coronavirus contact tracing app after the pandemic is under control, as the tech giants strive to addresss ongoing privacy concerns about the effort.", "url": "https://www.foxnews.com/tech/apple-google-will-shut-down-coronavirus-tracing-app-pandemic-ends", "urlToImage": null, "publishedAt": "2020-04-24T19:35:44Z", "content": "Get all the latest news on coronavirus and more delivered daily to your inbox. Sign up here.\r\nApple and Google say they will shut down their coronavirus contact tracing app after the pandemic is under control, as the tech giants strive to address ongoing priv… [+1875 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "David Murphy", "title": "Are You Charging Your MacBook on the Wrong Side? - Lifehacker", "description": "Yes, you read that headline correctly. There is apparently a “right” way and a “wrong” way to connect devices to a MacBook with Thunderbolt/USB-C ports on both sides. Doing it wrong can affect your computer’s performance.", "url": "https://lifehacker.com/are-you-charging-your-macbook-on-the-wrong-side-1843045306", "urlToImage": null, "publishedAt": "2020-04-24T19:31:53Z", "content": "Yes, you read that headline correctly. There is apparently a right way and a wrong way to connect devices to a MacBook with Thunderbolt/USB-C ports on both sides. Doing it wrong can affect your computers performance.\r\nI recently encountered this knowledge on … [+3975 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Michael Higham", "title": "The Big Final Fantasy 14 Overhaul You've Been Waiting For Will Come With Patch 5.3 - GameSpot", "description": "The long-awaited streamlined version of the base game Final Fantasy XIV: A Realm Reborn arrives with the next big update.", "url": "https://www.gamespot.com/articles/the-big-final-fantasy-14-overhaul-youve-been-waiti/1100-6476474/", "urlToImage": null, "publishedAt": "2020-04-24T19:03:00Z", "content": "As the MMORPG Final Fantasy XIV has evolved into a renowned, critically-acclaimed mainline series entry with its expansion packs, the one caveat players frequently bring up to newcomers is that they'll have grind out the base game A Realm Reborn. It's often r… [+2943 chars]"}, {"source": {"id": null, "name": "9to5mac.com"}, "author": null, "title": "Facebook launches ‘Messenger Rooms’ as a Zoom and Group FaceTime alternative - 9to5Mac", "description": "Facebook is out today with a new product to connect multiple people via video chat and compete with popular offerings like Zoom, Group FaceTime, Skype, Houseparty, and more. Detailed by TechCrunch, Facebook announced a number of messaging updates today with t…", "url": "https://9to5mac.com/2020/04/24/facebook-launches-messenger-rooms-as-a-zoom-and-group-facetime-alternative/", "urlToImage": null, "publishedAt": "2020-04-24T18:47:18Z", "content": "Facebook is out today with a new product to connect multiple people via video chat and compete with popular offerings like Zoom, Group FaceTime, Skype, Houseparty, and more.\r\nDetailed by TechCrunch, Facebook announced a number of messaging updates today with … [+3683 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "", "title": "Sony's excellent WH-1000XM3 headphones are only $238 at Newegg - Engadget", "description": "Sony's excellent WH-1000XM3 headphones are once again on sale. This time around, you can get them for $238.", "url": "https://www.engadget.com/sony-wh1000xm3-sale-newegg-135558070.html", "urlToImage": null, "publishedAt": "2020-04-24T18:19:07Z", "content": "Engadget's Devindra Hardawar gave the WH-1000XM3 a score of 94 when he reviewed them in 2018. They're comfortable, well-made and feature excellent noise cancelling capabilities. Bluetooth Codec support is similarly excellent with ACC, aptX HD and LDAC all pre… [+801 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jay Peters", "title": "Samsung and Google are offering free phone repairs to health care workers through June 30th - The Verge", "description": "Samsung and Google are offering free phone repairs to health care workers and first responders helping fight COVID-19 in partnership with phone repair company uBreakiFix. If you’re eligible, you’ll be able to get free repairs through June 30th for phones from…", "url": "https://www.theverge.com/2020/4/24/21234668/samsung-google-ubreakifix-free-phone-repairs-healthcare-first-responder-galaxy-pixel", "urlToImage": null, "publishedAt": "2020-04-24T17:39:26Z", "content": "In collaboration with uBreakiFix\r\nPhoto by Brennan King / The Verge\r\nSamsung and Google are offering free phone repairs to health care workers and first responders to help support those frontline workers in the fight against COVID-19 (via9to5Google). The two … [+1247 chars]"}, {"source": {"id": null, "name": "Trueachievements.com"}, "author": "Heidi Nicholas", "title": "Sci-fi adventure Deliver Us The Moon joins Xbox Game Pass and Game Pass for PC today - TrueAchievements", "description": "Deliver Us The Moon is a sci-fi action adventure title which draws inspiration from movies such as Interstellar, and which joins the Xbox Game Pass and Xbox Game Pass for PC services today as a day one addition.", "url": "https://www.trueachievements.com/n41593/deliver-us-the-moon", "urlToImage": null, "publishedAt": "2020-04-24T17:19:36Z", "content": "The Xbox team has been busy lately: just yesterday, they surprise-dropped the announcement that Red Dead Redemption 2 will join Xbox Game Pass in May. Before that, they announced new titles for Xbox Game Pass, along with several new titles for Xbox Game Pass … [+1728 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Daymare 1998 (Resident Evil 2 Tribute) - Official Console Launch Trailer - IGN", "description": "Daymare 1998, the Resident Evil 2 tribute game, finally arrives on PlayStation 4 and Xbox One on April 28th. Check out the official console launch trailer he...", "url": "https://www.youtube.com/watch?v=BiWnPEGvWcA", "urlToImage": null, "publishedAt": "2020-04-24T17:00:11Z", "content": null}, {"source": {"id": null, "name": "Tomsguide.com"}, "author": "Paul Wagenseil", "title": "Skype attack threatens 300 million users: How to protect yourself - Tom's Guide", "description": "New phishing campaign targets Skype users working from home", "url": "https://www.tomsguide.com/news/skype-phishing-attack", "urlToImage": null, "publishedAt": "2020-04-24T16:32:43Z", "content": "A new phishing campaign aimed at Skype users is especially convincing -- it already knows your name and where you work.\r\nThe attack arrives in the form of an email alerting you that you have several Skype notifications and need to click a \"review\" button. Cli… [+2084 chars]"}, {"source": {"id": null, "name": "Dotesports.com"}, "author": "Andreas Stavropoulos", "title": "Riot previews Astronaut Bard, Pool Party Taliyah, and Pulsefire Pantheon skins for League's 2020 plans - Dot Esports", "description": "Some \"underserved\" champs are getting skins.", "url": "https://dotesports.com/league-of-legends/news/riot-previews-astronaut-bard-pool-party-taliyah-and-pulsefire-pantheon-skins-for-leagues-2020-plans", "urlToImage": null, "publishedAt": "2020-04-24T16:24:32Z", "content": "Get your wallet ready, League of Legends fans. New skins are coming.\r\nLeague gameplay producer Jessica Safelocked Nam updated fans on Riots 2020 roadmap, which includes a number of new and snazzy skins. The Riot dev teased fresh cosmetics for Bard, Taliyah, a… [+1018 chars]"}, {"source": {"id": null, "name": "Hodinkee.com"}, "author": "Jack Forster", "title": "Introducing: The Vacheron Constantin Les Cabinotiers Astronomical Striking Grand Complication – Ode to Music - HODINKEE", "description": "A unique piece super-complication from Vacheron's Les Cabinotiers.", "url": "https://www.hodinkee.com/articles/vacheron-constantin-astronomical-striking-grand-complication-ode-to-music-introducing", "urlToImage": null, "publishedAt": "2020-04-24T16:03:00Z", "content": "Vacheron Constantin has always had a reputation, throughout its history, for creating unusual and in many cases, highly complex unique timepieces for its most particular (and most affluent) clients. Today, the firm has announced that its \"Les Cabinotiers\" dep… [+5456 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Trials of Mana - Your Adventure Begins Trailer - Nintendo Switch - Nintendo", "description": "Trials of Mana is Available Now on Nintendo Switch! A Trials of Mana Demo is also available and free to download! Forces of darkness will stop at nothing to ...", "url": "https://www.youtube.com/watch?v=qq1CTFtJI38", "urlToImage": null, "publishedAt": "2020-04-24T16:00:30Z", "content": "Trials of Mana is Available Now on Nintendo Switch! A Trials of Mana Demo is also available and free to download!\r\nForces of darkness will stop at nothing to get their hands on the powerful Sword of Mana. Begin your adventures today, join your companions, and… [+463 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Christian de Looper", "title": "7 Of The Best Amazon Alexa Speakers - Forbes", "description": "Looking for a great speaker with arguably the smartest digital assistant, Alexa? Here are 7 of the best Amazon Alexa speakers out there.", "url": "https://www.forbes.com/sites/forbes-personal-shopper/2020/04/24/7-of-the-best-amazon-alexa-speakers/", "urlToImage": null, "publishedAt": "2020-04-24T16:00:00Z", "content": "Alexa is arguably the smartest digital assistant, and while Google Assistant also has a lot going for it, Alexa is the go-to for many users who dont have Android phones. There are a ton of Alexa speakers on the market, and while they all have the smart featur… [+4164 chars]"}, {"source": {"id": null, "name": "Pcworld.com"}, "author": "", "title": "Nintendo account hack FAQ: What happened, who’s at risk, and how you can secure your ID - PCWorld", "description": "Nintendo has divulged that some 160,000 online accounts have been compromised. Here's what happened and how you can secure your persona information.", "url": "https://www.pcworld.com/article/3540294/nintendo-account-hack-faq-what-happened-whos-at-risk-and-how-you-can-secure-your-id.html", "urlToImage": null, "publishedAt": "2020-04-24T15:43:00Z", "content": "Since youre probably playing a whole lot more Switch and 3DS games than usual these days, this hack couldnt have come at a worse time. Nintendo has announced that more than 150,000 older accounts have been hacked and are warning users to change their accounts… [+1848 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "The Associated Press", "title": "Astronomer files trademark lawsuit against American Girl - ABC News", "description": "", "url": "https://abcnews.go.com/US/wireStory/astronomer-files-trademark-lawsuit-american-girl-70329513", "urlToImage": null, "publishedAt": "2020-04-24T15:15:29Z", "content": "MADISON, Wis. -- \r\nA Chicago astronomer has sued the maker of American Girl dolls, alleging the Wisconsin company stole her likeness and name to create its astronaut doll. \r\nThe federal trademark lawsuit filed in Madison this week by Lucianne Walkowicz asks A… [+1228 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Ron Amadeo", "title": "Android 11 Preview 3 hands-on—Strange changes to Recent Apps and notifications - Ars Technica", "description": "Preview 3 has some unfinished UIs that raise interesting questions.", "url": "https://arstechnica.com/gadgets/2020/04/android-11-preview-3-brings-recent-apps-changes-auto-revoked-permissions/", "urlToImage": null, "publishedAt": "2020-04-24T15:11:00Z", "content": "18 with 15 posters participating\r\nThere's a new Android 11 Developer Preview. This one is Preview 3, and it launched yesterday for Google's Pixel line. Previous Android 11 previews haven't had a ton of new additions, but this version has a lot of strange and … [+11362 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Paul Tassi", "title": "What To Make Of Destiny 2’s Massive Pending Trials Of Osiris Changes - Forbes", "description": "Bungie went into detail about Destiny 2's Trials of Osiris problems and what is being changed to fix them.", "url": "https://www.forbes.com/sites/paultassi/2020/04/24/what-to-make-of-destiny-2s-massive-pending-trials-of-osiris-changes/", "urlToImage": null, "publishedAt": "2020-04-24T14:57:23Z", "content": "The Summoner\r\nBungie\r\nYesterday, Bungie finally addressed the enormous elephant in the room, the state of Trials of Osiris and all its problems. They said they were going to be doing weekly insights into ongoing issues with the game, including the seasonal mo… [+4429 chars]"}, {"source": {"id": null, "name": "Macrumors.com"}, "author": "Mitchel Broussard", "title": "Deals: Verizon Still Offering Big Discounts on AirPods Pro and iPhone XS Cases - MacRumors", "description": "Verizon has a few ongoing deals to end this week, offering what remains to be one of the lowest prices we've seen on Apple's AirPods Pro at...", "url": "https://www.macrumors.com/2020/04/24/deals-verizon-airpods-pro/", "urlToImage": null, "publishedAt": "2020-04-24T14:27:19Z", "content": "Verizon has a few ongoing deals to end this week, offering what remains to be one of the lowest prices we've seen on Apple's AirPods Pro at $224.99, down from $249.00. This deal beats Amazon's own sale by about $10, and is the best available online right now.… [+1290 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Paul Tassi", "title": "Mayhem 2.0 Has Broken ‘Borderlands 3’ In A Bad Way - Forbes", "description": "Borderlands 3 has introduced Mayhem 10 in Mayhem 2.0, and farming now makes little to no sense, and many builds are broken.", "url": "https://www.forbes.com/sites/paultassi/2020/04/24/mayhem-20-has-broken-borderlands-3-in-a-bad-way/", "urlToImage": null, "publishedAt": "2020-04-24T14:15:16Z", "content": "Borderlands 3\r\nGearbox\r\nYesterday, Borderlands 3 introduced a whole bunch of new things into the game, bug fixes, character buffs, a temporary loot event and a new Cartels game mode. But above all else Gearbox totally redesigned the endgame of Borderlands 3 f… [+4477 chars]"}, {"source": {"id": null, "name": "Tomsguide.com"}, "author": "Kate Kozuch", "title": "Zoom just got a killer feature to beat every video call app - Tom's Guide", "description": "Real-time transcription takes Zoom meetings to the next level", "url": "https://www.tomsguide.com/news/zoom-just-got-a-killer-feature-to-beat-every-video-call-app", "urlToImage": null, "publishedAt": "2020-04-24T14:09:00Z", "content": "Zoom calls are about to give the video conferencing service a serious edge over Google Hangouts, Microsoft Teams, and all the other best video chat apps battling for the loyalty of everyone working from home. \r\nOtter.ai, a real-time chat transcription service… [+2215 chars]"}, {"source": {"id": null, "name": "Gamepress.gg"}, "author": null, "title": "Community Day April 2020 Guide | Pokemon GO Wiki - GamePress", "description": "Pokemon GO Wiki, Database, News, and Community for the Pokemon GO Player.", "url": "https://gamepress.gg/pokemongo/community-day-april-2020-guide", "urlToImage": null, "publishedAt": "2020-04-24T14:00:22Z", "content": "In PvP, Alakazam is significantly held back in CP capped leagues because of its Attack-weighted stat line. It is definitely better suited for Raiding content. One thing Alakazam does have is 6 different Charge Moves, but since its so frail, its limited to pla… [+2243 chars]"}, {"source": {"id": null, "name": "Destructoid.com"}, "author": "Chris Moyse", "title": "WWE confirms there will be no WWE 2K release this year - Destructoid", "description": "WWE confirms there will be no WWE 2K release this year", "url": "https://www.Destructoid.com/wwe-confirms-there-will-be-no-wwe-2k-release-this-year-588012.phtml", "urlToImage": null, "publishedAt": "2020-04-24T14:00:00Z", "content": "Count it Out\r\nWorld Wrestling Entertainment (WWE) has confirmed that it will not be releasing a video game in 2020, marking the first year in decades that the company will forego a digital replication of its squared circle action. The announcement was officia… [+1439 chars]"}, {"source": {"id": null, "name": "Searchengineland.com"}, "author": "https://www.facebook.com/barryschwartz", "title": "New free version of Google Shopping rolling out now - Search Engine Land", "description": "It is now rolling out and should be fully live in the US by early next week.", "url": "https://searchengineland.com/new-free-version-of-google-shopping-rolling-out-now-333589", "urlToImage": null, "publishedAt": "2020-04-24T13:52:00Z", "content": "Google’s new free version of Google Shopping is now rolling out. A Google spokesperson has confirmed with Search Engine Land that this has begun to roll out. This does not mean it is fully rolled out and all U.S. searchers will see it immediately, but by earl… [+740 chars]"}, {"source": {"id": null, "name": "Electrek.co"}, "author": null, "title": "Ford might delay Mustang Mach-E launch, will update as production restarts - Electrek", "description": "Ford might delay the Mustang Mach-E launch amid the coronavirus pandemic and will give an updated timeline as it restarts its production facilities. The Mustang Mach-E is Ford’s first all-electric vehicle built from the ground up and one of the most anticipat…", "url": "https://electrek.co/2020/04/24/ford-delay-mustang-mach-e-launch-production-restart/", "urlToImage": null, "publishedAt": "2020-04-24T13:27:26Z", "content": "Ford might delay the Mustang Mach-E launch amid the coronavirus pandemic and will give an updated timeline as it restarts its production facilities.\r\nThe Mustang Mach-E is Ford’s first all-electric vehicle built from the ground up and one of the most anticipa… [+2960 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jon Porter", "title": "Telegram adding secure group video calls this year - The Verge", "description": "Messaging app Telegram is developing a group video calling service that’s due to be launched later this year. It announced the plans alongside the news that the service now boasts 400 million monthly active users.", "url": "https://www.theverge.com/2020/4/24/21234254/telegram-messaging-app-group-video-calling-security-usability", "urlToImage": null, "publishedAt": "2020-04-24T13:10:11Z", "content": "The messaging service now has 400 million monthly active users\r\nIllustration by Alex Castro / The Verge\r\nMessaging app Telegram is developing a group video calling service thats due to be launched later this year, the company announced today. It says that cur… [+1733 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Joan E. Solsman", "title": "This Oculus Quest fitness app worked me so hard I forgot to breathe - CNET", "description": "Supernatural is a new spin on virtual reality fitness, and it may save me from backsliding into a lazy slug during lockdown.", "url": "https://www.cnet.com/news/supernatural-vr-fitness-mashup-of-pelaton-and-beat-saber-oculus-quest/", "urlToImage": null, "publishedAt": "2020-04-24T12:57:15Z", "content": "Supernatural sets game-ified, choreographed workouts to popular music in virtual reality. \r\nWithin\r\nSupernatural, a new virtual realityfitness game you can play in your home, isn't playing around. I sweat so hard I have to guzzle five glasses of water for eve… [+9525 chars]"}, {"source": {"id": null, "name": "Phonearena.com"}, "author": "Adrian Diaconescu", "title": "New leaks reveal LG Velvet 5G camera specs, battery size, memory, and more - PhoneArena", "description": "The LG Velvet 5G is not exactly a question mark after the company itself has revealed a bunch of stuff about the upcoming phone, but now almost all of the key specs are out of the bag.", "url": "https://www.phonearena.com/news/lg-velvet-5g-leaked-specs-camera-battery-memory-more_id124120", "urlToImage": null, "publishedAt": "2020-04-24T11:04:00Z", "content": "All content, features, and design are Copyright 2001-2020 PhoneArena.com.PhoneArena may receive a small commission if you purchase through affiliate links on this page.All rights reserved. Reproduction in whole or in part or in any form or medium without writ… [+28 chars]"}, {"source": {"id": null, "name": "Rockpapershotgun.com"}, "author": null, "title": "XCOM: Chimera Squad is out now, and it's half-price - Rock Paper Shotgun", "description": "It’s time to put down your world-saving guns and pick up your alien-policemen batons, because XCOM: Chimera Squad is out.", "url": "https://www.rockpapershotgun.com/2020/04/24/xcom-chimera-squad-is-out-now-and-its-half-price/", "urlToImage": null, "publishedAt": "2020-04-24T10:17:00Z", "content": "It’s time to put down your world-saving guns and pick up your alien-policing batons, because XCOM: Chimera Squad is out. XCOPS takes a big sidewards leap away from the main series, boiling down turn-based combat into single-room encounters. Developers Firaxis… [+2356 chars]"}, {"source": {"id": null, "name": "Milehighreport.com"}, "author": "Tim Lynch", "title": "Denver Broncos: Alabama WR Jerry Jeudy highlights - Mile High Report", "description": "The Denver Broncos have a new wide receiver in Jerry Jeudy. Here are his Alabama highlight reels. Enjoy!", "url": "https://www.milehighreport.com/2020/4/24/21233874/jerry-jeudy-highlights", "urlToImage": null, "publishedAt": "2020-04-24T09:34:37Z", "content": "The Denver Broncos have a new wide receiver in Jerry Jeudy. Here are his Alabama highlight reels. Enjoy!"}, {"source": {"id": null, "name": "Tomsguide.com"}, "author": "Roland Moore-Colyer", "title": "PS5 will be crushed by Xbox Series X power, says ex-Sony developer - Tom's Guide", "description": "PS5 is a ‘beast’ but can’t beat Xbox Series X, according to a former PlayStation developer", "url": "https://www.tomsguide.com/news/ps5-will-be-crushed-by-xbox-series-x-power-says-ex-sony-developer", "urlToImage": null, "publishedAt": "2020-04-24T07:11:26Z", "content": "A former Sony PlayStation developer has heaped praise on Microsofts Xbox Series X, claiming that the consoles extra power may send Sonys PS5 packing. \r\nThe developer in question is Chris Grannell, whos worked for Horizon: Zero Dawn studio Guerrilla Games and … [+2182 chars]"}, {"source": {"id": null, "name": "Nintendolife.com"}, "author": "Nintendo Life", "title": "Random: Lord Of The Rings Actor Elijah Wood Visits Animal Crossing Player's Island To Sell His Turnips - Nintendo Life", "description": "Direct from Driftwood", "url": "http://www.nintendolife.com/news/2020/04/random_lord_of_the_rings_actor_elijah_wood_visits_animal_crossing_players_island_to_sell_his_turnips", "urlToImage": null, "publishedAt": "2020-04-24T02:30:00Z", "content": null}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Jordan Ramée", "title": "CS:GO And Team Fortress Source Code Leaked, But Valve Isn't Worried - GameSpot", "description": "Though it's now become a problem in 2020, the leak of the source code for Team Fortress 2 and Counter-Strike:Global Offensive actually traces back to 2018.", "url": "https://www.gamespot.com/articles/csgo-and-team-fortress-source-code-leaked-but-valv/1100-6476395/", "urlToImage": null, "publishedAt": "2020-04-24T02:00:00Z", "content": "Valve seemingly has a bit of a leak problem right now, as the source code for both Team Fortress 2 and Counter-Strike: Global Offensive has recently made its way into the public eye. Or at least, that's how it appears. The source code has actually been public… [+4707 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Gordon Kelly", "title": "Google Just Gave Millions Of Users A Reason To Quit Chrome, Windows 10 - Forbes", "description": "Google has revealed an unfixable problem which may force you to pick between Windows 10 and Chrome.", "url": "https://www.forbes.com/sites/gordonkelly/2020/04/23/google-chrome-critical-security-exploit-windows-10-upgrade-warning-update-chrome-browser/", "urlToImage": null, "publishedAt": "2020-04-24T00:36:00Z", "content": "Google is always improving Chrome and it recently issued a brilliant (if long overdue) upgrade. That said, there have also been some recent controversial changes, security problems and data concerns and now Google has detailed a serious new problem in Chrome … [+2782 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Oscar Gonzalez", "title": "Travis Scott event in Fortnite: How to watch it again and find the Giant Astro Heads - CNET", "description": "The rapper dropped new tracks in a jaw-dropping concert.", "url": "https://www.cnet.com/news/travis-scott-event-in-fortnite-how-to-watch-it-again-and-find-the-giant-astro-heads/", "urlToImage": null, "publishedAt": "2020-04-24T00:31:35Z", "content": "Play some Fortnite and listen to a new track from Travis Scott.\r\nEpic Games\r\nFortnite events aren't only for players to check out new content from developer Epic Games. The popular battle royale game has also played host to multiple premieres and collaboratio… [+2962 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew Webster", "title": "Travis Scott’s first Fortnite concert was surreal and spectacular - The Verge", "description": "Rapper Travis Scott performed a surreal concert inside of the battle royale game Fortnite, utilizing trippy visuals to create a musical performance that could only be possible in a digital space.", "url": "https://www.theverge.com/2020/4/23/21233637/travis-scott-fortnite-concert-astronomical-live-report", "urlToImage": null, "publishedAt": "2020-04-24T00:29:22Z", "content": "Sicko mode\r\nIf theres one thing you can say about Fortnites live events, its that they keep getting more ambitious. From the original rocket launch to the mech vs. kaiju battle to the black hole that wiped out an entire island, each new event is more elaborat… [+3098 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Ewan Spence", "title": "Apple Leak Reveals Radical New MacBook - Forbes", "description": "Apple's first ARM powered MacBook is expected to launch next year, as Tim Cook moves away from Intel's grasp.", "url": "https://www.forbes.com/sites/ewanspence/2020/04/23/apple-macbook-pro-arm-intel-new-leak-rumor-specs-release-date/", "urlToImage": null, "publishedAt": "2020-04-23T23:53:07Z", "content": "Apple may be preparing to update the 13-inch and 16-inch MacBook Pro machines to Intels tenth-generation processors, but its longstanding project to bring ARM power to its MacOS platform gathers pace, with reports today that a release in 2021 is on the cards.… [+5450 chars]"}, {"source": {"id": null, "name": "Bleepingcomputer.com"}, "author": "Sergiu Gatlan", "title": "Windows 10 KB4549951 update fails to install, causes BSODs - BleepingComputer", "description": "The Windows 10 KB4549951 ​​​​​​​cumulative update is reportedly failing to install and is causing blue screens of death (BSOD) after installation reboots, among other issues, according to user reports.", "url": "https://www.bleepingcomputer.com/news/microsoft/windows-10-kb4549951-update-fails-to-install-causes-bsods/", "urlToImage": null, "publishedAt": "2020-04-23T23:11:05Z", "content": "The Windows 10 KB4549951 cumulative update is reportedly failing to install and is causing blue screens of death (BSOD) after installation reboots, among other issues, according to user reports.\r\nKB4549951 is a cumulative update with security fixes released a… [+6269 chars]"}, {"source": {"id": null, "name": "Venturebeat.com"}, "author": "Jeff Grubb", "title": "Your Super Mario Maker 2 levels are a lot less cute in World Maker - VentureBeat", "description": "Super Mario Maker 2 just got its final update, and the new World Maker mode highlights a problem: no one knows how to make a fun Mario course.", "url": "https://venturebeat.com/2020/04/23/your-super-mario-maker-2-levels-are-a-lot-less-cute-in-world-maker/", "urlToImage": null, "publishedAt": "2020-04-23T21:44:17Z", "content": "Super Mario Maker 2s latest update reveals that almost no one knows how to make a fun Mario stage. This was once easy to ignore, because thats not actually what you should go to Super Mario Maker for. Instead, this series has always provided players with a fa… [+2272 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Andrew Hoyle", "title": "iPhone 11 Pro vs. OnePlus 8 Pro cameras: My quarantine walk photo comparison - CNET", "description": "We put the two phones side-by-side to see which can take the best photos in daylight and night.", "url": "https://www.cnet.com/news/iphone-11-pro-vs-oneplus-8-pro-cameras-my-quarantine-walk-photo-comparison/", "urlToImage": null, "publishedAt": "2020-04-23T20:40:00Z", "content": "OnePlus has taken the wraps off its latest flagship, the OnePlus 8 Pro. Along with its silky blue finish, the phone packs a multicamera setup that includes a standard zoom, a super wide-angle lens and a 3x zoom. It impressed Lynn La in her full OnePlus 8 Pro … [+6477 chars]"}, {"source": {"id": null, "name": "Dexerto.com"}, "author": "Paul Cot", "title": "Trainers reporting increased shiny rates for Pokemon Go Buddy Up event - Dexerto", "description": "Trainers are encountering the likes of Feebas' shiny form much more frequently thanks to the Pokemon Go Buddy Up event.", "url": "https://www.dexerto.com/pokemon/trainers-reporting-increased-shiny-rates-for-pokemon-go-buddy-up-event-1357138", "urlToImage": null, "publishedAt": "2020-04-23T20:30:17Z", "content": "Trainers are currently in the middle of enjoying the bonuses that the Pokemon Go Buddy Up event has to offer. In addition to these though, increased shiny rates are also being reported.\r\nIn particular Feebas shiny encounters seem to have increased. The Magika… [+2551 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Richard Wakeling", "title": "Xbox Series X: What Do Game Devs Think Of Microsoft's Next-Gen Console - GameSpot", "description": "Various Microsoft and third-party developers have spoken about the Xbox Series X and its improved hardware.", "url": "https://www.gamespot.com/articles/xbox-series-x-what-do-game-devs-think-of-microsoft/1100-6476426/", "urlToImage": null, "publishedAt": "2020-04-23T20:20:00Z", "content": "The Xbox Series X is set to usher in the next-generation of console gaming in just a few months--along with Sony's PlayStation 5. Microsoft has already shared plenty of details about its upcoming console, detailing the Xbox Series X's full specs, storage solu… [+3254 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Michael McWhertor", "title": "Overwatch’s communication wheel now lets you customize the voice lines - Polygon", "description": "Players can now choose which voice lines are included in Overwatch’s communication wheel, with new additions like “press the objective,” “fall back,” and “sorry.”", "url": "https://www.polygon.com/2020/4/23/21233221/overwatch-communication-wheel-custom-voice-lines-update-patch", "urlToImage": null, "publishedAt": "2020-04-23T20:15:58Z", "content": "Players can now choose which voice lines are included in the wheel"}, {"source": {"id": null, "name": "Macrumors.com"}, "author": "Juli Clover", "title": "Demo: Using Apple Music on a Samsung TV - MacRumors", "description": "Samsung and Apple have partnered to bring the Apple Music app to Samsung TVs, and as of today, the Apple Music service and dedicated app can be...", "url": "https://www.macrumors.com/2020/04/23/apple-music-samsung-tv-demo/", "urlToImage": null, "publishedAt": "2020-04-23T19:49:03Z", "content": "Samsung and Apple have partnered to bring the Apple Music app to Samsung TVs, and as of today, the ‌Apple Music‌ service and dedicated app can be accessed on Samsung TV sets manufactured in 2018 and later.\r\nSubscribe to the MacRumors YouTube channel for more … [+1894 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Ryan W. Miller", "title": "What's 'Zoom fatigue'? Here's why video calls can be so exhausting - USA TODAY", "description": "With people taking more working meetings and social gatherings to video conference platforms, people are beginning to feel \"Zoom fatigue.\"", "url": "https://www.usatoday.com/story/news/nation/2020/04/23/zoom-fatigue-video-calls-coronavirus-can-make-us-tired-anxious/3010478001/", "urlToImage": null, "publishedAt": "2020-04-23T18:57:30Z", "content": "Some farms and animal sanctuaries have found a way to lighten the mood during virtual meetings.\r\nUSA TODAY\r\nA few Zoom calls for work in the morning. Logging your children into their virtual classroom around lunchtime. And a FaceTime call with your parents at… [+5598 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Ryan Gilliam", "title": "Play Call of Duty: Modern Warfare multiplayer for free April 24-27 - Polygon", "description": "Call of Duty: Modern Warfare will have a free multiplayer weekend starting on April 24 and running until April 27. Players can dive into five different maps and play multiplayer all weekend.", "url": "https://www.polygon.com/2020/4/23/21232998/call-duty-modern-warfare-free-multiplayer-weekend-warzone-dates-download", "urlToImage": null, "publishedAt": "2020-04-23T18:43:24Z", "content": "Call of Duty: Modern Warfare is getting a free weekend from April 24-27, according to the official Call of Duty Twitter account. Starting Friday, players can download the game and play multiplayer online for free until the trial is up. However, free players w… [+878 chars]"}, {"source": {"id": null, "name": "Techspot.com"}, "author": "Shawn Knight", "title": "Extreme overclocker pushes dated AMD FX-8350 beyond 8.1GHz - TechSpot", "description": "Renowned German overclocker Roman “der8auer” Hartung recently revisited an old CPU to see if a newer motherboard and a voltage controller could help him squeeze even more performance out of his already impressive AMD FX-8350 processor.", "url": "https://www.techspot.com/news/84960-extreme-overclocker-pushes-dated-amd-fx-8350-beyond.html", "urlToImage": null, "publishedAt": "2020-04-23T17:34:40Z", "content": "In a nutshell: Overclockers are a curious bunch. Much like automotive enthusiasts, they're obsessed with squeezing the absolute most performance out of a given piece of hardware or platform, even if it means going beyond what is practical or efficient. \r\nReno… [+1765 chars]"}, {"source": {"id": null, "name": "Liliputing.com"}, "author": "Brad Linder", "title": "Huawei launches MatePad 10.4 Android tablet for $270 and up (in China) - Liliputing", "description": "About two months after launching the Matepad Pro line of premium Android tablets (priced at $600 and up), Huawei is updating its mid-range tablet lineup with the new MatePad 10.4 tablet. As the nam…", "url": "https://liliputing.com/2020/04/huawei-launches-matepad-10-4-android-tablet-for-270-and-up-in-china.html", "urlToImage": null, "publishedAt": "2020-04-23T17:21:00Z", "content": "About two months after launching the Matepad Pro line of premium Android tablets (priced at $600 and up), Huawei is updating its mid-range tablet lineup with the new MatePad 10.4 tablet.\r\nAs the name suggests, the new model has a 10.4 inch display. It also ha… [+1227 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew J. Hawkins", "title": "Porsche unveils CarPlay-compatible radios for its classic cars - The Verge", "description": "Porsche introduces two new head units for its classic vehicles, with high-res touchscreens, DAB+, Bluetooth, and Apple CarPlay.", "url": "https://www.theverge.com/2020/4/23/21232713/porsche-apple-carplay-head-unit-retro-classic", "urlToImage": null, "publishedAt": "2020-04-23T17:16:16Z", "content": "Porsche is introducing new head units that combine vintage design with more modern conveniences, like high-resolution touchscreens, Bluetooth, DAB+, and Apple CarPlay. \r\nThere are two versions available: one with single-DIN dimensions and a 3.5-inch display f… [+1450 chars]"}, {"source": {"id": null, "name": "Macworld.com"}, "author": "Alexandria Haslam", "title": "This iPhone 8 Plus is way cheaper than the iPhone SE right now - Macworld", "description": "Verizon's Visible is selling the 64GB iPhone 8 Plus for $360 today and you get a $100 MasterCard gif card to boot.", "url": "https://www.macworld.com/article/3540190/this-iphone-8-plus-is-way-cheaper-than-the-iphone-se-right-now.html", "urlToImage": null, "publishedAt": "2020-04-23T16:11:00Z", "content": "If you like the price of the iPhone SE but don't want such a small screen, we've got a great deal for you: Verizon's Visible is selling an unlocked iPhone 8 Plus for $360 todayRemove non-product link, more than $200 off its usual price. And to sweeten the dea… [+1311 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "What is XCOM 2? - Everything you need to know about XCOM 2 Collection - Nintendo Switch - Nintendo", "description": "Before you jump into the XCOM 2 Collection for Nintendo Switch on May 29, watch this video explaining everything you need to know about XCOM 2. Learn more: h...", "url": "https://www.youtube.com/watch?v=fGA9F8HhRIs", "urlToImage": null, "publishedAt": "2020-04-23T15:00:16Z", "content": "Before you jump into the XCOM 2 Collection for Nintendo Switch on May 29, watch this video explaining everything you need to know about XCOM 2.\r\nLearn more: https://www.nintendo.com/games/detail...\r\n#XCOM#XCOM2#NintendoSwitch\r\nSubscribe for more Nintendo fun!… [+309 chars]"}, {"source": {"id": null, "name": "Zdnet.com"}, "author": "Charlie Osborne", "title": "As we turn to remote working, Malwarebytes joins VPN fray - ZDNet", "description": "The new Malwarebytes Privacy VPN has been launched at a time VPN adoption is likely on the rise.", "url": "https://www.zdnet.com/article/as-we-turn-to-remote-working-malwarebytes-joins-vpn-fray/", "urlToImage": null, "publishedAt": "2020-04-23T12:00:00Z", "content": "Interest in virtual private networks (VPNs) has increased in importance and usage in recent months due to the coronavirus outbreak.\r\nAs many of us are now working remotely from home, the need to encrypt and protect our online activities has become paramount a… [+2699 chars]"}, {"source": {"id": null, "name": "Dexerto.com"}, "author": "Jacob Hale", "title": "Leaked Apex Legends LTM hints at Warzone-inspired armor change - Dexerto", "description": "It looks like Warzone may have inspired this new LTM in Apex Legends, and it could be a complete game-changer.", "url": "https://www.dexerto.com/apex-legends/leaked-apex-legends-ltm-hints-at-warzone-inspired-armor-change-1356983", "urlToImage": null, "publishedAt": "2020-04-23T11:02:44Z", "content": "A renowned Apex Legends dataminer has leaked details of an upcoming Limited Time Mode in Respawn Entertainment’s battle royale title that could hint at huge armor changes coming to the game in the future.\r\nAs with any battle royale game, the debate surroundin… [+1525 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "All 5 Golden Wrench Locations | FORTNITE CHALLENGE WEEK 10 SEASON 2 - GamesRadar", "description": "Another week means another bunch of challenges, but the one that you’ll need help with the most this week is finding all of the Golden Wrenches. Here’s where...", "url": "https://www.youtube.com/watch?v=Q5MjRJlMfSY", "urlToImage": null, "publishedAt": "2020-04-23T08:50:23Z", "content": null}, {"source": {"id": "the-next-web", "name": "The Next Web"}, "author": "Napier Lopez", "title": "Motorola’s Edge+ shows there’s still a place for a headphone jack on a flagship phone - The Next Web", "description": "I appreciate Motorola‘s inventiveness with designs like the modular Moto Z family. I appreciate the value it brings with its Moto G family. And the new Moto Razr is one of the first examples of our future full of folding phones. But for all the interesting ph…", "url": "https://thenextweb.com/plugged/2020/04/23/motorolas-edge-shows-theres-still-a-place-for-a-headphone-jack-on-a-flagship-phone/", "urlToImage": null, "publishedAt": "2020-04-23T06:09:11Z", "content": "I appreciate Motorolas inventiveness with designs like the modular Moto Z family. I appreciate the value it brings with its Moto G family. And the new Moto Razr is one of the first examples of our future full of folding phones.\r\nBut for all the interesting ph… [+3126 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Giving Fallout 76 Another Shot - GameSpot", "description": "Fallout 76 had a rocky launch, but with the Wastelanders update, you might be tempted to give it another shot. Here's what Jake Dekker has to say after spend...", "url": "https://www.youtube.com/watch?v=kOH48B9HChA", "urlToImage": null, "publishedAt": "2020-04-23T04:00:15Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Final Fantasy 7: Hard Mode Guide to Success - IGN", "description": "Getting started on your second playthrough of Final Fantasy 7 Remake? Here are some tips to make your second trek through Midgar on hard difficulty, a little...", "url": "https://www.youtube.com/watch?v=tvdkZFuXAt0", "urlToImage": null, "publishedAt": "2020-04-23T00:30:04Z", "content": null}]}