{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Forbes.com"}, "author": "Ewan Spence", "title": "Apple Leak Reveals Radical New MacBook - Forbes", "description": "Apple's first ARM powered MacBook is expected to launch next year, as Tim Cook moves away from Intel's grasp.", "url": "https://www.forbes.com/sites/ewanspence/2020/04/25/apple-macbook-pro-arm-intel-new-leak-rumor-specs-release-date/", "urlToImage": null, "publishedAt": "2020-04-25T23:36:11Z", "content": "Apple may be preparing to update the 13-inch and 16-inch MacBook Pro machines to Intels tenth-generation processors, but its longstanding project to bring ARM power to its MacOS platform gathers pace, with reports today that a release in 2021 is on the cards.… [+6658 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Vanessa Hand Orellana", "title": "2 Apple Watch features that earned the smartwatch a permanent spot on my wrist - CNET", "description": "I started out a skeptic, but the Apple Watch eventually won me over. Here's what it took for me to take it seriously as a fitness tracker and smartwatch.", "url": "https://www.cnet.com/news/apple-watch-features-that-earned-smartwatch-permanent-spot-on-wrist/", "urlToImage": null, "publishedAt": "2020-04-25T23:09:24Z", "content": "Angela Lang/CNET\r\nI haven't always been a fan of the Apple Watch. I bought one as soon as it went on sale in 2015 hoping it would blow me away, but it ended up spending more time in my drawer than on my wrist. It took three more years and the addition of two … [+8182 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Darren Allan", "title": "AMD Cezanne leak hints at next-gen laptop CPUs with RDNA 2 graphics that go for Intel’s jugular - TechRadar Singapore", "description": "Zen 3 APUs with RDNA 2-powered integrated graphics, rumor has it", "url": "https://www.techradar.com/news/amd-cezanne-leak-hints-at-next-gen-laptop-cpus-with-rdna-2-graphics-that-go-for-intels-jugular", "urlToImage": null, "publishedAt": "2020-04-25T22:50:00Z", "content": "AMD Ryzen 4000 (codenamed Renoir) mobile chips are still very much fresh on the scene and making a huge impact in terms of competitiveness in the laptop world but weve already seen a leak for next-gen APUs apparently codenamed Cezanne (a name which has been d… [+2934 chars]"}, {"source": {"id": null, "name": "Androidpolice.com"}, "author": null, "title": "Facebook adds Messenger Rooms to the bevy of group video services - Android Police", "description": "Video calls have become an important way to stay in touch with friends and family during this time of isolation. There's already plenty to choose from,", "url": "https://www.androidpolice.com/2020/04/25/facebook-adds-messenger-rooms-to-the-bevy-of-group-video-services/", "urlToImage": null, "publishedAt": "2020-04-25T20:49:00Z", "content": "Video calls have become an important way to stay in touch with friends and family during this time of isolation. There's already plenty to choose from, but now Facebook is giving us something new to consider as Messenger Rooms begins to roll out across the gl… [+1587 chars]"}, {"source": {"id": null, "name": "Hypebeast.com"}, "author": "Rebecca Kim", "title": "Text Bug Is Causing iPhones and iOS Devices to Crash - HYPEBEAST", "description": "Just a notification with the text bomb can lock up phones.", "url": "https://hypebeast.com/2020/4/apple-text-bug-crash-iphones-ios-devices", "urlToImage": null, "publishedAt": "2020-04-25T20:22:00Z", "content": "Apple appears to be suffering similar software issues that arose on iOS 11 a few years ago when an Indian language character from a text message would crash iPhones. This time around, it seems that a certain string of Sindhi characters sent via text can lock … [+1029 chars]"}, {"source": {"id": "crypto-coins-news", "name": "Crypto Coins News"}, "author": null, "title": "Twitch Streamer Alinity Gets Bullied By A Bunch of Voyeuristic Creeps - CCN.com", "description": "Go ahead and call me a simp, bullies. You're the pathetic weirdos gawking at Alinity, then bullying her with calls for Twitch to ban her.", "url": "https://www.ccn.com/twitch-streamer-alinity-gets-bullied-by-a-bunch-of-voyeuristic-creeps/", "urlToImage": null, "publishedAt": "2020-04-25T19:49:00Z", "content": "<ul><li>Popular Twitch streamer Alinity had a nip slip Friday.</li><li>An army of goons immediately began harassing her on social media.</li><li>Alinity isnt the problem; the issue is the bullying of female gamers.</li></ul>In a Friday broadcast, popular Twit… [+3359 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Stephen Shankland", "title": "iPhone SE outclasses all Android phones thanks to Apple's A13 chip - CNET", "description": "Performance on a budget arrives just in time for buyers spooked by the pandemic.", "url": "https://www.cnet.com/news/iphone-se-outclasses-all-android-phones-thanks-to-apples-a13-chip-processor/", "urlToImage": null, "publishedAt": "2020-04-25T19:18:55Z", "content": "John Kim/CNET\r\nBy packing the big A13 chip into its small iPhone SE, Apple has made its budget smartphone a more compelling product at just the right time for a coronavirus-spooked world. Where most budget phones cut costs by using lower-end processors, the n… [+3579 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Stephen Shankland", "title": "Microsoft tells Chrome users to switch to its Edge browser on Outlook - CNET", "description": "Microsoft's web browser and email service are \"better together,\" the company argues.", "url": "https://www.cnet.com/news/microsoft-tells-chrome-users-to-switch-to-its-edge-browser-on-outlook/", "urlToImage": null, "publishedAt": "2020-04-25T19:18:49Z", "content": "Illustration by Stephen Shankland/CNET\r\nFor years, Google has placed prominent pop-up ads on its web properties suggesting people switch to Google's Chrome browser, saying they'll get better performance, features and security. Now Microsoft is trying the same… [+1886 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Alison DeNisco Rayome", "title": "Facebook Messenger Rooms: How to use the free Zoom video chat competitor - CNET", "description": "Up to 50 people can chat in a room at once, with no time limit.", "url": "https://www.cnet.com/how-to/facebook-messenger-rooms-how-to-use-the-free-zoom-video-chat-competitor/", "urlToImage": null, "publishedAt": "2020-04-25T18:43:15Z", "content": "Facebook Messenger Rooms is set to compete with Zoom and other group video chat apps.\r\nFacebook\r\nFacebook is getting in on the group-video-chat game with a new feature called Messenger Rooms, which seems set to compete with services like Zoom, Skype and Micro… [+2907 chars]"}, {"source": {"id": null, "name": "Kotaku.com"}, "author": "Zack Zwiezen", "title": "New GTA Online Missions Are All About Preparing For A Recession - Kotaku", "description": "Grand Theft Auto Online received a new update a few days ago that added six new missions. These missions are all about an old-time GTA Online character, Gerald, and his attempts to get ready for an upcoming recession. Five of them are good and one of them is …", "url": "https://kotaku.com/new-gta-online-missions-are-all-about-preparing-for-a-r-1843048824", "urlToImage": null, "publishedAt": "2020-04-25T18:12:59Z", "content": "Grand Theft Auto Online received a new update a few days ago that added six new missions. These missions are all about an old-time GTA Online character, Gerald, and his attempts to get ready for an upcoming recession. Five of them are good and one of them is … [+2804 chars]"}, {"source": {"id": null, "name": "Sammobile.com"}, "author": "SamMobile", "title": "Galaxy S20 update with display green tint fix now widely available - SamMobile", "description": "Not every new flagship smartphone is perfect out of the box. And sometimes, issues can be introduced to new devices ...", "url": "https://www.sammobile.com/news/galaxy-s20-update-with-display-green-tint-fix-now-widely-available/", "urlToImage": null, "publishedAt": "2020-04-25T17:13:22Z", "content": "Not every new flagship smartphone is perfect out of the box. And sometimes, issues can be introduced to new devices after launch because of botched software updates, which is exactly what happened with the Galaxy S20 series recently: Galaxy S20, S20+, and S20… [+1391 chars]"}, {"source": {"id": null, "name": "Motor1.com"}, "author": "Chris Okula", "title": "This Cayman GT4 Video Could Easily Be A Porsche Ad - Motor1 ", "description": "These are the ads we want to see.", "url": "https://www.motor1.com/news/414779/porsche-cayman-gt4-drive-commercial/", "urlToImage": null, "publishedAt": "2020-04-25T16:27:10Z", "content": "The Porsche Cayman GT4 was an earth-shattering machine when it first debuted in 2016. Here we have the familiar mid-engined Cayman sports car but with an engine from the 911 Carrera S and a GT badge usually reserved for Porches top of the line 911s. The Cayma… [+1584 chars]"}, {"source": {"id": null, "name": "Androidpolice.com"}, "author": "https://www.facebook.com/corbin.davenport.50", "title": "The ultimate guide for installing the Google Play Store on Amazon Fire tablets - Android Police", "description": "Amazon's Fire tablets are incredibly popular, mostly because they're incredibly cheap. However, none of them come with access to the Google Play Store,", "url": "https://www.androidpolice.com/2020/04/25/install-play-store-amazon-fire-tablet/", "urlToImage": null, "publishedAt": "2020-04-25T16:07:19Z", "content": "This story was originally published 2020/03/18 4:41pm PDTon Mar 18, 2020 and last updated 2020/04/25 8:48am PDTApr 25, 2020. \r\nAmazon's Fire tablets are incredibly popular, mostly because they're incredibly cheap. However, none of them come with access to the… [+13115 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Matthew Forde", "title": "Sony slip-ups: ahead of the PS5, we look back at the PlayStation tech that just didn't work - TechRadar India", "description": "They can't all be winners", "url": "https://www.techradar.com/news/sony-slip-ups-ahead-of-the-ps5-we-look-back-at-the-playstation-tech-that-just-didnt-work", "urlToImage": null, "publishedAt": "2020-04-25T16:00:00Z", "content": "As we motor towards the next generation of consoles, Sony currently holds all of the cards and will be looking to build upon the monumental success it found during the current generation. Its sometimes easy to forget just how well the PlayStation 4 has sold, … [+6393 chars]"}, {"source": {"id": null, "name": "Androidpolice.com"}, "author": "https://www.facebook.com/ryne.hager", "title": "OnePlus 8 Pro OxygenOS 10.5.5 update brings partial fix for 'green-tint' screen issue, plus touchscreen sensitivity tweaks - Android Police", "description": "As OnePlus promised just days ago, yet more updates for its latest pair of phones are now rolling out. Unlike the last couple of pre-release updates,", "url": "https://www.androidpolice.com/2020/04/25/oneplus-8-and-8-pro-update-brings-screen-and-camera-fixes/", "urlToImage": null, "publishedAt": "2020-04-25T15:44:58Z", "content": "As OnePlus promised just days ago, yet more updates for its latest pair of phones are now rolling out. Unlike the last couple of pre-release updates, which had near-identical changelogs, this one delivers a handful of much-appreciated fixes, including some un… [+2987 chars]"}, {"source": {"id": null, "name": "9to5google.com"}, "author": null, "title": "Google Meet call w/ thousands of Googlers watched an executive’s son praise Zoom - 9to5Google", "description": "Funny story: During a Google Meet call with thousands of Google employees, an executive's son walked in and sung praises to the competing Zoom service.", "url": "https://9to5google.com/2020/04/25/google-meet-zoom-competition-executive-son-story/", "urlToImage": null, "publishedAt": "2020-04-25T14:37:50Z", "content": "In the wake of the coronavirus pandemic, Zoom has skyrocketed to mainstream popularity with hundreds of millions of users added in the past couple of months. Google Meet, on the other hand, hasn’t seen anything near Zoom’s success. To twist the knife, a Googl… [+2200 chars]"}, {"source": {"id": null, "name": "Mspoweruser.com"}, "author": "http://www.facebook.com/pages/wmpowerusercom/37708414657", "title": "Deal Alert: One-day deal can score you a Surface Book for only $479.99 - MSPoweruser - MSPoweruser", "description": "The Surface Book with its detachable base is still a very unique device, and today only you can score one for as little as $479.99 Woot is running a one-day sale on refurbished Surface Book laptops, with a range of models available. The laptops are all Micros…", "url": "https://mspoweruser.com/deal-alert-one-day-deal-can-score-you-a-surface-book-for-only-479-99/", "urlToImage": null, "publishedAt": "2020-04-25T14:21:18Z", "content": "You can now get a steep $290 discount on Surface Pro X bundle, which includes the Surface Pro X device, Signature Keyboard and the Slim Pen. Amazon is currently offering the Black Surface Pr...\r\nDeal Alert: Save up to $300 on Microsoft Surface Pro 7\r\nYou can … [+2253 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Cameron Faulkner", "title": "Save on Google Nest’s Hello video doorbell and the 15-inch MacBook Pro - The Verge", "description": "This weekend, Daily Steals is offering Verge readers a $30 discount on the Google Nest Hello video doorbell. Additionally, this is a good time to save on a 15-inch MacBook Pro, an iPhone SE 2, and Cyberpunk 2077.", "url": "https://www.theverge.com/good-deals/2020/4/25/21234844/google-nest-hello-video-doorbell-macbook-pro-cyberpunk-2077-deal-sale-preorder", "urlToImage": null, "publishedAt": "2020-04-25T14:15:44Z", "content": "Plus, you can pick up a discounted Shark robot vacuum and the iPhone SE 2 for less\r\nPhoto by Florence Ion for The Verge\r\nThis story is part of a group of stories called \r\nOnly the best deals on Verge-approved gadgets get the Verge Deals stamp of approval, so … [+3323 chars]"}, {"source": {"id": null, "name": "Jalopnik.com"}, "author": "Andrew P. Collins", "title": "This Badass Old Van Is Actually A Modern Ford F-150 - Jalopnik", "description": "I paw through a lot of Facebook groups and forums looking at modified vehicles belonging to people I don’t know. (If you also think this is fun, we could probably be friends.) But a modern chassis, drivetrain, and dashboard swap over to a classic body project…", "url": "https://jalopnik.com/this-badass-old-van-is-actually-a-modern-ford-f-150-1843014870", "urlToImage": null, "publishedAt": "2020-04-25T14:12:13Z", "content": "I paw through a lot of Facebook groups and forums looking at modified vehicles belonging to people I dont know. (If you also think this is fun, we could probably be friends.) But a modern chassis, drivetrain, and dashboard swap over to a classic body project … [+3160 chars]"}, {"source": {"id": null, "name": "Rockpapershotgun.com"}, "author": null, "title": "Battlefield V wraps up the war effort with a final update this June - Rock Paper Shotgun", "description": "Don't roll out the excruciatingly patriotic bunting just yet - BFV's final update and future plans aim to keep the fires of war burning for a little longer", "url": "https://www.rockpapershotgun.com/2020/04/25/battlefield-v-wraps-up-the-war-effort-with-a-final-update-this-june/", "urlToImage": null, "publishedAt": "2020-04-25T14:07:00Z", "content": "We did it, team. The war’s almost over. The lads at Battlefield V HQ have declared that it’s time to sign some treaties, shut down the factories, and put an end to this virtual war. Before you start hanging up the red, white and blue bunting, though, there’s … [+1768 chars]"}, {"source": {"id": null, "name": "9to5google.com"}, "author": null, "title": "This week’s top stories: Huawei caught falsifying photos, Google Store refresh, ‘Hey Google’ sensitivity, more - 9to5Google", "description": "Top Stories: Huawei caught claiming DSLR photos were taken on a smartphone, Google Store sees a refresh highlighting Google's hardware brands, and more.", "url": "https://9to5google.com/2020/04/25/top-stories-huawei-falsifying-photos-google-store-refresh/", "urlToImage": null, "publishedAt": "2020-04-25T14:01:43Z", "content": "In this week’s top stories: Huawei was caught claiming DSLR photos were taken on a smartphone, the Google Store sees a refresh highlighting Google’s hardware brands, adjustable “Hey Google” sensitivity outlined, and more.\r\nFiled under bizarre controversy this… [+3260 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Rhett Allain", "title": "Wait a Second, That Table Has No Legs! - WIRED", "description": "How to build “magic,” gravity-defying structures—with Legos, kite string, and physics.", "url": "https://www.wired.com/story/wait-that-table-has-no-legs/", "urlToImage": null, "publishedAt": "2020-04-25T14:00:00Z", "content": "Really, this doesn't tell us much. All it says is that the upward-pulling tension has to be equal to the two downward forces (gravity and the other tension).\r\nBut what about the sum of the torques? If the object is in equilibrium, you can pick any point on th… [+2262 chars]"}, {"source": {"id": null, "name": "Dexerto.com"}, "author": "Joe Craven", "title": "Summit1g slams Valorant as the \"absolute fakest\" section on Twitch - Dexerto", "description": "The veteran Twitch streamer slammed the Valorant section, explaining why it's the \"absolute fakest\" part of the streaming platform.", "url": "https://www.dexerto.com/valorant/summit1g-slams-valorant-as-the-absolute-fakest-section-on-twitch-1357802", "urlToImage": null, "publishedAt": "2020-04-25T13:32:09Z", "content": "Veteran streamer Jaryd 'Summit1g' Lazar has blasted the Valorant section of Twitch as the \"fakest\" section of the streaming site, as hyper surrounding beta access rages on.\r\nValorant's closed beta is fast approaching one month old, with thousands of prospecti… [+2084 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Eddie Makuch", "title": "WWE 2K21 Is Canceled, But Franchise Isn't Dead - GameSpot", "description": "The WWE announces that there won't be a new WWE 2K game this year but 2K says fans should watch out for \"exciting news\" on Monday.", "url": "https://www.gamespot.com/articles/wwe-2k21-is-canceled-but-franchise-isnt-dead/1100-6476445/", "urlToImage": null, "publishedAt": "2020-04-25T13:23:00Z", "content": "The WWE has officially confirmed that the next WWE 2K game is canceled. WWE 2K21 will not be released, management said on an earnings call. The news comes following potentially-delayed workflows due to the ongoing pandemic and a particularly poor showing from… [+1467 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Lily Hay Newman", "title": "Zoom Upgrades Encryption Keys to What It Promised All Along - WIRED", "description": "Plus: Facebook data on the dark web, Nintendo accounts keep getting hacked, and more of the week's top security news.", "url": "https://www.wired.com/story/security-news-roundup-zoom-upgrades-encryption-keys/", "urlToImage": null, "publishedAt": "2020-04-25T13:11:10Z", "content": "It was another week of social distancing or quarantine for most of the world, but Google published findings that it has seen 12 government-backed hacking groups undeterred by the pandemic and, in fact, trying to take advantage of those conditions for intellig… [+3200 chars]"}, {"source": {"id": null, "name": "Androidcentral.com"}, "author": "Jerry Hildenbrand", "title": "Android 11 is finally bringing a modern UI to some existing features - Android Central", "description": "Features are better when you know that they exist. Android R ... err 11 is bringing an easy way to use some really great ones.", "url": "https://www.androidcentral.com/android-11-finally-bringing-modern-ui-some-existing-features", "urlToImage": null, "publishedAt": "2020-04-25T13:08:16Z", "content": "Android is, always has been, and always will be jam-packed with software features. Even the most bare-bones software as seen on something like the Pixel phone will have features that you never knew you needed until you did need them. And it will also have fea… [+2428 chars]"}, {"source": {"id": null, "name": "Macrumors.com"}, "author": "MacRumors Staff", "title": "Top Stories: iPhone SE and Magic Keyboard Launches, AirPods and 23-Inch iMac Rumors, and More - MacRumors", "description": "While the iPhone SE and Magic Keyboard for iPad Pro making their way into customers' hands were the biggest news this week, we also saw a ton of...", "url": "https://www.macrumors.com/2020/04/25/top-stories-iphone-se-magic-keyboard-launch/", "urlToImage": null, "publishedAt": "2020-04-25T13:04:07Z", "content": "While the iPhone SE and Magic Keyboard for iPad Pro making their way into customers' hands were the biggest news this week, we also saw a ton of rumors about Apple's upcoming product line.\r\nConfusion about Apple's plans for its AirPods lineup continues to rei… [+5962 chars]"}, {"source": {"id": null, "name": "Soranews24.com"}, "author": "https://soranews24.com/author/scott-wilson/", "title": "Japanese artist paints Cloud from Final Fantasy VII Remake using traditional methods【Video】 - SoraNews24", "description": "Not just priceless, it's gil-less.", "url": "https://soranews24.com/2020/04/25/japanese-artist-paints-cloud-from-final-fantasy-vii-remake-using-traditional-methods%e3%80%90video%e3%80%91/", "urlToImage": null, "publishedAt": "2020-04-25T13:02:35Z", "content": "Not just priceless, it’s gil-less.\r\nWith the recent release of Final Fantasy VII Remake, fans of the original game and newcomers to the series alike have been creating some incredible works inspired by the game.\r\nAnd now that lineup includes well-known Nihong… [+2091 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Dave Thier", "title": "‘Pokémon GO’: Here’s A Promo Code For Some Free PokéBalls And Berries. - Forbes", "description": "It's community day, and you need Pokéballs. Here's a 'Pokémon GO' promo code for some free great balls and razzberries.", "url": "https://www.forbes.com/sites/davidthier/2020/04/25/pokmon-go-heres-a-promo-code-for-some-free-pokballs-and-berries/", "urlToImage": null, "publishedAt": "2020-04-25T12:36:06Z", "content": "pokemon GO\r\nCredit: Niantic\r\nIts a weird one, today. Pokémon GO is running an extra-long Community Day with some crucial additions today, trying to re-orient an event all about getting outside and hanging out with people to one thats all about staying inside … [+1807 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Paul Tassi", "title": "Why Are Destiny 2’s Titans Suddenly Dominating Guardian Games? - Forbes", "description": "We can debate what to make of Destiny 2’s “whoops the real Olympics got cancelled” Guardian Games event in terms of how it’s been presented with its endless bounty grind, but I do think it has achieved at least part of its desired objectives, stirring up dram…", "url": "https://www.forbes.com/sites/paultassi/2020/04/25/why-are-destiny-2s-titans-suddenly-dominating-guardian-games/", "urlToImage": null, "publishedAt": "2020-04-25T12:35:58Z", "content": "Destiny 2\r\nBungie\r\nWe can debate what to make of Destiny 2s whoops the real Olympics got cancelled Guardian Games event in terms of how its been presented with its endless bounty grind, but I do think it has achieved at least part of its desired objectives, s… [+3395 chars]"}, {"source": {"id": null, "name": "Dexerto.com"}, "author": "Joe Craven", "title": "New master camo and Shoot the Ship modes coming to Modern Warfare - Dexerto", "description": "Infinity Ward confirmed the inclusion of a new master camo and new Shoot the Ship modes in an April 24 community update.", "url": "https://www.dexerto.com/call-of-duty/new-master-camo-and-shoot-the-ship-modes-coming-to-modern-warfare-1357780", "urlToImage": null, "publishedAt": "2020-04-25T12:11:57Z", "content": "Call of Duty developers Infinity Ward have confirmed that Modern Warfare will soon be graced with new Shoot the Ship modes, as well as a new master weapon camouflage, above the existing Damascus.\r\nIn an April 24 community update, Infinity Ward confirmed a hos… [+1718 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Heather Kelly", "title": "Advertising adjusts for a new reality: Sweatpants for staying home and toilet paper that cares - The Washington Post", "description": "There's a reason ads on TV are starting to look the same and Instagram seems to know exactly what loungewear you should buy. Advertising is trying to hit the right notes during the pandemic.", "url": "https://www.washingtonpost.com/technology/2020/04/25/ads-coronavirus-change/", "urlToImage": null, "publishedAt": "2020-04-25T11:02:55Z", "content": "Just stay home seems like an unusual sell from a hotel-booking service, but these are unusual times. Companies large and small are figuring out how to make ads that dont seem insensitive or as if theyre from a different time, when people took beach vacations,… [+9194 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "13 Changes We Need To See in Animal Crossing New Horizons - ANIMAL CROSSING NEW HORIZONS GAMEPLAY - Eurogamer", "description": "We love Animal Crossing: New Horizons here at Eurogamer, but there are some changes we'd like to see to the game. Our own Animal Crossing: New Horizons gamep...", "url": "https://www.youtube.com/watch?v=5B4uDpzf9Dc", "urlToImage": null, "publishedAt": "2020-04-25T11:00:02Z", "content": null}, {"source": {"id": null, "name": "Mspoweruser.com"}, "author": "http://www.facebook.com/pages/wmpowerusercom/37708414657", "title": "Microsoft reveals why no Surface device has Thunderbolt and why you can't upgrade your RAM - MSPoweruser - MSPoweruser", "description": "Microsoft came very late to the party when it came to adding USB-C to their range of Surface laptops and PCs, and when it did eventually arrive, Microsoft disappointed many due to the ports not supporting Thunderbolt, which offers much faster data speeds and …", "url": "https://mspoweruser.com/microsoft-reveals-why-no-surface-device-has-thunderbolt-and-you-cant-upgrade-your-ram/", "urlToImage": null, "publishedAt": "2020-04-25T10:50:57Z", "content": "Microsoft came very late to the party when it came to adding USB-C to their range of Surface laptops and PCs, and when it did eventually arrive, Microsoft disappointed many due to the ports not supporting Thunderbolt, which offers much faster data speeds and … [+1873 chars]"}, {"source": {"id": null, "name": "Dexerto.com"}, "author": "Joe Craven", "title": "Apex Legends dev reveals original weapon concepts for R-301, R-99, more - Dexerto", "description": "Ryan Lastimosa, an Art Director at Respawn Entertainment, has shared a number of concept weapon designs, giving players a glimpse of the dev process.", "url": "https://www.dexerto.com/apex-legends/apex-legends-dev-reveals-original-weapon-concepts-for-r-301-r-99-more-1357761", "urlToImage": null, "publishedAt": "2020-04-25T10:45:04Z", "content": "Ryan Lastimosa, 3D Art Director at Respawn Entertainment, has revealed concept designs for a handful of fan-favorite Apex Legends/Titanfall weapons, including the R-301, R-99, Longbow and Peacekeeper. \r\nFans have been captivated with the incredible creativity… [+2789 chars]"}, {"source": {"id": null, "name": "Motor1.com"}, "author": "Jacob Oliva", "title": "Watch 2021 VW Golf R Spied In Action At The Nürburgring - Motor1 ", "description": "It's lacking something, though.", "url": "https://www.motor1.com/news/414745/volkswagen-golf-r-nurburgring-video/", "urlToImage": null, "publishedAt": "2020-04-25T10:42:03Z", "content": "More than a week ago, we've seen the 2021 Volkswagen Golf R in spy images from the Nürburgring with minimal camouflage almost non-existent, actually. However, those are only still shots and for many car enthusiasts, a non-moving preview of the Golf R won't su… [+1377 chars]"}, {"source": {"id": null, "name": "Autoevolution.com"}, "author": "Andrei Tutu", "title": "2015 Ford Mustang GT 'Generation Gap\" Is a Bad Boy 1967 Eleanor Conversion - autoevolution", "description": "Wouldn't it be a dream to enjoy a Ford Mustang that mixes the retro look of a 1967 Fastback with the plethora of benefits delivered by a 2015 GT? The answer to this question is obvious, so the motor-crazy crew over at B Is For Build decided to translate this …", "url": "https://www.autoevolution.com/news/2015-ford-mustang-gt-generation-gap-is-a-bad-boy-1967-eleanor-conversion-142983.html", "urlToImage": null, "publishedAt": "2020-04-25T10:39:00Z", "content": "It's been almost a month since we first discussed this stunning Blue Oval project and while the March article included all the uphill work required to put this contraption together, the time has come to start enjoying the fruits of all that labor. As such, th… [+1229 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Davey Winder", "title": "New Windows 10 Update Fail: Users Warn Of BSOD And Deleted Files - Forbes", "description": "As users complain of blue screens of death, deleted files and reboot loops, here's what you really need to know about this Windows 10 update.", "url": "https://www.forbes.com/sites/daveywinder/2020/04/25/new-windows-10-update-fail-users-warn-of-bsod-and-deleted-files/", "urlToImage": null, "publishedAt": "2020-04-25T10:03:45Z", "content": "The latest Patch Tuesday update has caused alarming problems for some Windows 10 users\r\nSOPA Images/LightRocket via Getty Images\r\nAs users complain of blue screens of death, deleted files and reboot loops, here's what you need to know about this Windows 10 up… [+4453 chars]"}, {"source": {"id": null, "name": "Androidcentral.com"}, "author": "Stephen Warwick", "title": "EU states 'being completely held hostage by Google and Apple' says official - Android Central", "description": "Apple and Google have rebuffed calls from France and Germany to support their contact tracing apps, which use centralized data containing user information.", "url": "https://www.androidcentral.com/eu-states-being-completely-held-hostage-google-and-apple-says-official", "urlToImage": null, "publishedAt": "2020-04-25T09:10:59Z", "content": "An EU official has said that Apple and Google are holding EU states hostage after they rebuffed further calls to support contact tracing solutions offered by France and Germany.\r\nAs Reuters reports:\r\nA standoff between the two largest nations in the European … [+2171 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Matt Espineli", "title": "FF7 Remake Elemental Materia Guide: Where To Find This Essential Materia Orb - GameSpot", "description": "Here's how to get the only two Elemental Materia orbs available in FF7 Remake for PS4.", "url": "https://www.gamespot.com/articles/ff7-remake-elemental-materia-guide-where-to-find-t/1100-6476502/", "urlToImage": null, "publishedAt": "2020-04-25T07:52:57Z", "content": "In Final Fantasy 7 Remake, the Elemental Materia is one of the best Materia orbs you can get, as it can imbue either your weapons with elemental power and your armor with elemental defense. However, this Materia can be incredibly easy to miss if you're just g… [+2738 chars]"}, {"source": {"id": null, "name": "Tomsguide.com"}, "author": "Roland Moore-Colyer", "title": "Xbox Series X's crazy fast load times revealed — and PS5 should be worried - Tom's Guide", "description": "Xbox Series X super-fast SSD loads Gears 5 four times faster than Xbox One", "url": "https://www.tomsguide.com/news/xbox-series-xs-crazy-fast-load-times-revealed-and-ps5-should-be-worried", "urlToImage": null, "publishedAt": "2020-04-25T06:25:00Z", "content": "Microsofts Xbox Series X will load games much, much faster than the Xbox One, even if a games code isnt tweaked for the next-generation console. \r\nGears 5 loads four times faster on the Xbox Series X than it does on the Xbox One, according to Mike Rayner, tec… [+2197 chars]"}, {"source": {"id": null, "name": "Androidpolice.com"}, "author": null, "title": "The 5 best things about the OnePlus 8 Pro - Android Police", "description": "The higher price of the OnePlus 8 Pro hasn't gone down too well in some quarters, but there's no doubting that you still get a lot of phone for the money.", "url": "https://www.androidpolice.com/2020/04/24/5-best-oneplus-8-pro/", "urlToImage": null, "publishedAt": "2020-04-25T03:47:18Z", "content": "The higher price of the OnePlus 8 Pro hasn't gone down too well in some quarters, but there's no doubting that you still get a lot of phone for the money. Lets take a look at the five standout features of the latest OnePlus flagship. And don't worry, we've go… [+3189 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Oscar Gonzalez", "title": "Travis Scott event in Fortnite: How to watch the encore and find the Giant Astro Heads - CNET", "description": "The rapper dropped new tracks in a jaw-dropping concert. Catch the next show at midnight.", "url": "https://www.cnet.com/news/travis-scott-event-in-fortnite-how-to-watch-the-encore-and-find-the-giant-astro-heads/", "urlToImage": null, "publishedAt": "2020-04-25T01:02:37Z", "content": "Play some Fortnite and listen to a new track from Travis Scott.\r\nEpic Games\r\nFortnite events aren't only for players to check out new content from developer Epic Games. The popular battle royale game has also played host to multiple premieres and collaboratio… [+3718 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Resident Evil 3 Remake's Hidden Difficulty Modes Improve Its Horror - Screen Rant", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiTWh0dHBzOi8vc2NyZWVucmFudC5jb20vcmVzaWRlbnQtZXZpbC0zLXJlbWFrZS1uaWdodG1hcmUtZGlmZmljdWx0eS1tb2RlLWdvb2Qv0gFRaHR0cHM6Ly9zY3JlZW5yYW50LmNvbS9yZXNpZGVudC1ldmlsLTMtcmVtYWtlLW5pZ2h0bWFyZS1kaWZmaWN1bHR5LW1vZGUtZ29vZC9hbXAv?oc=5", "urlToImage": null, "publishedAt": "2020-04-25T00:01:31Z", "content": null}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Let's Play Predator: Hunting Grounds | GameSpot Community Fridays - GameSpot", "description": "Jean-Luc and Ben team up with, or fight against, the community in this new asymertrical online shooter.", "url": "https://www.youtube.com/watch?v=hYGTBArmQ80", "urlToImage": null, "publishedAt": "2020-04-24T22:50:36Z", "content": "Jean-Luc and Ben team up with, or fight against, the community in this new asymertrical online shooter."}, {"source": {"id": null, "name": "Destructoid.com"}, "author": "Jordan Devore", "title": "No Man's Sky has 'ambitious additions' lined up for 2020 - Destructoid", "description": "No Man's Sky has 'ambitious additions' lined up for 2020", "url": "https://www.Destructoid.com/no-man-s-sky-has-ambitious-additions-lined-up-for-2020-588063.phtml", "urlToImage": null, "publishedAt": "2020-04-24T22:30:00Z", "content": "The developers are excited about what's in store\r\nHello Games' stellar post-launch support of No Man's Sky will continue for the foreseeable future.\r\nThe team shared encouraging words this week in a blog post, noting that they're \"working up some more ambitio… [+893 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Michael Higham", "title": "The Big Final Fantasy 14 Overhaul You've Been Waiting For Will Come With Patch 5.3 - GameSpot", "description": "The long-awaited streamlined version of the base game Final Fantasy XIV: A Realm Reborn arrives with the next big update.", "url": "https://www.gamespot.com/articles/the-big-final-fantasy-14-overhaul-youve-been-waiti/1100-6476474/", "urlToImage": null, "publishedAt": "2020-04-24T22:12:00Z", "content": "As the MMORPG Final Fantasy XIV has evolved into a renowned, critically-acclaimed mainline series entry with its expansion packs, the one caveat players frequently bring up to newcomers is that they'll have grind out the base game A Realm Reborn. It's often r… [+2943 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Anthony Spadafora", "title": "Ubuntu 20.04 adds VPN and support for a key Windows 10 feature - TechRadar", "description": "Latest Ubuntu release includes WireGuard and exFAT support", "url": "https://www.techradar.com/news/ubuntu-2004-adds-vpn-and-support-for-a-key-windows-10-feature", "urlToImage": null, "publishedAt": "2020-04-24T21:40:00Z", "content": "Canonical has released the latest version of its Ubuntu Linux distribution which offers a number of exciting new features designed to improve performance and security.\r\nUbuntu 20.04, aka Focal Fossa, is based on the Linux 5.4 kernel and this long-term-support… [+1714 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Austen Goslin", "title": "Here are all of Valorant’s competitive ranks - Polygon", "description": "Riot has revealed Valorant’s competitive ranks, when the Ranked mode will go live, how many friends you can team up with, and ranked progression.", "url": "https://www.polygon.com/2020/4/24/21234911/valorant-rated-mode-release-date-ranks-competitive-matchmaking-teams", "urlToImage": null, "publishedAt": "2020-04-24T21:27:16Z", "content": "Riot has finally revealed the first details about Valorants upcoming ranked mode. Since Valorants closed beta started a few weeks ago, there has only been one mode: Unrated. But in the games next patch, Rated mode will be added, allowing players to earn ranks… [+2775 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Sean Szymkowski", "title": "Lexus GS bows out, exits production with Black Line special edition - CNET", "description": "The GS is on the way out, but a special edition will help mark its farewell.", "url": "https://www.cnet.com/roadshow/news/lexus-gs-production-discontinued-black-line-special-edition/", "urlToImage": null, "publishedAt": "2020-04-24T21:19:48Z", "content": "This is goodbye.\r\nLexus\r\nIt's time to part ways with the Lexus GS. Just a few years shy of its 30th anniversary, Toyota's luxury division confirmed the GS will exit production at the end of this year.\r\nAs the luxury sedan comes to the end of its life, Lexus a… [+1360 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Lisa Eadicicco", "title": "Microsoft Word now says 2 spaces after a period is wrong - Business Insider - Business Insider", "description": "Microsoft Word will now flag two spaces after a period as an error, putting an end to the debate.", "url": "https://www.businessinsider.com/microsoft-word-update-2-spaces-after-period-wrong-2020-4", "urlToImage": null, "publishedAt": "2020-04-24T21:12:09Z", "content": "Microsoft is putting its foot down in the age-old debate about whether it's correct to put one or two spaces after a period.\r\nMicrosoft Word's editor function is getting a new feature that flags two spaces after a period as an error, according to The Verge. S… [+1126 chars]"}, {"source": {"id": null, "name": "Droid-life.com"}, "author": "Kellen", "title": "Bad News for OnePlus Just as OnePlus 8 Launches - Droid Life", "description": "OnePlus has largely turned into a darling of the Android smartphone world in the US thanks to smartly put-together phones, a focus on features important to the enthusiast crowd, and pricing that has made flagship-level phones affordable. The addition of carri…", "url": "https://www.droid-life.com/2020/04/24/oneplus-8-launch-met-with-layoffs-in-europe/", "urlToImage": null, "publishedAt": "2020-04-24T21:04:17Z", "content": "OnePlus has largely turned into a darling of the Android smartphone world in the US thanks to smartly put-together phones, a focus on features important to the enthusiast crowd, and pricing that has made flagship-level phones affordable. The addition of carri… [+2156 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Alessandro Barbosa", "title": "Animal Crossing: New Horizons Update Brings Redd The Art Dealer, Leif, Nature Day, And Museum Expansion - GameSpot", "description": "Get ready to critique some art and have it displayed it in latest content update for Animal Crossing: New Horizons for Nintendo Switch.", "url": "https://www.gamespot.com/articles/animal-crossing-new-horizons-update-brings-redd-th/1100-6476294/", "urlToImage": null, "publishedAt": "2020-04-24T20:11:00Z", "content": "Animal Crossing: New Horizons has received a huge update, introducing two new merchants to the game. It expands the already extensive museum and rolls out the first of a host of planned events for the next few months, including its Earth Day event called Natu… [+1632 chars]"}, {"source": {"id": null, "name": "Autoevolution.com"}, "author": "Mihnea Radu", "title": "Front-Engined Lamborghini Aventador Is the Anti-Corvette Statement - autoevolution", "description": "Putting the engine in the wrong place is one of the most interesting things happening in the sports car world right now. But where is the right place? Now that the Chevy Corvette has it in the same location as every Italian exotic, maybe it's time for Lamborg…", "url": "https://www.autoevolution.com/news/front-engined-lamborghini-aventador-is-the-anti-corvette-statement-142977.html", "urlToImage": null, "publishedAt": "2020-04-24T20:11:00Z", "content": "We're kidding. The Aventador is one of the most amazing machines ever, but it's getting a little old. It came out roughly four batman movies ago and has stayed alive only though numerous small updates.In this video, TheSketchMonkey raises the possibility that… [+1238 chars]"}, {"source": {"id": null, "name": "9to5mac.com"}, "author": null, "title": "Magic Keyboard for iPad Pro top features — the best iPad accessory ever [Video] - 9to5Mac", "description": "Hands-on with top features for the Magic Keyboard for iPad Pro. It's the best accessory for the iPad Pro, and turns it into a versatile laptop.", "url": "https://9to5mac.com/2020/04/24/magic-keyboard-for-ipad-pro-review-top-features-best-ipad-accessory-ever-video/", "urlToImage": null, "publishedAt": "2020-04-24T19:42:23Z", "content": "Two days ago the Magic Keyboard for the 11-inch iPad Pro landed on my desk. Ive been using it constantly since it first arrived, and although its not perfect, I absolutely love it.\r\nIts so good that I can easily say that this is the best iPad accessory in the… [+13185 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "David Murphy", "title": "Are You Charging Your MacBook on the Wrong Side? - Lifehacker", "description": "Yes, you read that headline correctly. There is apparently a “right” way and a “wrong” way to connect devices to a MacBook with Thunderbolt/USB-C ports on both sides. Doing it wrong can affect your computer’s performance.", "url": "https://lifehacker.com/are-you-charging-your-macbook-on-the-wrong-side-1843045306", "urlToImage": null, "publishedAt": "2020-04-24T19:31:53Z", "content": "Yes, you read that headline correctly. There is apparently a right way and a wrong way to connect devices to a MacBook with Thunderbolt/USB-C ports on both sides. Doing it wrong can affect your computers performance.\r\nI recently encountered this knowledge on … [+3975 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Steve Watts", "title": "Nintendo Switch Shortages Reportedly Exacerbated By Automated Buyers - GameSpot", "description": "Buying bots may be contributing to or even causing persistent hardware shortages for Nintendo's handheld hybrid.", "url": "https://www.gamespot.com/articles/nintendo-switch-shortages-reportedly-exacerbated-b/1100-6476478/", "urlToImage": null, "publishedAt": "2020-04-24T19:19:00Z", "content": "In the weeks since the coronavirus pandemic began and much of the world has been confined to their separate houses, Nintendo Switch hardware has been notoriously difficult to find. This has been chalked up to increased demand as people look for ways to occupy… [+1388 chars]"}, {"source": {"id": null, "name": "Gamespot.com"}, "author": "Phil Hornshaw", "title": "Where Is Xur In Destiny 2? Location And Exotic Items (April 24-28) - GameSpot", "description": "Grab some new Destiny 2 Exotics from Xur to help you to take the gold in the Guardian Games.", "url": "https://www.gamespot.com/articles/destiny-2-xur-location-and-exotic-items-april-24-2/1100-6476472/", "urlToImage": null, "publishedAt": "2020-04-24T19:05:00Z", "content": "Destiny 2's latest seasonal event, the Guardian Games, kicked off this week, providing a whole bunch of new bounties to complete as players face off to see which of Destiny's three classes is the best. The spirit of competition is nice, but winning is better-… [+3933 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Megan Rose Dickey", "title": "Instacart has a problem with third-party apps letting shoppers pay for early access to orders - TechCrunch", "description": "Kara Carmichael has been an Instacart shopper for years in Orlando, Fla. It’s how she’s been able to support her family, she told TechCrunch. But she says she has noticed an increase in third-party bot activity that has made shopping “nearly impossible.” Desp…", "url": "http://techcrunch.com/2020/04/24/instacart-third-party-apps-bots-priority-access-batches-orders/", "urlToImage": null, "publishedAt": "2020-04-24T18:56:51Z", "content": "Kara Carmichael has been an Instacart shopper for years in Orlando, Fla. It’s how she’s been able to support her family, she told TechCrunch. But she says she has noticed an increase in third-party bot activity that has made shopping “nearly impossible.”\r\nDes… [+5147 chars]"}, {"source": {"id": null, "name": "Boingboing.net"}, "author": null, "title": "This AI's only function is to draw penises - Boing Boing", "description": "DICK-RNN is a recurrent neural network trained with 10,000 doodles of dicks. You start drawing a shape and the AI tries its best to finish it as a penis. Starting with the balls helps a lot. Try it…", "url": "https://boingboing.net/2020/04/24/this-ais-only-function-is-to.html", "urlToImage": null, "publishedAt": "2020-04-24T17:38:00Z", "content": "“The Angel, The Automobilist, and Eighteen Others” is a new collection of early drawings by eccentric illustrator and storyteller Edward Gorey (1925-2000). Over at The Comics Journal, Mark Dery, author of the Gorey biography Born to Be Posthumous, reviews the… [+1660 chars]"}, {"source": {"id": null, "name": "Androidpolice.com"}, "author": "https://www.facebook.com/corbin.davenport.50", "title": "Sony WH-C710N review: Great noise-cancelling headphones for under $200 - Android Police", "description": "Sony makes some of the best noise-canceling headphones around, especially the WH-1000XM3 (which is overdue for a replacement). The WH1000XM3 is a premium", "url": "https://www.androidpolice.com/2020/04/24/sony-wh-ch710n-review/", "urlToImage": null, "publishedAt": "2020-04-24T17:00:43Z", "content": "Sony makes some of the best noise-canceling headphones around, especially the WH-1000XM3 (which is overdue for a replacement). The WH1000XM3 is a premium set of headphones that regularly goes for around $300, and competing products like the Bose QuietComfort … [+4387 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Christian de Looper", "title": "7 Of The Best Amazon Alexa Speakers - Forbes", "description": "Looking for a great speaker with arguably the smartest digital assistant, Alexa? Here are 7 of the best Amazon Alexa speakers out there.", "url": "https://www.forbes.com/sites/forbes-personal-shopper/2020/04/24/7-of-the-best-amazon-alexa-speakers/", "urlToImage": null, "publishedAt": "2020-04-24T16:00:00Z", "content": "Alexa is arguably the smartest digital assistant, and while Google Assistant also has a lot going for it, Alexa is the go-to for many users who dont have Android phones. There are a ton of Alexa speakers on the market, and while they all have the smart featur… [+4164 chars]"}, {"source": {"id": null, "name": "Forbes.com"}, "author": "Paul Tassi", "title": "Mayhem 2.0 Has Broken ‘Borderlands 3’ In A Bad Way - Forbes", "description": "Borderlands 3 has introduced Mayhem 10 in Mayhem 2.0, and farming now makes little to no sense, and many builds are broken.", "url": "https://www.forbes.com/sites/paultassi/2020/04/24/mayhem-20-has-broken-borderlands-3-in-a-bad-way/", "urlToImage": null, "publishedAt": "2020-04-24T14:15:16Z", "content": "Borderlands 3\r\nGearbox\r\nYesterday, Borderlands 3 introduced a whole bunch of new things into the game, bug fixes, character buffs, a temporary loot event and a new Cartels game mode. But above all else Gearbox totally redesigned the endgame of Borderlands 3 f… [+4477 chars]"}, {"source": {"id": null, "name": "Tomsguide.com"}, "author": "Kate Kozuch", "title": "Zoom just got a killer feature to beat every video call app - Tom's Guide", "description": "Real-time transcription takes Zoom meetings to the next level", "url": "https://www.tomsguide.com/news/zoom-just-got-a-killer-feature-to-beat-every-video-call-app", "urlToImage": null, "publishedAt": "2020-04-24T14:09:00Z", "content": "Zoom calls are about to give the video conferencing service a serious edge over Google Hangouts, Microsoft Teams, and all the other best video chat apps battling for the loyalty of everyone working from home. \r\nOtter.ai, a real-time chat transcription service… [+2215 chars]"}, {"source": {"id": "the-next-web", "name": "The Next Web"}, "author": "Callum Booth", "title": "The fancy-pants LG Velvet arrives on May 7 — here’s what we know - The Next Web", "description": "If I asked you to list smartphone brands, LG wouldn’t be near the top. But the company is trying to change all that, and its latest attempt? Its new smartphone, the LG Velvet. Now, the latest update is the company will unveil this handset on May 7, something …", "url": "https://thenextweb.com/plugged/2020/04/24/lg-velvet-phone-may-7-launch-specs/", "urlToImage": null, "publishedAt": "2020-04-24T13:45:06Z", "content": "If I asked you to list smartphone brands, LG wouldnt be near the top. But the company is trying to change all that, and its latest attempt? Its new smartphone, the LG Velvet.\r\nNow, the latest update is the company will unveil this handset on May 7, something … [+2558 chars]"}, {"source": {"id": null, "name": "Electrek.co"}, "author": null, "title": "Ford might delay Mustang Mach-E launch, will update as production restarts - Electrek", "description": "Ford might delay the Mustang Mach-E launch amid the coronavirus pandemic and will give an updated timeline as it restarts its production facilities. The Mustang Mach-E is Ford’s first all-electric vehicle built from the ground up and one of the most anticipat…", "url": "https://electrek.co/2020/04/24/ford-delay-mustang-mach-e-launch-production-restart/", "urlToImage": null, "publishedAt": "2020-04-24T13:27:26Z", "content": "Ford might delay the Mustang Mach-E launch amid the coronavirus pandemic and will give an updated timeline as it restarts its production facilities.\r\nThe Mustang Mach-E is Ford’s first all-electric vehicle built from the ground up and one of the most anticipa… [+2960 chars]"}, {"source": {"id": null, "name": "Cnet.com"}, "author": "Rick Broida", "title": "The new iPhone SE can be yours for $184 - CNET", "description": "Visible's new deal beats them all. Here's what you need to know.", "url": "https://www.cnet.com/news/new-iphone-se-can-be-yours-for-184/", "urlToImage": null, "publishedAt": "2020-04-24T11:54:23Z", "content": "You can score Apple's newest iPhone for a post-credit price of just $184.\r\nApple\r\nInterested in the new iPhone SE? Apple's latest is now on sale everywhere starting at $399. Before you pay full price, however, check this out: For a limited time, and while sup… [+2188 chars]"}, {"source": {"id": null, "name": "Rockpapershotgun.com"}, "author": null, "title": "XCOM: Chimera Squad is out now, and it's half-price - Rock Paper Shotgun", "description": "It’s time to put down your world-saving guns and pick up your alien-policemen batons, because XCOM: Chimera Squad is out.", "url": "https://www.rockpapershotgun.com/2020/04/24/xcom-chimera-squad-is-out-now-and-its-half-price/", "urlToImage": null, "publishedAt": "2020-04-24T10:17:00Z", "content": "It’s time to put down your world-saving guns and pick up your alien-policing batons, because XCOM: Chimera Squad is out. XCOPS takes a big sidewards leap away from the main series, boiling down turn-based combat into single-room encounters. Developers Firaxis… [+2356 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Ryan W. Miller", "title": "What's 'Zoom fatigue'? Here's why video calls can be so exhausting - msnNOW", "description": "With people taking more working meetings and social gatherings to video conference platforms, people are beginning to feel \"Zoom fatigue.\"", "url": "https://www.usatoday.com/story/news/nation/2020/04/23/zoom-fatigue-video-calls-coronavirus-can-make-us-tired-anxious/3010478001/", "urlToImage": null, "publishedAt": "2020-04-24T05:30:00Z", "content": "Some farms and animal sanctuaries have found a way to lighten the mood during virtual meetings.\r\nUSA TODAY\r\nA few Zoom calls for work in the morning. Logging your children into their virtual classroom around lunchtime. And a FaceTime call with your parents at… [+5598 chars]"}, {"source": {"id": null, "name": "Youtube.com"}, "author": null, "title": "Travis Scott's Astroworld Concert Live on Fortnite with 100 Thieves | HYPEBEAST Exclusive - HYPEBEAST", "description": "JUMP STRAIGHT TO CONCERT AT: 36:34 NEW SONG AT: 44:23 Watch Travis Scott's Astroworld concert live on Fortnite with Ceice from 100 Thieves for a HYPEBEAST ex...", "url": "https://www.youtube.com/watch?v=XgeRLTx_qqc", "urlToImage": null, "publishedAt": "2020-04-24T00:00:53Z", "content": "JUMP STRAIGHT TO CONCERT AT: 36:34NEW SONG AT: 44:23\r\nWatch Travis Scott's Astroworld concert live on Fortnite with Ceice from 100 Thieves for a HYPEBEAST exclusive.\r\nFor up-to-date news and more: http://HYPEBEAST.com\r\nSubscribe to our channel: https://www.yo… [+241 chars]"}]}